[{"id":102432,"title":"Students to give back on Service Day","permalink":"http:\/\/palyvoice.com\/2015\/04\/22\/students-to-give-back-on-service-day\/","content":"For the fourth day of Palo Alto High School's <a href=\"http:\/\/palyvoice.com\/2015\/04\/19\/preview-not-in-our-schools-week\/\">Not In Our Schools Week<\/a>, students are invited to give back to the community both on- and off-campus tomorrow by participating in the sixth annual Service Day.\r\n\r\nWith over 300 students signed up for volunteer projects at local organizations and a host of booths and activities available on the Paly Quad at lunch, this year's Service Day is set to be bigger than ever, according to sophomore and Service Day planner Candace Wang. Each year, the event attracts more and more participants, and there are more volunteer organizations present than ever before.\r\n\r\nStudents who have not already signed up to volunteer at off-campus organizations are instead encouraged to participate in the available on-campus activities during lunch. Clubs and organizations will be on campus raising awareness for their respective causes and providing volunteer opportunities to students. No sign-ups are required, and free pizza will be served to those who participate in two or more activities.\r\n\r\n\"It is our hope that the students who participate in Service Day are able to find new ways to express their passions, find new ways to be involved and engaged in their communities, and find places where they can try new things,\" Wang said. \"Volunteering is a great way to get a feel for different career paths without heavy commitment for sacrifices.\"\r\n\r\n<iframe style=\"overflow-y:hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/5660368-paly-service-day-2015\" width=\"620\" height=\"1183\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\nOrganizing this event took a large number of people, and Wang is grateful for the support and efforts of everyone involved.\r\n\r\n\"This year, it was an incredible team effort,\" Wang said. \"More people have chipped in than ever before. YCS did an incredible job of organizing all 23 of the off-campus sites, and Key Club is putting all the effort humanly possible to create the best on-campus selection of clubs and organizations. We also have to thank the parents and, of course, [community service and career adviser] Ms. [Christina] Owen for making everything else possible.\"\r\n\r\nAfter months of hard work, the Service Day planning committee looks forward to the event.\r\n\r\n\"This is a huge milestone for all of us,\" Wang said. \"I can't wait to see how the day turns out.\"","excerpt":"For the fourth day of Palo Alto High School's Not In Our Schools Week, students are invited to give back to the community both on- and off-campus tomorrow by participating in the sixth annual Service Day.\r\n","date":"2015-04-22 17:15:58","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Paly-Service-Day-2012-breakfast.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","8499":"Associated Student Body","28798":"candace wang","14280":"nios","14279":"not in our schools week","8953":"paly","9094":"Service","14277":"service day","32455":"volunteer","42197":"volunteering","42196":"YCS"}},{"id":102466,"title":"Students plead with school board to re-examine zero period elimination","permalink":"http:\/\/palyvoice.com\/2015\/04\/22\/students-plead-with-school-board-to-re-examine-zero-period-elimination\/","content":"[caption id=\"attachment_102494\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/this-one.jpg\"><img class=\"size-full wp-image-102494\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/this-one.jpg\" alt=\"Palo Alto community members fill the District Office at tonight's board meeting. There was an open forum in which 24 speakers, most of whom were Gunn High School students, addressed the recent decision to eliminate non-academic Zero Period classes at Gunn.\" width=\"600\" height=\"402\" \/><\/a> Palo Alto community members fill the District Office at tonight's Board of Education meeting. There was an open forum in which 24 speakers, most of whom were Gunn High School students, addressed the recent decision to eliminate academic Zero Period classes at Gunn. Photo by Jeanette Wong.[\/caption]\r\n\r\nOver 40 Gunn High School students attended the Palo Alto Unified School District Board of Education meeting tonight to contest the district’s decision to remove Gunn’s academic Zero Period classes.\r\n\r\nThe students went to the meeting in response to a <a href=\"http:\/\/www.paloaltoonline.com\/media\/reports\/1428767898.pdf\">letter from Supt. Max McGee<\/a> in which he announced that Gunn will no longer be offering Zero Period classes after this year, other than non-academic courses such as Physical Education.\r\n\r\nOut of the 24 people who signed up to talk during the open forum portion of the meeting, 17 Gunn students spoke, all arguing in favor of keeping Zero Period as a choice for students.\r\n\r\nThe students emphasized repeatedly that the decision was made without student input, there was a lack of data supporting claims against Zero Period and that reducing students’ choices will not decrease their stress.\r\n\r\n“It’s about student voice,” Gunn sophomore Mihir Juvvadi said to the board members. “The key is that we want a proper process to be followed in all future decisions. … You made a decision about the schedule without consulting students. You didn’t hear us talk; you heard us talk after you had made your decision. We thank you for hearing our voices, but when it did come, it was a little bit too late.”\r\n\r\n[caption id=\"attachment_102498\" align=\"alignleft\" width=\"309\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_4212.jpg\"><img class=\" wp-image-102498\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_4212.jpg\" alt=\"Gunn sophomore Natalie Rozak speaks to the board members. &quot;Our voice matters,&quot; Rozak said. &quot;Please stop putting words into our mouths.&quot; Photo by Jeanette Wong\" width=\"309\" height=\"207\" \/><\/a> Gunn sophomore Natalie Rozak speaks to the board members. \"Our voice matters,\" Rozak said. \"Please stop putting words into our mouths.\" Photo by Jeanette Wong[\/caption]\r\n\r\nAccording to the speakers, one of the main issues regarding this decision is the lack of communication between the board and students. Although the board did attempt to connect with students, according to some students, some felt that it would have been more effective for administration and students to reach a resolution together, after discussions with all relevant members of the community.\r\n\r\nIn an opening statement, McGee expressed regret that students did not feel they were adequately involved in decision-making regarding this issue.\r\n\r\n“I understand the frustration, the anger and the disappointment of our students and our faculty who want to retain the current practice,” McGee said. “I am very sorry that we did not do our best job in this instance.”\r\n\r\nGunn School Board Representative Rose Weinmann called the decision “misguided paternalism” and not in the best interest of Gunn students.\r\n\r\nHeather Schultz, a parent of a current Gunn High School student, spoke during the open forum to voice her support for the choice that Zero Period offers students.\r\n\r\n“I am concerned about change simply for the sake of change itself,” Schultz said. “It [the decision] feels rushed and dismissive of student opinions.”\r\n\r\nGunn Sophomore Class President Chloe Chang Sorenson confronted the board members about the adverse consequences that removing Zero Period could prompt.\r\n\r\n“You do not see that your ‘positive changes’ are actually increasing stress in many students and making us feel powerless and overwhelmed,” Chang said. “It’s an endless cycle that always repeats again and again and again, and students always end up on the bottom.”\r\n\r\nSome students urged the board to actively respond to the voice of the students now.\r\n\r\n“Students’ faith in the school board is very closely tied with this decision,” Gunn Senior Class President Mack Radin said. “It’s one thing to say you’ll listen to us in the future, but it would be so powerful to listen to us now, if you change something now.”\r\n\r\nVarious student speakers gave accounts of their personal experiences with Zero Period, and claimed that it has helped them to manage their time more effectively.\r\n\r\n“I am taking zero period so I can choose to have more control over my schedule,” sophomore Lucy Augustine said.\r\n\r\nSophomore Natalie Rozak shared her disappointment last year when her schedule did not allow her to fully pursue her passion of horseback riding. However, she has modified her schedule this year to include a Zero Period class, which she says better fits her personal needs.\r\n\r\n[caption id=\"attachment_102499\" align=\"alignright\" width=\"274\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_4194.jpg\"><img class=\" wp-image-102499\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_4194.jpg\" alt=\"Superintendent Max McGee speaks out to members of the PAUSD community and acknowledges their feelings. “I understand the frustration, the anger and the disappointment of our students and our faculty who want to retain the current practice,” McGee said. “I am very sorry that we did not do our best job in this instance.” Photo by Jeanette Wong.\" width=\"274\" height=\"184\" \/><\/a> Superintendent Max McGee speaks out to members of the PAUSD community. “I understand the frustration, the anger and the disappointment of our students and our faculty who want to retain the current practice,” McGee said. “I am very sorry that we did not do our best job in this instance.” Photo by Jeanette Wong.[\/caption]\r\n\r\n“Because of Zero Period, I am able to ride horses every single day and complete my homework on time,” Rozak said.\r\n\r\nFollowing the meeting, some students said they were disappointed that there was no discussion of revisiting the elimination of academic classes during zero period. Gunn Associated Student Body President Aren Raisinghani recognizes this disappointment, but acknowledges the difficulties in achieving immediate change on such a large scale.\r\n\r\n“There was over an hour of talking … but even with all the different forms of persuasion, still no action was taken — or discussed being taken — at the executive level,” Raisinghani said. “Many students are frustrated because they came here today with that [a promise to revisit the new policy] in mind... [However,] I wouldn’t expect the School Board to take action immediately following a school board meeting because, in any leadership group, there are a lot of formalities.”\r\n\r\nSeveral students expressed gratitude for the action taken by the community, and assistance in helping make school a better place.\r\n\r\n“We really, really appreciate your concern and the concern of the parents in the community,” Gunn sophomore Olivia Ellson said. “We recognize the good intentions, and we understand that after the tragedies of this year, there is a need to take action. Whatever you decide to do with all of the discussion today, we would like you to know that we are a community. We know that Gunn can be stressful, and we would like to work with you to change that.”\r\n\r\n“We need your support, your time and an open mind,” Sorensen said. “Show us that we’re all in this together.”","excerpt":"Over 40 Gunn High School students attended the Palo Alto Unified School District Board of Education meeting tonight to contest the district’s decision to remove Gunn’s academic Zero Period classes.","date":"2015-04-22 00:09:11","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/this-one.jpg","categories":["Editor's Pick","News","Spotlight"],"tags":{"11799":"Board of Education","42272":"district office","8752":"gunn high school","32445":"max mcgee","42271":"palo alto unified","8953":"paly","8977":"PAUSD","42274":"removal","9069":"School Board","11606":"superintendent","42273":"zero period"}},{"id":102347,"title":"Paly debaters prevail at tournament","permalink":"http:\/\/palyvoice.com\/2015\/04\/20\/paly-debaters-prevail-at-tournament\/","content":"[caption id=\"attachment_102348\" align=\"alignnone\" width=\"387\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-17-at-10.11.45-PM.png\"><img class=\"wp-image-102348\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-17-at-10.11.45-PM.png\" alt=\"Juniors Anna Lu and Anna Nakai pose for a picture after co-championing in the varsity division at the Santa Clara Philalethic Invitational tournament. This tournament marked the first time over twenty years that four Paly debaters have ever co-championed both the varsity and novice divisions of a tournament. Photo by Anna Lu.\" width=\"387\" height=\"382\" \/><\/a> Juniors Anna Lu and Anna Nakai pose for a picture after co-championing in the varsity division at the Santa Clara Philalethic Invitational tournament this past month. This tournament marked the first time over twenty years that four Paly debaters have ever co-championed both the varsity and novice divisions of a tournament. Photo courtesy of Anna Lu.[\/caption]\r\n\r\nThe Palo Alto Speech and Debate Team performed exceptionally and made history at the Santa Clara Philalethic Invitational tournament this past month.\r\n\r\nJunior Anna Lu competed in the varsity division of the January\/February topic and co-championed at the Santa Clara Philalethic Invitational tournament with fellow junior Anna Nakai, while freshmen Barry He and Nikolas Risano co-championed in the novice division of the January\/February topic.\r\n\r\nOther honorable mentions include junior Carissa Zou, who made it to the semifinals, and sophomore Timothy Liu, who made it to quarterfinals in the varsity division of the January\/February topic. Junior Eric Foster made it to semifinals and sophomore Ethan Teo made it to quarterfinals in the varsity division of the March\/April topic.\r\n\r\nLiu said that the January\/February topic revolved around Living Wage, while the March\/April topic was on Food Security.\r\n\r\n“The topic was 'Just governments ought to require employers pay a living wage,'” Liu said. “It is an interesting topic, because although on the surface it seems rather logical that it must be good since it provides people with money, there are a variety of issues that can arise from the Living Wage, such as unemployment.”\r\n\r\nAccording to Lu, this tournament marked the first time in over 20 years that four Paly debaters have ever co-championed both the varsity and novice divisions of a tournament.\r\n\r\n“I think that our success at this last tournament is a testament to the amount of potential we have for next year, especially among the current freshmen,” Teo said. “Paly has never done so well at this tournament before, so next year is a season to really look forward to.”\r\n\r\nPaly Speech and Debate coach Jennie Savage said that the team was over half the pool in octafinals, which is completely unheard of in a tournament that is so large.\r\n\r\n“It was a fantastic regular season closer for our team — the speech squad and the debate squad did exceptionally well there,\" Savage said.\r\n\r\n&nbsp;","excerpt":"The Palo Alto Speech and Debate Team performed exceptionally and made history at the Santa Clara Philalethic Invitational tournament this past month.","date":"2015-04-20 18:18:26","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-17-at-10.11.45-PM.png","categories":["News"],"tags":{"8638":"debate","8944":"palo alto high school","42150":"palo alto high school speech and debate","8953":"paly","19261":"speech and debate","9175":"tournament"}},{"id":102374,"title":"Preview: Not in Our Schools Week","permalink":"http:\/\/palyvoice.com\/2015\/04\/19\/preview-not-in-our-schools-week\/","content":"<span style=\"color: #141823;\">The Associated Student Body will dedicate Not in Our Schools Week to the promotion of awareness, inclusion and service within Palo Alto High School during its annual event, which runs from April 20-24 this year.<\/span>\r\n\r\nAccording to the ASB event page, each day of the week will feature a theme with corresponding activities and a color that students are encouraged to wear.\r\n\r\n[caption id=\"attachment_102378\" align=\"alignright\" width=\"391\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11166076_747101122073349_1760077096_n.jpg\"><img class=\" wp-image-102378\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11166076_747101122073349_1760077096_n.jpg\" alt=\"Students who participated in the Day of Silence break the silence by shouting after school. Photo: Mary McNamara.\" width=\"391\" height=\"220\" \/><\/a> Students who participated in the Day of Silence break the silence by shouting after school. Photo: Mary McNamara.[\/caption]\r\n\r\nOn the Friday before NIOS Week, some students participated in the Day of Silence, where they remained silent throughout the day to honor and support those in the LGBTQ community who have had their voices silenced.\r\n\r\nMonday marks the official start to NIOS week, and students are encouraged to wear blue. The theme of this day is to bring awareness to stereotypes embedded in “isms,” such as sexism and racism, and learn to “erase” them. Brunch will include a chalk walk activity. During lunch, sophomores Aisha Chabane and Claire Eberhart will perform poetry, and a photo table will be available for students to create their own “erase-isms.\"\r\n\r\nTuesday’s theme is ability awareness, and the color of this day is purple. During brunch, ASB Officers will be hosting a human knot, where students grab hands and try to work together and untangle themselves. At lunch, there will be a panel in the Media Arts Center where students with different disabilities will share their experiences.\r\n\r\nWednesday is Sexual Assault Awareness Day, and students are encouraged to wear red. On the quad at brunch, buttons will be handed out and the Paly Women’s Choir, Paly Women's Choir and Spectrum will prefrom. At lunch, there will be a “These Hands Won’t Harm” poster on the Quad and a trivia game on the Senior Deck.\r\n\r\nAs a part of NIOS week, Paly students will serve their community in the sixth annual Paly Service Day. Service Day allows students to participate in various volunteer activities both on campus during lunch and around the Bay Area. Students will volunteer at over 40 different off-campus sites, aiding causes that include the environment, the arts, poverty, homelessness, health and safety and more. The off-campus site signups are now closed, but students can still participate in the many service projects available for students during lunch.\r\n\r\nService Day also marks the end of the food drive for Neighbors Helping Neighbors, a local organization that provides food for families unable to qualify for other “safety net” programs. The cans and dry foods gathered over the past week will be collected by YCS-interact Club leaders.\r\n\r\nFriday's theme is health and wellness, and students are encouraged to wear green. The goal of this day is to build unity and friendship within the Paly community. Brunch will include meditation on the quad. Additionally, a photo of the whole school will be taken with a drone. Lunch activities include yoga on the Quad and tie dyeing t-shirts.\r\n\r\n“NIOS Week is going to be so amazing and so meaningful this year,\" Sophomore Class Vice President Anmol Nagar said. \"It [NIOS Week] is really a way for all of us to learn about what makes us different and the hardships that everyone goes through, and overcome those differences to promote a more inclusive community at Paly.”","excerpt":"The Associated Student Body will dedicate Not in Our Schools Week to the promotion of awareness, inclusion and service within Palo Alto High School during its annual event, which runs from April 20-24 this year.","date":"2015-04-19 21:33:34","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11166076_747101122073349_1760077096_n.jpg","categories":["News","Spotlight"],"tags":{"14285":"ability awareness","42157":"day of silence","42160":"health and wellness day","42158":"isms","14280":"nios","14279":"not in our schools week","8944":"palo alto high school","14277":"service day","42159":"sexual assault awareness day"}},{"id":102054,"title":"Slideshow: What students appreciate about their teachers","permalink":"http:\/\/palyvoice.com\/2015\/04\/17\/slideshow-what-students-appreciate-about-their-teachers\/","content":"Students are encouraged to thank their staff and teachers as part of Staff Appreciation Week April 13-17 at Palo Alto High School.\r\n\r\nThe Associated Student Body set up a booth on Tuesday, Wednesday and Thursday at lunch where students wrote notes to staff members. In addition, ASB will deliver flower bouquets to the staff throughout the week.\r\n\r\nIn celebration of Staff Appreciation Week, The Paly Voice asked students what they appreciate about their teachers.\r\n\r\n<iframe width=\"600\" height=\"600\" src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AkJATcMNCSKz\" frameborder=\"0\" allowfullscreen scrolling=\"no\"><\/iframe><noscript><span>Teacher Appreciation<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Mary McNamara.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Mary McNamara.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Mary McNamara.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 620<\/span><span>height<\/span><span> 400<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 623<\/span><span>height<\/span><span> 402<\/span><span>Photo by Mary McNamara.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 623<\/span><span>height<\/span><span> 399<\/span><span>Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 622<\/span><span>height<\/span><span> 398<\/span><\/noscript>","excerpt":"In celebration of Staff Appreciation Week, The Paly Voice asked students what they appreciate about their teachers.","date":"2015-04-17 10:02:31","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-17-at-9.51.44-AM.png","categories":["Multimedia","Spotlight"],"tags":{"31764":"appreciation","8496":"ASB","8944":"palo alto high school","42087":"staff appreciation week","9152":"teachers"}},{"id":102023,"title":"Club going up on a MUNday","permalink":"http:\/\/palyvoice.com\/2015\/04\/16\/club-going-up-on-a-munday\/","content":"[caption id=\"attachment_102183\" align=\"alignnone\" width=\"616\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-16-at-12.23.23-PM.png\"><img class=\" wp-image-102183\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-16-at-12.23.23-PM.png\" alt=\"Palo Alto High School's Model United Nations club poses for a picture at the Inter-Generational MUN conference last September. This was the club's first conference of the year. \" width=\"616\" height=\"463\" \/><\/a> Palo Alto High School's Model United Nations club poses for a picture at the Inter-Generational MUN conference last September. Photo by Eli Craverio Frankel.[\/caption]\r\n<p style=\"color: #000000;\">With over 100 active clubs at Palo Alto High School, it is hard for one to know what goes on in each and every club. Despite how Paly's Model United Nations club has been around for years, quite a few Paly students are aware of what the club actually does. The Paly Voice met with senior club President Zofia Ahmad and junior Vice President Eli Craverio Frankel to hear about what goes on in MUN club.<\/p>\r\n“Paly Model United Nations is a club intended for students to learn about world politics and events, teach members how to debate and write position papers and attend Model United Nations conferences around the Bay,” Frankel said.\r\n\r\nAt these conferences, each high school is assigned a country and assigned a committee with a specific topic. Then they must research the country and its position, write the position paper and go to the conferences to debate and find a solution.\r\n\r\n“Once we find our solution we have to work together with the other countries to write and pass a resolution,” Frankel said. “It is a really fun and interesting experience.”\r\n\r\nFrankel said that some topics that the club has seen this year were Israel vs Palestine, cyber warfare, maritime piracy, and the Syrian Civil War.\r\n\r\nAccording to Frankel, so far this year Model UN has attended the Intergenerational Model United Nations Conference in San Francisco, Stanford Model United Nations Conference, Santa Clara Valley Model United Nations Conference at Santa Teresa High School in San José, and Berkeley Model United Nations Conference at UC Berkeley.\r\n\r\n“The conferences we attend, especially Berkeley Model UN Conference and Stanford Model UN Conference, are attended by people from all over the world, and as you can imagine, a bunch of really put-together people in suits can be really intimidating,” Ahmad said. “A big part of being successful at conferences is being confident in your solutions and research, even if you're completely making something up.”\r\n\r\nAccording to Ahmad, in order to give the club the opportunity to get comfortable debating and discussing within parliamentary procedure, the leadership team implemented mock conferences for club members.\r\n\r\n“This year I think the biggest change we implemented was hosting mock conferences,” Ahmad said. “We decided to do these so that our members would be more prepared for actual conferences and the style of debating you do there.”\r\n\r\nMany members of the club won awards at these conferences for excellent research and in-committee skills, including junior Chris van Gelder (3 times), sophomore Gaby Pelayo, sophomore Joelle Dong, sophomore Zahra Muzaffar, and more, according to Frankel.\r\n\r\n“This year has been an amazing year for the club as we have grown significantly to include more members,” Frankel said. In addition, we have improved how the clubs works and learns thanks to our amazing president Zofia Ahmad, our wonderful secretary sophomore Mary McNamara, our terrific treasurer Alicia Mies, and our two awesome advisors, history teachers Mr. Grant Blackburn and Mr. Christopher Farina.”\r\n\r\nPaly MUN meets every Monday in room 813 during lunch.\r\n\r\n“We hope to continue improving our club next year and create more amazing MUN experiences,” Frankel said.\r\n<p style=\"color: #000000;\"><em>Editor’s note: This version of the story correctly states that Model United Nations club has been at Paly for over four years. <\/em><\/p>","excerpt":"Although Palo Alto High School's Model United Nations club has been around for four years, quite a few Paly students are unaware of what the club is actually about. Senior club President Zofia Ahmad and junior Vice President Eli Craverio Frankel explain what goes on in MUN club. \r\n","date":"2015-04-16 17:51:47","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-16-at-12.23.23-PM.png","categories":["Features","Spotlight"],"tags":{"41546":"ahmad","28772":"club","11337":"clubs","41544":"eli","41545":"frankel","30243":"model un","41543":"model un club","41547":"model united nations","41548":"mun","8944":"palo alto high school","8953":"paly","41542":"zofia ahmad"}},{"id":102058,"title":"Boys&#8217; golf braves windy conditions to defeat Gunn","permalink":"http:\/\/palyvoice.com\/2015\/04\/16\/boys-golf-braves-windy-conditions-to-defeat-gunn\/","content":"The Palo Alto High School boys’ golf team (11-1, 9-0) adapted to tough conditions en route to a comfortable 183-194 win over crosstown rival Gunn High School (10-1) on Tuesday at Palo Alto Municipal Golf Course.\r\n\r\nFreshmen Ahmed Ali and Joonsung Ha led the Vikings with even par-scores of 35 apiece.\r\n\r\nAli played down the importance of tying first in individual scoring.\r\n\r\n\"As long as I help my team out in any way, I'm happy,\" Ali said.\r\n\r\nSenior captains Alex Hwang and John Knowles shot 36 and 40, respectively. Junior Matthew Lewis also shot 40, while fellow junior Henry Gordon rounded out the win with a score of 37.\r\n\r\n[caption id=\"attachment_102325\" align=\"alignright\" width=\"419\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11149032_10206395380866055_1838262257_n.jpg\"><img class=\"wp-image-102325\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11149032_10206395380866055_1838262257_n.jpg\" alt=\"11149032_10206395380866055_1838262257_n\" width=\"419\" height=\"313\" \/><\/a> Junior Henry Gordon sets up the ball for a putt. Gordon finished with a score of 37 against Gunn. Photo by Alex Hwang.[\/caption]\r\n\r\nCoach Doyle Knight added that the win showed that the team is shaping up well for upcoming post-season matches.\r\n\r\n\"I was proud of [the team] today,\" Knight said. \"They shot low even with the wind, and it bodes well for our league tournament and CCS. It was nice we were finally able to play a competitive team [Gunn].\"\r\n\r\nGunn senior captain Jack Jaffe noted the effect of the windy conditions on the match.\r\n\r\n\"Our team struggled with the wind and putting,\" Jaffe said. \"But if we work on our games diligently for the next couple of weeks we should be able to challenge Paly in our next match as well as the SCVAL league tournament.\"\r\n\r\nAccording to Hwang, the rivalry was exacerbated by the two teams' familiarity with each other.\r\n\r\n\"We see them every day at practice because they share our practice facility,\" Hwang said. \"As a Paly golfer, they've always been the team in the back of my mind for the past 4 years, so it was nice to beat them in my last year.\"\r\n\r\nThe team's next match is against Los Altos High School at 3:30 p.m. tomorrow at Palo Alto Hills Country Club.","excerpt":"The Palo Alto High School boys’ golf team (11-1, 9-0) adapted to tough conditions en route to a comfortable 183-194 win over crosstown rival Gunn High School last Tuesday at Palo Alto Municipal Golf Course.","date":"2015-04-16 15:53:52","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11149032_10206395380866055_1838262257_n.jpg","categories":["Golf"],"tags":{"41552":"ahmed ali","14524":"alex hwang","41554":"ali","30253":"doyle knight","8738":"Golf","8751":"gunn","41553":"hwang","25081":"knight","14521":"paly golf","29185":"rivals","10981":"win"}},{"id":102303,"title":"Season update: Boys&#8217; lacrosse in control after early adversities","permalink":"http:\/\/palyvoice.com\/2015\/04\/16\/season-update-boys-lacrosse-in-control-after-early-adversities\/","content":"After a rough patch in the beginning of the season, the Palo Alto High School boys’ lacrosse team (5-5, 4-2) has rebounded and is in position to clinch a spot in the Santa Clara Athletic League playoffs. The Vikings will play crosstown rival Gunn at 7 p.m. on Friday in their first game back from spring break.\r\n\r\nAccording to junior midfielder Charlie Stephenson, the season began slowly as players adjusted to new dynamics.\r\n\r\n[caption id=\"attachment_102318\" align=\"alignright\" width=\"391\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_24672.jpg\"><img class=\"wp-image-102318 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_24672.jpg\" alt=\"Senior captain Owen Staiger scrambles back to defend in a victory over Gunn on March 13. Photo by Amy Leung.\" width=\"391\" height=\"198\" \/><\/a> Senior Owen Staiger scrambles back to defend in a victory over Gunn on March 13. Photo by Amy Leung.[\/caption]\r\n\r\n“We started off pretty rough just because we weren’t working well together as a team, but our coach has introduced some teamwork into our play,” Stephenson said. “We’ve stepped it up the second half of the season.”\r\n\r\nInjuries have hampered the Vikings’ success; leading scorer and senior captain Zach Levitan was unable to play in a few games at the beginning of the season due to a shoulder injury, according to junior attack Matthew Seligson. Despite setbacks, Stephenson said that several players have risen to the occasion and have improved their play over the course of the season.\r\n\r\n“I think Owen Staiger’s stepped up as a player and tried to take control of the team,” Stephenson said. “Christian Rider played a key role in our defense, and he’s seen as a leader, even just as a sophomore.”\r\n\r\nStephenson noted that this year’s squad is loaded with naturally athletic players, and that the emphasis for the team is on refining stick skills and improving cohesiveness.\r\n\r\n“Our speed is a lot better, our size is good and now we’re working on communication so that’ll be a strong suit,” Stephenson said.\r\n\r\nAs league play draws to a close, the team hopes to end on a strong note and is looking forward to taking on league rival Los Gatos High School on April 24 at home, according to junior attack Owen Dulik.\r\n\r\n“The next [Los Gatos] game is going to be huge,” Dulik said. “They’re [one of] our only league losses this season, and we hate them, so it’s going to be a really big game.”","excerpt":"After a rough patch in the beginning of the season, the Palo Alto High School boys’ lacrosse team (5-5, 4-2) has rebounded and is in position to clinch a spot in the Santa Clara Athletic League playoffs. The Vikings will play crosstown rival Gunn at 7 p.m. on Friday in their first game back from spring break.","date":"2015-04-16 15:17:39","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_24671.jpg","categories":["Sports"],"tags":{"12015":"boys lacrosse","42127":"charlie stephenson","42128":"christian rider","8752":"gunn high school","42129":"los gatos high school","11983":"Matthew Seligson","9960":"owen dulik","12172":"owen staiger","8944":"palo alto high school","12052":"zach levitan"}},{"id":102101,"title":"Preview: Girls&#8217; lacrosse to face rival Saint Francis tomorrow","permalink":"http:\/\/palyvoice.com\/2015\/04\/16\/preview-girls-lacrosse-to-face-rival-saint-francis-tomorrow\/","content":"[caption id=\"attachment_102090\" align=\"aligncenter\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_0850.jpg\"><img class=\"wp-image-102090\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_0850.jpg\" alt=\"The Paly players huddle after beating Saint Francis in a very close game last year. This year, the Saint Francis Lancers will play for redemption. Photo by Molly Fogarty. \" width=\"500\" height=\"375\" \/><\/a> The Palo Alto High School lacrosse players huddle after beating Saint Francis in a very close game last year. This year, the Saint Francis Lancers will play for redemption. Photo by Molly Fogarty.[\/caption]\r\n<p style=\"line-height: 15.2pt; margin: .1pt 0in .1pt 0in;\"><span style=\"font-size: 10.5pt; font-family: Georgia;\">The Palo Alto High School girls' lacrosse team (8-1) will play Saint Francis High School Lancers (7-9-1) at 7 p.m. tomorrow at the Paly lacrosse field.<\/span><\/p>\r\n<p style=\"line-height: 15.2pt; margin: .1pt 0in .1pt 0in;\"><span style=\"font-size: 10.5pt; font-family: Georgia;\">Last season, the Vikings dramatically beat the Lancers 10-9. The Vikings were trailing and came back to win the game in the final quarter. The year prior, the Lancers beat Paly in triple overtime for the championship.<\/span><\/p>\r\n<p style=\"line-height: 15.2pt; margin: .1pt 0in .1pt 0in;\"><span style=\"font-family: Georgia; font-size: 10.5pt; line-height: 15.2pt;\">Senior Paige Anderson notes the tension between the two teams.<\/span><\/p>\r\n<p style=\"line-height: 15.2pt; margin: .1pt 0in .1pt 0in;\"><span style=\"font-size: 10.5pt; font-family: Georgia;\">\"It's really fun to play Saint Francis, because they've always been our rival,\" Anderson said. <\/span><\/p>\r\n<p style=\"line-height: 15.2pt; margin: .1pt 0in .1pt 0in;\"><span style=\"font-size: 10.5pt; font-family: Georgia;\">Anderson hopes to start a winning streak against Saint Francis this year. <\/span><\/p>\r\n<p style=\"line-height: 15.2pt; margin: .1pt 0in .1pt 0in;\"><span style=\"font-size: 10.5pt; font-family: Georgia;\">\"We're focusing on winning the draw, handling the ball well, and possessing on attack,<\/span>\" Anderson said. \"I'm hoping this year that it won't be as close as last year but will still be a good game.\"<\/p>","excerpt":"The Paly girls' lacrosse team will play Saint Francis High School Lancers at 7 p.m. tomorrow at the Paly lacrosse field.","date":"2015-04-16 13:49:01","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_0850.jpg","categories":["Sports"],"tags":{"8836":"Lacrosse","12016":"lax","41721":"paige anderson","17800":"paly lacrosse","31766":"rivalry","25429":"saint francis"}},{"id":102200,"title":"Astronomy Club to host renowned astronomer","permalink":"http:\/\/palyvoice.com\/2015\/04\/16\/astronomy-club-to-host-renowned-astronomer\/","content":"[caption id=\"attachment_102209\" align=\"alignnone\" width=\"592\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ASTRONOMY.jpg\"><img class=\"wp-image-102209 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ASTRONOMY.jpg\" alt=\"ASTRONOMY\" width=\"592\" height=\"444\" \/><\/a> Members of Astronomy Club witness a partial solar eclipse at a viewing event in October 2014. The club will host astronomer Jill Tarter on Friday in the Haymarker Theatre. Photo courtesy of Chelsea Thangavelu.[\/caption]\r\n\r\nThe Astronomy Club will host astronomer Jill Tarter to discuss extra-terrestrial activity at 6:30 p.m. Friday in the Palo Alto High School Haymarket Theatre.\r\n\r\nTarter, a former director of the Search for Extra-Terrestrial Intelligence and current <a href=\"http:\/\/www.seti.org\/seti-institute\/about-seti\/who-we-are\/bernard-m-oliver-chair\">Bernard M. Oliver Chair<\/a> for SETI, will discuss her career in astronomy and within SETI, a nonprofit institution dedicated to scientific research, education and public outreach.\r\n\r\n“Up to this day, there are about 2,000 confirmed exoplanets — planets outside of our solar system,” senior and Astronomy Club co-president Chelsea Thangavelu said. “Dr. Tarter will be speaking about the possibility of intelligent life or life as we know it outside of our solar system on these exoplanets and what we as humans may do if and when we discover extra-terrestrial intelligence.”\r\n\r\nIn addition to her work at SETI, Tarter was named one of the <a href=\"http:\/\/content.time.com\/time\/specials\/packages\/article\/0,28804,1970858_1970909_1971711,00.html\">100 most influential people<\/a> by Time Magazine in 2004. In 2009, she was a <a href=\"http:\/\/upstart.bizjournals.com\/news\/wire\/2008\/10\/16\/ted-prizes-go-from-deep-sea-to-deep-space.html\">recipient<\/a> of a TED Prize awarded to individuals with visions to spark global change, according to TED’s <a href=\"https:\/\/www.ted.com\/participate\/ted-prize\">official website<\/a>.\r\n\r\n“We are definitely excited about this event,\" Thangavelu said.  “We are so lucky to have such an important figure in science speak at our school. Dr. Tarter is a great speaker and is very passionate about her career.”\r\n\r\nAccording to Thangavelu, pizza will be provided for the first 100 attendees and students who attend may be able to earn extra credit in their science classes.","excerpt":"The Astronomy Club will host astronomer Jill Tarter to discuss extra-terrestrial activity on Friday at 6:30 p.m. in the Haymarket Theatre.","date":"2015-04-16 13:47:55","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ASTRONOMY.jpg","categories":["News"],"tags":{"41994":"astronomer","41991":"astronomy","41992":"astronomy club","41996":"extra-terrestrial","40687":"haymarket theatre","41993":"jill tarter","8944":"palo alto high school","8953":"paly","41995":"seti"}}]