[{"id":107875,"title":"Vikings stumble during 3rd quarter, fall short to San Benito","permalink":"http:\/\/palyvoice.com\/2015\/09\/15\/vikings-stumble-during-the-3rd-quarter-fall-to-san-benito\/","content":"[caption id=\"\" align=\"alignnone\" width=\"702\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_img_1343.jpg\"><img class=\"size-full wp-image-107980\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_img_1343.jpg\" alt=\" Photo by Sam Lee\" width=\"702\" height=\"419\" \/><\/a> Senior wideout Eli Givens (far right) prepares for the snap. Givens scored two touchdowns during the Vikings' loss to San Benito, including a one-handed catch in the Haybalers' endzone. Photo by Sam Lee. [\/caption]\r\n\r\nThe Palo Alto High School Vikings football team (1-1, 0-0) fell to the San Benito Haybalers (2-0, 0-0) by a score of 49-34 last Friday in the second game of the season, a well-fought battle that was decided by a one-sided third quarter.\r\n\r\nAccording to senior quarterback Justin Hull, the Vikings played harder and performed better this year than they did in last year's game against San Benito, in which Paly lost 33-0.\r\n\r\n“Last year we just got blown out by these guys, so it was nice to see a lot of effort across the board, offense and defense,” Hull said.\r\n\r\nThe Vikings started the game off on a high note when Hull connected with senior wide receiver Riley Schoeben for a touchdown in the first 10 minutes. Immediately afterward, junior linebacker Jamie Cullen recovered a fumble on the Vikings’ 1-yard line, stalling a Haybalers' drive.\r\n\r\nSan Benito came back, however, with consecutive touchdowns scored by junior fullback Hunter Nye and senior running back Kyle Cameron.\r\n\r\nAlthough Paly senior fullback Shaun Pike tied up the game at the half with a touchdown less than 11 minutes into the third quarter, San Benito scored two back-to-back touchdowns in the same quarter. The Vikings' head coach Jake Halas accredited this to the Haybalers' wishbone offense, a formation that puts heavy pressure on the opposing team's defensive players. \r\n\r\n“We had a hard time shutting down that offense,\" Halas said. \"The wishbone offense hits very hard. We had some assignments blown, we couldn’t really stop them.” \r\n\r\nHowever, the Vikings didn’t go down without a fight. Hull found receivers in the endzone multiple times during the second half, including a one-handed catch by senior wideout Eli Givens.\r\n\r\nUltimately, San Benito’s running game proved too much for the Vikings to handle.\r\n\r\n\"It was disappointing, but there’s a lot that we can learn from it,\" Pike said. \"It’s a good learning experience.\"\r\n\r\nThe Vikings' next game is against the Archbishop Mitty Monarchs (2-0,0-0) at 7 p.m. this upcoming Friday in San Jose.\r\n","excerpt":"The Palo Alto High School Vikings football team (1-1, 0-0) fell to the San Benito Haybalers (2-0, 0-0) by a score of 49-34 last Friday, in the second game of the season, a well-fought battle that was decided by a one-sided third quarter.\r\n","date":"2015-09-15 17:58:33","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_2img_1239.jpg","categories":["Football","Sports","Sports Recap"],"tags":[]},{"id":108023,"title":"Liveblog: Girls&#8217; volleyball takes on Woodside in home opener","permalink":"http:\/\/palyvoice.com\/2015\/09\/15\/liveblog-girls-volleyball-takes-on-woodside-in-home-opener\/","content":"[caption id=\"attachment_108028\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo4.jpg\"><img class=\"size-full wp-image-108028\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo4.jpg\" alt=\"The Vikings volleyball tea huddles before their game against Gunn on Sept. 23, 2014. The Vikings went on to lose the match 25-21, 25-23, 25-20. This was the first time Paly lost to Gunn in several years. Photo by Amy Leung.\" width=\"600\" height=\"450\" \/><\/a> The Vikings volleyball team huddles before their game against Gunn High School on Sept. 23, 2014. The Vikings went on to lose the match 25-21, 25-23, 25-20. This was the first time Paly lost to Gunn in several years. Photo by Amy Leung.[\/caption]\r\n\r\n<em>Check back here at 6:45 p.m. for live updates on Palo Alto High School girls' volleyball team's home opener against Woodside High School.<\/em>\r\n\r\n[liveblog]","excerpt":"Check back here at 6:45 p.m. for live updates onPalo Alto High School girls' volleyball team's home opener against Woodside High School.\r\n","date":"2015-09-15 14:05:50","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo4.jpg","categories":["Sports","Volleyball"],"tags":{"8734":"girls","8770":"home","8855":"liveblog","11344":"new gym","9210":"vikings","9216":"volleyball","25275":"woodside"}},{"id":107846,"title":"Slideshow: Football vs. San Benito","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/slideshow-football-vs-san-benito\/","content":"The Palo Alto High School Vikings football team (1-1, 0-0) suffered a hard-fought loss to the San Benito Haybalers (2-0, 0-0) on Friday as the game ended with a final score of 49-34.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AgDA26sVRxJ-\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n\r\n","excerpt":"The Palo Alto High School Vikings football team (1-1, 0-0) suffered a hard-fought loss to the San Benito Haybalers (2-0, 0-0) on Friday as the game ended with a final score of 49-34.","date":"2015-09-14 22:28:33","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_12571.jpg","categories":["Football","Sports"],"tags":{"8714":"football","8953":"paly","9059":"San Benito","9210":"vikings"}},{"id":107951,"title":"Administration adjusts Tutorial check-in policy","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/administration-adjusts-tutorial-check-in-policy\/","content":"[caption id=\"attachment_107970\" align=\"alignnone\" width=\"427\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSCN03741.jpg\"><img class=\"wp-image-107970\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSCN03741.jpg\" alt=\"DSCN0374\" width=\"427\" height=\"320\" \/><\/a> Junior Kathleen Gaffney studies in the library. Some students are worried that the library overcrowding—already severe during tutorial— will grow worse. “The library will become overcrowded since it was already pretty crowded when people weren’t required to stay for the entire length of Tutorial,” senior Rachel van Gelder said. Photo by Adrienne Kwok.[\/caption]\r\n\r\nAttendance will be recorded at the end of Tutorial beginning tomorrow at Palo Alto High School, according to a Schoology post by Principal Kim Diorio.\r\n\r\nThe change of sign-in time from the beginning to the end of the period comes after a <a href=\"http:\/\/palyvoice.com\/2015\/08\/25\/tutorial-2-0-mandatory-attendance\/\">major shift<\/a> in use of the period this year.\r\n\r\nIn the post, Diorio mentions how it is the Palo Alto High School administration’s vision for Tutorial to be used as “<a href=\"http:\/\/paly.net\/flextime_learning_roadmap\">Flex Time<\/a>,” or time spent doing non-academic activities. This includes opportunities such as <a href=\"http:\/\/palyvoice.com\/2015\/09\/14\/palo-alto-high-school-hosts-first-ever-yoga-on-the-quad-during-tutorial\/\">yoga on the Quad<\/a>, socializing, reading and meditating. Students can also continue to work on academic material.\r\n\r\nThe post also says that students will check in with their Tutorial teachers from 2:45 p.m. to 2:55 p.m. A warning bell will ring at 2:45 p.m. to remind students to check in.\r\n\r\nMath teacher Charlotte Harris understands the need for a new Tutorial attendance strategy.\r\n\r\n“I believe that the administration wants students on campus taking use of this time, even if it’s simply bonding with other people on campus,” Harris said. “They want people to stay, so it makes sense to take it [attendance] at the end [of Tutorial].”\r\n\r\nStudent reactions to the change in policy are mixed.\r\n\r\n“I think it’s kind of a hassle that we have to check in at the end now, but I can see why they’re deciding to do it that way,” senior Rachel van Gelder said. “I know there are a lot of people who try to sneak out before Tutorial is over, so this will probably stop that from happening so often.”\r\n\r\nJunior Jenny Zhuge is against the new approach to attendance.\r\n\r\n“I just don’t like that they [administration] made Tutorial mandatory for everyone,” Zhuge said. “If you need help from teachers, then you should go and get help. But if you don’t, and are just going to waste your time at school anyways, then might as well go home. For some people, going home and finishing work might be more productive than staying at school.”\r\n\r\nAccording to junior Mackenzie Ferrell, Paly administration’s regulation of Tutorial will be beneficial to students in ways that are not related to school work.\r\n\r\n“Tutorial is a great way to get help, but if you don’t need to see a teacher you should be able to do fun things, and that is just what Paly administration is trying to do,” Ferrell said. “It is a good time to socialize and get to know your teachers.”\r\n\r\nAdditionally, Diorio mentions in the post that students must notify the school of a pre-planned absence before leaving during Tutorial, or risk being forced to stay.\r\n\r\n“If you do need to leave campus, please have your parents contact the attendance office before Tutorial starts so you can pick up a pass to leave,” Diorio said in her post. “The campus supervisors\/admin [administration] at the exits of school will ask to see the pass.”","excerpt":"Attendance for Tutorial will be recorded from 2:45-2:55 p.m. to ensure that students stay for the entire length of the period starting tomorrow, according to a Schoology post by Principal Kim Diorio.","date":"2015-09-14 22:01:54","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSCN03741.jpg","categories":["News","Spotlight"],"tags":{"8458":"administration","53664":"attendance","39937":"change","53668":"charlotte","8644":"diorio","53665":"end of period","53667":"ferrell","53669":"harris","53672":"jenny","53666":"mackenzie","8944":"palo alto high school","8953":"paly","53671":"rachel","33850":"schoology","11060":"tutorial","53670":"van gelder","53673":"zhuge"}},{"id":107922,"title":"Paly hosts first ever &#8220;Yoga on the Quad&#8221; during Tutorial","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/palo-alto-high-school-hosts-first-ever-yoga-on-the-quad-during-tutorial\/","content":"[caption id=\"attachment_107923\" align=\"alignnone\" width=\"950\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11986473_10200509181809203_7819621335471777330_n.jpg\"><img class=\"size-full wp-image-107923\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11986473_10200509181809203_7819621335471777330_n.jpg\" alt=\"A sign advertising the new event during tutorial where students are invited to participate in a yoga class on the quad called &quot;Yoga on the Quad.&quot; Photo: &quot;Paly on the quad&quot; Facebook group. \" width=\"950\" height=\"582\" \/><\/a> A sign advertising the new event during Tutorial where students are invited to participate in a yoga class on the Quad taught by yoga instructor Lisa Haley. Photo: \"Paly on the Quad\" Facebook group.[\/caption]\r\n\r\nPalo Alto High School students will host a yoga class on the Quad during Tutorial, which will continue every Tuesday.\r\n\r\nAccording to junior and co-event coordinator Cezanne Lane who is working with junior coordinator Teddie Stewart, the event is a way to expose yoga to the teen community.\r\n\r\n“We want to bring yoga to the youth community,\" Lane said. \"It has been a really important aspect of my life and helps me to manage my stress and we both feel that we want others to have the opportunity to do the same.\"\r\n\r\nDue to this year’s enforcement of<a href=\"http:\/\/palyvoice.com\/2015\/08\/25\/tutorial-2-0-mandatory-attendance\/\"> mandatory Tutorial<\/a>, Stewart says that yoga is a great way to help students become more mindful.\r\n\r\n“We understand that not all of you [students] have the time\/effort to drop what you're doing to do yoga,\" Stewart said in a post to the \"Yoga on the Quad\" Facebook group. \"Since Tutorial is now mandatory and it's meant to help students (not just with school work), we should all take advantage of this opportunity and try yoga. I promise you will see a difference in your attitude after it’s done.\"\r\n\r\nAccording to Stewart, she and Lane worked with Yogaworks instructor Lisa Haley to create a class in which students are able to see the benefits of yoga. Haley will lead the session.\r\n\r\n\"There is no prior experience needed and you can wear whatever you'd like,\" Lane said.\r\n\r\nAccording to junior Yashvi Tibrewal, the class is a great opportunity because it exposes students to things they might not otherwise try.\r\n\r\n“I think it’s great that the school is taking the effort to organize these things on campus because it makes it easier for students to try out new things, such as yoga, that we may otherwise not end up trying at home,\" Tibrewal said. \"It’s also a great use of Tutorial time for when we don’t feel like doing homework.\"","excerpt":"Palo Alto High School will conduct its first ever yoga class on the Quad tomorrow during tutorial which will continue to occur every Tuesday.\r\n","date":"2015-09-14 21:37:46","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11986473_10200509181809203_7819621335471777330_n.jpg","categories":["News","Spotlight"],"tags":{"8953":"paly","53648":"yoga","53647":"yogaonthequad","41238":"zen"}},{"id":107592,"title":"Students react to James Franco film workshops","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/students-react-to-james-franco-film-workshops\/","content":"A wide range of reactions from students have been elicited after news of that alumnus James Franco will be teaching a <a href=\"http:\/\/palyvoice.com\/2015\/09\/07\/james-franco-to-teach-film-course-in-mac\/\">film production workshop<\/a> hosted at Palo Alto High School in the Media Arts Center. Hover over the dots to find out what some Paly students have had to say about Franco and the upcoming workshop.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/700124793260736514\/1024\/10\/scaletowidth#tl-700124793260736514;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\nPhotos by Emma van der Veen.","excerpt":"News of alumnus James Franco teaching a film production workshop hosted at Palo Alto High School in the Media Arts Center has elicited a wide range of reactions from students. ","date":"2015-09-14 19:12:20","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1844.jpg","categories":["Features"],"tags":{"8493":"art","8706":"film","8801":"james franco","8944":"palo alto high school","8953":"paly","23939":"reaction","53242":"student opinion","29088":"workshop"}},{"id":107896,"title":"Seniors: College application sessions during tutorial with Ms. Tokheim","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/seniors-college-application-sessions-during-tutorial-with-ms-tokheim\/","content":"","excerpt":"","date":"2015-09-14 15:08:08","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":107894,"title":"1st Progress Report ends this Friday, Sept. 18","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/1st-progress-report-ends-this-friday-sept-18\/","content":"","excerpt":"","date":"2015-09-14 15:04:18","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":107618,"title":"Students, staff deal with limited parking","permalink":"http:\/\/palyvoice.com\/2015\/09\/14\/students-staff-deal-with-limited-parking\/","content":"[caption id=\"attachment_107629\" align=\"aligncenter\" width=\"601\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/unnamed.jpg\"><img class=\"wp-image-107629\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/unnamed.jpg\" alt=\"unnamed\" width=\"601\" height=\"401\" \/><\/a> Biology honors and Advanced Placement Environmental Science teacher Nicole Loomis prepares to leave after school on Sept. 2. Loomis encourages alternatives to driving to school, such as biking, taking public transportation, walking or carpooling as a way to avoid issues caused by limited parking. Photo by Morgan Keller.[\/caption]\r\n\r\nWith parking passes going into effect, many Palo Alto High School students and staff are unable to park on campus due to limited parking spots caused by both <a href=\"http:\/\/palyvoice.com\/2015\/09\/02\/slideshow-gym-teardown-marks-end-of-an-era\/\">new<\/a> and <a href=\"http:\/\/palyvoice.com\/2008\/09\/27\/node-20022\/\">ongoing<\/a> construction projects.\r\n\r\nAccording to Assistant Principal Jerry Berkson, lost parking spots totaled at approximately 65, although some may become accessible again in the El Camino parking lot later in the year.\r\n\r\n\"I don't think we're going to gain anything on the gym side for a while,\" Berkson said. \"Now that the gym is torn down, we might be able to [add some] past the fence. We’ll see how it looks like in a little while.\"\r\n\r\nStaff members with parking permits are able to park in staff or student spots, according to <a href=\"http:\/\/www.paly.net\/parking-permits-and-regulations\">Palo Alto High School's website<\/a>, although the designated staff spaces are limited,\r\n\r\nA lottery was held to distribute the left over parking permits to juniors or sophomores who had applied for one.\r\n\r\n\"Parking permits are senior priority,\" Berkson said. \"There's still some spots left, so the lottery was pretty easy.\"\r\n\r\nAccording to Berkson, although anyone could apply for a permit, many people didn't this year.\r\n\r\n\"[People didn't apply for a permit] because you guys are all busy, and you don't get around to things sometimes,\" Berkson said.\r\n\r\nAccording to Berkson, parking accommodations will be made for athletes.\r\n\r\n\"There will be 'X' amount of spaces for athletes during their seasons only,\" Berkson said. \"We figure on that being around ten [parking spaces] per season, so they will be able to park on campus.\"\r\n\r\nThe Paly Voice spoke with students, teachers and Principal Kim Diorio to see what they had to say about the changes in parking and how to combat it.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AMGAw68Cfs2c\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"With parking passes going into effect, many Palo Alto High School students and staff are unable to park on campus due to limited parking spots caused by both new and ongoing construction projects.","date":"2015-09-14 11:36:34","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/unnamed.jpg","categories":["News","Slideshow","Spotlight"],"tags":{"8616":"construction","53246":"limited parking","8944":"palo alto high school","8953":"paly","8975":"parking","9107":"slideshow"}},{"id":107854,"title":"James Franco teaches first film workshop","permalink":"http:\/\/palyvoice.com\/2015\/09\/13\/james-franco-teaches-first-film-workshop\/","content":"[caption id=\"attachment_107861\" align=\"aligncenter\" width=\"584\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/0-5.jpeg\"><img class=\"wp-image-107861\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/0-5.jpeg\" alt=\"0-5\" width=\"584\" height=\"390\" \/><\/a> James Franco (right) leads the class in organizing scene assignments for the screenplay \"Metamorphosis: Junior Year.\" Each group of five will film a specific scene that will be joined to produce a unified screenplay. The finished project will be submitted to Conquest Film Festival. Photo by Dhara Yu.[\/caption]\r\n\r\nIt’s not every day that you get to see a famous actor and filmmaker, let alone be taught by one. At Palo Alto High School, however, 40 students were given the opportunity to work with alumnus James Franco to become acquainted with his knowledge of film. The first of eight James Franco-led film workshops took place from 9 a.m. to 1 p.m. today in the Media Arts Center.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/09\/07\/james-franco-to-teach-film-course-in-mac\/\" target=\"_blank\">After considering approximately 500 applicants<\/a>, the leaders of the workshop selected students from Palo Alto High School, Gunn High School, Menlo School and Los Altos High School on Sept. 12, a day prior to the first workshop.\r\n\r\nStudents were first introduced to their assignment for the year: to film certain scenes in groups from the screenplay “Metamorphosis: Junior Year” by Amber Cony, based on the <a href=\"https:\/\/books.google.com\/books\/about\/Metamorphosis.html?id=p0Y9oImKJQsC&amp;hl=en\" target=\"_blank\">novel and stage play<\/a> by James Franco's mother, Betsy Franco. At the end of the year, the groups will unify each of their respective scenes into one film, to eventually be submitted to the <a href=\"http:\/\/cinequest.org\/film-festival\" target=\"_blank\">Cinequest Film Festival<\/a> in San Jose.\r\n\r\nThe screenplay follows the life of a teenager, Ovid, and his everyday interactions with his friends, whether it be the poet, filmmaker or cyber-couple. Carrying his own painful secret, Ovid transcribes his confessions into his notebook, while maintaining a strong passion for art and modern-day Roman mythology references.\r\n\r\nAfter introductions, participants were assigned mock roles for a live reading of the script, which soon generated discussion of what students wanted to change, add or manipulate to the screenplay.\r\n\r\n“We got to listen to all the different voices,” Menlo sophomore Ari Troper said.\r\n\r\nStudents were then split into permanent eight groups of five, with each group in charge of filming particular characters and scenes. Among each of the five participants, students assigned themselves a specific job of either director, producer, cinematographer, writer or editor.\r\n\r\nJames Franco ended the workshop with a live commentary of “The Myth of an American Teenager,” a coming-of-age movie with a similar theme to “Metamorphosis: Junior Year.”\r\n\r\n[caption id=\"attachment_107862\" align=\"alignright\" width=\"445\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/0-4.jpeg\"><img class=\"wp-image-107862\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/0-4.jpeg\" alt=\"0-4\" width=\"445\" height=\"298\" \/><\/a> Esther Wojcicki (right) greets James Franco (left) in front of the Media Arts Center as students arrive in the morning. Wojcicki is assisting Franco with the teaching and planning aspects of the workshops. Photo by Dhara Yu.[\/caption]\r\n\r\n“He made comments about the movie, which was really helpful,” Troper said. “It really showed how much he knows about this stuff.”\r\n\r\nSophomore Arjan Mobin shared Troper’s sentiments, expressing that it was an experience that helped to showcase the required work for each session.\r\n\r\n“It was good,” Mobin said. “We kind of got a feel for what we’re doing for the rest of the year.”\r\n\r\nAccording to Betsy Franco, today’s workshopped served for more informational purposes, while future workshops will introduce the skill sets required to direct, film and produce.\r\n\r\nBoth Tom Franco, James Franco’s younger brother, and Iris Torres will attend each workshop and help produce the film, while Paly journalism teacher Esther Wojcicki will assist James Franco with teaching and planning each of the workshops.\r\n\r\nPaly junior Jackson Kienitz applied to the workshop in hopes of furthering his film interest and learning from experience.\r\n\r\n“When I grow up, I want to become a storyteller through some medium, and film is one of my favorite mediums of doing so,” Kienitz said. “This will be a great opportunity for growing, partly through making connections, as well as simply practicing the art form.”\r\n\r\nOther students hope to apply the skills they learn directly to their future career interest.\r\n\r\n“I’ve always had a passion for film, and that’s exactly what I want to do for the rest of my life,” Gunn junior Juan Santos said. “I think just having this opportunity to work with an accomplished director, actor and writer is a huge thing and I took the opportunity the second I heard about it.”\r\n\r\nOther participants had little to no film experience, but instead applied in hopes of exploring new possibilities.\r\n\r\n“I’m not really into film, or I haven’t been, but I thought it would be a really interesting opportunity to be a part of a production like this,” Mobin said.\r\n\r\nPaly junior Alec Cohen-Schisler feels that the program itself is both “unreal” and “revolutionary,” and he looks forward to the year.\r\n\r\nAccording to Betsy Franco, James Franco is thrilled to be able to teach at his old high school and looks forward to the final product.\r\n\r\n“He really loves his students,” Betsy Franco said. “He loves to be a student. Learning is what he is all about. I think this is his way of giving back.”","excerpt":"The first of eight James Franco-led film workshops took place from 9 a.m. to 1 p.m. in the Media Arts Center today.","date":"2015-09-13 20:14:47","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/0-5.jpeg","categories":["News","Spotlight"],"tags":{"29838":"alumnus","53632":"Betsy","53630":"conquest","53629":"eight","53636":"esther","8703":"festival","8706":"film","29992":"franco","8751":"gunn","10749":"high school","29991":"james","8801":"james franco","53634":"junior year","9849":"los altos","17729":"Menlo","53635":"metamorphosis","53638":"myth of american teenager","53637":"myth of american teenagr","8939":"palo alto","8944":"palo alto high school","8953":"paly","10117":"san jose","53633":"screenplay","53631":"Tom","12702":"wojcicki","29088":"workshop"}}]