[{"id":106870,"title":"Ban on junior Spirit Week theme idea causes uproar","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/ban-on-junior-spirit-week-theme-idea-causes-uproar\/","content":"A few Palo Alto High School juniors prompted a response from Paly administration after harshly criticizing a ruling to ban a Spirit Week theme idea deemed culturally insensitive.\n\nIn the Class of 2017 Spirit Week theme meeting on Sept. 1, students selected the theme \"Gold Chains\" as one of the top options. The theme would consist of students dressing to mimic hip-hop culture. Student Activities Director Matthew Hall went to administration to approve the theme, but it was quickly ruled out.\n\nIn the wake of the decision, several juniors posted on Facebook to express their opinions on the matter. According to junior Adrian Smith, he posted a photo of a hand controlling a puppet in the “Paly Class of 2017” Facebook group because the decision brought up issues of student voice.\n\n“I felt like the student body [Associated Student Body] wasn’t a ‘student-based’ group,” Smith said. “My original goal of posting that picture was to speak for us students and to slightly send a message to the staff.”\n\nPrincipal Kim Diorio directed an email yesterday towards the whole Class of 2017 but specifically responded to the upset students who posted on Facebook to express their opinions, calling some messages “hurtful, accusatory and cruel.” Diorio explains the rationale and process for banning the theme in her email.\n\n“First, instead of being upset with your peers or teachers, please know the administrative team at Paly unanimously ruled against the 'Gold chains\/thug life' theme based on concerns of cultural appropriation, offending others and\/or perpetuating stereotypes,” Diorio said in the email. “We recognize, and this Facebook page confirms to some degree, a greater need for sensitivity training and developing empathy and compassion towards one another at Paly.”\n\nAt first, junior Emily Read said she did not recognize the reasoning for banning the theme. According to Read, other class members were also bothered when the decision first went public. At the time it was not clear to everyone as to who had made the decision, so people incorrectly held ASB accountable for the ban. Junior Ibby Day also believes students directed their frustrations at the wrong people.\n\n“I think a lot of the people who were angry at the banned theme don't really understand what ASB's part in this whole thing is,” Day said. “I think many people use ASB as a direct way to start a fight because it is mostly student-run, and they don't want to bring up the issue to the Paly admin adults.”\n\nDay says she wrote a Facebook post in the class group to defend the members of ASB, who were the intended recipients of some unkind messages written by juniors.\n\n<span style=\"color: #141823;\">\"I want to defend ASB again because all they are doing is making sure that Paly doesn't get sued for a week that honestly has no apparent value besides fun and cooperation amongst peers,\" Day said in the post.<\/span>\n\nAccording to Day, she was disturbed by the disrespect being aimed toward ASB.\n\n“People were making rash accusations towards people who were only trying to keep Spirit Week fun and inclusive,\" Day said.\n\nAccording to Read, she realized the cause of the ban after explanations by Diorio and Hall,&nbsp;though she is still disappointed with the final outcome.\n\n“I'm still upset that it [the theme] was banned, but I understand why and I agree with it not being used,” Read said.\n\nDay appreciates Diorio’s message to her class as well.\n\n“I feel her response was completely appropriate to the situation,” Day said. “She handled it professionally and [was] open-minded, and I'm glad she took action because those who targeted ASB need to understand that if they have a serious concern with why spirit week themes are banned, they have the opportunity to work it out with an admin.”","excerpt":"A few Palo Alto High School juniors prompted a response from administration after harshly criticizing a ruling to ban a Spirit Week theme idea deemed culturally insensitive.","date":"2015-09-04 18:37:44","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/soph1.jpg","categories":["News"],"tags":{"8458":"administration","50762":"ban","8644":"diorio","14282":"hall","9760":"juniors","8944":"palo alto high school","8953":"paly","9119":"Spirit Week","28800":"theme","9244":"Yellow"}},{"id":106876,"title":"Boys’ water polo looks to improve despite construction obstacles","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/boys-water-polo-looks-to-improve-despite-construction-obstacles\/","content":"[caption id=\"attachment_106894\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/600By800BoysWopoPractice-150904.jpg\"><img class=\"wp-image-106894 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/600By800BoysWopoPractice-150904.jpg\" alt=\"The Palo Alto High School boys’ water polo team executes some drills at the Rengstorff Pool in Mountain View during practice. The team’s first game is against Jesuit High School on Sept. 4 at the opponent's school in Davis.\" width=\"800\" height=\"600\" \/><\/a> The Palo Alto High School boys’ water polo team executes some drills at the Rengstorff Pool in Mountain View during practice. The team’s first game is against Jesuit High School on Sept. 4 at at the opponent's school in Davis. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School boys’ water polo team looks to overcome changes and improve on its second round exit from Central Coast Section last year as its season gets underway today with a non-league game.\r\n\r\nOne of the major changes this year for the Vikings will be that the team won’t be able to play in a home pool. Instead, they have been practicing and playing at the Rengstorff Pool in Mountain View. Once the regular season begins, the team will play home games at Gunn High School’s pool.\r\n\r\nAccording to senior right hand driver Winston Rosati, not having a home pool has been an nuisance.\r\n\r\n“It has been a big inconvenience in terms of logistics and has made certain practice drills much harder to do, but we can certainly do our best with it,” Rosati said.\r\n\r\nNew head coach Aaron Johnson agreed that having no pool might be a hindrance, but he attributed a smooth transition to the new Paly athletic director and team parent.\r\n\r\n“It has definitely been a challenge not having our own pool this season, but we have not let it become a set-back,” Johnson said. “Our athletic director Kathleen Bowers and our team parent Kristen Anderson have done an amazing job making the transition go as smooth as possible. We are also grateful to be able to use Gunn High School as our home pool this year.”\r\n\r\nAnother place the team has experienced change is at the coaching position. Although Johnson is a new head coach, he has had some experience working with the Paly water polo team.\r\n\r\n“I was previously the Paly Frosh\/Soph coach for the past few seasons, so when the varsity job opened up, I was ready to step in to the position,\" Johnson said. “It is something I have been looking forward to for quite some time.”\r\n\r\nAccording to junior right hand driver Andrew Jozefov, Johnson’s style will help the team get better this year.\r\n\r\n“I really like his style,” Jozefov said. “It is really structured which I feel is definitely going to help us. … He holds us to a high standard and expects us to be able to execute.”\r\n\r\nThe team also lost a few key contributing seniors including Lucas Novak, Seth Alston, Ray Zhao, Hans Usman and Luke Schroder.\r\n\r\n“There were some really hard-working team leaders that graduated last year, which is a big loss to this team,” Johnson said. “Lucas Novak redefined the role of captain. He was an amazing leader, positive influence on everyone around him and always pushed himself and teammates to be the best they can.”\r\n\r\nHowever, Johnson believes that there are many players who are capable of stepping up to offset losses.\r\n\r\n“I am however, lucky to have a lot of young talent coming up,” Johnson said. “One in particular is Jack Anderson, a sophomore with a starting position on varsity. He is an underclassman with a big task.\"\r\n\r\nDespite the many changes, the team has set high goals.\r\n\r\n“Our goals are to win SCVAL [Santa Clara Valley Athletic League] league and to get top three at CCS [Central Coast Sections],” Rosati said.\r\n\r\nJozefov is using last year’s disappointment to fuel himself this season.\r\n\r\n“Last year we had a first round bye and got knocked out in the second round and that was pretty disappointing,” Jozefov said. “We hope to get to the semis this year.”\r\n\r\nAccording to Johnson, the team has the right mindset and is excited to begin its season.\r\n\r\n“We’re going out focusing on winning one quarter at a time and playing consistent water polo. We are looking forward to getting this season rolling.”\r\n\r\nThe Viking’s first game is against Jesuit High School at 7 p.m. today in Davis.","excerpt":"The Palo Alto High School boys’ water polo team will look to overcome changes and improve on its second round exit from Central Coast Section last year as its season begins today with an out-of-league game.","date":"2015-09-04 16:55:11","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/600By800BoysWopoPractice-1509041.jpg","categories":["Sports"],"tags":{"9845":"boys water polo","8568":"CCS","50763":"jesuit high school","12043":"new coach","9236":"Winston Rosati"}},{"id":106767,"title":"Liveblog: Football vs. Sequoia","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/liveblog-football-vs-sequoia\/","content":"Check back here beginning at 7:15 p.m. this Friday, Sept. 4 as the Palo Alto High School football team (0-0, 0-0) hosts the Sequoia High School Cherokees (0-0, 0-0) for it's first regular season game of the season.\r\n\r\n[liveblog]","excerpt":"Check back here beginning at 7:15 p.m. this Friday, Sept. 4 as the Palo Alto High School football team (0-0, 0-0) hosts the Sequoia High School Cherokees (0-0, 0-0) for it's first regular season game of the season.","date":"2015-09-04 13:18:21","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2014-11-10-at-8.40.13-PM.png","categories":["Sports","Spotlight"],"tags":{"8714":"football","29126":"home opener","8855":"liveblog","25428":"sequoia"}},{"id":106292,"title":"Yearbook expands senior photo options","permalink":"http:\/\/palyvoice.com\/2015\/09\/03\/yearbook-expands-senior-photo-options\/","content":"This year, seniors will be able to submit their own photos for their yearbook portraits, greatly expanding their options from previous years.\r\n\r\nIn years prior, seniors were limited to paying for a professional photographer, using their student identification cards or attending a free session in which they were unable to chose their photo.\r\n\r\n\"I thought it [the old system] was good, but kind of overpriced,\" senior Courtney Lovely said.\r\n\r\nWith a new leadership team, Madrono is aiming to improve its photo submission policy.\r\n\r\n\"This year, we have [Madrono has] a new teacher, and we both agreed that it was ridiculous that people [felt pressured to] pay for their senior portraits so we decided that this year we would try a new method of doing it,\" Co-editor-in-chief, Blake Ragsdale said. \"We are really trying to redefine the yearbook, and this was one of the steps in order to redefine it.\"\r\n\r\nSeniors seem to enjoy this new option.\r\n\r\n\"I think allowing your own submissions is great,\" senior Alfredo Gonzalez said. \"It's good for people who want the freedom that a professional photo shoot has with location, but don't want to pay the price.\"\r\n\r\nThe photos must follow certain guidelines.\r\n\r\n\"They must be 4 inch by 5 inch, 300DPI, and a professional-looking photo, delivered to the yearbook classroom <span style=\"color: #545454;\">– Room <\/span>101 <span style=\"color: #545454;\">–<\/span> via USB after school on Tuesdays or Thursdays,\" Ragsdale said.\r\n\r\nPhotos will be due by Oct. 15, according to Madrono's photo guide.\r\n\r\nMouse around the Prezi to explore your portrait options. Click the text to zoom in.\r\n[prezi id=\"ajj3_rsitixw\"]","excerpt":"The Paly Voice presents a guide to getting a perfect yearbook picture for seniors confused about senior portrait options. ","date":"2015-09-03 11:24:44","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/Screen-Shot-2015-08-27-at-11.19.06-AM.png","categories":["Multimedia","News"],"tags":{"8953":"paly","23891":"senior portrait","23892":"yearbook"}},{"id":106482,"title":"Season preview: Girls&#8217; tennis optimistic for upcoming year","permalink":"http:\/\/palyvoice.com\/2015\/09\/03\/season-preview-girls-tennis-optimistic-for-upcoming-year\/","content":"[caption id=\"attachment_106812\" align=\"alignnone\" width=\"525\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-03-at-11.02.03-AM.png\"><img class=\"size-full wp-image-106812\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-03-at-11.02.03-AM.png\" alt=\"Senior co-captain Kelsey Wang serves the ball during practice. According to Wang, the team's first match will be today and the girls hope to start the season strong with a win. Photo courtesy of Wang.\" width=\"525\" height=\"359\" \/><\/a> Senior co-captain Kelsey Wang serves the ball during practice. According to Wang, the team's first match will be today and the girls hope to start the season strong with a win. Photo courtesy of Wang.[\/caption]\r\n\r\nThe Palo Alto High School girls’ tennis team is optimistic for its upcoming season after moving up to the De Anza League.\r\n\r\n\"This year, we are in a more competitive league, so we hope to stand our ground and compile a great record for the season,\" senior co-captain Kelsey Wang said.\r\n\r\nAccording to junior Avanika Narayan, the loss of five seniors from last year's team will result in the formation of new doubles teams.\r\n\r\n“Many of the seniors were important doubles players so we are going to recalibrate over doubles and form new teams,” Narayan said.\r\n\r\nDespite the losses, coach Andy Harader is confident the girls will perform well this season.\r\n\r\n“Our goals this year are to end up in the top tier of our league and make it to the Central Coast Section championships,” Harader said.\r\n\r\nKey players to look out for this season are sophomores Narayan and Mylinh Truong, according to Harader.\r\n\r\nAccording to Narayan, the girls hope to bond and develop more as a team.\r\n\r\n\"The team chemistry has changed a lot this season, since now we have two new freshmen and several sophomores that have moved up from junior varsity,” Narayan said.\r\n\r\nAccording to Wang, the team has been practicing hard and readjusting for match play with non-league matches.\r\n\r\n\"Our goal for this week's non-league match is to start the season strong with a win,\" Narayan said.\r\n\r\nWang believes the team's positive attitude will result in a successful season.\r\n\r\n\"I'm especially excited this season since I've seen the team grow and improve so much, and I can't wait to see what we can do this year,\" Wang said.\r\n\r\nThe team will play its first match at Aragon High School at 4 p.m. today.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ tennis team is optimistic for this upcoming season after moving up to the De Anza League.","date":"2015-09-03 11:07:04","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11989150_617542768385627_2077123310_o.jpg","categories":["Sports","Uncategorized"],"tags":{"25273":"andy harader","32562":"Avanika Narayan","10019":"girls tennis","49953":"mylinh truong","8944":"palo alto high school","8953":"paly","10016":"tennis"}},{"id":106671,"title":"Slideshow: Gym teardown marks end of an era","permalink":"http:\/\/palyvoice.com\/2015\/09\/02\/slideshow-gym-teardown-marks-end-of-an-era\/","content":"After eight decades of hosting sports games, dances and concerts, the Palo Alto High School Big Gym is no more.\r\n\r\nTwo excavators <a href=\"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/\">tore down the athletic facility<\/a> this morning, and left the structure in pieces. In its place will be a <a href=\"http:\/\/palyvoice.com\/2015\/08\/29\/the-final-farewell-big-gym-scheduled-for-demolition-on-monday\/\">new state-of-the-art sports complex<\/a>.\r\n<blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 658px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-version=\"4\">\r\n<div style=\"padding: 8px;\">\r\n<div style=\"background: #F8F8F8; line-height: 0; margin-top: 40px; padding: 28.125% 0; text-align: center; width: 100%;\">\r\n<div style=\"background: url(data:image\/png; base64,ivborw0kggoaaaansuheugaaacwaaaascamaaaapwqozaaaagfbmveuiiii9pt0ehh4gib4hibkchbwchbwchbydr+jqaaaachrstlmaba4yhyqsm5jtamwaaadfsurbvdjl7zvbegmhcaqbaf\/\/42xcnbpaqakcm0ftumfaaibe81iqbjds3ls6zs3bipb9wed3yyxfpmhrft8sgyrcp1x8ueuxlmznwelfoycv6mhwwwmzdpekhlhlw7nwjqkhc4uizphavdza2jpzudsbzzinae2s6owh8xpmx8g7zzgkeopuoyhvgz1tbcxmkd3kwnvbu0gkhkx+izilf77iofhry1nyfnb\/lqpb79drwoyjva\/davg9b\/rlb4cc+nqgdz\/tvbbbnr6gbreqn\/nrmdgaqeej7whonozjf+y2i\/fzou\/qaaaaaelftksuqmcc); display: block; height: 44px; margin: 0 auto -44px; position: relative; top: -22px; width: 44px;\">\r\n<p style=\"margin: 8px 0 0 0; padding: 0 4px;\"><a style=\"color: #000; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none; word-wrap: break-word;\" href=\"https:\/\/instagram.com\/p\/7JZ5jJMUME\/\" target=\"_top\">Check out the Big Gym demolition in less than 13 seconds<\/a><\/p>\r\n<p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\">A video posted by The Paly Voice (@thepalyvoice) on <time style=\"font-family: Arial,sans-serif; font-size: 14px; line-height: 17px;\" datetime=\"2015-09-02T23:38:45+00:00\">Sep 2, 2015 at 4:38pm PDT<\/time><\/p>\r\n\r\n\r\n\r\n<\/blockquote>\r\n<script src=\"\/\/platform.instagram.com\/en_US\/embeds.js\" async=\"\" defer=\"defer\"><\/script>\r\n\r\n\"It's going to be one incredible site when it's finished,\" Assistant Principal Jerry Berkson said. \"We're so excited to see what it will be like.\"\r\n\r\nThe exterior demolition was met with excitement from First Period Physical Education students, who had the opportunity to watch for the first half of the period.\r\n\r\n\"I just thought it was a once-in-a-lifetime opportunity to see a historic building go down and how they [the construction workers] do it,\" PE teacher Peter Diepenbrock said. \"There's so much to learn and experience from it. I thought it'd be a very memorable experience for the students.\"\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AUOAI0Mfh3C0\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<em>Photos by Cooper Lou.<\/em>","excerpt":"The exterior demolition of Palo Alto High School's Big Gym, home to eight decades of athletic achievement, has begun.","date":"2015-09-02 21:27:44","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/a.jpg","categories":["News","Spotlight"],"tags":{"8520":"Berkson","11286":"big gym","12339":"demolition","44928":"diepenbrock","49949":"gym reconstruction","49952":"has come to a close.","49951":"home to eight decades of athletic achievement","8944":"palo alto high school","8953":"paly","12969":"paly gym","49950":"The Palo Alto High School Big Gym","49937":"torn down"}},{"id":106593,"title":"Season preview: Cross country aims to dominate","permalink":"http:\/\/palyvoice.com\/2015\/09\/02\/season-preview-cross-country-aims-to-dominate\/","content":"[caption id=\"attachment_106681\" align=\"alignleft\" width=\"510\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/XCWARMUP1.jpg\"><img class=\"wp-image-106681 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/XCWARMUP1.jpg\" alt=\"XCWARMUP\" width=\"510\" height=\"314\" \/><\/a> The Palo Alto High School boys' cross country team warms up during practice at the Paly track on Friday. \"The biggest obstacle the team has to overcome is the massive overabundance of boys who signed up to run this year,\" head coach Kelsey Feeley said. Photo by Cooper Lou.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nPalo Alto High School's cross country teams are looking to continue their dominance after the boys’ team attended state championships and the girls’ team placed fourth at the Central Coast Section Championships last year.\r\n\r\nThe boys’ team placed second to Bellarmine at CCS but ultimately fell short at the state championship meet in Fresno, Calif., placing last in their division.\r\n\r\nJunior Kent Slaney, who attended the state championship meet, is hoping to improve after the team’s disappointing performance.\r\n\r\n“The state championships didn’t turn out as we wanted to but we are hoping to improve on that this year and hopefully win CCS,” Slaney said.\r\n\r\nAccording to boys’ coach Kelsey Feeley, several key athletes’ graduations will pose a challenge for the team.\r\n\r\n“We will definitely miss the presence of graduated seniors Lucas Matison and Aaron Chandler,” Feeley said. “Not only were they top scorers on the team, but they also set great examples for how to run and how to find a balance between cross country and school work.”\r\n\r\nDespite these losses, Feeley believes that the team will thrive this season.\r\n\r\n“I think that the majority of my returning varsity squad are setting up to have incredibly successful seasons, both as a team but also individually,” Feeley said.\r\n\r\nAccording to Slaney and Feeley, the team prepared for the new season by attending practices over the summer.\r\n\r\n“A good number of the boys, returners and newcomers alike made an effort to come out to our summer practices, so they have a pretty good head start,” Feeley said.\r\n\r\nFeeley says some runners to look out for include Slaney, senior Sam Desre and junior Naveen Pai.\r\n\r\nThe girls’ team is also hoping to improve after its fourth place finish at CCS last year.\r\n\r\n“As a team, I know our number one goal without a doubt is to make the state meet,” senior and team captain Sarah Wang said. “We've gotten really close over the past couple of years, but I know we have the team to make it this year as long as we stay healthy and keep this goal in mind.”\r\n\r\nSenior and team captain Portia Barrientos believes that the team can reach their goal.\r\n\r\n“I’m feeling really optimistic about the season,” Barrientos said. “We have five returning seniors who are capable of contributing on the varsity level, as well as lots of talented sophomores and a freshman that look really promising.”\r\n\r\nAccording to senior Nicole Chen, to achieve the goal of reaching State Championships, the team is adopting a consistent workout schedule.\r\n\r\n“We run two to three hard workouts a week and [have] two easy days to recover,” Chen said.\r\n\r\nIn addition, the team is focusing on building up its stamina.\r\n\r\n“In terms of improvement, we're really working on building mileage right now and also building our endurance for longer meets in the future,” Wang said. “We're working hard every day and really pushing the workouts.”\r\n\r\nAccording to Barrientos, the team was fortunate to have lost only one graduating senior, Katie Foug.\r\n\r\n“We have a lot of young talent that I can see coming up to fill her spot,” Barrientos said.\r\n\r\nBoth the boys' and girls' teams will compete in their first meet at 3 p.m. Thursday at Henry M. Gunn High School.","excerpt":"Palo Alto High School's cross country teams are looking to continue their dominance after the boys’ team attended state championships and the girls’ team placed fourth at the Central Coast Section Championships last year.","date":"2015-09-02 18:55:04","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/XCWARMUP1.jpg","categories":["Sports","Spotlight"],"tags":{"8552":"California","8568":"CCS","8620":"cross country","8751":"gunn","11393":"kelsey feeley","8830":"kent slaney","49948":"long distance","40923":"meet","49946":"nicole chen","8939":"palo alto","8953":"paly","9004":"portia barrientos","9054":"running","49947":"sarah wang","9120":"sports","33010":"state championships"}},{"id":106663,"title":"Video: Big Gym demolition","permalink":"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/","content":"The Palo Alto High School Big Gym came down after exterior demolition began at 7 a.m. this morning.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/z-O3wEE3l5w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School Big Gym came down after exterior demolition began at 7 a.m. this morning.","date":"2015-09-02 13:24:20","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/CN5-KRqUEAI62wT.jpg-large.jpg","categories":["News"],"tags":{"11286":"big gym","8616":"construction","12339":"demolition","9208":"video"}},{"id":106651,"title":"Football home opener at 7:30 p.m. this Friday vs. Sequoia","permalink":"http:\/\/palyvoice.com\/2015\/09\/01\/football-home-opener-at-730-p-m-this-friday-vs-sequoia\/","content":"","excerpt":"","date":"2015-09-01 21:44:45","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":106364,"title":"Gym reconstruction to affect athletic programs","permalink":"http:\/\/palyvoice.com\/2015\/09\/01\/gym-remodel-to-affect-athletic-programs\/","content":"<iframe src=\"https:\/\/www.google.com\/maps\/d\/u\/0\/embed?mid=z3ODxXtF5xE8.kBA27mrIcM8w\" width=\"620\" height=\"480\"><\/iframe>\r\n\r\nPalo Alto High School's students, staff, coaches and parents are facing challenges brought on by recent construction projects, including the <a href=\"http:\/\/palyvoice.com\/2015\/08\/29\/the-final-farewell-big-gym-scheduled-for-demolition-on-monday\/\">Big Gym's <\/a>demolition and the pool's closure, which have caused some sports teams to relocate off-campus.\r\n\r\nBoth volleyball and water polo have been forced to move their practices off campus. Water polo is currently practicing at Rengstorff Park but will move to Gunn's pool in the coming weeks. According to volleyball head coach Jekira Wilson, the team will practice and play games in Gunn's old gym during the 2015 season.\r\n\r\nWilson said she took several days to complete the transition, ensuring that the equipment was properly labeled and ready for transportation.\r\n\r\n“The change in location has only affected me in the sense of making sure all three teams [freshman, junior varsity and varsity] are all organized and getting to Gunn on time for practices and eventually matches,” Wilson said.\r\n\r\nDue to the commute often taking upwards of 20 minutes to get to practice, Wilson's largest concern is giving players enough time to get their homework done.\r\n\r\nJunior volleyball setter Jessica Lee also agreed that having to travel across town is one of the biggest difficulties.\r\n\r\n“The location is a pain to get to every day,\" Lee said. \"You have to allow 30 minutes to get there every time.\"\r\n\r\nDespite disliking the relocation, Lee stays positive about the new gym construction.\r\n\r\n“It’s unfortunate, but it’s for the better for Paly athletics so we are paying it forward,” Lee said.\r\n\r\nAnother major concern for Wilson is getting enough Paly  fans to attend home games.\r\n\r\n“I don’t believe the move will affect the players' performance,\" Wilson said. \"I do encourage Paly student's however, to make it out to games— the girls will need the support.”\r\n\r\nPaly Volleyball is not the only fall sport being affected by the gym construction. Water polo will is also facing  the challenges of no longer having a pool on campus.\r\n\r\nMuch like Lee, junior water polo player Alex Beaudry is also being affected time wise by the move to a new location.\r\n\r\n“The change allows for no procrastination,\" Beaudry said. \"Since practice is right after school and ends at around 6 p.m., there are no big blocks for me to do homework in.\"\r\n\r\nSome winter and spring sports including basketball, wrestling and badminton. will also have to move off campus during their respective seasons.\r\n\r\nOther than changes in location, Paly sports teams are settling into their groove. \"Gunn has been very accommodating and other than the giant \"G\" on the wall and the change in paint colors, we are very much making ourselves at home,\" Wilson said.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School's students, staff, coaches and parents are facing challenges brought on by recent construction projects, including the Big Gym's renovations and the pool's closure, which have caused many sports teams to relocate off-campus.\r\n","date":"2015-09-01 11:34:16","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11911387_1807124139514151_1611859663_n1.jpg","categories":["Sports","Spotlight"],"tags":{"32738":"alex beaudry","49942":"beaudry","11286":"big gym","12358":"coach","8616":"construction","8751":"gunn","49940":"jekira wilson","8944":"palo alto high school","8953":"paly","9863":"pool","49939":"rinconada","9120":"sports","41060":"teams","38450":"update","9216":"volleyball","49938":"waterpolov","49941":"wilson"}}]