[{"id":97864,"title":"Liveblog: Basketball vs. Gunn","permalink":"http:\/\/palyvoice.com\/2015\/02\/07\/liveblog-basketball-vs-gunn\/","content":"<p><em>Check back in this Saturday beginning at 6 p.m. as Palo Alto High School's girls' and boys' basketball teams host the cross-town rival Gunn High School Titans in a double-header. Shortly following the girls' game, the boys' team will have its annual Senior Night festivities, celebrating the accomplishments of seniors Alex Dees, Corey Bicknell, Johnny Rojahn and Kevin Mullin. <\/em><\/p>\r\n<p>[liveblog]<\/p>\r\n","excerpt":"Check back in this evening beginning at 6 p.m. as Palo Alto High School's girls' and boys' basketball teams host the cross-town rival Gunn High School Titans in a double-header. The boys' team will honor its four seniors prior to tip-off. ","date":"2015-02-07 13:54:53","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg","categories":["Sports"],"tags":{"8538":"boys basketball","8735":"girls basketball","38467":"gunn vs. paly","9087":"Senior Night"}},{"id":97466,"title":"ASB &#8220;Suggestion Box&#8221; gives students opportunity to express ideas","permalink":"http:\/\/palyvoice.com\/2015\/02\/07\/asb-suggestion-box-gives-students-opportunity-to-express-ideas\/","content":"[caption id=\"attachment_97974\" align=\"alignnone\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-1271.jpg\"><img class=\"wp-image-97974\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-1271.jpg\" alt=\"photo-127\" width=\"581\" height=\"436\" \/><\/a> As of this week, students can more effectively reach out to the Associated Student Body with the new \"Suggestion Boxes\" that are placed in front of the library and the Student Activities Office. Each box was created to make it easier for students to express their opinions and ideas on what ASB is doing or should do, according to ASB President Claire Liu. \"Prioritizing student opinion and voice has been a goal of ASB's since day one,\" Liu said. Photo by Adele Bloch.[\/caption]\r\n\r\nThe Associated Student Body is extending its outreach by creating physical and online \"Suggestion Boxes\" that provide Palo Alto High School students outlets to voice their concerns and feedback to ASB this year.\r\n\r\nIn previous years, the sole Suggestion Box was placed in front of the library and received little attention from students, according to senior and ASB President Claire Liu. However, this year ASB hopes to incorporate the Suggestion Box into students' daily lives by creating an <a href=\"https:\/\/docs.google.com\/forms\/d\/1nCDga8Em38vidtBWHuvc9E1rGC3UfgYwpF71KuV17LU\/viewform\">online Suggestion Box<\/a>, which is being advertised through InFocus and social media.\r\n\r\n\"ASB is excited and totally on board [to reintroduce the box] and we're waiting to see what we get in our boxes and how we can work more effectively with the student body,\" Liu said.\r\n\r\nSenior Fabian Garduño is looking forward to the potential improvements that the Suggestion Box will bring.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692\">\r\n<div class=\"_5wd9\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #373e4d;\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0.0.0\">\r\n<div data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0.0.0.0\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805\">\r\n<div class=\"_5wd9\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805.2:0.0.0\">\r\n\r\n\"If they [ASB members] actually pay attention to it and put it into consideration ... I think it will be beneficial to the school,\" Garduño said.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Associated Student Body's extends its outreach by creating physical and online \"Suggestion Boxes\" that provide Palo Alto High School students with a new outlet to voice their concerns and feedback to ASB this year.","date":"2015-02-07 12:14:08","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-127.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","8499":"Associated Student Body","8944":"palo alto high school","38452":"suggestion box","30842":"suggestions"}},{"id":97999,"title":"Debaters to attend state qualifications tournament","permalink":"http:\/\/palyvoice.com\/2015\/02\/06\/debaters-to-attend-state-qualifications-tournament\/","content":"[caption id=\"attachment_98058\" align=\"alignnone\" width=\"348\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/CANDAAACE1.jpg\"><img class=\"wp-image-98058\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/CANDAAACE1.jpg\" alt=\"CANDAAACE\" width=\"348\" height=\"464\" \/><\/a> Sophomore Candace Wang shows off her medal won at the Coast Forensic League debate tournament. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nTwo Palo Alto High School debaters went undefeated in a debate tournament at Monta Vista High School last Saturday, guaranteeing them the opportunity to compete in California's State Qualifications tournament.\r\n\r\nSenior Noah Hashmi and sophomore Candace Wang stood victorious after winning all four rounds of debate at California's Coast Forensic League, one of two speech and debate leagues in the Bay Area.\r\n\r\nAccording to Hashmi, intensive preparation was necessary for the event.\r\n\r\n“Preparation for the tournament was intense because some of the best debate powerhouses in the Bay Area, like Bellarmine and Leland, were also at the tournament,” Hashmi said. “However, the topic was actually the same as many of the tournaments first semester … making the preparation for this specific tournament somewhat easier because I already had a good grasp on the topic.\"\r\n\r\nAccording to Paly debate coach Jennie Savage, receiving a wildcard is no easy feat.\r\n\r\n“It's exceptionally difficult to qualify to the State Championship tournament,” Savage said. “We get very few slots to even debate at the tournament to qualify — only the very best debaters are selected to attend and go head-to-head against the other best debaters.”\r\n\r\nWang is looking forward to joining junior Jenny Xin, who <a href=\"http:\/\/palyvoice.com\/2014\/11\/14\/juniors-triumph-at-debate-tournament\/\">received a wildcard<\/a> in late 2014, at State Qualifications.\r\n\r\n“I'm so excited that I get a chance to go [to State Qualifications],” Wang said. “Being able to go to State Quals is a testament to your ability, but advancing is an even greater achievement.”\r\n\r\nThe State Qualifications debate tournament will be held on March 6 and 7 at Westmont High School in Campbell.","excerpt":"Two Palo Alto High School debaters were awarded wildcards after going undefeated in a tournament at Monta Vista High School last Saturday, guaranteeing them the opportunity to compete in California's State Qualifications tournament.","date":"2015-02-06 19:12:06","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/CANDAAACE2.jpg","categories":["News","Spotlight"],"tags":{"28798":"candace wang","8638":"debate","8918":"noah hashmi","8944":"palo alto high school","8953":"paly","19261":"speech and debate","9175":"tournament","38459":"wildcard"}},{"id":97942,"title":"District calls for community effort to improve student wellness","permalink":"http:\/\/palyvoice.com\/2015\/02\/06\/district-calls-for-community-effort-to-improve-student-wellness\/","content":"Palo Alto Unified School District Superintendent Max McGee and Palo Alto High School Principal Kim Diorio sent emails to parents and students, respectively, addressing ways that the community and school plan to improve student wellness.\r\n\r\nA few hours after McGee posted his <a href=\"http:\/\/pausd.org\/community\/Superintendent\/Newsletter\/Feb2015MainMessage.shtml\" target=\"_blank\">fourth edition of his \"Max Mail\"<\/a> newsletter, Diorio emailed the student body a <a href=\"http:\/\/paly.net\/sites\/default\/files\/kd_letter_students_2015-02-05.pdf\" target=\"_blank\">revised version<\/a> of a letter from <a href=\"http:\/\/palyvoice.com\/2015\/01\/30\/administration-making-structural-changes-for-better-student-environment\/\" target=\"_blank\">last week<\/a>, which she removed from the <a href=\"paly.net\" target=\"_blank\">Paly website<\/a> after McGee suggested sending a district-wide letter instead. While worded differently to better match McGee's phrasing, Diorio's revised letter shares the same sentiments as the original, encouraging the school to implement a homework-free February break and suggesting long-term changes to Paly's homework and test policies.\r\n\r\n[caption id=\"attachment_98040\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg\"><img class=\"wp-image-98040\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg\" alt=\"The Palo Alto Unified School district and Palo Alto High School administrations are working on ways to increase support for students and their well-beings. Photo by Alex Merkle-Raymond.\" width=\"300\" height=\"225\" \/><\/a> The Palo Alto Unified School district and Palo Alto High School administrations are working on ways to increase support for students and their well-beings. Some of those methods are outlined in letters sent out yesterday to parents and students. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nWhile Diorio plans to notify parents of the new letter soon, she wants the first recipients of her email to be students in order to involve them more directly in the discussion about stress and mental health.\r\n\r\n\"Having listened to students all last week, there was a concern about feeling like, 'who's talking to the kids?'\" Diorio said. \"The adults are in this position where we're having a lot of adult conversations about suicide and stress, but who's talking to the kids, and how come they're not being included in these conversations?\"\r\n\r\nDiorio said she will discuss possible solutions to help empower students and improve the school climate with the Associated Student Body this week. Additionally, Diorio invites students to share their thoughts and suggestions using a <a href=\"https:\/\/docs.google.com\/forms\/d\/1Iwmc-hxmRcGjpHY02mszlFVPmFkyQL5ddR7Xk84r77E\/viewform\" target=\"_blank\">Google form<\/a> included in the letter.\r\n\r\nIn McGee's newsletter, the superintendent showed gratitude for students, district staff, the police, city officials and other public agents in light of a Gunn High School student's death by suicide last month. McGee also advocated for a community-wide effort to support students in all aspects of their well-being, stressing that mental health issues are not just a \"school problem.\"\r\n\r\n\"These past two weeks, people have been anxious to understand why [the suicide happened], sometimes quick to blame and generally eager to share their solutions to what they believe the students’ problems are,\" McGee said in his newsletter. \"While the reactions are understandable, it is time to come together as a collective community.\"\r\n\r\nWhile McGee acknowledges that academic stress is not the sole cause of suicide, he emphasizes that change can begin within the school system and urges parents and students to reduce competitiveness at school, underscoring the importance of learning for the sake of learning, not for grades.\r\n\r\n\"It is imperative we remember student health and connectedness do not have to come at the cost of high academic standards,\" McGee said. \"This [students'] sense of curiosity and desire to deepen and apply knowledge is consistent with our [the district's] vision and evidence that we are a community of learners who will be well-prepared for a fulfilling future. However, when students feel they should prize their grades over deeper learning, when the number of AP [Advanced Placement] and honors classes they take matters more than what they experience in these classes or when they are over-competitive with one another or obsessed with checking grades, unhealthy actions can follow. \"\r\n\r\nMcGee has also authorized a number of projects to help support students at both high schools, such as conducting a course alignment review, requiring regular meetings with school counselors and advisers and beginning \"mindfulness training,\" in addition to the changes that Diorio hopes to make at Paly.\r\n\r\nMcGee said he hopes to increase the discussion as a community about student wellness. A \"Let's Talk: A Community Conversation about Healthy Kids and Healthy Schools\" event, sponsored by the City of Palo Alto and <a href=\"http:\/\/www.psnpaloalto.com\" target=\"_blank\">Project Safety Net<\/a>, will be held at 7 p.m. on Wednesday, Feb. 25 at the Cubberley Community Center Theatre to help spark a discourse.","excerpt":"Palo Alto Unified School District Superintendent Max McGee and Palo Alto High School Principal Kim Diorio sent emails to parents and students, respectively, addressing ways that the community and school plan to improve student wellness.","date":"2015-02-06 10:15:42","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["News","Spotlight"],"tags":{"38449":"academic stress","8611":"Community","8644":"diorio","8647":"district","8834":"Kim Diorio","37742":"letter","32445":"max mcgee","37655":"mental health","8944":"palo alto high school","8977":"PAUSD","9128":"Stress","11606":"superintendent"}},{"id":97856,"title":"Girls&#8217; soccer looks to win it all","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/girls-soccer-looks-to-win-it-all\/","content":"[caption id=\"attachment_97861\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg\"><img class=\"wp-image-97861 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg\" alt=\"Senior midfielder Katie Foug carries the ball forward into the Los Gatos half. Paly beat Los Gatos 2-0. Photo by George Lu\" width=\"600\" height=\"399\" \/><\/a> Senior midfielder Katie Foug carries the ball forward into the Los Gatos half. Paly beat Los Gatos 2-0 on Jan. 24. Photo by George Lu.[\/caption]\r\n\r\nAfter defeating Santa Clara High School (8-4-4, 5-3-2), the only team to serve it a loss this season, today by a score of 9-2, the Palo Alto High School girls’ soccer team (14-1-0, 8-1-0) is tied for first in the De Anza League, leading the league in most goals scored and fewest goals allowed , according to <a href=\"http:\/\/www.maxpreps.com\/league\/gJhb-VuN5kesTljiplLOEQ\/standings-scval---de-anza.htm\" target=\"_blank\">Maxpreps<\/a>.\r\n\r\nThe team is doing historically well. On Jan. 20, Paly beat Mountain View High School (12-3-0,7-1-0) for the first time since 2007 to move back into a tie for first place in the DAL.\r\n\r\nAssistant Coach Eric Seedman said he feels the team is having a great season so far.\r\n\r\n“If we can keep it up, it could be very special indeed,” Seedman said.\r\n\r\nSeedman said he was impressed with the way the team handled its first setback of the loss to Santa Clara.\r\n\r\n“The team got right back to work and cleaned up some of the details that led up to that setback,” Seedman said. “The players are very resilient. They didn't let it get them down.”\r\n\r\nJunior forward and defender Alison Lu also noted the team’s successful season but said there are a few things the team can do to reach its ultimate goal of winning the DAL and later the Central Coast Section finals.\r\n\r\n“We've had many chances in front of the goal but haven't been able to capitalize on those opportunities,” Lu said. “We're just going to keep practicing and work on starting games off strong. We sometimes start off a bit lackadaisical and have a few moments in the beginning where we don't have full control of the ball.”\r\n\r\nPaly players currently lead the DAL in multiple categories, according to <a href=\"http:\/\/www.maxpreps.com\/league\/gJhb-VuN5kesTljiplLOEQ\/standings-scval---de-anza.htm#standings\" target=\"_blank\">Maxpreps<\/a>. Junior midfielder Jacey Pederson leads the DAL in goals with 20, while sophomore goalie Dhara Yu leads the league in fewest goals allowed per game, with an average of 0.4. The team as a whole has scored 55 goals, while only allowing seven.\r\n\r\nSeedman noted the excellence of Pederson's performance but also attributed the team’s success to a wide range of players, including Lu, senior Katie Foug and freshman Emily Tomz.\r\n\r\n“One of our best attributes is our depth,” Seedman said. “We can put any player out on the field at any juncture and have confidence that they will more than hold their own. Most coaches don't have that flexibility.”\r\n\r\nWith <a href=\"http:\/\/www.maxpreps.com\/rankings\/girls-soccer-winter\/1\/section\/ca\/central+coast+section.htm\" target=\"_blank\">Maxpreps<\/a>' standings placing the Vikings third in CCS, a playoff berth seems inevitable.\r\n\r\n“Can we do it?\" Seedman said. \"Yes. Will we do it? Time will tell. We will need to stay healthy, and keep working hard.\"\r\n\r\nThe Vikings' next game is against Mountain View at 3:30 p.m. on Feb. 10 at Mountain View.\r\n\r\n&nbsp;","excerpt":"After defeating Santa Clara High School (8-4-4, 5-3-2), the only team to serve it a loss this season, by a score of 9-2, the Palo Alto High School girls’ soccer team (14-1-0, 8-1-0) is tied for first in the De Anza League, leading the league in most goals scored and fewest goals allowed.","date":"2015-02-05 20:33:35","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg","categories":["Sports","Spotlight"],"tags":{"38451":"allison lu","8568":"CCS","10199":"eric seedman","10198":"girls soccer","25078":"jacey pederson","37715":"midseason","8944":"palo alto high school","8953":"paly","9012":"preview","10667":"santa clara","9110":"Soccer","38450":"update"}},{"id":96876,"title":"Student Film Festival to be held Friday","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/student-film-festival-to-be-held-friday\/","content":"Palo Alto High School's Student Film Festival will showcase a selection of films from the Video Production classes from 7 to 9 p.m. on Friday, Feb. 6 in the Media Arts Center. Admission is free to all attendees.\r\n\r\n[caption id=\"attachment_97819\" align=\"alignright\" width=\"290\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/paly_film_fest_logo2015.png\"><img class=\"wp-image-97819\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/paly_film_fest_logo2015.png\" alt=\"paly_film_fest_logo2015\" width=\"290\" height=\"218\" \/><\/a> The logo for Friday's Student Film Festival created by senior Griffin Bajor. Photo courtesy of Paly.net.[\/caption]\r\n\r\nStudents from the Beginning Video Production class as well as the Advanced Video Production class will have their films showcased. Graphic Design students also designed promotional posters inspired by the films, which can be viewed outside the MAC.\r\n\r\nBeginning Video Production students created films in a variety of genres from silent, to horror, to German Expressionist-influenced films, to enviro-comedies that aim for a spot in Palo Alto's Greenlight Film Festival. Advanced Video Production students created films with genres ranging from original poetry adaptations <span style=\"color: #545454;\">—<\/span> which aim for the Scholastic's Art and Writing Awards for Film contest <span style=\"color: #545454;\">—<\/span> to films inspired by their Individuals and Difference unit and an eight hour challenge examining science fiction, technology and schools.\r\n\r\nSome student works will be screened for the San Francisco International Film Festival and Cinequest, which is a \"qualifier\" film festivals for the Oscars. Three Paly student films have already been invited to screen at Cinequest for the high school student competition.\r\n\r\nAccording to Video Production and Graphic Design teacher Brett Griffith, the MAC atrium screen will be continuously showing a selection of student work throughout the night. The specific films will not be announced until after the film festival, but they will be posted to the <a href=\"http:\/\/vimeo.com\/palyvideoproductions\">Paly Video vimeo<\/a> in a few weeks time.\r\n\r\nThere will be two different types of awards handed out: the Critic's Choice Awards and the Best Overall award. The Critic's Choice awards will be handed out to four current students from the 2014-15 school year and will be recognized by <span style=\"color: #3f3b30;\">a Los Angeles and New York based group of Griffith's peers working as independent, features and commercial filmmakers or academics within higher education, according to the school's <a href=\"http:\/\/paly.net\/news\/2015-paly-student-film-festival\">website<\/a>. The new Best Overall award will be available to former Advanced students who were active mem<\/span>bers of the student film club, have had a film recognized by a major film festival, have participated in the John Lennon Educational Tour Bus or are going on the Student Television Network field trip to San Diego competing in the National Filmmakers' competition, according to Griffith.\r\n\r\n\"I am featuring this new 'Best Overall' award so that current students can be inspired by all that Paly filmmakers can do,\" Griffith said via an email to <em>The Paly Voice<\/em>.","excerpt":"Palo Alto High School's Student Film Festival will showcase a selection of films from the Video Production classes from 7 to 9 p.m. on Friday, Feb. 6 in the Media Arts Center. Admission is free too all attendees.","date":"2015-02-05 20:32:07","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/paly_film_fest_logo2015.png","categories":["News","Spotlight"],"tags":{"12716":"film festival","38425":"paly film festival","38426":"student film festival"}},{"id":96416,"title":"Opinion: Violence in Mexico and why it matters","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/opinion-violence-in-mexico-and-why-it-matters\/","content":"[caption id=\"attachment_97750\" align=\"alignnone\" width=\"661\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Ayotzinapa.jpg\"><img class=\"wp-image-97750\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Ayotzinapa.jpg\" alt=\"Photo of a man and a young boy in Ayotzinapa protests.\" width=\"661\" height=\"496\" \/><\/a> A man and a young boy stand in a crowd surrounded by protesters. The young boy's sign asks, \"And if they were your children?\" while the man's sign reads, \"Alive we want them! Now!\" Photos by Antonio Cervantes.[\/caption]\r\n\r\nWe gather at Bolivar House, home to the Center for Latin American Studies at Stanford. People are crowding doorways and streaming out the front door, sitting down on the carpet next to the podium and ducking under glaring camera lenses. There is a feeling of informality so typical of Latin America that it seems to band the whole group together under the weight and tension that accompanies the event. The event begins with a series of presentations, during which a father valiantly comes forward to share a few words with the group. We don't know the man any better than we know the rest of of the crowd, but we band together under his pain because his pain is our pain; his grief, the grief of all of Mexico.\r\n\r\nThis was a few months ago when I was attending a vigil at Stanford University at the Center for Latin American Studies to honor and inform people of the 43 missing students of Ayotzinapa, Guerrero. <a href=\"http:\/\/www.telesurtv.net\/english\/telesuragenda\/Justice-for-Ayotzinapa-20141014-0077.html\">According to South American television network teleSUR<\/a>, the students were arrested by Mexican police and then turned over to local drug gang Guerreros Unidos. When these students disappeared, a connection was drawn between the police who arrested them and the Mexican drug cartels. According to teleSUR, authorities believe that the students were killed.\r\n\r\nOccurrences similar to this massacre have become common over the last 10 years in Mexico’s drug war. However, this event has brought to light a connection between the Mexican government and drug cartels, serving as a wake-up call for not only Mexicans but also for people all over the world. Mexicans and non-Mexicans alike are saying “basta” or “no more” to the death, the corruption, the disappearances and the abuse of power the Mexican government seems to wield.\r\n\r\nThe reaction to the disappearance of these students has exploded into a movement for social change across Mexico and the world, rallied by students of all ethnic backgrounds against the corruption of the Mexican government and its increasingly translucent connection with the Mexican drug cartels. Since the disappearances of the students in Ayotzinapa, there have been hundreds of non-violent protests all over Latin America, many of them still ongoing today.\r\n\r\nMore than 100 people attended the Stanford vigil, Hispanic and non-Hispanic alike. I was glad to finally see people in my community act. Being from Mexico, the Mexican drug war has always been an issue prominent in my life, and the overwhelming support from the Bay Area community was something I had yet to experience. I felt very moved and empowered by the event.\r\n\r\nIt's disappointing how little American news channels have covered the events in Ayotzinapa. At school, I was surprised by the fact I was one of the few people who knew about the tragedy and the movement for social change. It makes sense, coming from Mexico, that I be informed on this topic; however, it doesn't meant that everyone else in Palo Alto should be oblivious to a tragedy that is happening right next door, in a country whose border we share. After asking around, I was also surprised by our community's lack of education on the Mexican drug war in general and other drug wars happening all over Latin America\r\n\r\nThirty-eight percent of California's population is Latino, and towns in the Bay Area such as Redwood City and East Palo Alto have huge Latino communities. Yet, there is a profound disconnect between the United States and Mexico. Violence in Mexico is not really highlighted by the media, and as a result, the few times that these issues are discussed, it is often in blind ignorance. Perhaps this is caused by the distraction of events in the Middle East. Perhaps people believe it does not affect them, or perhaps the fact that violence is happening a road trip away makes them feel uncomfortable and vulnerable.\r\n\r\nRegardless of the reason, violence in Mexico is not often covered by American media. Real violence by real people in a very real proximity to the United States is often left ignored, and what doesn't appear on the screens or in the papers ceases to exist in the minds of the American people.\r\n\r\nThis has to change because these events affect more than just the families of the those 43 missing Ayotzinapa students. They affect your gardener, the guy who bags your groceries at Safeway, your doctor, that student who sits next to you in class, your nanny.\r\n\r\nWe should address these issues not as far off problems, but as issues deserving of our attention that affect us in in California, right here and right now, even if they're not highlighted by the media. We should give our Mexican neighbors the global support they deserve.","excerpt":"Staff writer Emilia Diaz-Magaloni shares her opinion on the absence of coverage on Mexican violence and protests in American media. ","date":"2015-02-05 19:50:58","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Ayotzinapa.jpg","categories":["Opinion","Spotlight"],"tags":{"38454":"ayotzinapa","38457":"guerrero","38458":"latin america","30011":"media","38453":"mexico","38455":"protests","37654":"support","38456":"violence"}},{"id":97583,"title":"Android Club to host local startup","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/android-club-to-host-local-startup\/","content":"[caption id=\"attachment_97852\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965364_10206469737366577_50733423_n1.jpg\"><img class=\"size-full wp-image-97852\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965364_10206469737366577_50733423_n1.jpg\" alt=\"Android Club President Charles Yu and Ios Development Club President Brian Tracy pose during club day. Photo by Josh Yuen.\" width=\"600\" height=\"450\" \/><\/a> Club presidents Charles Yu (Android Club President) and Brian Tracy (iOS Development Club President) pose during club day during the first club day of the 2014-15 school year. Photo by Josh Yuen.[\/caption]\r\n\r\nThe Android Development Club will hold a meeting with Cyanogen Inc. at 2:30 p.m. Tuesday in the Palo Alto High School Media Arts Center.\r\n\r\nCyanogen is a local startup and strives to increase performance, customization and security on Android-based devices , according to the company's official <a href=\"https:\/\/cyngn.com\/\">website<\/a>.\r\n\r\nAndroid Club secretary Charlie Mihran is interested in gaining a glimpse into Cyanogen's everyday work experience.\r\n\r\n\"I'm most excited about getting to hear from experienced professionals in tech fields,\" Mihran said. \"I would love to work at a place like Cyanogen, so getting a sneak peak into how they work is pretty awesome.\"\r\n\r\nThe club's treasurer, Alex Rose, is excited for the event and is also interested in learning how the small startup became successful.\r\n\r\n\"To meet a company that started right here in Palo Alto that also works on products that are going to be seen on the new tech coming out in the next few years is really exciting,\" Rose said. \"It will be really interesting to hear about the process of building the product and how they got it from their office to hundreds of thousands of phones worldwide.\"\r\n\r\nThe meeting will also boost the club's reputation, which will make it easier to plan future events with similar technology companies, according to Rose.","excerpt":"The Android Development Club will hold a meeting with the firmware producer Cyanogen Inc. at 2:30 p.m. Tuesday in the Palo Alto High School Media Arts Center. ","date":"2015-02-05 16:20:11","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965364_10206469737366577_50733423_n.jpg","categories":["News"],"tags":{"38414":"adc","15665":"alex rose","8476":"android","11980":"Android Development club","11982":"Charlie Mihran","38415":"cyanogen","38416":"startup","38417":"tech","38418":"tech company"}},{"id":97776,"title":"Girls&#8217; wrestling to compete at Championship Cup Series","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/ccs-preview-girls-wrestling\/","content":"[caption id=\"attachment_97891\" align=\"alignright\" width=\"237\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965661_402527606579242_1616725435_n.jpg\"><img class=\"wp-image-97891\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965661_402527606579242_1616725435_n.jpg\" alt=\"Palo Alto high school  wrestling sign. Photo taken by Aisha Chabane \" width=\"237\" height=\"324\" \/><\/a> Palo Alto high school wrestling sign. Photo taken by Aisha Chabane[\/caption]\r\n\r\nThe Palo Alto High School girls' wrestling team will compete at the Championship Cup Series at 4 p.m. this Friday and Saturday at Oak Grove High School.\r\n\r\nThe top three placers in CCS go to the state meet.\r\n\r\nSophomore Sara Aguilar and senior Alexa Austin will participate in the tournament. Last year, Aguilar ranked fourth and Austin ranked third.\r\n\r\nThe team has been doing well this season with Austin placing second and Aguilar third at the last meet.\r\n\r\n“I believe we're ready for the championship and the only thing to do now is just visualize and while in the moment take it one match at a time,\" Aguilar said.\r\n\r\nGeneral admission for students is $4 and $8 for adults, and free for children 5 years old and under.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' wrestling team will compete at the Championship Cup Series at 4 p.m. this Friday and Saturday at Oak Grove High School.","date":"2015-02-05 15:24:00","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965661_402527606579242_1616725435_n.jpg","categories":["Sports"],"tags":{"38439":"alexa austin","8568":"CCS","8734":"girls","38440":"Sara Aguilar","9241":"wrestling"}},{"id":97789,"title":"Liveblog: Girls&#8217; soccer plays Santa Clara","permalink":"http:\/\/palyvoice.com\/2015\/02\/04\/liveblog-girls-soccer-plays-santa-clara\/","content":"[caption id=\"attachment_80611\" align=\"alignnone\" width=\"606\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5098.jpg\"><img class=\"wp-image-80611 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5098.jpg\" alt=\"Junior midfielder Jacey Pederson dribbles past a defender. Pederson made two goals. Photo by Maddy Jones.\" width=\"606\" height=\"404\" \/><\/a> Junior midfielder Jacey Pederson dribbles past a defender. Pederson made two goals. Palo Alto High School beat Gunn High School 6-0. Photo by Maddy Jones.[\/caption]\r\n\r\n<i>Palo Alto High School girls' soccer (13-1, 7-1) takes on Santa Clara High School (8-3-4, 5-2-2), the only team the Vikings have fallen to. Check back at 3:30 p.m. for live coverage of the game. <\/i>\r\n\r\n[liveblog]","excerpt":"Palo Alto High School girls' soccer (13-1, 7-1) takes on Santa Clara High School (8-3-4, 5-2-2), the only team the Vikings have fallen to. Check back at 3:30 p.m. for live coverage of the game. ","date":"2015-02-04 23:34:48","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5098.jpg","categories":["Uncategorized"],"tags":{"10198":"girls soccer","8855":"liveblog","38424":"lose","10667":"santa clara","38315":"undefeated","10981":"win"}}]