[{"id":105550,"title":"Badminton places at CCS","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/badminton-places-at-ccs\/","content":"[caption id=\"attachment_105621\" align=\"alignnone\" width=\"593\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-04-at-10.46.52-AM.png\"><img class=\" wp-image-105621\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-04-at-10.46.52-AM.png\" alt=\"Juniors Eric Chiang and James Wang play against Evergreen Valley High School’s Mason Jiang and Eric Jiang in boys' doubles. They later on placed second overall at Central Coast Selection. \" width=\"593\" height=\"394\" \/><\/a> Juniors Eric Chiang and James Wang play against Evergreen Valley High School’s Mason Jiang and Eric Jiang in boys' doubles. Chiang and Wang placed second overall at the Central Coast Section tournament. Photo by Chris Do.[\/caption]\r\n\r\nFour members of the Palo Alto High School badminton team are celebrating their successes after an impressive performance at the Central Coast Section playoffs.\r\n\r\nJuniors Eric Chiang and James Wang placed second in boys’ doubles while senior Promise Lee and freshman Jackie Cai took fifth in girls’ doubles.\r\n\r\nIn girls’ doubles, Lee and Cai won their first two matches, but fell short to Silver Creek High School’s Yui Tantiyavarong and Huyen Duong 21-10, 10-21, 22-20 in the third match.\r\n\r\nIn boys’ doubles, Wang and Chiang made it to the final round; however, they fell short to Evergreen Valley High School’s Mason Jiang and Eric Jiang 21-17, 21-11.\r\n\r\n“We were mildly disappointed when we lost our finals game,” Wang said. “Although we came in thinking we had a chance of winning, our opponents were national players and were realistically a lot better than us.”\r\n\r\nWang believed that the Vikings would do well going into CCS.\r\n\r\n“We had a pretty good season, so we were confident that we would place in the top three for doubles in CCS,” Wang said.\r\n\r\nWang attributes the wins to their positive mentality.\r\n\r\n“We [Eric and I] are both cool-headed people who can talk strategy if we're struggling in a game,” Wang said. “Although we can get physically overwhelmed by our opponents, especially since I haven't completely recovered from surgery, we never get mentally overwhelmed.”\r\n\r\n&nbsp;","excerpt":"Four members of the Palo Alto High School badminton team are celebrating their successes after an impressive performance at Central Coast Section playoffs.","date":"2015-06-04 17:31:17","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-04-at-10.46.52-AM.png","categories":["Sports","Uncategorized"],"tags":{"15905":"badminton","44915":"eric chiang","44916":"jackie cai","44917":"james wang","8953":"paly","44918":"promise lee"}},{"id":105618,"title":"Paly students win international math contest","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/paly-students-win-international-math-contest\/","content":"[caption id=\"attachment_105637\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo.jpg\"><img class=\" wp-image-105637\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo.jpg\" alt=\"Juniors Eric Foster, Andrew Lee, mathematics instructional supervisor Radu Toma, Kathryn Li and Allison Zhang (left to right) pose for a picture after winning the international Mathematical Modeling Challenge contest. The team and Mr. Toma are invited to Hong Kong in July to attend the awards ceremony. Photo by Daniel Li.\" width=\"603\" height=\"453\" \/><\/a> Juniors Eric Foster, Andrew Lee, team advisor Radu Toma, Kathryn Li and Allison Zhang (left to right) pose for a picture. They won the International Mathematical Modeling Challenge contest on Monday, and the team and Toma are invited to Hong Kong in July to attend the awards ceremony. Photo by Daniel Li.[\/caption]\r\n\r\nA team of four juniors in Advanced Placement BC Calculus are invited to Hong Kong in July for their success in the International Mathematical Modeling Challenge on Monday.\r\n\r\nJuniors Allison Zhang, Eric Foster, Kathryn Li and Andrew Lee won the international competition on behalf of Palo Alto High School and the United States. Teams were required to solve a real world problem relating to the field of mathematics. The contest was held during mid-March and ended early-May, and during that time, teams chose five consecutive days to work and collaborate on the assigned problem.\r\n\r\nThis year, teams were asked to design a model for effective filming and production of a motion picture.\r\n\r\n“We modeled movie scheduling, taking into account variables such as actor availability, prop\/set construction time and traveling costs,” Zhang said.\r\n\r\nIn an email to the Palo Alto High School faculty, Toma praised the team for its achievement.\r\n\r\n\"This is the highest award Paly students have ever earned in mathematics,\" Toma said. \"I am absolutely blown away by their accomplishment and humbled both to have had them as students. This award is a tribute both to these students' exceptional talent, work ethic, determination and love of mathematics, and to all their past mathematics teachers who have taught, inspired and mentored these kids over the years.\"\r\n\r\nAccording to Zhang, the team is very excited to hear that they won the international competition on behalf of the United States and Palo Alto High School.\r\n\r\nMembers of the team were shocked when they found out they had won, according to Lee.\r\n\r\n“Honestly, it was a bit of a surprise,” Lee said. “We actually were not 100 percent confident in our paper when we submitted it. Even in the last couple hours, we were rushing to proof-read and complete it.”\r\n\r\nBecause of their accomplishments, the team and Toma are invited to Hong Kong in July to receive an award. In addition, three other high schools from Beijing, Singapore and Shanghai are also invited to this ceremony.\r\n\r\n“The other three team members and I cannot wait to travel to Hong Kong for the awards ceremony,\" Zhang said. \"This contest is especially significant to us because it encourages high school students to solve relevant real world problems through applied mathematics.\r\n\r\n&nbsp;","excerpt":"A team of four juniors in Advanced Placement BC Calculus are invited to Hong Kong in July for their success in the International Mathematical Modeling Challenge contest on Monday. ","date":"2015-06-04 17:30:59","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo.jpg","categories":["Spotlight"],"tags":{"42265":"allison zhang","39379":"andrew lee","42266":"eric foster","42267":"kathryn li","10661":"radu toma"}},{"id":105613,"title":"The speeches that didn’t make it, Class of 2015: Part I","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-i\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech <\/strong>by Jack Brook\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Good evening everyone, I’m honored to be standing up here <span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1182038502\"><span class=\"aQJ\">tonight<\/span><\/span>. Although we’re all still very young, I do feel like there is one very important lesson I’ve learned so far that is worth sharing.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">What I’ve learned is that we need to confront and prepare for the fact that over the course of the next four years (and the rest of our lives) there are going to be people who are critical of us and the things we do. I know that many of us, including myself, have received a lot of support and praise but in college and in the real world, our parents aren’t always going to be there to pat us on the back and say “Great job honey.”<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Now I learned this lesson the hard way one summer at a filmmaking camp.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I came in to the camp intending to learn how to make emotional films and develop as an artist but was told that instead of art, what I had been making before was merely “entertainment.” (A little bit of context: The movie that got me into this camp was about a talking cat; that’s the type of filmmaker I was).<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Here’s the problem though: I really liked making movies about things like talking cats and before this camp other people had also really liked them. But my film camp teachers were not amused by talking cats.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">And the moment I realized that they didn’t like what I did, I tried super hard to win their approval. I watched my peers soar to new creative heights as I stood by helpless, weighted down by doubt and insecurity. I’m not going to lie, the films I did make at the camp were pretty darn bad. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">In four weeks, I went from making quirky comedies to instead attempting to create interpretive filmography about haikus.  <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I languished miserably and it was an absolutely devastating experience. I didn’t make another film for five months afterwards. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I’ll pause my story for just a minute. From my understanding of things, nearly everyone who eventually does something they’re really truly proud of seems to have this moment of crisis. A time where you doubt yourself; where you look around and see other people doing things better than you; where you question whether or not you’re good enough; whether you are worthy.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I mean, look at Elvis: The first time he performed, he was told he would be better off going back to being a truck driver than a singer. Or J.K. Rowling. She was rejected 12 times before someone agreed to publish Harry Potter. And of course there is Walt Disney, who was fired from his first job because he “lacked imagination and had no good ideas.” The list of successful people who were originally told that what they were doing wasn’t good literally goes on forever.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Anyway, as I was saying, I left pretty devastated from that summer camp. I thought about it for a long time and one day I realized that during the camp all those films that I made were simply constructions of what I thought other people, my teachers, wanted to see. I never made anything that I was passionate about. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">The difference between Elvis and me is that Elvis stuck with his vision and didn’t change it when somebody suggested otherwise. I tailored my vision to what I thought someone else wanted.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">When I finally realized this, it was like a eureka moment. The best way to recover from my months of misery, I figured, was to simply cast it all away and go back to working on things I was passionate about. So then I thought, what is it deep down in my heart of hearts that I want to make? And then it came to me: I’m going to make a movie about a competitive eating prodigy. A young boy striving to become a hot dog eating champion. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Let me tell you something: The most fun I have ever had in my life was making this movie. Dozens and dozens of hot dogs were consumed, pies were swallowed and asparagus was slurped. I was also humbled by the fact that many of my friends and their parents were willing to step in and help me out. After weeks of shooting, I had my movie. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">And you know what the best part was? I was making that movie for nobody but myself.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Needless to say, I regained my love of making movies and became a much better filmmaker in the process. Now I know all of us have different interests, whether in theater or STEM or writing or athletics or robotics or something else entirely, but I think we all need to remember that when we’re doing something we love, that we feel passionate about, we can’t look to other people for validation. Instead, we need to look inwards and think: Is what I’m doing going to make me happy? Is it something that I’m doing for me, and not for someone else? <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Don’t try to be somebody that you’re not. Don’t quit at what you like to do. It’s up to you to decide whether or not what you’re doing, or what you want to do, is worthy. And if you haven’t found your passion yet, dare to explore and don’t turn back if someone sneers or makes fun of you. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Even if you want to make videos about talking cats and hot dog eating prodigies.<\/span><\/p>","excerpt":"The Paly Voice acquired senior Jack Brook's speech that did not get chosen for Graduation, with his consent to publish.","date":"2015-06-04 12:07:49","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105615,"title":"The speeches that didn&#8217;t make it, Class of 2015: Part II","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-ii\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation but were not selected by a panel of faculty members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech <\/strong>by Oliver Rowles\r\n\r\nGood afternoon everyone, teachers, families, and classmates. I arrived in Palo Alto less than two years ago, moving from New York City, and the place itself has already impacted me way more than I could have ever imagined. I had never had an Asian friend before.(pause) and now some are my best friends. I was welcomed very warmly into the Paly community only a few weeks into school, when half of the Junior and Senior grades came over to my house while my parents were out of town... Sorry Dad. But it was well worth it as I met the people who would become my best friends for the remainder of high school. Paly has recently received a ton of criticism and bad press after the tragedies that occurred over the past year, but we cannot forget what a great place this actually is. Over these past two years I’ve definitely learned a thing or two to take with me after I graduate.\r\n\r\nFirst of all, these 4 years of high school are not going to be the best 4 years of your life, I don’t even wish that upon my worst enemy. If getting on the wheel in Ceramics class is part of the best 4 years of your life there is something seriously wrong. That being said High School is a very unique time, and nothing will ever be like it. As you get older, you mature. You begin to feel less infallible, your desire to be independent is tempered by the reality of actually being independent and all the responsibility that comes with it. You will never have the mindset you had in High School again. I remember telling my parents that when I turned 18 that I would never listen to them again. I am 18 now and have been for nearly 6 months and I cannot even come close to imagining not having them in my life. Everyone going to college next year will come to that realization when you’re actually going to have to wash your own clothes and change your bed sheets more than once a semester. Paly has helped me become the independent person I am today and one that will surely survive without his parents perched on his shoulder for the rest of time.\r\n\r\nI’m sure every student here has a teacher that pushed him or her to succeed and do their best throughout these 4 years. Personally, I don’t think I can single out just one and that’s something that’s extraordinary about this school. Everyone wants you to do well and get to the next level, and that isn’t just teachers, students want to help you too. We have a great community here and I’m going to miss it dearly next year.\r\n\r\nSince my early days at Paly I’ve had the same group of friends by my side, and that is something I wouldn't trade for the world. Even though we fight and argue sometimes, mostly about whether to go to Driftwood or Chipotle during lunch, I couldn’t imagine finishing my high school career with any other guys. When my parents decided to move out west from New York I was devastated. Leaving a place where I have lived for sixteen and a half years just suddenly. I vividly remember bawling my eyes out in front of my mom the night before our flight out as I was convinced that nowhere besides New York would ever be home. But I am more than glad to say I was mistaken, and Palo Alto has definitely become a home to me.\r\n\r\nI wanted to thank my mom, dad, and most of all my brother Will for helping me get to where I am today. My brother has taught me so much and has been my role model throughout my entire life. Even though you thought I was the golden child and that mom and dad liked me more than you, I have always been jealous of how much smarter and talented you are than me at pretty much everything, except for Madden, I could still whoop you any day. I also wanted to thank all my classmates and teachers for an amazing two years here and wish you all the best in the future. ROLL TIDE","excerpt":"The Paly Voice acquired senior Oliver Rowles' speech that did not get chosen for Graduation, with his consent to publish.","date":"2015-06-04 12:07:34","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105611,"title":"The speeches that didn&#8217;t make it, Class of 2015","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015\/","content":"[caption id=\"attachment_105631\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo-2.jpg\"><img class=\"wp-image-105631\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo-2.jpg\" alt=\"photo-2\" width=\"613\" height=\"460\" \/><\/a> The graduating class of 2015 toss their caps into the air with the conclusion of their graduation ceremony yesterday afternoon. Photo by Jeanette Wong.[\/caption]\r\n\r\n<em>The Paly Voice<\/em> acquired the following speeches from their authors, with the authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation but were not selected by a panel of faculty members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice<\/em>, nor those of its staff.\r\n<p style=\"color: #000000;\"><a href=\"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-i\/\">Jack Brook<\/a><\/p>\r\n<p style=\"color: #000000;\"><a href=\"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-ii\/\">Oliver Rowles<\/a><\/p>","excerpt":"The Paly Voice acquired the speeches that were not chosen to be delivered at Graduation from their authors, with the authors’ consent to publish.","date":"2015-06-04 12:07:13","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo-2.jpg","categories":["Features","Spotlight"],"tags":[]},{"id":105578,"title":"Student pulls fire alarm, disrupts finals","permalink":"http:\/\/palyvoice.com\/2015\/06\/03\/student-pulls-fire-alarm-disrupts-finals\/","content":"[caption width=\"491\" id=\"attachment_105601\" align=\"aligncenter\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11419826_946584855406185_581421127_n.jpg\"><img class=\"wp-image-105601\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11419826_946584855406185_581421127_n.jpg\" alt=\"\" width=\"491\" height=\"369\"><\/a> Students gather on the field after a student pulled the fire alarm following&nbsp;brunch. Photo by Emily Hwang.[\/caption]A Palo Alto High School student pulled the fire alarm at the end of brunch today, causing a delayed start for 4th Period final exams, according to Assistant Principal Jerry Berkson.\n\nThe students were dismissed from the football field about 10 minutes after the alarm was pulled. In an email to the Paly staff, parents and students, Principal Kim Diorio announced that the school day would be extended 15 minutes to give students the allotted two hour time slot for their final exams.\n\nAccording to Berkson, the alarm originated in the Student Center. The fire alarm control panel can detect where the alarm was triggered and if smoke or a manual trigger set off the alarm. Additionally, the Palo Alto Fire Department is automatically notified when the fire alarm goes off.\n\n\"As soon as I saw that it was pulled, I called them [PAFD] to say that it was a non-emergency,\" Berkson said. \"But they still have to reset everything. We can't just reset it.\"\n\n<span style=\"color: #000000;\">The <a href=\"http:\/\/palyvoice.com\/2014\/12\/04\/can-you-take-the-heat-think-twice-before-pulling-that-fire-alarm\/\">consequences of pulling a fire alarm<\/a> in&nbsp;the absence of a fire can be serious. If caught, there may be a suspension from the school or a citation by the police, Berkson said. According to Berkson,&nbsp;this incident misdirected his time and energy away from managing&nbsp;end-of-year activities such as graduation.<\/span>\n\nFreshman Preston Sterling says he thinks&nbsp;that the person who pulled the alarm did not want to take&nbsp;his or her 4th Period final exam.\n\n\"[I think] the purpose [of pulling the alarm] was to skip the final, but it kind of backfired,\" Sterling said.","excerpt":"A Palo Alto High School student pulled the fire alarm at the end of brunch today, causing a delayed start for 4th Period finals, according to Assistant Principal Jerry Berkson.","date":"2015-06-03 14:55:20","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/IMG_24251.jpg","categories":["News","Spotlight"],"tags":{"44972":"false alarm","10172":"finals","34357":"finals week","10447":"fire alarm","9954":"jerry berkson","8834":"Kim Diorio"}},{"id":105539,"title":"Tuesday Tunes: Luke Schroder","permalink":"http:\/\/palyvoice.com\/2015\/06\/02\/tuesday-tunes-luke-schroder\/","content":"[caption id=\"attachment_105563\" align=\"alignnone\" width=\"293\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11301425_1104632169553579_1411264500_n.jpg\"><img class=\" wp-image-105563\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11301425_1104632169553579_1411264500_n.jpg\" alt=\"Senior Luke Schroder shares with The Paly Voice his top songs. \" width=\"293\" height=\"440\" \/><\/a> Senior Luke Schroder shares with The Paly Voice his top songs. Photo by George Lu.[\/caption]\r\n\r\n<span style=\"color: #000000;\">For the final 2014-15 installment of Tuesday Tunes, The Paly Voice sat down with senior Luke Schroder and asked him to compile a list of some of his favorite songs.<\/span>\r\n\r\nSchroder is an active disc jockey  in the Palo Alto area, performing at local events and posting monthly mixes through <a href=\"https:\/\/www.mixcloud.com\/luke-schroder\/\">Mixcloud<\/a>.\r\n\r\n\"I just do it [DJ] for fun,\" Schroder said. \" I've always liked working with music, and it's always fun to either make my own music or mix multiple songs together and just make a playlist that seamlessly goes together.\"\r\n\r\nHis interested in music began in 4th grade, which later developed into a passion for electric music in 6th grade.\r\n\r\n\"Whatever I'm doing, it has music playing in the background,\" Schroder said. \"It just enhances everything.\"\r\n\r\nAlthough Schroder is graduating this year and going to University of Colorado Boulder, he plans to bring some musical equipment to college.\r\n\r\n\"I want to bring some of my DJing equipment to college so I can continue mixing, but not that time consuming ... just kind of on the side for fun.\"\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Aclairekrugler%3Aplaylist%3A4QwvhBDsCJYr4P4BZJvbfL\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"For the final 2014-15 installment of Tuesday Tunes, The Paly Voice sat down with senior Luke Schroder and asked him to compile a list of some of his favorite songs.","date":"2015-06-02 17:14:58","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11301425_1104632169553579_1411264500_n1.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":{"44966":"DJ","44965":"Luke Schroder","44969":"mixing","8906":"music","8953":"paly","42390":"spotify","42416":"Tuesday Tunes","44967":"tuesdayt","44968":"unes"}},{"id":105267,"title":"Timeline: May 2015 News in Review","permalink":"http:\/\/palyvoice.com\/2015\/06\/01\/timeline-may-2015-news-in-review\/","content":"<em>This is the fifth installment of the News in Review series, which summarizes the most important news stories and events from the month of May in a timeline format. <\/em>\r\n\r\n<iframe src=\"\/\/cdn.knightlab.com\/libs\/timeline\/latest\/embed\/index.html?source=0AmmgLOliFmExdE05RzBMRUJZVUJCZl8zRDItbEc4Umc#gid&amp;font=Bevan-PotanoSans&amp;maptype=toner&amp;lang=en&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This is the fifth installment of the News in Review series, which summarizes the most important news stories and events from the month of May in a timeline format.","date":"2015-06-01 14:21:07","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-7.39.26-PM.png","categories":["Multimedia","Spotlight"],"tags":{"19460":"2015","11628":"ap bio","12357":"athletic director","44632":"best of the best","43482":"bowers","44928":"diepenbrock","44930":"dismissed","8704":"field day","44932":"gunn bell schedule","42205":"hogwarts week","43329":"may","43592":"may fete parade","42896":"measure A","8916":"news","38267":"news in review","17489":"one acts","8944":"palo alto high school","8953":"paly","44931":"senior cut day","9121":"Spring Sports","44929":"staff positions","41536":"the paly voice","9792":"viking","9214":"voice"}},{"id":105055,"title":"Seniors launch gaming community","permalink":"http:\/\/palyvoice.com\/2015\/06\/01\/seniors-launch-gaming-community\/","content":"Two Palo Alto High School seniors are actively publicizing their new gaming-community website \"<a href=\"http:\/\/playongaming.com\">Play On<\/a>,\" designed for students who are interested in relaxing by playing video games.\r\n\r\n[caption id=\"attachment_105322\" align=\"alignright\" width=\"271\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-11.10.35-AM.png\"><img class=\"wp-image-105322 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-11.10.35-AM.png\" alt=\"Screen Shot 2015-05-28 at 11.10.35 AM\" width=\"271\" height=\"107\" \/><\/a> Two Paly seniors Griffin Bajor and Jake Gurle co-founded \"Play On,\" a gaming community targeted towards students who are looking to relax by playing video games.[\/caption]\r\n\r\nGriffin Bajor and Jake Gurle co-founded \"Play On\" for Palo Alto Unified School District students with all levels of expertise in the gaming world.\r\n\r\n\"You might already play games, you might not,\" Bajor said. \"If you don't, you can discover the great games out there to play on your Windows or Mac computer. If you do already play games, add your favorite games to the service to find new people to play with.\"\r\n\r\nUsers are encouraged to purchase the easily accessible \"Disco Dodgeball,\" \"Garry's Mod,\" \"Risk of Rain\" and \"Hammerwatch\" to have gaming compatibility with other users. With the donation from an Indie Developer 82apps, free copies of \"Robot Roller-Derby Disco Dodgeball\" are available for the first few people who sign up, according to Bajor.\r\n\r\n\"Play On\" is distinct from other gaming websites because it urges high schoolers to expand from their typical friend groups to play games with unfamiliar faces on larger servers in smaller, more intimate, matches, its creators say. Bajor and Griffin say they also plan to schedule community events for larger groups to join.\r\n\r\n\"My primary goal for 'Play On' is to make students feel welcome to a great community,\" Bajor said. \"It's just ... a place for anyone to have fun.\"\r\n\r\nA series of suicides motivated Bajor to create something beneficial for his community.\r\n\r\n\"I thought about my past experiences forming small gaming communities for my friends,\" Bajor said. \"I realized that I could take something I could love doing and bring it to the audience of all PAUSD students.\"\r\n\r\nTogether, Bajor and Gurle coded a website accessible for all students.\r\n\r\n\"When you join, you'll be a part of a community of fellow students, all looking to have fun,\" Bajor said. \"It's to take a break from the stresses of school, or to just have something fun to do.\"","excerpt":"Two Palo Alto High School seniors are actively publicizing their new gaming website \"Play On,\" designed for students who are interested in relaxing by playing video games.","date":"2015-06-01 14:11:33","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-11.10.35-AM.png","categories":["Features"],"tags":{"44905":"cofounded","8611":"Community","15410":"game","32466":"gaming","25086":"griffin bajor","44904":"jake gurle","8939":"palo alto","8977":"PAUSD","44906":"play on"}},{"id":103915,"title":"Athlete of the Year: Sophie Frick","permalink":"http:\/\/palyvoice.com\/2015\/05\/30\/athlete-of-the-year-sophie-frick\/","content":"On a cool and windy Friday afternoon in the middle of softball season, the Palo Alto High School softball team hosted the Santa Clara Bruins at their home field. It was a typical regular season league game, and the Vikings uneventfully fell short by a score of 6-1. It was during the last inning when the Vikings, having been out-dueled all game offensively by the pitching of Bruins phenom Kathryn Caravalho, finally showed signs of life for the first time. \r\n\r\nFreshman first baseman Sophie Frick worked the count full against Caravalho, who prior to the at-bat had only allowed two hits in the game. Even though her team trailed by six runs, Frick continued to persist by fouling off multiple pitches. On the eighth pitch of the at-bat, she ripped a double down the left-field line, knocking in the first run of the game for the Vikings, her teammates and coaches applauding. She's been doing that kind of thing all season. \r\n\r\nPlaying on a team with 10 upperclassmen, it would be natural to assume that Frick wouldn't receive the starting job at first base and a spot in the middle of the order. But after an impressive performance early in the season, her manager Bill Laskey did just that. \r\n\r\nAs it turns out, Frick isn't just good at softball. In the fall, she helped lead the girls' water polo team's push into the CCS playoffs. Later, she became a part of Coach Scott Peters' eight-player rotation, playing key minutes throughout a championship season for girls' basketball. She also finished in the top three on the softball team in hits (18), runs batted in (14), and batting average (.316), according to MaxPreps.com. \r\n\r\n[caption id=\"attachment_104992\" align=\"alignnone\" width=\"590\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11303970_1602089120038641_1694026943_o.jpg\"><img class=\" wp-image-104992\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11303970_1602089120038641_1694026943_o.jpg\" alt=\"Freshman Sophie Frick looks to pass to a nearby teammate in a home water polo game against Mountain View. Frick began the season on JV and eventually moved up to varsity. Photo by Howard Look. \" width=\"590\" height=\"393\" \/><\/a> Freshman Sophie Frick looks to pass to a nearby teammate in a home water polo game against Mountain View. Frick began the season on JV and eventually moved up to varsity. Photo by Howard Look.[\/caption]\r\n\r\nAfter a class online vote that featured eight Paly athletes, Frick's accomplishments this year were enough to earn recognition as the Paly Voice's Athlete of the Year.\r\n\r\nFor many young athletes around the world, the title \"student-athlete\" applies for one particular sport. Maybe two. Playing three sports year-round in high school is a feat that requires not just athleticism, but patience, determination, and a consistently assiduous attitude. What about three sports, all at the varsity level, as a <em>freshman<\/em> in high school? Is that even sustainable? \r\n\r\nFor Frick, it's more than just possible. It's a lifestyle. Palo Alto High School's next super-athlete is loving every moment of Paly sports. \r\n\r\n\"I don't know if I could just pick a favorite [sport],\" Frick said in a recent interview. \"My favorite is the one that I'm playing at the time during the season.\"\r\n\r\n[caption id=\"attachment_105043\" align=\"alignleft\" width=\"335\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11304157_1602089183371968_1945597461_n.jpg\"><img class=\"wp-image-105043\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11304157_1602089183371968_1945597461_n.jpg\" alt=\"Frick participates in a summer softball tournament during 2013. Two years later, Frick is a big presence in the middle of the Paly softball team's lineup. Photo by Jeff Frick. \" width=\"335\" height=\"224\" \/><\/a> Frick participates in a summer middle school softball tournament in 2013. Two years later, Frick is a big presence in the Paly softball team's lineup. Photo by Jeff Frick.[\/caption]\r\n\r\nThe time management required to juggle high school academics and overlapping sports games and practices has always been a part of Frick's teenage lifestyle.\r\n\r\n\"I've been used to the timing [of playing multiple sports],\" Frick said. \"I did the same thing in middle school where I was playing a sport throughout every season, so I'm definitely used to the time management and doing homework when I have free time especially. It hasn't been that hard this year, and it definitely helps with managing my time.\"\r\n\r\nFrick began playing sports at an early age, beginning with basketball, and baseball as well, during kindergarten. According to Frick, she played little league baseball until fifth grade before switching over to softball in sixth grade, the year that she was introduced to water polo. Both of her older siblings, Andrew, a current freshman at Claremont McKenna College, and Maddie, a sophomore at Paly, have experience playing sports in high school. \r\n\r\n[caption id=\"attachment_105027\" align=\"alignright\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11267042_10153408011083413_2787173618381490382_o.jpg\"><img class=\"wp-image-105027\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11267042_10153408011083413_2787173618381490382_o.jpg\" alt=\"Frick began her playing career at a young age, participating in little league baseball in kindergarten before transferring to softball in sixth grade. Photo by Jeff Frick. \" width=\"393\" height=\"262\" \/><\/a> Frick began her playing career at a young age, participating in little league baseball in kindergarten before transferring to softball in sixth grade. Photo by Jeff Frick.[\/caption]\r\n\r\n\"They are both as athletic as I am, if not more,\" Frick said humbly. \"Watching them grow up really pushed me to thrive in sports. I also love the feeling of winning and making a team. I think it's really cool how teammates form and how close a team comes together.\"\r\n\r\nThroughout the year, Frick acted in a very mature manner for a freshman. Despite a minimal amount of playing time in certain sports, she maintained a positive attitude and focused more on team success, not just her own.\r\n\r\n\"The hardest part of this year was probably during basketball season when I did not play very often for stretches,\" Frick said. \"I got a good amount of minutes during the regular season primarily, which I was very happy about. It was during practice when I would just try to continue to be a team player and not get down on myself or others as well.\"\r\n\r\nMany of Frick's teammates, including junior water polo player Katie Francis, acknowledged her outgoing personality and supportiveness, especially in practice.\r\n\r\n\"Sophie is very fun to be around and has a bubbly personality,\" Francis said. \"She is a very supportive teammate and pushes you hard in practice, which is good for the team.\"\r\n\r\nOther teammates expressed Frick's positivity and ability to get along with teammates easily. \r\n\r\n\"She is very supportive of all of us, especially bringing people up and our spirits up when we are down,\" freshman basketball guard Carly Leong said. \"She brings positivity by being the best teammate a person can have.\"\r\n\r\n\"She is super easy to get along with and is so friendly and outgoing that she fit right in with our team,\" junior Maddy Atwater said, a basketball and softball teammate of Frick's. \"She was a great teammate on the court and an even better friend off the court.\"\r\n\r\n[caption id=\"attachment_98904\" align=\"alignnone\" width=\"711\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_8696.jpg\"><img class=\"wp-image-98904\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_8696.jpg\" alt=\"Frick warms up behind the three-point line prior to a game vs. Gunn High School. Frick was one of two freshmen on the girls' team this season. Photo by George Lu. \" width=\"711\" height=\"474\" \/><\/a> Frick warms up behind the three-point line prior to a game against Gunn High School. Frick was one of two<br \/> freshmen on the girls' team this season. Photo by George Lu.[\/caption]\r\n\r\nFrick says that her favorite moment was winning the league championship during basketball season, especially with a team that had no seniors.\r\n\r\n\"Winning leagues in basketball was an extremely special experience, especially considering it doesn't just happen that easily or often,\" Frick said. \"We also had a really young team, which makes it all the better.\" \r\n\r\nFrick added that strong coaching in both water polo and softball were key to her enjoyment of sports this year. \r\n\r\n\"It was great to get better at water polo and have really awesome coaches at the same time,\" Frick said. \"My softball coach Bill Laskey also knows how to coach effectively, and even though he can get a little mad at times, it's all for making us [players] better.\"\r\n\r\nAccording to Frick, unlike basketball and water polo, softball and the immediate impact she was able to make on the softball team provided her with a surge of confidence for the future. \r\n\r\n\"Softball and the playing time gave me an incredible amount of confidence, especially coming in about four weeks after tryouts,\" Frick said. \"I didn't even know the coach personally. It was nice to go in right after basketball and start right away, knowing that the coach trusted me and the team trusted me to do what I could as a freshman. It did mean a lot to start and bat in the middle of the order even with a lot of the older players on the team.\"\r\n\r\nWhen asked if Frick looked up to a particular teammate, the first name that came to mind was a basketball teammate, junior guard Courtney Lovely.\r\n\r\n\"Coco is an overall extremely positive, well-rounded person and obviously a very good basketball player too,\" Frick said.\r\n\r\nGiven her noteworthy talent, Frick says she hopes to play all three sports for as long as she can. While nothing can take away her hard-working, focused and caring attitude, Frick says that only the hectic nature of high school would prevent her from competing for the duration of all four years.\r\n\r\n\"As of right now, I am hoping to play for as long as I can; hopefully all four years,\" Frick said. \"I know that it gets busy as a junior with SATs and as a senior with college apps, so if I feel overwhelmed I will probably step out of one or two sports. That being said, I really hope I will continue to manage my time well enough so that I can play all three sports throughout high school.\"\r\n\r\nWhen she's not practicing or competing, Frick is passionate about music and television, especially when it involves her siblings.\r\n\r\n[caption id=\"attachment_105040\" align=\"alignleft\" width=\"189\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11297661_1602089340038619_538719075_n.jpg\"><img class=\"wp-image-105040\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11297661_1602089340038619_538719075_n.jpg\" alt=\"Frick protects the ball as she squeezes between defenders in a game against Mountain View. Frick and the girls' varsity team won the De Anza League championship this season. Photo by Jeff Tobin. \" width=\"189\" height=\"284\" \/><\/a> Frick protects the ball as she squeezes between defenders in a game against Mountain View. Frick and the girls' varsity team won the De Anza League championship this season. Photo by Jeff Tobin.[\/caption]\r\n\r\n\"I am passionate about music, mostly finding new music in general,\" Frick said. \"I'm also very passionate about watching TV. I have a lot of shows that I'm always up to date with.\"\r\n\r\nAccording to Frick, her primary goals for the next few years are to establish strong bonds with teammates. As for looking beyond her time at Paly, Frick says that playing in college would be a dream come true.\r\n\r\n\"I pursue sports for obviously the awesomeness of school legacy and to win championships and building teams that you'll remember for the rest of your life,\" Frick said. \"I would also love to play a sport in college if I ever get the opportunity. I think it would be really fun and really pursuing a dream.\"\r\n\r\n&nbsp;","excerpt":"After participating in water polo, basketball and softball during her first year in high school, freshman Sophie Frick looks poised for a number of athletic accomplishments in the near future, marking herself as the Paly Voice's athlete of the year. ","date":"2015-05-30 17:06:31","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11303970_1602089120038641_1694026943_o.jpg","categories":["Spotlight"],"tags":{"44596":"athlete of the year","39038":"carly leong","11270":"courtney lovely","29696":"Katie Francis","8861":"maddy atwater","38660":"sophie frick"}}]