[{"id":95778,"title":"Student-athlete profiles: Who to watch out for at Winter Rally","permalink":"http:\/\/palyvoice.com\/2015\/01\/14\/student-athlete-profiles-who-to-watch-out-for-at-winter-rally\/","content":"Palo Alto High School's annual student-staff Winter Rally basketball game this Thursday will not feature your typical basketball athletes, but that doesn't mean that this year's student basketball team is absent of a drive to win or a love for basketball. The Paly Voice asked the students' co-head coach Kevin Mullin, a senior guard playing for the boys' varsity team, which players he wants the crowd to look out for. Here's the scoop on Mullin's 'Fab Five':\r\n\r\n[caption id=\"attachment_95914\" align=\"aligncenter\" width=\"550\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_20150114_1621431.jpg\"><img class=\"wp-image-95914\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_20150114_1621431.jpg\" alt=\"IMG_20150114_162143\" width=\"550\" height=\"413\" \/><\/a> Seeking redemption after last year's loss to the staff, students' head coach senior Kevin Mullin is relying on some key members of his squad to come up big. Photo by Josh Yuen.[\/caption]\r\n\r\nName: Alex Hwang\r\n\r\nHeight: 6' 1\"\r\n\r\nWeight: 170 lbs.\r\n\r\nPrevious basketball experience: Freshmen, JV, Club\r\n\r\nJersey during the game: TBD\r\n\r\nGoal for the game: \"I want to prove to all those who call me 'malnourished' that I'm a force to be reckoned with.\"\r\n\r\n&nbsp;\r\n\r\nName: James Giaccia\r\n\r\nHeight: 6' 0\"\r\n\r\nWeight: 175 lbs.\r\n\r\nPrevious basketball experience: None, just a \"dream chaser,\" as Giaccia described.\r\n\r\nJersey during game: Allen Iverson\r\n\r\nGoal for game: \"To go out and show the world what my coach Jackie Moon has been working on with me.\"\r\n\r\n&nbsp;\r\n\r\nName: Gillian Chryst\r\n\r\nHeight: 5' 10\"\r\n\r\nWeight: 147 lbs.\r\n\r\nPrevious basketball experience: JV, Varsity, Club\r\n\r\nJersey during game: Kobe Bryant (Los Angeles Lakers)\r\n\r\nGoal for game: \"I just want to have fun with my classmates and give people a show or something to laugh at.\"\r\n\r\n&nbsp;\r\n\r\nName: Will Snodgrass\r\n\r\nHeight: 5' 11\"\r\n\r\nWeight: 190 lbs.\r\n\r\nPrevious basketball experience: Jordan Middle School 'A' team\r\n\r\nJersey during game: Monta Ellis (Golden State Warriors)\r\n\r\nGoal for game: \"To go hard in the paint.\"\r\n\r\n&nbsp;\r\n\r\nName: Maclean Mansfield\r\n\r\nHeight: 5' 11\"\r\n\r\nWeight: 175 lbs.\r\n\r\nPrevious basketball experience: Recreational league in 6th grade\r\n\r\nJersey during game: Golden State Warriors practice jersey\r\n\r\nGoal for game: \"Hit the buzzer beater to drive the crowd wild.\"\r\n\r\nCo-head coach Jonny Rojahn will help Mullin lead the team against the staff. Other players include Jason B., Nick B., Jai C., Arya H., Clark H., Harry H., Misha H., Alex H., John K., Zach L., Jasper M., Rowan M., Walker R., Bryan W., and Lauren G.\r\n\r\nThe game will take place tomorrow after second period in the Paly Big Gym from 9:50 to 10:30 a.m. This year's prom location will also be announced during the rally.","excerpt":"In preparation for this year's student-staff basketball showdown during the Winter Rally, The Paly Voice asked students co-head coach Kevin Mullin, a senior guard playing for the boys' varsity team, which five players he wants the crowd to look out for. Take a peak at the scoop on Mullin's Fab Five. ","date":"2015-01-14 18:37:47","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_20150113_195833.jpg","categories":["Sports"],"tags":{"14524":"alex hwang","36387":"basketball game","32532":"gillian chryst","36388":"james giaccia","11831":"kevin mullin","36390":"maclean mansfield","8944":"palo alto high school","9090":"seniors","9123":"Staff","36386":"student-staff","9132":"students","36389":"will snodgrass","10976":"winter rally"}},{"id":95761,"title":"Liveblog: Girls&#8217; basketball vs. Saratoga","permalink":"http:\/\/palyvoice.com\/2015\/01\/14\/liveblog-girls-basketball-vs-saratoga\/","content":"<em>The Palo Alto High School girls' basketball team (12-2, 2-0) plays Saratoga High School (11-2, 1-0) today at home. The Vikings won their last game against Wilcox (3-9, 0-2).  Make sure to check back at 7 p.m. for live updates.<\/em>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School girls' basketball team (12-2, 2-0) plays Saratoga High School (11-2, 1-0) today at home. They won their last game against Wilcox (3-9, 0-2).  Make sure to check back at 7 p.m. for live updates. ","date":"2015-01-14 11:48:58","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_8939.jpg","categories":["Sports"],"tags":[]},{"id":95691,"title":"Foothill strives to introduce bachelor&#8217;s program","permalink":"http:\/\/palyvoice.com\/2015\/01\/13\/foothill-strives-to-introduce-bachelors-program\/","content":"[caption id=\"attachment_95692\" align=\"alignnone\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/unnamed.jpg\"><img class=\"wp-image-95692\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/unnamed.jpg\" alt=\"\" width=\"581\" height=\"436\" \/><\/a> On Jan. 1, a bill granted Foothill College the opportunity to create a four-year bachelor's degree program. If selected, Foothill will implement a cheaper and larger dental hygiene program than its current two-year program. Photo by Milena Maese-Czeropski.[\/caption]\r\n\r\n<span class=\"Apple-style-span\" style=\"color: #373e4d;\">Foothill College is currently striving to introduce a low-cost bachelor's degree program after the bill SB 850 went into effect Jan. 1, which gives community colleges affordable alternatives to programs that public California universities offer.<\/span>\r\n\r\nAccording to the <a href=\"http:\/\/leginfo.legislature.ca.gov\/faces\/billAnalysisClient.xhtml\">Legislative Counsel of California<\/a>, the implemented bill gives 15 California community colleges the opportunity to launch a bachelor's degree program in a specific major that meets local workforce demands and that does not compete with or duplicate programs offered at University of California or California State University schools. 34 community colleges are competing for the 15 spots offered in the bill, which was initially approved by Gov. Jerry Brown in September 2014.\r\n\r\nAccording to Foothill's Dental Hygiene Program Director Phyllis Spragge, if Foothill is one of the 15 community colleges chosen to offer a bachelor's degree program, administrators will create their first four-year dental hygiene program. Andrea Hanstein, Foothill director of marketing and public relations, said Foothill would implement this pilot program by 2016.\r\n\r\nThe state chancellor’s office will judge the colleges’ proposals and consult with UC and CSU schools to decide the chosen 15 community colleges. According to California's Legislative Counsel, the accepted colleges will only initially be able to offer one program, which will have to pass through the Accrediting Commission for Community and Junior Colleges and find a method of payment for the program.\r\n\r\nAccording to Palo Alto High School college advisor Sandra Cernobori, on average, 12 to 15 percent of Paly seniors apply to Foothill each year. If created, the dental hygiene program would provide Paly graduates the opportunity to enroll in a baccalaureate degree at Foothill for the first time.\r\n\r\nSenior Grete Saue is planning to go to Foothill and would consider the new program.\r\n\r\n“I think it's a good idea,” Saue said. “It opens up new opportunities for people who may not have the money, want to stay local or even need to spend the extra money that universities require.”\r\n\r\nCurrently no UC or CSU university teaches dental hygiene, and the course is only available through three private universities in California. The cost of tuition for the program at these private colleges ranges from $43,000 to $70,000 per year. If Foothill is granted the opportunity to create this program, it will be offered at rates significantly lower than those of private universities, according to Spragge.\r\n\r\n“The tuition for the pilot program baccalaureate degree programs will be higher than the usual community college fees, but lower than CSU or UC fees,” Spragge said. “It is estimated that a bachelor’s degree under this pilot program could cost about $10,000.”\r\n\r\nAccording to Spragge, Foothill chose the dental hygiene program due to the vitality of dental hygiene in the job market, the need for dental hygiene care in California and the strength of Foothill’s current dental hygiene program. According to <a href=\"http:\/\/www.foothill.edu\/bio\/programs\/dentalh\/\">Foothill College’s website<\/a>, its dental hygiene program has led to consistent rankings as one of the top 10 community colleges in the United States for dental hygiene. Its website says that its current two-year dental hygiene program includes curriculum that covers the basic sciences, oral anatomy, public health, nutrition, clinical dental hygiene, periodontics and radiology.\r\n\r\nAn average of 100 students apply each year for 24 spots in the current program, according to Spragge. However, the competition for a spot in the program would be lessened with the addition of a four-year program.\r\n\r\n\"Even though we only take 24 students a year, we're looking at this bachelor degree program to be larger in number and in scope,\" Spragge said.\r\n\r\nThe employment rate in the dental hygiene field is presumed to grow by 38 percent through 2020, significantly faster than other occupations, according to the <a href=\"http:\/\/www.bls.gov\/oes\/current\/oes292021.htm\">U.S Bureau of Labor Statistics<\/a>. This growth is attributed to an increased demand for dental care and a greater use of dental hygienists.\r\n\r\nFor more information about Foothill's current dental hygiene program, you can visit <a href=\"http:\/\/www.foothill.edu\/bio\/programs\/dentalh\/\">Foothill's official site<\/a>.","excerpt":"Foothill College is one of dozens of community colleges striving to introduce a low-cost bachelor degree program as an affordable alternative to those that traditional California Public Universities offer.","date":"2015-01-13 21:44:12","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/unnamed.jpg","categories":["News","Spotlight"],"tags":{"34667":"bachelor degree program","8552":"California","34668":"community college","34669":"Foothill","8715":"Foothill College"}},{"id":95728,"title":"&#8216;Save the 2008&#8242; to push school board tonight","permalink":"http:\/\/palyvoice.com\/2015\/01\/13\/save-the-2008-to-push-school-board-tonight\/","content":"<div style=\"color: #000000;\">\r\n\r\nMembers of a campaign organized by a Gunn High School student and former teacher will again bring their movement for a less stressful academic environment at tonight's School Board meeting's open forum session at 6:30 p.m. at the Palo Alto Unified School District office.\r\n\r\nThe campaign, <a href=\"http:\/\/www.savethe2008.com\">'Save the 2,008'<\/a>, was created by Gunn sophomore Martha Cabot and former teacher Marc Vicenti in reaction to the suicide of a Gunn student last year. It aims to engage the community with its six goals to decrease academic stress at Gunn, which includes assigning a less rigorous workload, having smaller class sizes and prohibiting cell phone use on campus.\r\n\r\n[caption id=\"attachment_95756\" align=\"alignright\" width=\"475\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-13-at-12.52.55-AM.png\"><img class=\"wp-image-95756\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-13-at-12.52.55-AM.png\" alt=\"Screen Shot 2015-01-13 at 12.52.55 AM\" width=\"475\" height=\"295\" \/><\/a> Save the 2,008 campaign website describes its six proposals for a less stressful academic environment. The campaign was launched last November and has participated in multiple open forums since its founding. Screenshot by Takaaki Sagawa.[\/caption]\r\n\r\nVicenti hopes the open forum will allow the campaign to gain the attention of both PAUSD and the community.\r\n\r\n\"I wish to make the campaign proposals visible, interesting and compelling to the district and Gunn leadership,\" Vicenti said. \"We want to engage and energize the community so that many voices will be raised in favor of our six proposals.\"\r\n\r\nSupt. Max McGee anticipates supporters of the campaign as well as those opposed to the campaign to voice their opinions during the forum.\r\n\r\n\"I expect that we will hear from people that support some of the components of Mark’s campaign,\" McGee said. \"I also expect we will hear from others who do not agree with some of his ideas and think that preventing suicide is a far more complex problem with solutions that go well beyond school.\"\r\n\r\nBoard member Heidi Emberling appreciates the campaign's efforts to offer input as a part of the community.\r\n\r\n\"The board is always happy to hear from the public regarding issues of importance to our school community,\" Emberling said.  \"We all need to work together as a community to continually improve our district for the benefit of all our students.\"\r\n\r\nThe issues addressed by the campaign are ones that not only concern Gunn, but also Palo Alto High School, according to board member Terry Godfrey.\r\n\r\n\"I think the team's goal to create 'a school that is rich with trust, deliberation, zest, meaning and personal connection' really hits home for students and families,\" Godfrey said. \"I have two students at Paly, and much of what the team wants to address is similar to what my family sees at Paly.\"\r\n\r\nThe campaign has attended previous board meetings, first participating in the open forum session on Nov. 18. It was created after Cabot's <a href=\"https:\/\/www.youtube.com\/watch?v=9LLnY_JBAAg\">reaction video<\/a>, which called for a less stressful environment at Gunn, according to Vicenti.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n","excerpt":"Members of a campaign organized by a Gunn High School student and former teacher will advocate for a less stressful academic environment by participating in the open forum session at 6:30 p.m. during tonight's School Board meeting at the Palo Alto Unified School District office.","date":"2015-01-13 13:54:11","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo.jpg","categories":["News","Spotlight"],"tags":{"34894":"2008","34889":"academic","29781":"board","34886":"Cabot","29798":"campaign","34891":"cell phones","23905":"goals","8751":"gunn","34887":"Mark","34885":"Martha","34892":"no","32431":"open forum","23939":"reaction","34893":"Save the 2008","9068":"School","9069":"School Board","10609":"school climate","34890":"six","9135":"suicide","34888":"Vicenti","9208":"video"}},{"id":95781,"title":"Liveblog: Girls&#8217; soccer vs. Saratoga","permalink":"http:\/\/palyvoice.com\/2015\/01\/13\/liveblog-girls-soccer-vs-saratoga\/","content":"<em>Check back in today at 3:30 p.m. for live coverage as the Palo Alto High School girls' soccer team (7-0, 1-0) takes on the Saratoga High School Falcons (3-2-2, 1-0-1) at home for its second league game of the season. <\/em>\r\n\r\n[liveblog]","excerpt":"Check back in today at 3:30 p.m. for live coverage as the Palo Alto High School girls's soccer team (7-0, 1-0) takes on the Saratoga High School Falcons (3-2-2, 1-0-1) for its second league game of the season. \r\n","date":"2015-01-13 13:52:36","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5054.jpg","categories":["Sports"],"tags":{"10198":"girls soccer","8854":"live blog","8855":"liveblog","8944":"palo alto high school","9063":"saratoga","9110":"Soccer"}},{"id":80796,"title":"Je suis Emma: Je suis Charlie","permalink":"http:\/\/palyvoice.com\/2015\/01\/12\/je-suis-emma-je-suis-charlie\/","content":"[caption id=\"attachment_95618\" align=\"aligncenter\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/jesuisemmafinal.jpg\"><img class=\"wp-image-95618\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/jesuisemmafinal.jpg\" alt=\"&quot;Je suis Emma&quot; is a new column that Managing Editor Emma Chiu will be writing over the course of the semester. It was inspired by the &quot;je suis Charlie&quot; movement that supports freedom of speech. Photo by Emma Chiu. \" width=\"400\" height=\"300\" \/><\/a> Managing Editor Emma Chiu covers her lips with the title of her new column, \"Je suis Emma.\" Photo by Emma Chiu.[\/caption]\r\n\r\n<em>The following piece is the first installation of a new column titled \"Je suis Emma.\" It serves as an introduction to what the column will be about and how it was inspired.<\/em>\r\n\r\n“Je suis Charlie.”\r\n\r\nMillions of tweets, Facebook posts and protest signs have donned these words in response to the <a href=\"http:\/\/time.com\/3657246\/paris-charlie-hebdo-shooting\/\">terrorist attack<\/a> on the French satirical magazine Charlie Hebdo, which resulted in the deaths of 12 people.\r\n\r\nIn the past, the magazine has produced offensive caricatures of the Prophet Muhammad and has openly criticized Islam. Using the phrase “Je suis Charlie” is <b>not<\/b> an agreement with Charlie Hebdo's statements and images that blatantly disrespect the beliefs of Islam. (It is also not intended to imply that I speak French.) “Je suis Charlie” is a symbol of supporting freedom of the press and showing no fear to those who attempt to stifle that freedom.\r\n\r\nUnfortunately, we’ve seen too often how tragic events spark protests and strong trends on social media, but after several weeks, or even days, the interest quickly fades — a point eloquently <a href=\"http:\/\/verdemagazine.com\/thats-what-shi-said-well-that-was-fast-society-has-a-goldfish-attention-span-when-it-comes-to-activism\">made<\/a> by fellow Palo Alto High School journalist Kelly Shi in the most recent issue of Verde Magazine. Just look at how 58 percent of Americans supported stricter gun control laws just after the Newtown shootings in 2012, but by October 2014, that support had fallen to 47 percent, according to <a href=\"http:\/\/www.gallup.com\/poll\/179045\/less-half-americans-support-stricter-gun-laws.aspx\">surveys<\/a> conducted by Gallup Poll.\r\n\r\nSo, this new column is my long-term commitment to supporting freedom of the press by discussing controversial topics that relate to high school students and expressing my possibly unpopular opinions.\r\n\r\nRight now, the public has been strongly urging journalists to push the envelope when it comes to controversy and show that we are not afraid to exercise our rights. However, this movement collides with the common journalistic principle that “just because you <i>can<\/i> say something doesn’t mean you <i>should.<\/i>” In my opinion, there is a problem in writing with the intent to offend (as Charlie Hebdo seems to have done), but there is still a power in writing with the intent to provoke.\r\n\r\nWhat can you expect from this column? Well since the words “high school” and “controversy” are so often seen together, you can expect almost anything. I intend to reveal my unconventional thoughts on people applying to over 20 colleges, worshiping <span style=\"color: #222222;\">Beyoncé<\/span> as a goddess and\/or watching a “trash” reality show like “The Bachelor.” I want to address hook-up culture, upperclassmen entitlement and stigmas that come from labels.\r\n\r\nI often like to use statistics but at the same time add a little sass or sarcasm. Some pieces may be more serious or light-hearted than others. One thing I can guarantee though: sugar-coating gets checked at the door.\r\n\r\nThis project will be a column and not a collection of separate opinion pieces for a reason: the phrase “Je suis Emma” will appear in each new column to serve as an ongoing reminder of last week’s overflowing support for freedom of the press, as well as a way to honor those who were killed for exercising their rights. With the title \"Je suis Emma,\" I hope to emphasize that both writing and reading these pieces are in themselves support of that freedom.\r\n\r\nJe suis Charlie. Je suis Emma.","excerpt":"This new column is my long-term commitment to supporting freedom of the press by discussing controversial topics that relate to high school students and expressing my possibly unpopular opinions. Topics can range from applying to college to worshiping Beyoncé to watching \"The Bachelor.\"","date":"2015-01-12 20:56:11","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/jesuisemmafinal.jpg","categories":["Je Suis Emma","Opinion","Spotlight"],"tags":{"34657":"charlie hebdo","8604":"college","11240":"emma chiu","34552":"je suis charlie","34551":"je suis emma","34553":"paris","34554":"the bachelor"}},{"id":95703,"title":"Paly grads to speak at “Listen and Learn”","permalink":"http:\/\/palyvoice.com\/2015\/01\/12\/paly-grads-to-speak-at-listen-and-learn\/","content":"[caption id=\"attachment_95706\" align=\"alignright\" width=\"305\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_1026.jpg\"><img class=\" wp-image-95706\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_1026.jpg\" alt=\"Students chat and read on the steps of the Low Memorial Library at Columbia University. One of the Paly alumni, currently an undergraduate student at Columbia, will share her experiences at the university tomorrow at &quot;Listen and Learn.&quot;\" width=\"305\" height=\"229\" \/><\/a> Students chat and read on the steps of the Low Memorial Library at Columbia University. At tomorrow's event, a Palo Alto High School alumna, who's currently an undergraduate student at Columbia, will share her experiences at the university. Photo by Jeanette Wong.[\/caption]\r\n\r\nPalo Alto High School alumni will share their experiences about the college application process and life at college at “Listen and Learn” during Tutorial tomorrow in Room 29 (upstairs of the Tower building).\r\n\r\nHosted by the College and Career Center, the talk is open to students of all grades and will consist of a Q&amp;A session and two breakout sessions.\r\n\r\n“In the first half hour, I’ll introduce them [the graduates] and ask them some questions, then people can ask follow-up questions,” college adviser Sandra Cernobori said. “After that, there’s going to be a couple breakout sessions on two different topics: One is about how course expectations differ from high school to college, and the other one is about the transition to college – how to get involved and make the transition smoother.”\r\n\r\nAccording to Cernobori, the purpose of the talk is for students to get first-hand information on the journey from high school to college.\r\n\r\n“I think a lot of our Paly grads have some really interesting insights,” Cernobori said. “Not only about the college application process, but [also] what college life is actually like from someone who’s had this preparation.”\r\n\r\nThe alumni speakers include Jessica Feinberg of Smith College, Sergey Smirnov of NYU Polytechnic, DaVaughn Dillahunty of Coppin State University, Helen Cane of Columbia University and Cobin Dodd of Macalester College.","excerpt":"Palo Alto High School alumni will share their experiences about the college search and life at college in “Listen and Learn” during Tutorial tomorrow in Room 29.","date":"2015-01-12 17:22:57","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_1026.jpg","categories":["News","Spotlight"],"tags":{"12340":"alumni","14165":"cernobori","8604":"college","8606":"College and Career Center","34670":"listen and learn"}},{"id":95433,"title":"Liveblog: 72nd annual Golden Globes","permalink":"http:\/\/palyvoice.com\/2015\/01\/11\/liveblog-72nd-annual-golden-globes\/","content":"<em>Editor’s Note: The opinions presented in this article are those of the authors alone and do not necessarily reflect the opinions of the staff of The Paly Voice as a whole.\r\n<\/em>\r\n\r\nTune in at 4 p.m. for live coverage of the 72nd annual Golden Globes.\r\n\r\n[caption id=\"attachment_95435\" align=\"aligncenter\" width=\"431\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/72nd-golden-globe-awards.jpg\"><img class=\"wp-image-95435 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/72nd-golden-globe-awards.jpg\" alt=\"Comedians Tina Fey (L) and Amy Poehler (R) will host the 72nd annual Golden Globes. Photo courtesey of Reuters.\" width=\"431\" height=\"302\" \/><\/a> Comedians Tina Fey (L) and Amy Poehler (R) will host the 72nd annual Golden Globes. Photo courtesy of Reuters.[\/caption]\r\n\r\n[liveblog]","excerpt":"Tune in Sunday at 4 p.m. for live coverage of the 72nd annual Golden Globes. ","date":"2015-01-11 14:20:03","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/72nd-golden-globe-awards.jpg","categories":["Entertainment","Spotlight"],"tags":{"19460":"2015","8676":"entertainment","34606":"golden globes","8901":"movies","9034":"red carpet"}},{"id":80638,"title":"Martin Luther King Jr. Day holiday on Monday, Jan. 19","permalink":"http:\/\/palyvoice.com\/2015\/01\/08\/martin-luther-king-jr-day-holiday-on-monday-jan-19\/","content":"","excerpt":"","date":"2015-01-08 13:42:03","author":"Lizzie Chun","categories":["Ticker"],"tags":{"34450":"martin luther king jr day","11159":"MLK"}},{"id":80776,"title":"Last day to add a class is Friday, Jan. 16","permalink":"http:\/\/palyvoice.com\/2015\/01\/08\/last-day-to-add-a-class-is-friday-jan-16\/","content":"","excerpt":"","date":"2015-01-08 13:41:55","author":"Lizzie Chun","categories":["Ticker"],"tags":{"34545":"add class"}}]