[{"id":112537,"title":"Atlantic article prompts mixed reactions","permalink":"http:\/\/palyvoice.com\/2015\/12\/02\/atlantic-article-prompts-mixed-reactions\/","content":"[caption id=\"attachment_112738\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/atlantic.jpg\"><img class=\"size-full wp-image-112738\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/atlantic.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"800\" height=\"600\" \/><\/a> Illustration by Portia Barrientos.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">As soon as the cover of the Atlantic Magazine’s December 2015 edition, a melancholy-inducing image of a teenage boy with his head buried in his hands, surfaced on social media it ignited an emotional maelstrom in the Palo Alto community. Some shared the article and denounced it completely, others thought the community's collective reaction was excessive — many more opinions fell in between.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The article, “<a href=\"http:\/\/www.theatlantic.com\/magazine\/archive\/2015\/12\/the-silicon-valley-suicides\/413140\/\" target=\"_blank\">The Silicon Valley Suicides<\/a>,” by Hanna Rosin, explores topics concerning the suicides that have occurred in Palo Alto over the last few years. Rosin chronicles the two recent suicide clusters and goes on to discuss affluence, race, parenting styles, academic environment and the overall culture of Palo Alto as related to the suicides. This story is the latest in a flurry of articles on Palo Alto written by local and national publications, including <a href=\"http:\/\/www.nytimes.com\/2015\/04\/26\/sunday-review\/push-dont-crush-the-students.html\" target=\"_blank\">The New York Times<\/a>, <a href=\"http:\/\/www.vice.com\/read\/student-teaching-0000748-v22n9\" target=\"_blank\">Vice<\/a>, <a href=\"http:\/\/www.npr.org\/2015\/05\/10\/405694832\/in-palo-altos-high-pressure-schools-suicides-lead-to-soul-searching\" target=\"_blank\">National Public Radio<\/a>, <a href=\"http:\/\/www.huffingtonpost.com\/terry-connelly\/recovering-from-suicide-i_b_7465234.html\" target=\"_blank\">Huffington Post<\/a> and <a href=\"http:\/\/www.sfgate.com\/bayarea\/article\/Why-are-Palo-Alto-s-kids-killing-themselves-6270854.php\" target=\"_blank\">San Francisco Magazine<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School Principal Kim Diorio is highlighted in the piece, and she says the article is not as she initially expected it to be. Among other things, she is not pleased with its imagery, placement as a cover story and the choice to name students’ names.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was under the impression that she wanted to write something a little more positive,” Diorio said. “If I could do it all again and wave my magic wand, I would have kept my mouth shut and not talked to her [Rosin].” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio says she is concerned about the possible negative effects the article could have on certain students and community members.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“That's one of my biggest worries, is will this re-trigger some of those feelings, some of that ideation, because that's what the data suggests can happen with that media attention,” Diorio said.<\/span>\r\n\r\n[caption id=\"attachment_112560\" align=\"alignright\" width=\"252\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12240996_10153792383468487_765764764809420000_o.jpg\"><img class=\" wp-image-112560\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12240996_10153792383468487_765764764809420000_o.jpg\" alt=\"The cover of The Atlantic Magazine's December 2015 issue. The image and headline met with backlash and accusations of sensationalism from some community members. Courtesy of The Atlantic\" width=\"252\" height=\"336\" \/><\/a> The cover of The Atlantic Magazine's December 2015 issue. The image and headline met with backlash and accusations of sensationalism from some community members. Courtesy of The Atlantic[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">According to Diorio, her only quote featured in the article was taken out of context. The article reads, “Diorio says she often asks kids what they do for fun, ‘and they can’t answer that question.’” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I know our students know how to have fun,” Diorio said. “It [the quote] was said in the sense that students do not have enough free time. … We just got our Challenge Success survey results back and it says students only have about 40 minutes of free time a day. That’s not a lot of time for downtime.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to both Diorio and PAUSD Supt. Max McGee, the timing of the article, one year after the death of a Gunn student by suicide, is one of the factors that contributed to their reproachful reactions.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I thought it was grossly insensitive to release it in November, a year after one of the students died by suicide, and frankly I was really worried it might trigger something, another tragedy,” McGee said. “I don’t understand why any publisher would do that.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee, however, did applaud the author’s effort to avoid oversimplifying such a convoluted issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“That’s really important because people are quick to point the finger and blame someone for a suicide, but I think she did a good job of saying this is really complicated,” McGee said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Before the article was published,<\/span><span style=\"font-weight: 400;\"> senior and Verde Magazine Co-Managing Editor Siddharth Srinivasan was wary, saying he did not expect The Atlantic “to uncover anything different than other articles in the past.”<\/span><span style=\"font-weight: 400;\"> Like much of the student body, Srinivasan felt ambivalent after reading it — he did not repudiate the author’s claims altogether, but found numerous problems with the approach. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“In some aspects, the research was more thorough and more well done than I expected and in some aspects it was more sensationalized than I expected,” Srinivasan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Andrea O’Riordan took issue with the lurid description of the train tracks in the introduction as well as the ending line of the article, which reads: \"They’re kids, so they can still forget.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“That [the ending] just struck me as being so, so wrong to insinuate that just because we’re still minors, we can forget traumatic experiences,” she said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In spite of the sensationalism, Srinivasan said he appreciated the author’s incorporation of scientific studies, such as the “U-curve” phenomenon. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s definitely interesting that she chose to bring the studies in because it really relates it to a more national issue rather than focusing in on particularly Palo Alto,” he said. “I think that was important to get the balance of student voice and clinical study.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Srinivasan, the article’s style of narration gives too much creative control to the author, which could embed a hidden bias within the story.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If <\/span><span style=\"font-weight: 400;\">I’m just a reader who does not have much knowledge about the Palo Alto community other than what’s in the article I feel like I’m swayed to a direction which is purely imposed by the writer herself,” Srinivasan said. <\/span><span style=\"font-weight: 400;\">“Choosing to narrate about the students rather than have them speak for themselves — I feel like it doesn't represent the students as well as it could have.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Gunn High School senior and editor-in-chief of the Gunn Oracle Shawna Chen echoed this sentiment, saying that the article would have had more journalistic merit if Rosin had spoken to more students. Furthermore, Chen pointed out that by making only cursory references to the schools’ various campaigns to combat the issue of student stress, Rosin conveyed a sense of defeatism.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I can’t say that what her article said isn’t true,” Chen said. “But if she spent some time talking about the growth we’ve had as a community, how we’ve changed, how we’ve moved past it, all these different initiatives that have been taken by parents and adults and students, I think that would have given students hope.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It remains contested whether this article offers crucial new insights on the problem at hand or if it is a piece tainted with sensationalism, perhaps even both, but one thing is certain — it has helped to paint a stark picture of Palo Alto.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I don't want our reputation nationally and beyond our community to be just about this,” Diorio said. “I wish there was a way to change the narrative so that our story is, ‘Look at all the amazing things we do, and look at all the talented students we have, and look at all the compassion and care and look at how we've come together as a community and responded to this tragedy.’”<\/span>","excerpt":"As soon as the cover of the Atlantic Magazine’s December 2015 edition, a melancholy-inducing image of a teenage boy with his head buried in his hands, surfaced on social media it ignited an emotional maelstrom in the Palo Alto community.","date":"2015-12-02 20:00:26","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/atlantic.jpg","categories":["News","Spotlight"],"tags":["andrea o'riordan","article","atlantic","diorio","hanna rosin","McGee","new york times","shawna chen","siddharth srinivasan","suicide"]},{"id":112592,"title":"Boys&#8217; soccer looks to conquer challenges, win league","permalink":"http:\/\/palyvoice.com\/2015\/12\/02\/boys-soccer-looks-to-conquer-challenges-win-league\/","content":"[caption id=\"attachment_112606\" align=\"alignnone\" width=\"598\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-01-at-11.31.04-AM.png\"><img class=\"size-full wp-image-112606\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-01-at-11.31.04-AM.png\" alt=\"captionsnsnsnsn\" width=\"598\" height=\"302\" \/><\/a> Junior defender Brian Tracy competes against a Los Gatos High School forward to win possession last year on the Vikings' Senior Night. Photo by Amy Leung.[\/caption]\r\n\r\nThe Palo Alto High School boys' soccer team (0-0, 0-0) is focusing on living up to the success of its most recent season, despite major losses in its starting lineup.\r\n\r\nAccording to head coach Donald Briggs, losing center midfielder Wesley Woo, midfielder Preston Kuppe and goalkeeper Alex Bonomi will affect team play.\r\n\r\n“Both Woo and Kuppe were key players, were very competitive and played in the middle,” Briggs said. “Bonomi was one of the two best keepers in the league. They will be difficult to replace. We will have to see how this years’ seniors and juniors can step in and play near last year’s high levels.”\r\n\r\nDespite these losses, the players remain hopeful and hardworking going into this season. According to senior midfielder Siddharth Srinivasan, the team is well rounded in player skill, which will help with keeping play at a high level throughout the season.\r\n\r\n“We are not reliant on one or two players and have good depth in every position, which is important if we want to be consistent in the long-run,” Srinivasan said.\r\n\r\nThe team’s league-winning past is something it is looking to repeat and build on, according to senior goalkeeper Eli Friedlander.\r\n\r\n“We have a strong group, and I think we have a good shot at winning [De Anza] league again,” Friedlander said. “Hopefully we will go deeper into CCS [Central Coast Section]. I expect that we will be competitive in every game we play.”\r\n\r\nAccording to Briggs, the team’s formation is still developing, and players may be switched around to accommodate and improve connections.\r\n\r\n“We are putting emphasis on modified medium-sized scrimmages to see where players fit in best defensively and offensively,” Briggs said.\r\n\r\nPlaying a fast-paced possession style game will be a challenge for the team this year, according to junior center midfielder Jack Stoksik.\r\n\r\n“We need to work on our sharpness in passing and moving,” Stoksik said. “We are often too slow to react to a good pass or to know when to break the line.”\r\n\r\nThe team’s long history and familiarity with each other’s playing styles will benefit the team as a whole, according to senior midfielder Dami Bolarinwa.\r\n\r\n“We are a team full of chemistry,\" Bolarinwa said. \"We have players that have been playing together for a long time and they know each other's strengths and weaknesses.\"\r\n\r\nThe Vikings are set to kick off their first regular season game at 3:30 p.m. on Thursday at the Paly soccer field against the Milpitas Trojans (0-0, 0-0).","excerpt":"The Palo Alto High School boys' soccer team (0-0, 0-0) is focusing on living up to its success of past seasons, despite major losses in its starting lineup.","date":"2015-12-02 19:26:06","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-01-at-11.31.04-AM.png","categories":["Sports"],"tags":["alex bonomi","briggs","CCS","dami bolarinwa","de anza league","eli friedlander","jack stoksik","milpitas","preston kuppe","preview","season preview","siddharth srinivasan","Soccer","wesley woo"]},{"id":112558,"title":"Season Recap: Volleyball falls to San Benito in CCS playoffs","permalink":"http:\/\/palyvoice.com\/2015\/12\/02\/season-recap-volleyball-falls-to-san-benito-in-ccs-playoffs\/","content":"[caption id=\"attachment_112562\" align=\"alignnone\" width=\"588\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Volleyball-2.png\"><img class=\"size-full wp-image-112562\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Volleyball-2.png\" alt=\"The Palo Alto High School girls' volleyball team celebrates after Senior middle blocker Claire Krugler gets a block against Mountain View High School. Photo by Victor Carlsson.\" width=\"588\" height=\"385\" \/><\/a> The Palo Alto High School girls' volleyball team celebrates after senior middle blocker Claire Krugler gets a block against Mountain View High School. Photo by Victor Carlsson.[\/caption]\r\n\r\nPalo Alto High School girls' volleyball team (24-13, 7-5) is looking forward to next season after its loss to San Benito High School (30-7, 11-1) in the second round of the Central Coast Section playoffs.\r\n\r\nThe Vikings' effort was led by sophomore outside hitter Chelsea Fan who earned 12 kills in the loss to San Benito and junior setter Jessica Lee who had 51 assists.\r\n\r\n“It was a good game,” Lee said. “A few points here and there was the difference between us winning and us losing. It was a tough loss for us because it ended our season, and for the seniors it was their last high school game, and for a couple it was their last volleyball game ever.”\r\n\r\nThis was the final match for seniors Claire Krugler, Clara Chiu, Claire Dennis, and Gabby Bains.\r\n\r\n“The loss against San Benito was very disappointing,\" Dennis said. \"We knew it was going to be a challenging team, and we hung in there through the fifth set but being so close to winning and going on to playoffs and falling short is extremely frustrating regardless. I had an amazing experience at Paly competing in sports.”\r\n\r\nOverall, first year head coach Jekara Wilson led the team to a successful record of 24-13, an improvement from last year's record of 19-12.\r\n\r\n“I am pleased with the outcome of the season,\" Jekara said, \"At the end of the day, I would have loved to have beaten San Benito in the CCS quarterfinals since we were so close, but even though we fell short of the win, I am so proud of the girls efforts. ”\r\n\r\nThe Vikings will build off of several returning players, including sophomore Chelsea Fan, junior Jessica Lee and Fiona Green, who believe that next season they can make it all the way to the state tournament.\r\n\r\n“I think since the majority of the team will be returning to play together next year, we will be a much stronger team as a whole,” Green said. \"We will be much better at working together since we have played together before.”\r\n\r\nWith a strong returning lineup and more experience at the coaching position, the team has high expectations for next season.\r\n\r\n“Our goals for next season will be to come first in league, to come in either first or second in CCS, and possibly even further,” Green said.","excerpt":"Palo Alto High School girls' volleyball team(24-13, 7-5) is looking forward to next season after its loss to San Benito High School (30-7, 11-1) in the second round of the Central Coast Section playoffs. \r\n","date":"2015-12-02 19:23:11","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Volleyball-2.png","categories":["Sports","Spotlight","Volleyball"],"tags":[]},{"id":112677,"title":"Season Recap: Football falls in CCS semi-final to Milpitas","permalink":"http:\/\/palyvoice.com\/2015\/12\/02\/season-recap-football-falls-in-ccs-semi-final-to-milpitas\/","content":"[caption id=\"attachment_112678\" align=\"alignnone\" width=\"702\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/rsz_img_1343.jpg\"><img class=\"size-full wp-image-112678\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/rsz_img_1343.jpg\" alt=\"Senior wide receiver Eli Givens prepares for the snap during a game against San Benito, Givens is one of many seniors leaving next season. Photo by Jackson Doerr\" width=\"702\" height=\"419\" \/><\/a> Senior wide receiver Eli Givens prepares for the snap during a game against San Benito, Givens is one of many seniors leaving next season. Photo by Jackson Doerr.[\/caption]\r\n\r\nThe Palo Alto High School football team (5-7, 3-3) ended its season last Friday with a 42-0 loss to the Milpitas Trojans (10-2, 6-0) in the Central Coast Section semi-finals, marking the Vikings’ second loss to Milpitas of this season.\r\n\r\nVikings’ head coach Jake Halas is regretful of the loss.\r\n\r\n“As a player and a coach, you always want to continue playing as long as they’ll let you,” Halas said. “Unfortunately, we ran into Milpitas again.”\r\n\r\nDespite the loss, Halas said the season went well overall.\r\n\r\n“Overall this was a good season, not because of our record, but because of what our kids accomplished,” said Halas. “Our senior leadership was a big reason for the late success of our program.”\r\n\r\nThe Vikings will lose 22 seniors, almost half of the team, next season.\r\n\r\nJunior offensive guard Sean Romeo is apprehensive about next season.\r\n\r\n\"It doesn't feel [like] that big of a deal at the moment, but I think that once we actually begin the senior year we're going to realize that we're the face of the school now and it's going to be a huge step up,\" Romeo said.\r\n\r\nDespite this, senior running back Takeru Nishi said that he believes the younger players will be able to pick up the slack.\r\n\r\n“I think they will do fine,” Nishi said. “There are many young, talented players who will work very hard to play to their full potential.”\r\n\r\nHalas echoed Nishi's sentiments about underclassmen replicating the seniors' talent and success.\r\n\r\n“Our seniors know that they are a major reason for turning this program around and laid a good foundation for the underclassmen to build upon,” Halas said.\r\n\r\nThe Vikings ended their season with a 5-7 overall record, improving on the 3-8 record from last year.\r\n\r\n“Our philosophy has always been to get better at every practice and improve on every game,” Halas said. “It's less about how you start and more about how you finish.”","excerpt":"The Palo Alto Vikings (5-7) ended their season last Friday with a loss to the Milpitas Trojans (10-2) in the Central Coast Section semi-finals. \r\n","date":"2015-12-02 16:42:50","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/11064611_1705045353059694_5429589398359119383_o.jpg","categories":["Sports"],"tags":["football","football season recap","halas","milpitas","season recap","tak"]},{"id":112566,"title":"Girls&#8217; water polo finishes season in CCS semifinals","permalink":"http:\/\/palyvoice.com\/2015\/12\/02\/girls-water-polo-finishes-season-in-ccs-semifinals\/","content":"[caption id=\"attachment_109032\" align=\"alignleft\" width=\"625\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12062844_146300709052487_873887724_o.jpg\"><img class=\" wp-image-109032\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12062844_146300709052487_873887724_o.jpg\" alt=\"The Palo Alto High School girls’ water polo team ends a strong season with a loss Photo by Chirag Akella. \" width=\"625\" height=\"417\" \/><\/a> Sophomore Sabrina Hall looks to take a shot as the Vikings beat Gunn by a final score of 6-5 during the regular season. The Palo Alto High School girls’ water polo team ended a strong season with a loss against Leland High School in the Central Coast Section semifinals. Photo by Chirag Akella.[\/caption]\r\n\r\nThe Palo Alto High School girls’ water polo team (16-13, 7-5) concluded its season with a 12-5 loss to Leland High School (15-8, 4-o) in the Central Coast Section semifinals on Nov. 18.\r\n\r\nAlthough the Vikings’ season ended one game shy from reaching the CCS finals, the players maintained a positive attitude, said junior Joanna Falla.\r\n\r\nSenior Gigi Rojahn, voted player of the year by her teammates, was pleased with the team's playoff performance on her final season with the team.\r\n\r\n“I'm really proud of how far our team went,” Rojahn said. “One of our goals was to make it further than last year, and we accomplished that goal. Of course we wanted to be in the CCS finals, and I think we could have made it, but we're still very happy with how far we went this season.”\r\n\r\nAdditionally, Rojahn says she feels a sense of unity between the seniors on the team developed throughout the season.\r\n\r\n“A majority of the seniors on the team have been playing together for a while and it was nice for us to close up our four years together with a successful season,\" Rojahn said. “I felt like we really stepped into different leadership positions and I'm really proud of how far we've come.”\r\n\r\nEven though the team will be losing several seniors who played crucial roles on the team, including Gigi Rojahn, Katie Francis, Caitlin Giffen, Claire Drebin and Alina Drebin, players are optimistic for a strong year in 2016.\r\n\r\n“Five key players this year were seniors, so I think it might be tough on the team adjusting,” Rojahn said. “However, we did adjust well this year after graduating two main players, so I think if they work hard and focus on playing as a team, the team will be successful.”\r\n\r\nJunior Haley Chalmers, who will step up as a key player next year as a senior, expressed a similar mindset and touched on improvements the team can make during the offseason.\r\n\r\n“Since we are losing five of our strongest players, our team needs to be putting in extra work in the offseason to prepare for next season,\" Chalmers said. “I think our hardest adjustment will be finding new leaders to help us play as a team, but once we do I know things will be good. The main thing I think we need to improve on is our confidence and knowledge in the game.”\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ water polo team (16-13, 7-5) concluded its season with a 12-5 loss to Leland High School in the Central Coast Section semifinals on Nov. 18.","date":"2015-12-02 15:28:36","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12062844_146300709052487_873887724_o.jpg","categories":["Sports","Sports Recap","Spotlight","Uncategorized","water polo"],"tags":["CCS","finals","girls","water","water polo"]},{"id":112411,"title":"ASB introduces new kickball event","permalink":"http:\/\/palyvoice.com\/2015\/12\/01\/asb-introduces-new-kickball-event\/","content":"[caption id=\"attachment_112633\" align=\"alignleft\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Javier.jpg\"><img class=\" wp-image-112633\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Javier.jpg\" alt=\"Sophomore Class President tJaiveer Sandhu practices for the new kickball event. The event is meant to increase the participation of different classes in the activity, according to Student Activities Director Matthew Hall. It will take place during lunch this Friday at the lacrosse field. Photo by Ethan Kao. \" width=\"599\" height=\"422\" \/><\/a> Sophomore Class President Jaiveer Sandhu practices for the new kickball event that is set to take place during lunch this Friday at the lacrosse field.  The event is meant to increase the participation of different classes in the activity, according to Student Activities Director Matthew Hall. Photo by Ethan Kao.[\/caption]\r\n\r\nPalo Alto High School’s Associated Student Body will debut a new kickball event during lunch this Friday at the lacrosse field.\r\n\r\nThe new event will feature the freshman and juniors against the sophomores and seniors with staff members on both teams, according to Student Activities Director Matthew Hall.\r\n\r\nAccording to Hall, the event was inspired by other schools who have done similar activities with great success.\r\n\r\n“It is something we’ve never done before that's the first thing,” Hall said. We’ve seen other schools and other ASB's do something similar. It’s a sport that doesn’t require a lot of practice or lots of setup and basically everybody can kick a ball.”\r\n\r\nAccording to junior class vice president Natalie Maloney, free cocoa will be given to spectators.\r\n\r\nHall said that the goal of the kickball event was to increase inclusiveness among the student body.\r\n\r\n“We can also get a lot of people on the team,” Hall said. “Our goal is to be inclusive and let a lot of people play. So if you’ve got 12 people out on the field, and you are rotating people in and out, you can get 20 or more people on a team. Then we can have 40-50 players for the day.”\r\n\r\nJunior Declan Flanders also shared similar thoughts regarding the new activity.\r\n\r\n“I think it’s great that we are doing the kickball event because it includes all the classes and even gets the staff involved,” Flanders said. “It’s an inclusive event that doesn’t require a lot of skill compared to flag football or softball.”","excerpt":"Palo Alto High School’s Associated Student Body will debut a new kickball event during lunch this Friday at the lacrosse field. ","date":"2015-12-01 14:34:10","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Javier.jpg","categories":["News","Spotlight"],"tags":["ASB","declan flanders","event","Kickball","Matt Hall","natalie maloney","rally"]},{"id":112505,"title":"PAUSD to host &#8216;Code Fest&#8217; for K-12 students","permalink":"http:\/\/palyvoice.com\/2015\/12\/01\/pausd-to-host-code-fest-for-k-12-students\/","content":"[caption id=\"attachment_112546\" align=\"aligncenter\" width=\"726\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Programming.jpg\"><img class=\"wp-image-112546\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Programming.jpg\" alt=\"Programming\" width=\"726\" height=\"408\" \/><\/a> The \"Code Fest\" will feature several workshops that serve to introduce students to coding. Students can expect to participate in events similar to the ones shown above. Photo by Smita Kolhatkar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto Unified School District is hosting its first free \"Code Fest\" for K-12 students as an introduction to coding from 1 to 5 p.m. Dec. 12 at JLS Middle School. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The \"Code Fest’s\" goal is to teach PAUSD student coding skills that are becoming more important in the workforce, according to PAUSD Educational Technology TOSA Smita Kolhatkar.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The objective of the 'Code Fest' is to expose each K-12 student to look at coding as an integral part of his or her life like they do with Reading and Writing and Math,” Kolhatkar told the Voice in an email. “In the world today, every job requires some knowledge of coding. In addition, it [coding] builds on their [students] problem solving, critical thinking and creative skills.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Event organizers aim to make the \"Code Fest\" a district wide event. <\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It is very exciting that we can organize the 'Code Fest' district-wide,” Kolhatkar said. “Our team includes teachers, a couple of administrators, parents and students from our elementary, middle and high school levels, making it a truly unified effort.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The \"Code Fest\" will overlay with the week-long \"Hour of Code,\" which is an event that was started by the nonprofit <\/span><a href=\"http:\/\/code.org\/\"><span style=\"font-weight: 400;\">code.org<\/span><\/a><span style=\"font-weight: 400;\"> three years ago to introduce computer science to students, according to Kolhatkar.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At the event, high schoolers will learn how to apply computer science in various ways.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“High schoolers can expect mobile devices and a range of robots,” Kolhatkar said. “Each of which will be accompanied by a set of challenges for various abilities. They will get hands-on time with every tool that they are introduced to. Each session is 50 minutes so they can work through at least one challenge with people guiding them if needed.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The event schedule will consist of three sessions during which students can experience some of 30 different areas of coding, ranging from iPads to robots, according to the \"Code Fest\" flyer. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">1:00-1:25: Event Kick-Off<\/span>\r\n\r\n<span style=\"font-weight: 400;\">1:30-2:25: Session 1<\/span>\r\n\r\n<span style=\"font-weight: 400;\">2:30-3:25: Session 2 <\/span>\r\n\r\n<span style=\"font-weight: 400;\">3:30-4:25: Session 3<\/span>\r\n\r\n<span style=\"font-weight: 400;\">4:30-4:50: Closing <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though the \"Code Fest\" will not make students masters at computer science, organizers hope that students will walk away with more interest in the field.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The program will introduce students to coding and go further in-depth with those who already have a basic knowledge,” Kolhatkar said. “Because one 50 minute session will not do justice to the range that is Computer Science, the hope is that everyone walks away with writing at least some lines of code, and with an excitement and eagerness to continue down the path, incorporating the skills into their lives.”<\/span>","excerpt":"The Palo Alto Unified School District will be hosting its first free Code Fest for K-12 students as an introduction to coding from  1 to 5 p.m. on Dec. 12 at JLS Middle School.","date":"2015-12-01 10:43:23","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Programming.jpg","categories":["News","Spotlight"],"tags":["code fest","computer science","java","pause"]},{"id":112463,"title":"Boys&#8217; water polo optimistic after disappointing finish to season","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/boys-water-polo-optimistic-after-disappointing-finish-to-season\/","content":"[caption id=\"attachment_112534\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/WaterPoloPractice1.jpg\"><img class=\"wp-image-112534\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/WaterPoloPractice1.jpg\" alt=\"Junior Andrew Jozefov looks to pass during the a Vikings' practice. Jozefov will look to lead the Vikings deep into the CCS playoffs next season. Photo by Cooper Lou.\" width=\"600\" height=\"405\" \/><\/a> Junior Andrew Jozefov looks to pass during the a Vikings' practice. Jozefov will look to lead the Vikings deep into the CCS playoffs next season. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School boys' water polo team (12-13, 8-6) looks improve and change its mentality next year after an unfortunate end to its season.\r\n\r\nDespite earning a first round bye, the Vikings' season ended after falling to Saint Francis High School last Saturday in the Central Coast Section Quarterfinal, 15-4. Last year, the team exited the playoffs one stage earlier.\r\n\r\nJunior Jared Stanley said he thought that the team could have done better in the CCS playoffs.\r\n\r\n“The past season went very well, but we were hoping to get a little bit further in CCS,” Stanley said. “It was disappointing to lose in the quarterfinals of CCS. It was also disappointing to not perform as we had expected to in the league tournament as we were hoping to play in the league final.”\r\n\r\nJunior Andrew Jozefov said that a lack of focus from the team ultimately led to its loss.\r\n\r\n“We had a few dedicated guys who performed well this year,” Jozefov said. “We didn't necessarily have everyone on the team working with the same mentality, which didn't exactly help the team.”\r\n\r\nJozefov said that the Vikings will have high goals going into next season.\r\n\r\n“Next year we plan on winning leagues and beating Gunn [High School] in league play,” Jozefov said. “Hopefully we can earn a good seed for CCS and get a bye into the semis so we have a solid chance at making some good things happen against some of the top private schools.”\r\n\r\nDespite losing eight seniors including Kevin Bowers, Justyn Cheung, Christian Laurence, Ryan Reed, Luke Coleman, Cameron Kahn and Winston Rosati, the Vikings are very optimistic for the future and believe they will have the experience necessary to do well in the CCS playoffs next year. According to Stanley, the team will have a majority of senior starters as there are many current juniors who can step up. However, even though the team will have enough experience, Stanley recognized the importance of the team's mentality.\r\n\r\n“We will have almost a full senior starting lineup next year and as a result hope to definitely be serious contenders for CCS finals,\" Stanley said. \"In order to do so we need to practice hard in the off season and treat every game like it's our last.","excerpt":"The Palo Alto High School boys' water polo team (12-13, 8-6) looks toward a fresh start next year after a disappointing end to its season.","date":"2015-11-30 20:50:12","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/WaterPoloPractice.jpg","categories":["Sports","Spotlight","water polo"],"tags":["boys water polo","CCS","jozefov","stanley","vikings","water polo"]},{"id":112531,"title":"ASB Movie Night &#8220;Home Alone&#8221; is this Friday, Dec. 4 in the Media Arts Center","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/asb-movie-night-home-alone-is-this-friday-dec-4-in-the-media-arts-center\/","content":"","excerpt":"","date":"2015-11-30 15:47:10","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112529,"title":"ASB Kickball Game is this Friday, Dec. 4 during lunch","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/asb-kickball-game-is-this-friday-dec-4-during-lunch\/","content":"","excerpt":"","date":"2015-11-30 15:45:39","author":"Josh Yuen","categories":["Ticker"],"tags":[]}]