[{"id":104797,"title":"Track and field to compete at CCS meet","permalink":"http:\/\/palyvoice.com\/2015\/05\/22\/track-and-field-to-compete-at-ccs-meet\/","content":"[caption id=\"attachment_104898\" align=\"alignnone\" width=\"496\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/KENNNNT.jpg\"><img class=\"wp-image-104898\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/KENNNNT.jpg\" alt=\"KENNNNT\" width=\"496\" height=\"360\" \/><\/a> Sophomore Kent Slaney takes the lead in the mile run at a meet against Los Gatos. Slaney placed third in the mile run at SCVALS and will be competing at CCS semifinals. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nThe Palo Alto High School track and field team will compete at the Central Coast Sectional semifinals at 2 p.m. Saturday at San Jose City College after success at the Santa Clara Valley Athletic League Meet last Friday.\r\n\r\nSeven Paly athletes and an additional three relay teams will be competing in over 10 events after placing in the top six in their events at the SCVALS meet. The girls’ team placed sixth out of 14 teams overall at SCVALs, while the boys’ team placed fourth out of 13 teams overall.\r\n\r\nAccording to coach Kelsey Feeley, the team has been training with less rigorous exercises to ensure good health for the event.\r\n\r\n“We kept this last week of training relatively light, working on fixing minor technical issues and focusing on keeping the body healthy and ready for competition,” Feeley said.\r\n\r\n[caption id=\"attachment_104900\" align=\"alignright\" width=\"184\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DAMIII.jpg\"><img class=\"wp-image-104900 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DAMIII.jpg\" alt=\"DAMIII\" width=\"184\" height=\"335\" \/><\/a> Junior Dami Bolarinwa competes in the 400 meter dash at a meet against Los Gatos. Bolarinwa placed third in the same event at SCVALS and will attend CCS semifinals. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nSome particularly successful Viking athletes include junior Eli Givens, who placed first in the 100 and 200 meter races, and sophomore Kent Slaney, who placed third in the mile run. However, each competitor is expected to perform well at the meet, according to Feeley.\r\n\r\n“All of the student-athletes who are competing this week have great chances of moving on to finals,\"Feeley said.\r\n\r\n\"They have put in a tremendous amount of work this season and are more than prepared to excel in trials,” Feeley said. “All of the coaches are beyond proud of the accomplishments that the kids have already achieved and can't wait to see it all pay off this weekend.”\r\n\r\nAccording to senior team captain Anna Dukovic, the team has been doing well this season.\r\n\r\n“Overall I think we have had a pretty good season,\" Dukovic said. \"Individually a lot of people have PR'd [beat their personal record].”\r\n\r\nDukovic says she is also looking forward to the event.\r\n\r\n\"All the athletes and teams are really good, so it will be fun to get the chance to run and jump against them,\" she said.\r\n\r\nAthletes who place in the top eight in track events and top 12 for most field events will move on to CCS Finals next Friday at 4 p.m.\r\n\r\nThe full results of the SCVAL meet can be viewed <a href=\"http:\/\/lynbrooksports.prepcaltrack.com\/ATHLETICS\/TRACK\/2015\/qual_res.pdf\">here<\/a>.","excerpt":"The Palo Alto High School track and field team will compete at the Central Coast Sectional semifinals at 2 p.m. Saturday at San Jose City College.\r\n","date":"2015-05-22 23:51:23","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/KENNNNT.jpg","categories":["Sports","Track and Field"],"tags":{"8568":"CCS","44682":"coach kasey","44681":"dash","9656":"eli givens","44678":"hurdles","11393":"kelsey feeley","8830":"kent slaney","8944":"palo alto high school","8953":"paly","9054":"running","18834":"scvals","44679":"semi finals","44680":"sprint","9153":"team","9181":"track","9183":"track and field"}},{"id":104758,"title":"History class project acknowledged in The New York Times","permalink":"http:\/\/palyvoice.com\/2015\/05\/22\/history-class-project-acknowledged-in-the-new-york-times\/","content":"An <a href=\"http:\/\/www.nytimes.com\/2015\/05\/21\/opinion\/gail-collins-tubman-versus-jackson.html\">opinion article<\/a> published in The New York Times yesterday featured a nod to Palo Alto High School's United States History classes and the projects their teacher, David Rapaport, sent to the article's author, Gail Collins.\n\nThe article, which was published both online and in print, discussed whether or not Harriet Tubman should replace Andrew Jackson on the $20 bill.\n\nTowards the middle of the article, Collins acknowledges the projects sent to her.\n\n\"A high school class in Palo Alto, Calif., sent me their huge stack of make-believe money with brand-new faces of both genders,\" Collins said. \"We will have to have a talk with whoever selected Tom Brady.\"\n\nThe dollar bill project, created by Rapaport, has been a part of his curriculum for 10 years and is one of the most memorable projects for the students in his classes.\n\n\"I do this project because I think it's important for students to confront their past and to use the symbols of their currency and also for them [to acknowledge] the fact that males dominate this particular expression,\" Rapaport said.\n\nRapaport had seen <a href=\"http:\/\/www.nytimes.com\/2015\/03\/21\/opinion\/gail-collins-a-womans-place-is-on-the-20-dollar-bill.html?rref=collection%2Fcolumn%2Fgail-collins\">this article<\/a>&nbsp;about women on the $20 bill written by Collins, whose work he loves, and decided that the student's work may be of relevance to Collins. He then sent a package of student work to Collins, not anticipating a response.\n\n\"It's terrific that this wonderful columnist recognized our work,\" Rapaport said.\n\nAccording to a student in U.S. History this year, the dollar bill project was enlightening.\n\n\"Having people share who they felt should be on the bill exposed me to national figures who had made significant contributions in society, some who have gone virtually unrecognized,\" junior Siddharth Srinivasan said.\n\nAnd as for the joke about the student who selected Tom Brady?\n\n\"It's funny because [that dollar] was actually made before the whole <a href=\"http:\/\/edition.cnn.com\/2015\/05\/11\/us\/nfl-deflategate-response\/\">Tom Brady incident<\/a>,\" Rapaport said.\n\nExamples from the past decade of the dollar bill project:\n\n[caption width=\"405\" id=\"attachment_104873\" align=\"alignleft\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/slick-bill16.jpg\"><img class=\"wp-image-104873\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/slick-bill16.jpg\" alt=\"slick bill[16]\" width=\"405\" height=\"183\"><\/a> Grace Slick[\/caption][caption width=\"411\" id=\"attachment_104870\" align=\"alignleft\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/anthony-bill161.jpg\"><img class=\"wp-image-104870\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/anthony-bill161.jpg\" alt=\"anthony bill[16]\" width=\"411\" height=\"183\"><\/a> Susan B. Anthony[\/caption]&nbsp;\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;\n\n[caption width=\"404\" id=\"attachment_104874\" align=\"alignleft\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/carlin-bill161.jpg\"><img class=\"wp-image-104874\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/carlin-bill161.jpg\" alt=\"carlin bill[16]\" width=\"404\" height=\"191\"><\/a> George Carlin[\/caption]\n\n[caption width=\"411\" id=\"attachment_104868\" align=\"alignleft\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/plath-bill.jpg\"><img class=\"wp-image-104868\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/plath-bill.jpg\" alt=\"plath bill\" width=\"411\" height=\"196\"><\/a> Sylvia Plath[\/caption]","excerpt":"An opinion article published in The New York Times yesterday featured a nod to Palo Alto High School's United States History classes and the projects their teacher, David Rapaport, sent to the article's author, Gail Collins.","date":"2015-05-22 18:46:57","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/carlin-bill16.jpg","categories":["News","Spotlight"],"tags":{"44761":"David Rapaport","44762":"dolllar bill project","44760":"Gail Collins","14163":"new york times","44763":"Tom Brady"}},{"id":104805,"title":"College map of Paly faculty","permalink":"http:\/\/palyvoice.com\/2015\/05\/21\/college-map-of-paly-faculty\/","content":"<p style=\"line-height: 14.25pt;\"><em>Below is an interactive college map that details the college(s) that Palo Alto High School faculty members attended. This map will be updated as more information is made available.<\/em><\/p>\r\nAs Palo Alto High School seniors prepare to say goodbye to Paly, each student embarks on his or her respective journey around the world, whether it be to a different college or country. Amidst the end-of-the-year celebrations, it's easy to forget that each of our teachers made similar decisions not long ago. The Paly Voice gathered data from Paly faculty members to mark where each of them attended college.\r\n\r\n<iframe style=\"line-height: 14.25pt;\" src=\"https:\/\/takaakisagawa.cartodb.com\/viz\/74cd7d5c-f60c-11e4-8276-0e018d66dc29\/embed_map\" width=\"100%\" height=\"520\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nThe faculty members, who have experienced these same transitional phases while attending different alma maters, are in a strong position to share words of wisdom with students who are exploring or venturing into the next step of their lives.\r\n\r\nCollege adviser Sandra Cernobori, who transferred from a community college to a public university after two years, advocates for students to consider all types of post-high school paths.\r\n\r\n\"College isn't for everyone,” Cernobori said. “I think taking a gap year can be wonderful for many students and an opportunity to take a break to relax and recharge.\"\r\n\r\nEnglish teacher Melissa Laptalo, who attended a public university, advises students to be flexible with the major at their chosen college.\r\n\r\n\"Stay open-minded about what you're pursuing in terms of your major,\" Laptalo said. \"What people came into college thinking that they were interested in shifted, especially given the different classes that they took for their general education.\"\r\n\r\nAfter having a positive experience at the College of San Mateo, Cernobori recommends a community college pathway, despite <a href=\"http:\/\/palyvoice.com\/2015\/01\/29\/opinion-destigmatize-community-college\/\">the stigma<\/a> around many community colleges.\r\n\r\n\"I think there's a stigma that somehow it [community college] is less rigorous or interesting, or not a real college,” Cernobori said. “I think that it is what you make of it and that it can be a very enriching experience.\"\r\n\r\nPrincipal secretary Carolyn Benfield believes that in the end, it is one's character that will define the person, not the college he or she attended.\r\n\r\n\"I think that there comes a time in your life when your identity is not wrapped up in where you went to college,” Benfield said. “When you're 18, that's a huge part of who you think you are. What people are going to care about is how interesting you are, how kind you are, how fun you are to be with, and someday, what kind of parent you are.\"","excerpt":"As the school year wraps up and students prepare to embark on the next step in their life, it's easy to forget that each of our teachers underwent similar processes not long ago. The Paly Voice gathered data from Paly faculty members to mark where each of them attended college, as well as to ask for personal advice.","date":"2015-05-21 23:23:32","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-21-at-6.19.41-PM.png","categories":["Multimedia","Spotlight"],"tags":{"19460":"2015","8458":"administration","33420":"advice","8604":"college","44765":"college map","8611":"Community","44766":"faculty","29801":"interactive","10028":"map","9090":"seniors","9123":"Staff","9152":"teachers","9198":"University","9214":"voice"}},{"id":104414,"title":"Bracelets support Adolescent Counseling Services","permalink":"http:\/\/palyvoice.com\/2015\/05\/21\/bracelets-support-adolescent-counseling-services\/","content":"[caption id=\"attachment_104659\" align=\"aligncenter\" width=\"638\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11182656_942516342436667_4981567885679502007_o.jpg\"><img class=\"wp-image-104659\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11182656_942516342436667_4981567885679502007_o.jpg\" alt=\"11182656_942516342436667_4981567885679502007_o\" width=\"638\" height=\"327\" \/><\/a> An assortment of hand-made beaded wrap-style bracelets are now available for sale for $25. Clockwise from top left: Turquoise, Black Diamond, Teal &amp; Gold, Rose &amp; Gold and Autumn Mix. Photo by Claire Chevallier.[\/caption]\r\n\r\nTwo Palo Alto High School seniors are selling an assortment of beaded bracelets to support the school's Adolescent Counseling Services.\r\n\r\nHeaded by seniors Claire Chevallier and Emma Chiu, bracelet sales began in early May. One hundred percent of the profit will be going to ACS, according to Chevallier. They were inspired to support ACS after the string of student deaths in the fall and winter.\r\n\r\n\"So many people go to counseling, more than you would think,\" Chevallier said. \"They directly work with the teens to make them feel better, which I think is honestly the best way to help make this place a better community. They give love to students that don't have it.\"\r\n\r\n[caption id=\"attachment_104760\" align=\"alignright\" width=\"363\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_7447.jpg\"><img class=\"wp-image-104760\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_7447.jpg\" alt=\"IMG_7447\" width=\"363\" height=\"273\" \/><\/a> One of the creators of the bracelets, senior Claire Chevallier models one of the wrap-styles. Photo by Maddy Jones.[\/caption]\r\n\r\nAccording to ACS, one in five young people experience a significant mental or emotional health issue during adolescence, and only 30 percent will receive treatment. Chevallier's <a href=\"https:\/\/www.facebook.com\/claire.chevallier.10\/posts\/942516742436627?pnref=story%20\">Facebook post<\/a> states that \"your purchase can help ensure that ACS will continue making differences in Paly students' lives.\"\r\n\r\n\"It took a lot of perseverance to get here,\" Chevallier said. \"At one point, I was thinking of canceling the whole project, but because I persevered, I was able to make it happen and I'm really glad that I did.\"\r\n\r\nBracelets are wrap-style beaded which are hand made by Chevallier and Chiu. Currently, all bracelets are hand delivered, but the business has hopes of expansion in the near future. They are currently selling for $25 and can be <a href=\"https:\/\/www.facebook.com\/claire.chevallier.10\/posts\/942516742436627?pnref=story%20\">bought<\/a> by contacting Chevallier or Chiu through Facebook.","excerpt":"Two Palo Alto High School seniors are selling an assortment of beaded bracelets to support the Adolescent Counseling Services. They are currently selling for $25 and can be bought by contacting Claire Chevallier or Emma Chiu through Facebook.","date":"2015-05-21 15:41:55","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_7447.jpg","categories":["News","Spotlight"],"tags":{"8455":"ACS","44630":"bracelets","10257":"charity","34130":"Claire Chevallier","11240":"emma chiu","44764":"handmade"}},{"id":104727,"title":"&#8220;Senior Cut Day&#8221; in numbers","permalink":"http:\/\/palyvoice.com\/2015\/05\/21\/senior-cut-day-in-numbers\/","content":"Four hundred forty-two Palo Alto High School seniors were absent for at least one class period on Monday, accounting for over 92 percent of the Class of 2015, according to school Attendance Secretary Karla Larson.\r\n\r\nTraditionally, the first Monday after the end of AP testing, the graduating class partakes in an unofficial \"Senior Cut Day\" that often includes camping and going to the beach. The attendance office received about 200 messages from parents excusing their children from school on Monday, according to Larson.\r\n\r\n\"It took me a good portion of the morning <span style=\"color: #252525;\">—<\/span> a few hours at least <span style=\"color: #252525;\">—<\/span> to get through everything [phone calls and emails from parents],\" Larson said.\r\n\r\nDespite the dramatic attendance drop, Larson said this number is fairly normal.\r\n\r\n\"I think it's pretty common each year to have the same high volume [of absences],\" Larson said.\r\n\r\nSocial Studies teacher Melinda Mattes instructs three AP Psychology classes and one Sociology class, which are senior-only and senior-dominant classes, respectively. Mattes reported seeing just five of her senior students on Monday, although this low attendance number is also quite typical for her on \"Senior Cut Day.\"\r\n\r\nThe following senior attendance data below was given to The Paly Voice by Larson.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/6232612-senior-cut-day-2015-in-numbers\" width=\"600\" height=\"1792\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Four hundred forty-two Palo Alto High School seniors were absent for at least one class period on Monday, accounting for over 92 percent of the Class of 2015, according to school Attendance Secretary Karla Larson. See this and more data from \"Senior Cut Day\" in a graphic arranged by The Paly Voice.\r\n","date":"2015-05-21 13:07:27","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-21-at-3.38.17-PM.png","categories":["Multimedia","News"],"tags":[]},{"id":104285,"title":"Boys&#8217; tennis ends season falling short of CCS placement","permalink":"http:\/\/palyvoice.com\/2015\/05\/20\/boys-tennis-ends-season-falling-short-of-css-placement\/","content":"[caption width=\"634\" id=\"attachment_104253\" align=\"alignnone\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-14-at-12.57.49-PM.png\"><img class=\"wp-image-104253\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-14-at-12.57.49-PM.png\" alt=\"TThe Palo Alto High School varisty boys' tennis team poses for a picture after winning at the California Tennis Classic Division 3 tournament. The team did not make the Central Coast Selection  cut and hopes to improve next season. Photo by Henry Badger. The Palo Alto High School varisty boys' tennis team poses for a picture after winning at the California Tennis Classic Division 3 tournament. The team fell short of making Central Coast Selections and hopes to improve next season. Photo by Henry Badger.\" width=\"634\" height=\"399\"><\/a> The Palo Alto High School varisty boys' tennis team poses for a picture after winning the California Tennis Classic Division 3 tournament in March. Photo by Susan Embersits.[\/caption]The Palo Alto High School boys’ tennis team (10-10, 2-10) wrapped up its season this month, falling just short of Central Coast Sectional Championships placement.\n\n“Our league is pretty tough so a record of 10-10 isn’t bad given how young we are,\" junior Shiv Matta said.\n\nThe team&nbsp;will lose four seniors this year— Raymond Li, Eric Lu, Chris Garcia and Kevin Huang.\n\n“Next year we will recruit some good freshmen and hopefully make a stronger impact in our tough league and show our presence to other teams,” sophomore Henry Badger said.\n\nDespite the loss of many players, the boys' have&nbsp;been training hard this season, according to Matta.\n\n\"We've done well in just keeping our heads up and working hard in practice to improve,\" Matta said. \"Sophomore Henry Badger has improved a lot and I'm proud of the progress he's making.\"\n\nBadger said that although the team did not make CCS, he still enjoyed the bonding experiences at tournaments.\n\n\"Unfortunately we didn't make CCS, but we are happy that we competed with the best and we look forward to next year,” Badger said. “I really enjoyed the team bonding this year, from our trip to Fresno, to just having practice on the court.”\n\nAs for next season, Matta has high hopes for the team.\n\n“We were a young team so this season went pretty&nbsp;well,” Matta said. “Hopefully next year will be better and we will make CCS.”","excerpt":"The Palo Alto High School boys’ tennis team (10-10) wrapped up its season this past month, falling short of  Central Coast Selection Championships placement.\r\n","date":"2015-05-20 21:41:07","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-14-at-12.57.49-PM.png\nThe Palo Alto High School varisty boys&#039; tennis team poses for a picture after winning at the California Tennis Classic Division 3 tournament. The team fell short of making Central Coast Selections and hopes to improve next season. Photo by Henry Badger.\" \/>","categories":["Sports"],"tags":{"11724":"boys tennis","44395":"henry badger","8944":"palo alto high school","8953":"paly","25274":"paly tennis","44396":"shiv matta","10016":"tennis"}},{"id":104093,"title":"Tuesday Tunes: Principal Kim Diorio","permalink":"http:\/\/palyvoice.com\/2015\/05\/19\/tuesday-tunes-principal-kim-diorio\/","content":"<p>[caption id=\"attachment_104647\" align=\"alignnone\" width=\"394\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11117796_10207252196567568_1812902750_n.jpg\"><img class=\" wp-image-104647\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11117796_10207252196567568_1812902750_n.jpg\" alt=\"Kim Diorio listens to her favorite tunes wearing earbuds that match the color of her scarf. Photo by George Lu. \" width=\"394\" height=\"591\" \/><\/a> Kim Diorio listens to her favorite tunes wearing earbuds that match the color of her scarf. Photo by George Lu.[\/caption]<\/p>\r\n<p>This week, The Paly Voice sat down with Palo Alto High School Principal Kim Diorio to ask her to compile a list of a few of her favorite songs.<\/p>\r\n<p>According to Diorio, she enjoys seeing her daughter share the same pleasure that she has while listening to music.<\/p>\r\n<p>\"She [my daughter] is really into whatever's on the radio and dancing,\" Dioro said. \"We do dance parties at our house now — we just turn the radio on and we’ll do Katy Perry radio or something.\"<\/p>\r\n<p>Some of her song choices remind her of a specific memory or person.<\/p>\r\n<p><iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Aclairekrugler%3Aplaylist%3A7HxISSgTNH06Tsw4Ir95Gs\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe><\/p>\r\n<p>Rio – Duran Duran (reminds her of her first crush\/ first favorite band)<\/p>\r\n<p>Let It Go – Idina Menzel (reminds her of her children)<\/p>\r\n<p>What A Wonderful World – Louis Armstrong (reminds her of her father)<\/p>\r\n<p>Crush – Dave Mathews Band (reminds her of her wedding)<\/p>\r\n<p>Billie Jean – Michael Jackson<\/p>\r\n<p>Fragile – Sting<\/p>\r\n<p>In My Life – Beatles (reminds her of her mother-in-law)<\/p>\r\n<p>Like I Love You – Justin Timberlake<\/p>\r\n<p>Sugar – Maroon 5<\/p>\r\n<p>Beautiful Day – U2<\/p>\r\n","excerpt":"This week, The Paly Voice sat down with Paly Principal Kim Diorio to ask her to compile a list of a few of her favorite songs.","date":"2015-05-19 19:12:39","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11117796_10207252196567568_1812902750_n2.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":{"44644":"Beautiful Day","44639":"Billie Jean","44638":"Crush","8644":"diorio","44640":"Fragile","44641":"In My Life","44647":"kim","8834":"Kim Diorio","44636":"Let It Go","44642":"Like I love You","9013":"principal","44635":"Rio","44634":"songs","44643":"Sugar","42416":"Tuesday Tunes","44637":"What A Wonderful World"}},{"id":104622,"title":"Viking Best of the Best Sports Fest 2015 results","permalink":"http:\/\/palyvoice.com\/2015\/05\/19\/viking-best-of-the-best-sports-fest-2015-results\/","content":"Palo Alto High School's Associated Student Body is hosting its first annual <a href=\"http:\/\/palyvoice.com\/2015\/05\/14\/preview-asb-debuts-spring-sports-festival\/\" target=\"_blank\">Viking Best of the Best Sports Fest<\/a>, in which six teams of 10 compete in volleyball, ultimate frisbee and flag football competitions from Tuesday to Thursday. Friday will feature a relay race to determine the tournament's champion. Below are the results of the competition, updated daily.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/6231586-viking-best-of-the-best-2015\" width=\"620\" height=\"2438\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Palo Alto High School's Associated Student Body is hosting its first annual Viking Best of the Best Sports Fest, in which six teams of 10 compete in volleyball, ultimate frisbee and flag football competitions from Tuesday to Thursday and a relay race on Friday.","date":"2015-05-19 13:56:46","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-19-at-4.01.30-PM1.png","categories":["Multimedia"],"tags":{"8496":"ASB","44632":"best of the best","12848":"competition","10046":"contest","44646":"flag football","8944":"palo alto high school","9762":"relay","44387":"Spring Sports Festival 2015","9175":"tournament","44645":"ultimate frisbee","44633":"viking best of the best sports fest","9216":"volleyball"}},{"id":104551,"title":"Slideshow: Theater department honors graduating seniors","permalink":"http:\/\/palyvoice.com\/2015\/05\/19\/slideshow-theater-department-honors-graduating-seniors\/","content":"The annual Palo Alto High School theater department's senior showcase allows the program to recognize the work its seniors have put into theater. This year's senior showcase once again proved to be a success. \n\n\"Senior Showcase is a night where underclassmen present each senior individually and talk about how great they are,” junior Sophie Swezey said. According to Swezey, each underclassman talks about their senior anonymously until finally revealing their identity at the end.\n\nAs the night went on, Paly theater teacher Kathleen Woods gave awards and a different theater-related book to each senior.\n\nThis tradition has been going on in the theater department for many years, according to Woods.\n\n“I love it [this tradition] and I will keep continuing it,” Woods said. “Some of the awards I give are traditional awards, some are named after famous people, and some of them are new. I just try to reflect a little bit on the journey I’ve had with the seniors the past one to four years. It is just my way of giving back to the seniors.”\n\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AMAAjg8elnYY\" width=\"600\" height=\"800\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The annual Palo Alto High School theater department's senior showcase allows the program to recognize the work its seniors have put into theater. This year's senior showcase once again proved to be a success.","date":"2015-05-19 13:44:31","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/SENIORS.jpg","categories":["Entertainment"],"tags":{"8654":"drama","29689":"kathleen woods","8944":"palo alto high school","8953":"paly","18257":"senior showcase","33459":"sophie swezey","9160":"theatre"}},{"id":104633,"title":"AP Literature meeting at lunch on Friday, May 29 in Writing Center","permalink":"http:\/\/palyvoice.com\/2015\/05\/19\/ap-literature-meeting-at-lunch-on-friday-may-29-in-writing-center\/","content":"","excerpt":"","date":"2015-05-19 13:23:34","author":"Jeanette Wong","categories":["Ticker"],"tags":[]}]