[{"id":108736,"title":"Advisory this week is for all sophomores, all seniors and select freshmen (A-K)","permalink":"http:\/\/palyvoice.com\/2015\/09\/26\/advisory-this-week-is-for-all-sophomores-all-seniors-and-select-freshmen-a-k\/","content":"","excerpt":"","date":"2015-09-26 19:16:17","author":"Josh Yuen","categories":["Ticker"],"tags":{"8462":"Advisory","8721":"freshmen","9085":"senior","29301":"sophomore"}},{"id":107477,"title":"Voice of the Week: Ashlyn Callan","permalink":"http:\/\/palyvoice.com\/2015\/09\/25\/voice-of-the-week-ashlyn-callan\/","content":"[caption width=\"293\" id=\"attachment_107553\" align=\"aligncenter\"]<img class=\"wp-image-107553\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Ashlyn.jpg\" alt=\"Ashlyn\" width=\"293\" height=\"415\"> Freshman Ashylyn Callan speaks to The Paly Voice about her experiences on varsity volleyball. Callan chose volleyball as her sport after growing a passion to be the best. \"It's frustrating when you see all these girls who can hit really hard and they can jump really high and you keep making mistakes,\" Callan said. \"So I started working with a private coach and I took notes of the things he said, I have a whole notebook at home. I reviewed those before every time before I play.\"[\/caption]This week, The Paly Voice sat down with freshman volleyball player Ashlyn Callan to discuss how she made varsity, how the upperclassmen treat her and of course, volleyball.\n\nThe Paly Voice: You made varsity volleyball your freshman year, congratulations. How did you prepare for your tryouts mentally and physically?\n\nAshlyn Callan: This whole summer I have been doing a bunch of different camps. I do it every summer because it's fun. The week before tryouts, I took it a little bit easier so that I could be ready. I didn't want to go all out and be sore for the first day of tryouts, because that's never good. I also went to all the open gyms.\n\nTPV: “Did you expect to make varsity?”\n\nAC: Not at all. The head coach Jekara Wilson invited me to varsity tryouts and that's as far as I expected to go, because it is an accomplishment to even get invited because only six freshmen were. I was so happy because it's just amazing.\n\nTPV: You said you were excited to make varsity, could you elaborate on how you felt when you were told that you were going to be on varsity volleyball?\n\nAC: So my dad came downstairs and she [Wilson]&nbsp;&nbsp;sent out an email, he came downstairs and said “Bad news Ash” and I was like “Oh that’s okay, next year, I guess” and he said “No, look you made it” and I was like “What!”.\n\nTPV: How much more competitive is varsity volleyball compared to your club [Red Rock Volleyball Club]?\n\nAC: It’s similar but different at the same time. Red Rock is all about power and hard hits and digging everything and consistency, consistency. At Paly it's like they are all amazing players too, but it's more about strategy. It's different strategies. But the girls here are smarter, they are so good.\n\nTPV: Last year a current sophomore named Chelsea Fan made varsity as a freshman and the year before that Jessica Lee made varsity as a freshman, have you talked to them about tips and what it is like being a freshman. Do you feel like you have shoes to fill?\n\nAC: They are both amazing players. I haven’t talked to them specifically, but I have talked to Claire Dennis who&nbsp;made it her freshman year, she has been really, really nice and supportive and really helpful to me. She congratulated me when I made the team. She texted me when we got the roster saying “Congratulations, that's great. I was in your shoes a couple years ago and it was really tough but at the same time it was the best season I ever had and I hope you have the same experience I do,\" That was really nice that she would do that.\n\nTPV: What is the vibe on the team like?\n\nAC: It’s really good. Coach Wilson really emphasized in tryouts that you need good chemistry as a team or else it doesn’t go well, because you need communication. Volleyball is a team sport so all the girls have to be super supportive.&nbsp;Sometimes you need to yell at somebody for something they did wrong, but they do it nicely. It’s good. We play well together.\n\nTPV: A lot of times freshmen don't get a lot of playing time on varsity teams. How do you feel about that? Was there ever a thought about not playing varsity and instead playing junior varsity so you could get more playing time?\n\nAC: Well I did the same thing for club. I played Red Rock and didn't get much playing time at all but you have to work for your playing time, no matter how good you are. Just by practicing with the girls, I have developed so much, that it is worth it for me to stay even if I don’t play that much. It's worth it. I think we play five sets and some teams in our league aren't as good so hopefully I get to play.","excerpt":"This week, The Paly Voice sat down with Freshman volleyball player Ashlyn Callan, to discuss how she made varsity, upperclassmen, and her love for volleyball. ","date":"2015-09-25 14:44:52","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_20891.jpg","categories":["Sports","Voice of the Week"],"tags":{"52320":"Ashlyn Callan","9795":"freshman","9200":"varsity","9216":"volleyball"}},{"id":108556,"title":"New program aims to expand student research opportunities","permalink":"http:\/\/palyvoice.com\/2015\/09\/24\/new-program-aims-to-expand-student-research-opportunities\/","content":"[caption id=\"attachment_108614\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/edited.jpg\"><img class=\" wp-image-108614\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/edited.jpg\" alt=\"Juniors Johnny Rohrbach and Meredith Cummings conduct a science experiment. Advanced Authentic Research will provide students the ability to carry out experiments much like the ones in class, though they will be responsible for designing their own research. Photo by Adrienne Kwok.\" width=\"613\" height=\"460\" \/><\/a> Juniors Johnny Rohrbach and Meredith Cummings conduct a science experiment during chemistry class. Advanced Authentic Research, a new student research program, will also provide students with the opportunity to carry out experiments, though they will be responsible for designing their own research. \"A program where high schoolers can create their own thesis and research a topic of their choosing would be beneficial towards a student's education and interesting for students,\" Cummings said. Photo by Adrienne Kwok.[\/caption]\r\n\r\nThe application deadline for Advanced Authentic Research, a program that will allow Palo Alto Unified School District high school students to showcase their applied research skills in a variety of academic subjects, is approaching on Sept. 25.\r\n\r\nAccording to AAR Coordinator Jeong Choe, students will be responsible for creating a specific thesis and researching their own topics. Students can conduct  research on a multitude of themes, including history, psychology, business and sports.\r\n\r\n“The program is a unique opportunity for students in grades 10-12,” Choe said. “It is designed for students with interest, passion, curiosity and perseverance to investigate an authentic topic of their choosing.”\r\n\r\nIn addition, students will be paired with a mentor knowledgeable in the chosen area of research, according to Choe.\r\n\r\n“They [Mentors] will support and facilitate each student’s work in their own laboratories, offices and other settings,” Choe said. “If students are conducting surveys, they may be at another place. If students are doing computational work, the place may be flexible.”\r\n\r\nThis year, students will participate in the program on their own time after school or during the weekend this year, but starting next year the program will be incorporated into a 7th Period class, according to PAUSD Deputy Supt. Markus Autrey.\r\n\r\nStudents will receive 10 Career Technical Education school credits for completing the program and working for a minimum of 60 hours per semester, though the scheduling is flexible. The class is pass or fail, according to Choe, and progress report will be collected from participants in February.\r\n\r\n“Some students may choose to spend more time than this based on their development of interests and passion in their research project,” Choe said.\r\n\r\nWhile the program is similar to Paly’s Science Research Project program, AAR is not limited to science-related topics.\r\n\r\n“You can view AAR as an expansion of SRP,” Choe said. “SRP has a science focus and a lab component is a crucial piece. In AAR, we are giving opportunities to all the other disciplines.”\r\n\r\nAccording to Choe, students will begin researching their topics in October and finalize their findings in May.\r\n\r\nBoth Paly and Gunn High School are providing the program for its inaugural year.\r\n\r\nGunn High School AAR liaison Angela Merchant says AAR is an excellent program for students.\r\n\r\n“We are looking forward to organizing and implementing this great opportunity for kids,” Merchant said.\r\n\r\n<a href=\"http:\/\/www.pausd.org\/sites\/default\/files\/pdf-faqs\/attachments\/ApplicationAAR-Fillable.pdf\">Applications<\/a> are due through an email to Choe at jchoe@pausd.org. For more information, contact math teacher and AAR Teacher on Special Assignment Deanna Chute at dchute@pausd.org.","excerpt":"New educational program Advanced Authentic Research is aiming to provide high school students with the opportunity to conduct research on various topics including science, history, sports and business.","date":"2015-09-24 19:45:47","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/edited.jpg","categories":["News"],"tags":{"56310":"aar","56311":"advanced","56480":"advanced authentic research","8470":"Alto","56308":"angela","56312":"authentic","56307":"chute","56315":"cummings","56306":"deanna","8751":"gunn","8763":"High","56316":"johnny","56318":"matthew","56309":"merchant","56314":"meredith","8912":"new","8938":"Palo","8953":"paly","29027":"project","39964":"research","56317":"rohrbach","9068":"School","9072":"science","56313":"srp"}},{"id":108657,"title":"SatireDay Cartoon 1","permalink":"http:\/\/palyvoice.com\/2015\/09\/24\/satireday-cartoon-1\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-24-at-10.56.29-AM.png\"><img class=\"alignnone size-full wp-image-108658\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-24-at-10.56.29-AM.png\" alt=\"Screen Shot 2015-09-24 at 10.56.29 AM\" width=\"800\" height=\"512\" \/><\/a>","excerpt":"Check out our latest cartoon. ","date":"2015-09-24 11:24:31","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-24-at-10.56.29-AM.png","categories":["Satire Day"],"tags":{"29624":"classroom","56517":"comic","34110":"funny","8848":"Library","56516":"satire","11060":"tutorial"}},{"id":108162,"title":"Student photographers offer alternative for senior portraits","permalink":"http:\/\/palyvoice.com\/2015\/09\/24\/student-photographers-offer-alternative-for-senior-portraits\/","content":"Due to a <a href=\"http:\/\/palyvoice.com\/2015\/09\/03\/yearbook-expands-senior-photo-options\/\">change in regulations<\/a> for Palo Alto High School senior portraits this year, individuals can now submit their own photos, opening up a new industry for student photographers.\r\n\r\nMeet some of Paly's skilled and accessible young student senior portrait photographers, available for those in need of cheaper, but high quality portraits:\r\n\r\n[caption id=\"attachment_108166\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1902.jpg\"><img class=\"size-full wp-image-108166\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1902.jpg\" alt=\"Senior Karina Chan. &quot;You’re really getting a bang for your buck,&quot; Chan said. &quot;It won’t cost extra to get rid of a watermark or anything like that, so it [getting pictures taken by students] makes a lot of sense.&quot; Photo by Emma van der Veen.\" width=\"600\" height=\"425\" \/><\/a> Senior Karina Chan. \"You’re really getting a bang for your buck,\" Chan said. \"It won’t cost extra to get rid of a<br \/>watermark or anything like that, so it [getting pictures taken by students] makes a lot of sense.\"<br \/>Photo by Emma van der Veen.[\/caption]<strong>Karina Chan:<\/strong>\r\nSenior Karina Chan was the first of multiple students to offer their services as a senior portrait photographer. Chan enjoys taking photos at the Stanford Dish and around Stanford University campus. Although Chan has never taken paid portraits before, she often takes photos of her friends. She became interested in offering her services for senior portraits in order to use the proceeds to fund her senior trip, a tradition at Paly.\r\n\r\n\"The closest it’ll get to is like taking somebody’s profile picture, which is very laid back,\" Chan said. \"But it’s the same thing pretty much, you just have to be more aware of making people look perfect and think about like what it’s [the photo] going to look like in the yearbook.\"\r\n\r\nIf interested, students can set up a meeting time through Facebook. Sessions are $30 for a half hour and $60 for an hour. This payment includes a post-shooting photo choosing time, any edits to the photos and a guaranteed offer that the portraits will fit yearbook requirements.\r\n\r\nTo see some of Chan's work, visit her online portfolio at <a href=\"karina-chan-photography.tumblr.com\">karina-chan-photography.tumblr.com<\/a>.\r\n\r\n[caption id=\"attachment_108165\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0217.jpg\"><img class=\"size-full wp-image-108165\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0217.jpg\" alt=\"Senior Will Dougall. &quot;I just didn’t feel like it was right to make friends pay for pictures that should be free,&quot; Dougall said. Photo by Emma van der Veen.\" width=\"600\" height=\"425\" \/><\/a> Senior William Dougall. \"I just didn’t feel like it was right to make friends pay for pictures that should be free,\" Dougall said. Photo by Emma van der Veen.[\/caption]\r\n\r\n<strong>William Dougall:<\/strong>\r\nSenior William Dougall made himself a senior portrait photographer because he thought the high prices of professional photographer portraits seemed unreasonable.\r\n\r\n\"I know a lot of friends who wanted senior pictures, and I have the resources to do it [take their portraits],\" Dougall said. \"I felt bad for people who are paying a whole lot of money for senior portraits, so I made myself available.\"\r\n\r\nDougall has participated in three National Geographic photography workshops for photography, submitted photos to Scholastic Arts and submitted to national photography competitions. Dougall is currently the staff photographer for Paly's Verde Magazine. According to Dougall, his favorite place to take pictures is at Skyline during sunset, which makes for very great lighting.\r\n\r\nDougall is offering his photography services for free to his close friends, and is welcoming others to contact him through Facebook messenger.\r\n\r\nTo see some of Dougall's work, visit his online portfolio at <a href=\"http:\/\/williamdougall.22slides.com\/\">http:\/\/williamdougall.22slides.com\/<\/a>\r\n\r\n[caption id=\"attachment_108167\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2017.jpg\"><img class=\"size-full wp-image-108167\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2017.jpg\" alt=\"Senior Alisha Kumar. &quot;I love taking pictures in San Francisco,&quot; Kumar said. &quot;It’s something I like to do for fun.&quot; Photo by Emma van der Veen.\" width=\"600\" height=\"425\" \/><\/a> Senior Alisha Kumar. \"I love taking pictures in San Francisco,\" Kumar said. \"It’s something I like to do for fun.\"<br \/> Photo by Emma van der Veen.[\/caption]\r\n\r\n<strong>Alisha Kumar:<\/strong>\r\nSenior Alisha Kumar has previously taken pictures for her friends and loves it. According to Kumar, it's something she does for fun.\r\n\r\n\"I guess they liked having me take them [their pictures],\" Kumar said. \"Once word got out that you could get anyone to take your [senior] pictures, a whole bunch of them asked for me to take their senior pictures.\"\r\n\r\nShe has taken school photography classes and has taught herself techniques, as well. She especially enjoys taking photos in San Francisco.\r\n\r\nKumar is not charging for taking senior portraits and can be contacted through Facebook messenger.\r\n\r\nTo see some of Kumar's work, visit her blog <a href=\"bythebreezeblog.com\">bythebreezeblog.com<\/a>\r\n\r\n[caption id=\"attachment_108168\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2018.jpg\"><img class=\"size-full wp-image-108168\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2018.jpg\" alt=\"Senior Ashley Crichton. &quot;I have done stuff like this [taking portraits] before, but I've never been paid for it,&quot; Crichton said. Photo by Emma van der Veen.\" width=\"600\" height=\"425\" \/><\/a> Senior Ashley Crichton. \"I have done stuff like this [taking portraits] before, but I've never been paid for it,\" Crichton said. Photo by Emma van der Veen.[\/caption]<strong>Ashley Crichton:<\/strong>\r\nSenior Ashley Crichton chose to offer her services as a senior portrait photographer because she often takes photographs anyway, so the profits are simply an additional benefit for an activity she enjoys.\r\n\r\n\"I would be taking pictures in my free time anyway, so why not make money at the same time,\" Crichton said.\r\n\r\nCrichton's credentials include the current robotics team's photographer, publication in National Geographic Magazine and other various awards. Gamble Gardens and Stanford are among her favorite locations to take portraits.\r\n\r\nPortrait sessions are a minimum of one hour long, priced at $50 per hour. Contact Crichton through Facebook messenger.\r\n\r\nTo see some of Crichton's work, visit her blog at <a href=\"https:\/\/initfortheart.wordpress.com\/\">https:\/\/initfortheart.wordpress.com\/<\/a>\r\n\r\n[caption id=\"attachment_108555\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2264.jpg\"><img class=\"size-full wp-image-108555\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2264.jpg\" alt=\"Senior Danielle Bisbee. &quot;A friend of mine asked me to take hers and I decided to offer to take others'[senior portraits],&quot; Bisbee said. Photo by Emma van der Veen.\" width=\"650\" height=\"425\" \/><\/a> Senior Danielle Bisbee. \"A friend of mine asked me to take hers and I decided to offer to take others' [senior<br \/>portraits],\" Bisbee said. Photo by Emma van der Veen.[\/caption]<strong>Danielle Bisbee:<\/strong>\r\nSenior Danielle Bisbee was first asked by a friend to take her senior portrait, so she decided to expand and make herself available to others as well. Bisbee especially enjoys taking photos at Foothill Park and Gamble Gardens and has a lot of experience in photography.\r\n\r\n\"I took Advanced Photo and AP [Advanced Placement] Studio Art,\" Bisbee said. \"I've been taking portraits with one of my friends since before freshman year.\"\r\n\r\nBisbee is offering her services free of charge for up to one hour of shooting. Contact her through Facebook messages.\r\n\r\nTo see some of Bisbee's work, visit her online portfolio at <a href=\"http:\/\/daniellebisbeephoto.tumblr.com\">http:\/\/daniellebisbeephoto.tumblr.com<\/a>.","excerpt":"Due to a change in regulation for Palo Alto High School senior portraits this year, individuals can now submit their own photos, opening up a new industry for student photographers.","date":"2015-09-24 10:58:34","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0217.jpg","categories":["Features","Slideshow","Spotlight"],"tags":{"8944":"palo alto high school","8953":"paly","49106":"photographers","8987":"photography","56302":"portraits","9085":"senior","9129":"student"}},{"id":108331,"title":"Preview: Vikings&#8217; look to gain momentum against Oak Grove","permalink":"http:\/\/palyvoice.com\/2015\/09\/24\/preview-vikings-look-to-gain-momentum-against-oak-grove\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_107980\" align=\"alignnone\" width=\"702\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_img_1343.jpg\"><img class=\"size-full wp-image-107980\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_img_1343.jpg\" alt=\"Senior wide receiver Eli Givens awaits the snap as quarterback Justin Hull checks at the line of scrimmage in a game against San Benito. Hull and Givens, along with lineman Mikey Grandy and linebacker\/fullback Tak Nishi, are this year's team captains. Photo by Ethan Kao. \" width=\"702\" height=\"419\" \/><\/a> Senior wide receiver Eli Givens awaits the snap as quarterback Justin Hull checks at the line of scrimmage in a game against San Benito. Hull and Givens, along with lineman Mikey Grandy and linebacker\/fullback Tak Nishi, are this year's team captains. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Palo Alto High School football team (1-2, 0-0) is looking to move past last week's 52-28 loss to the Archbishop Mitty Monarchs (3-0, 0-0) and secure a victory at home over the winless Oak Grove Eagles (0-2, 0-0). The game will kick off at 7:30 p.m. on Friday, Sept. 25.\r\n\r\nLast Friday, the Vikings were able to keep up with the Monarchs for nearly three quarters, tying the game at 28 apiece on a connection between senior quarterback Justin Hull and senior wide receiver Riley Schoeben midway through the third quarter. The Monarchs, who came into the game ranked 54th in California, according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/archbishop-mitty-monarchs-(san-jose,ca)\/football\/home.htm\">MaxPreps.com<\/a>, closed the game with 24 unanswered points, slamming the door on any hopes of an upset by the Vikings.\r\n\r\nSenior captain and wide receiver Eli Givens is optimistic that the return of a number of injured players this week will provide a boost on the defensive side.\r\n\r\n\"We just need our injured players that didn't play last week to step up and help us out on defense,\" Givens said.\r\n\r\nThe Eagles, led by junior quarterback Tyler McGovern and senior running back Rasaan Fontenette, had a bye week this past week after being shut out by Valley Christian High School (3-0, 0-0) 24-0 on Sept. 11. Despite noticeable offensive struggles from the team, Fontenette has averaged 182 rushing yards per game through two games this season, according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/oak-grove-eagles-(san-jose,ca)\/football\/stats.htm\">MaxPreps.com<\/a>.\r\n\r\nGivens stressed that executing on both sides of the ball will be key for the Vikings.\r\n\r\n\"I think we will be able to pass and get some good run plays against Oak Grove and if our defense plays to its full potential then we will take care of them,\" Givens said.\r\n\r\nThe matchup will be the final game of the Vikings' non-conference schedule, as the team will begin De Anza League play a week later on Oct. 2 against Saratoga High School (1-2, 0-0). Saratoga eliminated the Vikings from Central Coast Section playoff contention on the final day of the regular season last November.","excerpt":"The Palo Alto High School football team (1-2, 0-0) is looking to move past last week's 52-28 loss to the Archbishop Mitty Monarchs (3-0, 0-0) and secure a victory at home over the winless Oak Grove Eagles (0-2, 0-0), a matchup that kicks off at 7:30 p.m. this Friday, Sept. 25. ","date":"2015-09-24 10:44:05","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_img_1343.jpg","categories":["Football","Sports"],"tags":{"37717":"defense","9656":"eli givens","8714":"football","29116":"justin hull","17730":"Mitty","55369":"oak grove","8939":"palo alto","9012":"preview","56300":"riley schoeben","56299":"valley christian"}},{"id":108465,"title":"Club Day offers myriad of activities","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/club-day-offers-myriad-of-activities\/","content":"Following the first Club Day of the 2015-16 academic year, Palo Alto High School students are set to start participating in various clubs. Click on the link to view highlights from yesterday's event.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/uyTE7cKuyYc\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Following the first Club Day of the 2015-16 academic year, Palo Alto High School students are set to start participating in various clubs.","date":"2015-09-22 18:58:19","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSC_19621.jpg","categories":["Editor's Pick","Multimedia","News"],"tags":{"44048":"2015-16","56295":"chess club","11711":"club day","11337":"clubs","8683":"events","56296":"extracurriculars","56294":"fashion club","8944":"palo alto high school","56297":"paly club","56298":"untaught history club","56293":"wilderness club"}},{"id":108478,"title":"Annual college fair is on Oct. 12 in the library","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/annual-college-fair-is-on-oct-12\/","content":"","excerpt":"","date":"2015-09-22 18:11:24","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":108476,"title":"Fiery arts sale this Friday Sept. 25 and Saturday Sept. 26","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/fiery-arts-sale-this-friday-sept-25-and-saturday-sept-26\/","content":"","excerpt":"","date":"2015-09-22 18:09:33","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":108390,"title":"Liveblog: Volleyball takes on Mountain View in league opener","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/liveblog-volleyball-takes-on-mountain-view-in-league-opener\/","content":"[caption id=\"attachment_108218\" align=\"alignnone\" width=\"709\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/volleyball3.png\"><img class=\"wp-image-108218 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/volleyball3.png\" alt=\"Volleyball \" width=\"709\" height=\"445\" \/><\/a> The Palo Alto High School Vikings celebrate after sophomore Chelsea Fan wins a point in their game against Woodside High School on Sept. 5. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\nThe Palo Alto High School volleyball team (11-3,0-0) will take on Mountain View (9-0,0-0) at Gunn tonight it their league opener. Check back at 6:45 p.m. for updates.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School volleyball team (11-3,0-0) will take on Mountain View (9-0,0-0) at Gunn tonight in its league opener. Check back at 6:45 p.m. for updates.","date":"2015-09-22 18:02:58","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/volleyball3.png","categories":["Sports","Uncategorized","Volleyball"],"tags":{"52186":"Chelsea Fan","8751":"gunn","56275":"league opener","8855":"liveblog","29989":"mountain view","8939":"palo alto","8944":"palo alto high school","8953":"paly","9210":"vikings","9216":"volleyball"}}]