[{"id":111591,"title":"Coffee Chats: English teacher Alanna Williamson","permalink":"http:\/\/palyvoice.com\/2015\/11\/15\/coffee-chats-english-teacher-alanna-williamson\/","content":"[caption id=\"attachment_111603\" align=\"aligncenter\" width=\"371\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/alannawilliamson.jpg\"><img class=\"wp-image-111603\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/alannawilliamson.jpg\" alt=\"alannawilliamson\" width=\"371\" height=\"424\" \/><\/a> English teacher Alanna Williamson drinks an eggnog latte while sharing why she is passionate about English and offering some of her best advice for current students. Photo by Morgan Keller.[\/caption]\r\n\r\n<em>Here is the first installment of Coffee Chats, where<\/em><em> The Paly Voice gets to know staff members over a cup of coffee. <\/em>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down with English teacher Alanna Williamson over an iced eggnog latte to discuss how the new school year is going and her advice for students. <\/span>\r\n\r\nThis is Williamson’s first year working at Palo Alto High School. She teaches both English 10\/10A and American Literature for juniors. According to Williamson she would love to teach an elective in upcoming years. Along with teaching English, Williamson is the assistant coach for Paly’s dance team and even helped lead the teacher dance during Spirit Week.\r\n\r\n“I’m an assistant coach,\" Williamson said. \"It’s fun. She [dance teacher Hillary McDaniels] organized and I helped. We co-choreographed. I loved Spirit Week.”\r\n\r\nWilliamson grew up near Palo Alto in Sunnyvale and graduated from Fremont High School. During her high school career, she participated in theater and was the president of the spoken word poetry club at her school. After graduation, she attended De Anza College for three years before transferring to University of California, Los Angeles. Williamson was always passionate about English and knew that if her theatrical dreams did not work out she would like to pursue a career in English education.\r\n\r\n“I was thinking about pursuing theatre and Broadway and when that didn't pan out, I had to refocus,” Williamson said. “And I really loved talking about education with people. A lot of my friends had a lot of problems in the way the education system is [run] so I want to help fix that.”\r\n\r\nHaving graduated from school relatively recently, Williamson says she is able to relate to her students and the problems they face each day.\r\n\r\n“I think that there still needs to be that student-teacher line,” Williamson said. “But I do want you guys to know that it really wasn't that long ago that I went through all the same stuff that you're going through now and that I can talk to you guys and support you through everything.”\r\n\r\nAccording to Williamson, Paly itself is not the place to blame for student stress, but rather the Palo Alto student environment as a whole.\r\n\r\n<span style=\"font-weight: 400;\">“I think that there's so much that the teachers do all the time with the way that they conduct their classes and the different things being set into place at Paly that are there to really support students,” Williamson said. “I think it has to do more with the community we’re in, and the environment and the fact that [Stanford] is across the street staring at us every day and just kind of looming.”<\/span>\r\n\r\nThe biggest advice that Williamson has for students about stress or feeling down is to not be ashamed to talk to someone about it.\r\n\r\n“Talk to somebody,\" Williamson said. \"Don’t feel ashamed because it's such a human experience. Everyone’s going through it. It's just because we live in silence all the time so people feel like you should feel bad about it. You really don't have to feel bad about it. And you’ll get better.”\r\n\r\nHaving gone through the college application process herself recently, Williamson believes that sometimes going to community college and transferring to another school can be a good option.\r\n\r\n“Don’t ruin your life trying to stress out about it now and feel sad if you can’t make it for some reason that’s completely out of your control when you can instead plan your future in a different way,\" Williamson said. \"That would be more beneficial for you.\"\r\n\r\nWilliamson loves teaching at Paly and thinks of it as a unique opportunity that she plans to continue career for as long as possible.\r\n\r\n<span style=\"font-weight: 400;\">“It's a pretty cross your heart thing getting placed somewhere like Paly, so as long as they want me, I’ll stay,” Williamson said.<\/span>","excerpt":"The Paly Voice sat down with english teacher Alanna Williamson over an iced eggnog latte to discuss how the new school year is going and her best advice for students.\r\n","date":"2015-11-15 22:15:08","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/alannawilliamson.jpg","categories":["Coffee chats","Entertainment","Uncategorized"],"tags":["coffee","coffee chat","english","ms. williamson","Teacher","williamson"]},{"id":112026,"title":"Annual Turkey Trot Feast is on Friday, Nov. 20","permalink":"http:\/\/palyvoice.com\/2015\/11\/14\/annual-turkey-trot-feast-is-on-friday-nov-20\/","content":"","excerpt":"","date":"2015-11-14 23:20:32","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112024,"title":"Advisory this week is for all freshmen and juniors","permalink":"http:\/\/palyvoice.com\/2015\/11\/14\/advisory-this-week-is-for-all-freshmen-and-juniors\/","content":"","excerpt":"","date":"2015-11-14 23:17:12","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":111956,"title":"Boys&#8217; water polo team to kick off CCS playoffs against Saint Francis","permalink":"http:\/\/palyvoice.com\/2015\/11\/13\/boys-water-polo-team-to-kick-off-ccs-playoffs-against-saint-francis\/","content":"[caption id=\"attachment_111983\" align=\"alignnone\" width=\"631\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/BoysWaterPolo2.jpg\"><img class=\" wp-image-111983\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/BoysWaterPolo2.jpg\" alt=\"Senior Cameron Khan attempts to make a pass during a game against Gunn earlier this season. The Vikings will look to win their first game of the Central Coast Section playoffs against Saint Francis on Saturday. Photo by Chirag Akella.\" width=\"631\" height=\"459\" \/><\/a> Senior Cameron Khan attempts to make a pass during a game against Gunn earlier this season. The Vikings will look to win their first game of the Central Coast Section playoffs against Saint Francis on Saturday. Photo by Chirag Akella.[\/caption]\r\n\r\nThe Palo Alto High School boys' water polo team (12-12, 8-5) will open its Central Coast Section playoffs campaign against Saint Francis High School at 11:30 a.m on Saturday at Los Altos High School.\r\n\r\nDespite losing to Saint Francis 10-6 earlier in the season, the Vikings believe that they can right the ship this time around. Junior Jared Stanley attributed the loss to a sluggish start and emphasized the importance of having the right mindset going into the game.\r\n\r\n“We have played them before but we didn't come out firing in the first couple of minutes,” Stanley said. “We really need to come out hard in the first minutes of this game in order to set the tone.”\r\n\r\nAccording to Stanley, going into the quarterfinal game, the Vikings have the right mentality needed to win.\r\n\r\n“We had a really good focused practice today, so I believe we are more than capable of coming out with a win against Saint Francis,” Stanley said. “We know our match ups and it's going to be a great game.”\r\n\r\nJunior Andrew Jozefov says that the team has specifically been working on the team’s defense during practice this week in order to prepare for Saint Francis.\r\n\r\n“To prepare ourselves for this game, we have been working on sharpening our one-on-one drive defense because that was our biggest weakness last time we lost to them this season,” Jozefov said. “This time we know that our drive defense, our press and our crash on set will be better and sharper because we know that they [Saint Francis] had trouble against it last time.”\r\n\r\nJozefov also highlighted Bellarmine, a team they have not played this season and Gunn, a team they split their series with this season, as teams that will be tough in their CCS playoff bracket.\r\n\r\n“The tough teams this year in CCS are Bellarmine and Gunn,\" Jozefov said. \"To beat Gunn all we need to do is have the same focused mentality and drive to win. In order to beat Bellarmine, we will need to play some great counter-defense and really communicate to each other on defense to stop their quick and effective counter.”\r\n\r\nThe Vikings are optimistic that they will reach the CCS finals, a season-long goal.\r\n\r\n\"We are very excited going into CCS because this is what the whole season has led to,\" senior Winston Rosati said. \"We want to win and I think if all the parts come together it is possible. I am excited and hopeful.\"","excerpt":"The Palo Alto High School water polo team (12-12, 8-5) will open their Central Coast Section (CCS) playoffs campaign against Saint Francis High School at 11:30 a.m. on Saturday at Los Altos High School. \r\n","date":"2015-11-13 23:43:55","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/BoysWaterPolo2.jpg","categories":["Sports","water polo"],"tags":["Boys","boys water polo","CCS","jozefov","stanley","vikings","water polo"]},{"id":111936,"title":"Cross country prepares for CCS Championship","permalink":"http:\/\/palyvoice.com\/2015\/11\/13\/cross-country-prepares-for-ccs-championship\/","content":"[caption id=\"attachment_111953\" align=\"alignright\" width=\"606\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/x.jpg\"><img class=\"size-full wp-image-111953\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/x.jpg\" alt=\"The Palo Alto High School boys’ cross country team warms up during practice at the Paly track. After finishing third \" width=\"606\" height=\"373\" \/><\/a> The Palo Alto High School boys’ cross country team warms up during practice at the Paly track. After securing third place in the Santa Clara Valley Athletic League El Camino division, the team aims to maintain the momentum and continue to excel at the Central Coast Section Championship tomorrow. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School boys’ and girls’ cross country teams will compete at the Central Coast Section Championship tomorrow at the Crystal Springs Cross Country Course, after placing first and third respectively in the Santa Clara Valley Athletic League El Camino division.\r\n\r\n<span style=\"font-weight: 400;\">Despite injuries to several key runners including junior Kai Oda, the boys’ team has high hopes for its meet tomorrow, according to junior Spencer Morganfeld.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If we run like we did at SCVALs and all the other teams run like they did at SCVALs, then we will make it to finals [State Championships],” Morganfeld said.<\/span> “We are going to do our very best. The whole team is expected to do well.”\r\n\r\n<span style=\"font-weight: 400;\">According to senior team captain Sarah Wang, the girls’ cross country season has been filled with injuries.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We've lost numerous runners to injuries this season, including three of the four captains,” Wang said. “On top of that, many of our varsity runners are battling some form of chronic injury, usually shin splints. Despite these injuries, many of our underclassmen have stepped up, improving tremendously throughout the season.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In spite of these setbacks, several runners are expected to stand out.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">Sophomore Julia Doubson had an amazing season,” senior team captain Portia Barrientos said. “She improved by about a minute on the Crystal Springs course which is really impressive. So she’s really become a breakout star. Our freshman Katia Martha had a really great race at leagues, and I’m looking forward to see her compete at CCS.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Wang, the girls’ team is aiming to perform its best at CCS.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our chances of making States are pretty slim, so we just want to run our hardest,” Wang said. “For us seniors, we just want to have a good last meet and go out feeling good.”<\/span>\r\n\r\nLast year, the boys' team advanced to the State Championships following a second place finish at CCS, while the girls' team secured in fourth place at CCS.\r\n\r\nThe meet will begin at 10 a.m. tomorrow at the Crystal Springs Cross Country Course in Belmont.","excerpt":"The Palo Alto High School boys’ and girls’ cross country teams will compete at the Central Coast Section Championship tomorrow at the Crystal Springs Cross Country Course, after placing third in the Santa Clara Valley Athletic League El Camino division.","date":"2015-11-13 21:17:35","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/x.jpg","categories":["Sports","Spotlight"],"tags":["CCS","cross country","fun","running","track"]},{"id":111716,"title":"All-gender restrooms appear on campus","permalink":"http:\/\/palyvoice.com\/2015\/11\/12\/all-gender-restrooms-on-campus-to-support-transgender-community\/","content":"[caption id=\"attachment_111898\" align=\"alignnone\" width=\"548\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2432.jpg\"><img class=\" wp-image-111898\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2432.jpg\" alt=\"Gender neutral restrooms have been popping up around school campus to accommodate for the LGBTQ community, according to Assistant Principal Jerry Berkson. Photo by Daniel Li. \" width=\"548\" height=\"411\" \/><\/a> The Palo Alto High School administration has been converting some staff restrooms to all-gender bathrooms in the past few weeks. The new restrooms are available in the Media Arts Center, 700s building and the Student Center. Photo by Daniel Li.[\/caption]\r\n\r\nThe Palo Alto High School administration is replacing some standard male and female restrooms with single-stalled all-gender restrooms around campus.\r\n\r\n“All-gender restrooms are happening all over now; you see it everywhere you go,” Assistant Principal Jerry Berkson said. “The key to the all-gender restrooms is that they are single-stalled.”\r\n\r\nAccording to Berkson, the restrooms were put into place two weeks ago, but the concept started last year.\r\n\r\nCurrently, the all-gender restrooms are located in the Media Arts Center, 700s building and the Student Center.\r\n\r\n“We tried to strategically put them so there is a restroom within reach,” Berkson said.\r\n\r\n<em>Editor's Note: Portions of this article have been removed or altered. The Paly Voice intends to revisit this topic in the coming weeks.<\/em>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School administration is replacing some standard male and female restrooms with single-stalled all-gender restrooms around campus.","date":"2015-11-12 19:06:18","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2432.jpg","categories":["News"],"tags":["700s building","administration","all-gender","Berkson","Jerry","jerry berkson","lgbtq","mac","paly","restrooms","student center","transgender"]},{"id":111490,"title":"Review: Fire, Oak and Barley is more than just oak-ay","permalink":"http:\/\/palyvoice.com\/2015\/11\/12\/review-fire-oak-and-barley-is-more-than-just-oak-ay\/","content":"<span style=\"font-weight: 400;\">A flickering fire burns bright at Fire, Oak &amp; Barley as servers flip dough and place countless pizzas in the restaurant’s blazing wood-fired oven. Customers chatter as several widescreen televisions broadcast sports games and events and decorative artwork illuminates the walls. Large illuminated menus boast scrumptious sandwiches, diverse pizza selections and an assortment of soups.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Fire, Oak &amp; Barley, a new family-owned restaurant located at 341 South California Ave., aims to provide its customers with high quality, nutritious options and a fun atmosphere.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A truly great meal requires three things: the freshest ingredients; skill and attention to detail in preparation and service; and most of all, a real passion for food,” owner Dan Brunello said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On a recent visit, we were immediately greeted by the friendly staff located behind the counter near the front of the restaurant. A jug with cold, refreshing water sits on a small table, and fireplaces create a warm environment. Throughout the ordering and eating process, the staff was helpful and patient. <\/span><span style=\"font-weight: 400;\">Fire, Oak &amp; Barley opened in August, between The Counter and Cafe Pro Bono, neighboring Starbucks, Spice Kit and Pizza Studio.<\/span>\r\n\r\n[caption id=\"attachment_111689\" align=\"alignright\" width=\"349\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2376.jpg\"><img class=\"wp-image-111689\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2376.jpg\" alt=\"IMG_2376\" width=\"349\" height=\"262\" \/><\/a> Inside the Fire, Oak &amp; Barley, there is a lounge area with a double-sided fireplace where customers can relax and watch television while having a drink. Photo by Daniel Li.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">According to Brunello, the name “Fire, Oak &amp; Barley” stems from the all-day wood-fired menu items,  the wine bar selection as well as the local craft beers on tap.<\/span>\r\n\r\nThe restaurant’s warm green and orange lighting creates a comfortable ambiance. A small patio in the front of the restaurant outside seats 16 people with a double-sided fireplace that also burns in front of a lounge area inside. While the restaurant is informal, the calm atmosphere is a comfortable dinnertime environment.\r\n\r\n<span style=\"font-weight: 400;\">Fire, Oak &amp; Barley’s menu includes a large selection of sandwiches, salads, soups and pizzas. The restaurant mainly specializes in grilled foods, wine and beer.<\/span>\r\n\r\n[caption id=\"attachment_111569\" align=\"alignleft\" width=\"314\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/FullSizeRender-6.jpg\"><img class=\"wp-image-111569\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/FullSizeRender-6.jpg\" alt=\"The &quot;California Fresh&quot; is one of the restaurant's signature sandwiches. Photo by Daniel Li. \" width=\"314\" height=\"235\" \/><\/a> The \"California Fresh\" is one of the restaurant's signature sandwiches. With moist turkey and appetizing bread and cheese, the sandwich is a great lunch meal. Photo by Daniel Li.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">“California Fresh” ($8.95), one of the restaurant’s signature sandwiches, is an enjoyable option served on a dutch crunch roll. It is composed of a freshly roasted turkey breast, avocado, Monterey jack cheese, red onion, lettuce, tomato, mayonnaise and Dijon mustard,  served with a side of coleslaw on lettuce. While the bread was a bit hard, the sandwich had fresh ingredients and the avocado was appetizing. Both the turkey and cheese were flavorful, although the condiments were bland. The sandwich's overall taste was stronger than most other sandwiches, and the bread was surprisingly delicious.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The “Margherita Pizza” ($13.95), another customer favorite, is composed of a light San Marzano tomato sauce, fior di latte mozzarella, fresh basil, sea salt, with a drizzle of extra virgin olive oil. The pizza is split into eight slices, a bit too much for a single person serving. As I took a bite of the pizza sprinkled with basil leaves I noticed that the thin crust was crunchy and there was a strong tomato sauce flavor. While the sauce was perfectly made, the pizza itself was too thin and therefore not as filling as traditional pizzas.<\/span>\r\n\r\n[caption id=\"attachment_111570\" align=\"alignright\" width=\"343\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2366.jpg\"><img class=\" wp-image-111570\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2366.jpg\" alt=\"The Margherita Pizza is one of the most popular pizzas at Fire, Oak and Barley. Photo by Daniel Li. \" width=\"343\" height=\"257\" \/><\/a> The Margherita Pizza is one of the most popular pizzas at Fire, Oak and Barley. Photo by Daniel Li.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Overall, Fire, Oak &amp; Barley offers appetizing meals and is well worth a visit for lunch or dinner and its prices are average compared to Palo Alto alternatives. The \"California Fresh\" sandwich and \"Margherita Pizza\" were well worth the price.<\/span>","excerpt":"New Palo Alto restaurant Fire, Oak & Barley offers delicious pizza and sandwiches in an informal environment.","date":"2015-11-12 15:10:45","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_2376.jpg","categories":["Entertainment","Reviews"],"tags":["brunello","california fresh","fire oak and barley","margherita","pizza","restaurant","review","sandwich","wood oven"]},{"id":111624,"title":"Review: &#8220;Spectre&#8221; begins with a bang, but misses the bullseye","permalink":"http:\/\/palyvoice.com\/2015\/11\/12\/review-spectre-begins-with-a-bang-but-misses-the-bullseye\/","content":"[caption id=\"attachment_111914\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/site3.jpg\"><img class=\" wp-image-111914\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/site3.jpg\" alt=\"James Bond has returned within the new film, &quot;Spectre.&quot; Overall the film is satisfactory, but plot details take away from the action scenes and the story itself. Photo by MGM\" width=\"600\" height=\"400\" \/><\/a> James Bond has returned within the new film, \"Spectre.\" Overall the film is satisfactory, but plot details take away from the action scenes and the story itself. Photo by MGM.[\/caption]\r\n\r\nThe James Bond franchise has returned with the thrilling new chapter to the Bond series, \"Spectre.\" The film continues the traditions from previous eras and as well as the story from recent Bond films while paving its own path, differentiating it from other Bond films. Its exciting sequences, iconic references and humorous script is sure to please both casual and die-hard Bond fans alike.\r\n\r\n\"Spectre,\" directed by Sam Mendes, begins with an opening sequence in Mexico City that rivals some of the best opening sequences in the series. The sequence follows Bond (Daniel Craig) tracking down a mysterious villain through the town square during the festive Day of the Dead celebrations. Bond then engages in a brilliantly shot helicopter fight scene which caps the action-packed opening scene. The rest of the movie follows Bond’s quest to track down a person from his past and to take down the terrorist organization, Spectre.\r\n\r\nOne way \"Spectre\" succeeds is that it incorporates all the classic Bond moments that old fans will love. The introduction of \"Bond, James Bond?\" Check. Shaken, not stirred? Yup. The timeless Aston Martin? Of course. There are even many references to past films (\"From Russia With Love\" train scene, anyone?). However, where this film differs from the majority of the series is in its exploration of Bond’s (Daniel Craig) past, a continuing theme from all of Craig’s past Bond films.\r\n\r\nThough the exploration of Bond’s past was done very well in Craig's previous movies (namely \"Casino Royale\" and \"Skyfall\"), in \"Spectre\" it distracts rather than adds to the plot. Extended monologues takes away from the action scenes and slows the pace of the movie. Also, the focus on Bond’s past does not accentuate Bond’s traditional mysterious and stoic nature and makes him much softer than previous films. It also leads to an unorthodox ending that combined with rumors of \"Spectre\" being Craig’s final Bond film, fuels many rumors regarding the plot of the next film, \"Bond 25.\"\r\n\r\nDespite those issues, \"Spectre\" succeeds in many ways. Supporting characters Eve Moneypenny (Naomie Harris), Q (Ben Whishaw) and M (Ralph Fiennes) continue their strong performances from \"Skyfall.\" Harris plays a great sidekick to Bond while Whishaw does a phenomenal job adding funny moments and continuing to play an exceptional younger Q. Fiennes also does a good job taking over from the longtime Judie Dench as M, incorporating the steely attitude needed for the character. The script is well done, incorporating humor throughout while still retaining the darker feel regarding Bond's past. The cinematography is shot very well, as the action scenes were captivating and intense. The different locations Bond ventures into, such as Mexico City and Rome, are captured well by the directing, the clothing is classy and fashionable, and the explosions are bigger than ever.\r\n\r\nChristoph Waltz (Ernst Blofeld) plays a phenomenal antagonist. Waltz’s idiosyncratic acting fits seamlessly with the role of “Oberhauser,” but there is one problem – there was not enough of him. The first half of the film foreshadows Oberhauser to be an extremely powerful and invincible villain. However, when he is on-screen, he gives too many monologues and isn’t able to have the same impact as past villains such as Raoul Silva (Javier Bardem) from \"Skyfall.\"\r\n\r\nDespite the divergence from the traditional Bond script, \"Spectre\" still retains the traditional Bond moments die-hard fans will look for, and its enthralling action scenes and humorous moments make it a must-watch even for the casual moviegoer.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The James Bond franchise has returned with another hit film, \"Spectre.\" The film follows  Bond's attempt to track down a foe from his past and take down a terrorist organization. Despite some issues with its plot, \"Spectre\" is a thrilling movie that all should go to see. ","date":"2015-11-12 11:34:57","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/FIRST-LOOK_post.jpg","categories":["Entertainment","Reviews"],"tags":["007","bond","film","james","movie","review","spectre"]},{"id":111640,"title":"Project Rally seeks student tutors to combat achievement gap","permalink":"http:\/\/palyvoice.com\/2015\/11\/12\/project-rally-seeks-student-tutors-to-combat-achievement-gap\/","content":"[caption id=\"attachment_111641\" align=\"aligncenter\" width=\"521\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/PR-346.jpg\"><img class=\"wp-image-111641\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/PR-346.jpg\" alt=\"PR 346\" width=\"521\" height=\"391\" \/><\/a> Students participate in \"Rug Time,\" one of the activities that Project Rally uses to supplement instruction. “Rug Time Activities include reading a storybook together and then working on an activity related to the book,” Project Rally Coordinator Shirley Mak said. “This week, the kids brainstormed examples of good and bad behavior, played games as a group and took turns sharing on specific topics like: How was your day? What were you for Halloween?” Photo Courtesy of Shirley Mak.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Project Rally, <\/span><span style=\"font-weight: 400;\">a tutoring program <\/span><span style=\"font-weight: 400;\">focused on fighting Palo Alto’s achievement gap, is<\/span><span style=\"font-weight: 400;\"> looking for student tutors after <\/span><span style=\"font-weight: 400;\">launching earlier this year at <\/span><span style=\"font-weight: 400;\">Fairmeadow and Hoover elementary schools.<\/span>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Formed as a <\/span><span style=\"font-weight: 400;\">collaboration between East Palo Alto Tennis and Tutoring and the Palo Alto Unified School District, Project Rally aims to solve a “city-wide problem,” according to Project Rally Coordinator Shirley Mak.  <\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“I believe there is a significant achievement gap in Palo Alto, as there tends to be in areas with high levels of socio-economic disparity,” <\/span><span style=\"font-weight: 400;\">Mak <\/span><span style=\"font-weight: 400;\">said. “Even when students from lower economic backgrounds have access to the same teachers, classrooms and resources as their peers who come from much higher socio-economic backgrounds, they often perform much lower academically in comparison.”<\/span><\/p>\r\n<span style=\"font-weight: 400;\">Project Rally focuses specifically on improving reading ability at elementary schools. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[We want to] <\/span><span style=\"font-weight: 400;\">provide academic, physical, and emotional support to disadvantaged K-1 students and empower parents to help their children read proficiently,” Mak said. “Research shows that students who do not read proficiently are more likely to drop out of high school so we're trying to address this early on with one-on-one literacy support.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Currently, Project Rally students are all either voluntary transfer program students from East Palo Alto or students who qualify for free or reduced lunch at the participating schools, according to Mak. <\/span>\r\n<p style=\"text-align: left;\">Though the subjects of sessions differ, they follow three main themes.<\/p>\r\n<p style=\"text-align: left;\">“Tutoring sessions typically consist of 45 minutes of instruction that revolve around phonetic awareness, reading and verbal skills of writing, speaking and listening,” Mak said.<\/p>\r\n<p style=\"text-align: left;\">As Project Rally is volunteer-based, they are always looking for more tutors to work with our students, according to Mak.<\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Mak is using students interested in tutoring for Project Rally to e-mail <\/span><a href=\"mailto:info@projectrally.net\"><span style=\"font-weight: 400;\">info@projectrally.net<\/span><\/a> <span style=\"font-weight: 400;\">or fill out an online application form on <\/span><a href=\"http:\/\/projectrally.net\/\"><span style=\"font-weight: 400;\">projectrally.net<\/span><\/a><span style=\"font-weight: 400;\">. Tutors must be at least 14 years of age.<\/span><\/p>\r\n&nbsp;","excerpt":"Project Rally, a tutoring program focused on fighting Palo Alto’s achievement gap, is currently looking for student tutors after launching earlier this year at Fairmeadow and Hoover Elementary School.","date":"2015-11-12 11:20:30","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/PR-346.jpg","categories":["News"],"tags":["achievement gap","palo alto","project rally","tutor"]},{"id":111726,"title":"Paly alumna wins big on game show","permalink":"http:\/\/palyvoice.com\/2015\/11\/11\/paly-alumna-wins-big-on-game-show\/","content":"[caption id=\"attachment_111737\" align=\"alignnone\" width=\"649\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/molly-mackris.jpg\"><img class=\"wp-image-111737\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/molly-mackris.jpg\" alt=\"molly mackris\" width=\"649\" height=\"366\" \/><\/a> Paly alumna Molly Mackris stands with \"Let's Make a Deal\" host Wayne Brady as she awaits the reveal of a mystery item. The episode aired in early November. Photo courtesy of Molly Mackris.[\/caption]\r\n\r\nA Palo Alto High School alumna won big on an episode of the CBS channel game show “<a href=\"https:\/\/www.youtube.com\/watch?v=bfhUGhjOqjY\">Let’s Make a Deal<\/a>” that aired last Wednesday.\r\n\r\nMolly Mackris, a Paly graduate of  the Class of 2015 and a current student at Chapman University, took home a new Kawasaki motorcycle worth $7,399 after trading it for a $4,485 game room which included a shuffleboard, foosball table and television set.\r\n\r\nAn avid fan her entire life, Mackris began watching “Let’s Make a Deal” as a child and was finally given the chance to be part of the audience in June of this year. In the game show, audience members make deals with the show's host. The host offers contestants something of value, such as cash, and contestants must choose whether to keep the object or trade it for a mystery item.\r\n\r\n“Most of my friends and family were pretty shocked when they found out I was on the show, mostly because I hadn't mentioned it before,” Mackris said. “The show taped in June, but I wasn't allowed to tell anyone that I was a contestant until the show aired.”\r\n\r\nIn the beginning of the show, Mackris avoided purchasing a zonk; an object with little value to the buyer. She later turned down another unknown item, revealed to be a trip to the Caribbean island St. Lucia.\r\n\r\n“I actually don't regret missing out on the trip to St. Lucia,” Mackris said. “It would have been a cool experience but if I had won the trip I still probably would have traded it for the big deal of the day at the end of the show and would have ended up with the motorcycle anyway.”\r\n\r\nFinally, she purchased a game room which she later traded for a “big deal” mystery item. While Mackris won a motorcycle and avoided the meager prize of $2,160, she lost out on a Chevy Sonic Sedan worth $25,879.\r\n\r\nMackris plans on selling the motorcycle.\r\n\r\n“Those who know me know that I'm the farthest thing from a ‘biker chick,’ so I got a lot of people asking me if I was actually going to ride it or not,” she said.\r\n\r\nDespite not receiving the grand prize, Mackris says she enjoyed the experience.\r\n\r\n“I would absolutely love to be on 'Let's Make A Deal' again, even if I was just in the audience,” Mackris said. “The energy in the studio that day was unlike anything I had experienced before and by the time we left that day we all felt like one big family.”","excerpt":"A Palo Alto High School alumna won a new motorcycle on the CBS channel game show “Let’s Make a Deal” that aired last Wednesday.","date":"2015-11-11 16:27:15","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/12195773_935542996529214_7788620552987236578_n.jpg","categories":["News","Spotlight"],"tags":["alum","game show","lets make a deal","molly mackris","motorcycle","palo alto high school","paly","rhubarb","st lucia","television","tv"]}]