[{"id":107127,"title":"Veterans, rookies shine in 54-28 rout of Cherokees","permalink":"http:\/\/palyvoice.com\/2015\/09\/06\/veterans-rookies-shine-in-54-28-rout-of-cherokees\/","content":"The Palo Alto High School football team (1-0, 0-0) rebounded from last year's offensive struggles with a dominating performance in front of its home crowd on Friday night, scoring eight touchdowns in a 54-28 victory over the Sequoia Cherokees (0-1, 0-0).\r\n\r\nIn his first season-opening game as starting quarterback, senior Justin Hull threw for three touchdown passes and rushed for another, leading the offense on six touchdown drives in the second half.\r\n\r\nAfter a disappointing 3-7 season in which Hull and senior Oliver Svirsky shared the quarterback position, Hull now has full control over second-year head coach Jake Halas's offense after Svirsky transferred to Milpitas High School this summer. In addition to Hull's strong performance, a balanced running attack from sophomore Paul Jackson III, and seniors Tony Caballero-Santana and Shaun Pike kept Cherokee defenders off-balance throughout the game.\r\n\r\n[caption id=\"attachment_107196\" align=\"aligncenter\" width=\"653\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/MG_83252.jpg\"><img class=\"wp-image-107196\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/MG_83252.jpg\" alt=\"Senior running back Tony Caballero-Santana makes a cut upfield. Caballero-Santana rushed for a touchdown in the third quarter of Friday's game, as the Vikings defeated the Sequoia Cherokees 54-28. Photo by Cooper Lou.\" width=\"653\" height=\"435\" \/><\/a> Senior running back Tony Caballero-Santana makes a cut upfield. Caballero-Santana rushed for a touchdown in the third quarter of Friday's game, as the Vikings defeated the Sequoia Cherokees 54-28. Photo by Cooper Lou.[\/caption]\r\n\r\nMidway through the third quarter with the Cherokees still within one score, Jackson III broke free for a 63-yard touchdown run, the first of his varsity career.\r\n\r\n“I felt like it was a great first game, one of my best games, especially coming out of junior varsity last year,” Jackson said. “It feels great. A lot of nerves come with it, but I think I’m making adjustments to my game.”\r\n\r\nThe Vikings started quickly when Hull hit senior wideout Eli Givens on a vertical rout on the team’s second drive of the game. Hull attributed consistent drives throughout the game to his offensive line, led by senior captain Mikey Grandy.\r\n\r\n“The offensive line made my job really easy,” Hull said. “When we run the ball like that, I don't have to do much, but it could be better. It can always be better, but it was all right for the first game.”\r\n\r\nThe Cherokees were paced by a multitude of athletes including senior fullback Faave Brown and senior tailback Aya Brown. They briefly took a 20-14 lead early in the second half when junior quarterback Nick Demarco connected with Aya Brown on a slant touchdown pass, but were ultimately outperformed by the speed of the Vikings’ offense.\r\n\r\n“They were getting the ball moving, they were doing a great job with that,” Sequoia head coach Robert Poulos said. “We started fatigued defensively, which allowed them to use the same concept which we’re trying for, which is [to] start getting some seams you can exploit.”\r\n\r\nOn the Vikings’ side, Hull was able to connect with senior wide receiver Riley Schoeben twice in the end zone, the second providing the team with a comfortable lead late in the third quarter.\r\n\r\nCoach Halas expressed his confidence in the Vikings' play after the game.\r\n\r\n“I felt we were going to be able to run the ball, but if you had asked me about [scoring] 54 I would have said no,” Halas said. “We got stronger and they got winded.”\r\n\r\nThe Vikings next game is set for 7:30 p.m. next Friday, Sept. 11 at home against San Benito High School (1-0, 0-0).","excerpt":"The Palo Alto High School football team (1-0, 0-0) rebounded from last year's offensive struggles with a dominating performance in front of its home crowd on Friday night, scoring eight touchdowns in a 54-28 victory over the Sequoia Cherokees (0-1, 0-0). ","date":"2015-09-06 13:59:45","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/MG_83252.jpg","categories":["Sports","Sports Recap"],"tags":{"51440":"cherokees","8714":"football","25417":"halas","29126":"home opener","51444":"hull","51445":"jackson III","51443":"rookies","51441":"rout","11721":"schoeben","51442":"veterans"}},{"id":106538,"title":"A new era for standardized testing","permalink":"http:\/\/palyvoice.com\/2015\/09\/05\/a-new-era-for-standardized-testing\/","content":"[caption id=\"attachment_106545\" align=\"alignright\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-01-at-1.51.16-AM.png\"><img class=\" wp-image-106545\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-01-at-1.51.16-AM.png\" alt=\"Palo Alto High School's College Advisor Sandra Cernobori works at her desk in the College Center. In light of the changes implemented to the SAT, Cernobori recommends students to take the new SAT so that they can use the PSAT as a study took.  Photo by Cooper Lou. \" width=\"615\" height=\"409\" \/><\/a> Palo Alto High School College Advisor Sandra Cernobori works at her desk in the College and Career Center, answering questions and giving advice to those beginning their college application process. Cernobori recommends juniors to take the redesigned SAT next March so that they can use the newly modified PSAT as a study tool. Photo by Cooper Lou.[\/caption]\r\n\r\nFor the 2015-2016 school year, high school students throughout the United States will witness changes to the standardized tests used in college admissions, including the SAT, PSAT and ACT. These adjustments will have a considerable impact on students who graduate in 2017, leaving them to decide whether they should take the current SAT, act as guinea pigs for the redesigned SAT or take the newly revised ACT.\r\n\r\nThe introduction of 2016's new SAT has brought stress to at least several Palo Alto High School juniors who wish to take the current SAT and not the new version of the test. Many students in the past took the SAT second semester, but now, juniors only have until the end of 2015 to take the current SAT.\r\n\r\n“There’s a lot more pressure to do well on the old SAT, since my parents have spent so much money on classes,” junior Michelle Leong said. “There's a larger time constraint because they stop offering the old SAT in January.”\r\n\r\nInstead of sticking with the SAT, some students have responded to the SAT’s revisions by preparing for the ACT instead.\r\n\r\n“I'm the kind of person that needs more time to study for tests such as these,\" junior John Liu said. “Having to take the SAT this fall is a huge time crunch, and I will probably not have enough time to prepare. With the SAT changing this school year, everything becomes more complicated, so I decided just to prepare for the ACT.”\r\n\r\nListed below is more detailed information on the respective changes to be implemented to the SAT, PSAT and ACT this school year.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/09\/05\/sat-redesigned-exam-to-debut-in-2016\/\">SAT: Redesigned exam to debut in 2016<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/09\/05\/psat-changes-in-accordance-with-the-redesigned-sat\/\">PSAT: New changes in accordance with the redesigned SAT<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/09\/05\/act-new-score-indicators-and-essay\/\">ACT: New score indicators and essay<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Untitled-Infographic-2.png\"><img class=\"alignnone size-full wp-image-107143\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Untitled-Infographic-2.png\" alt=\"Untitled Infographic (2)\" width=\"500\" height=\"628\" \/><\/a>","excerpt":"For the 2015-2016 school year, high school students throughout the United States will soon witness changes to the standardized tests used in college admissions, including the SAT, PSAT and ACT. These adjustments will have a considerable impact on students who graduate in 2017, leaving them to decide whether they should take the current SAT, act as guinea pigs for the redesigned SAT or take the newly-revised ACT.","date":"2015-09-05 19:40:35","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-01-at-1.51.16-AM.png","categories":["Features","Spotlight"],"tags":{"9680":"ACT","8604":"college","12294":"college board","49945":"khan academy","8944":"palo alto high school","8953":"paly","29217":"psat","49943":"Sandra Cernobori","29935":"sat","49944":"standardized tests","12319":"test","33418":"tests"}},{"id":106618,"title":"PSAT: Changes in accordance with the redesigned SAT","permalink":"http:\/\/palyvoice.com\/2015\/09\/05\/psat-changes-in-accordance-with-the-redesigned-sat\/","content":"The new PSAT is expected to debut in October of 2015 and will focus primarily on assessing students’ ability to process and analyze information, just as the new SAT does, according to the College Board's <a href=\"https:\/\/www.collegeboard.org\/\">website<\/a>.\r\n\r\nThe PSAT is designed to help juniors to practice for the SAT and determine high school students’ eligibility for the National Merit Scholarship.\r\n\r\n[caption id=\"attachment_106805\" align=\"alignright\" width=\"160\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/images.jpeg\"><img class=\"size-full wp-image-106805\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/images.jpeg\" alt=\"The new PSAT will implement changes that are similar to the SAT. Screenshot by Daniel Li.\" width=\"160\" height=\"160\" \/><\/a> According to the College Board, the changes to the new PSAT will be similar to that of the redesigned SAT. Screenshot by Daniel Li.[\/caption]\r\n\r\nThe redesigned PSAT will consist of two sections: \"Evidence-Based Reading and Writing\", and \"Math.\" In addition, the scores will be reported on the same point scale as the redesigned SAT, 400-1600, instead of its past 60-240 point scoring. The exam will also be longer, 2 hours and 45 minutes, as opposed to its previous length, 2 hours and 10 minutes. Similarly to the redesigned SAT, there will be no penalty for incorrect answers.\r\n\r\n“The PSAT has been changed to match what’s going to be on the new SAT,” Cernobori said. “The tests are basically mimicked. The only difference is that the PSAT does not have the essay portion, and that has always been the case.”\r\n\r\nAccording to Cernobori, the PSAT is a shortened version of the redesigned SAT and serves as a useful study indicator.\r\n\r\n“The PSAT is intended for students to get an idea of what the new exam is like,” Cernobori said. “The score report, which students usually get back in January, can be used as a tool to help them prepare and study for the new exam.”","excerpt":"The new PSAT is expected to debut in October and will focus primarily on assessing students’ ability to process and analyze information, just as the new SAT does, according to the College Board's website.\r\n","date":"2015-09-05 19:39:26","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/FullSizeRender-3.jpg","categories":["Uncategorized"],"tags":{"14165":"cernobori","27706":"changes","12294":"college board","52044":"national merit scholarship","52042":"new SAT","8944":"palo alto high school","8953":"paly","29217":"psat","52043":"redesigned SAT","49943":"Sandra Cernobori","29935":"sat","12320":"standardized test","33418":"tests"}},{"id":106621,"title":"ACT: New score indicators and essay","permalink":"http:\/\/palyvoice.com\/2015\/09\/05\/act-new-score-indicators-and-essay\/","content":"Contrary to the College Board, the ACT organization has been implementing minor changes to the ACT exam throughout these past couple years, such as adding “paired passages” to its reading section in late 2014. However, this September, the major changes to the exam will include score indicators and the essay.\r\n\r\nThere will now be a \"Science, Technology, Engineering and Math\" (STEM) score, which is comprised of the Math and Science scores, along with an \"English Language Arts\" score, which will be comprised of the English and Reading scores. Additionally, a “progress toward career readiness\" score will show students where they need to improve on specific skills and a \"text complexity progress indicator\" will assess students’ abilities to understand complex passages.\r\n\r\n[caption id=\"attachment_106761\" align=\"alignright\" width=\"218\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-03-at-12.39.11-AM.png\"><img class=\"size-full wp-image-106761\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-03-at-12.39.11-AM.png\" alt=\"The newly-designed ACT will \" width=\"218\" height=\"87\" \/><\/a> This September, changes to the ACT will include new score indicators and the essay. According to Palo Alto High School College Advisor Sandra Cernobori, the changes will not have a huge impact on the overall composite score. Screenshot by Daniel Li.[\/caption]\r\n\r\nAccording to its <a href=\"http:\/\/www.actstudent.org\/\">website<\/a>, these scores and indicators will “give students a greater and more specific understanding of both their preparation for success after high school and how to better meet their goals,” which will in turn “better inform teaching, planning and decision making.”\r\n\r\n“The ACT STEM score is a sub score just like how right now there is an English writing sub score,” Cernobori said. “It is basically an indicator to help students know what their strengths are in terms of English and writing, and then in math and science. Students should not fret about it too much, since it will not have a big impact on the overall composite score.”\r\n\r\nIn addition, the ACT organization will also enhance the scoring and change its approach to the optional essay. The essay will aim to encourage consideration of multiple viewpoints and will be scored on several basic criteria: ideas and analysis, development and support, organization and language use.\r\n\r\n“The ACT essay will be more complex, as there are going to be three kinds of opinions and perspectives,” Cernobori said. “Students will be asked to read them and then analyze them as to their strengths and weaknesses and form their own position. It is a compound task and a more complex task; therefore, more time will be allocated to complete the task.”","excerpt":"Contrary to the College Board, the ACT organization has been implementing minor changes to the ACT exam throughout these past couple years, such as adding “paired passages” to its reading section in late 2014. However, this September, the major changes to the exam will include score indicators and the essay.","date":"2015-09-05 19:39:14","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/FullSizeRender-2.jpg","categories":["Uncategorized"],"tags":{"9680":"ACT","52047":"ACT organization","14165":"cernobori","8604":"college","29087":"essay","52046":"new ACT","8944":"palo alto high school","8953":"paly","49943":"Sandra Cernobori","52048":"score indicators","49944":"standardized tests","52049":"STEM score","33418":"tests"}},{"id":106616,"title":"SAT: Redesigned exam to debut in 2016","permalink":"http:\/\/palyvoice.com\/2015\/09\/05\/sat-redesigned-exam-to-debut-in-2016\/","content":"The revised SAT is slated to debut in March 2016, and each change has been made to test the knowledge and skills that are essential for success in the real world, according to a <a href=\"https:\/\/www.collegeboard.org\/releases\/2014\/expand-opportunity-redesign-sat\">press release<\/a> from the College Board.\r\n\r\nPalo Alto High School College Advisor Sandra Cernobori explains that the changes implemented on the new exam will be more aligned to Common Core standards, which have recently been implemented in high schools across California and the nation.\r\n\r\n\"The content on the new SAT will be modeled to what it is students are learning in the classrooms,\" Cernobori said. \"This change will ultimately be more beneficial to the students.\"\r\n\r\nAccording to the College Board's <a href=\"https:\/\/www.collegeboard.org\/\">website<\/a>, the redesigned SAT will move from the 2400-point scale to the 1600-point scale and will be comprised of three sections: \"Evidence-Based Reading and Writing,\" \"Math\" and an optional essay. However, instead of including the essay in the composite score as the current SAT does, the essay score will stand alone in the redesigned exam, similar to the ACT.\r\n\r\n[caption id=\"attachment_106766\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-03-at-12.43.52-AM.png\"><img class=\"size-full wp-image-106766\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-03-at-12.43.52-AM.png\" alt=\"The redesigned SAT will debut in March 2016 and for the first time, the essay will be optional.\" width=\"300\" height=\"202\" \/><\/a> The redesigned SAT will debut in March 2016 and for the first time, the essay will be optional. Screenshot by Daniel Li.[\/caption]\r\n\r\nThe College Board has made the essay optional since many college admissions officers failed to see the value of the essay. According to its website, the new optional essay is now similar to a typical college writing assignment and it will \"show how well [students] understand the passage and use it as the basis for a well-written thought-out discussion.\" Although the essay is optional, some colleges will still require students to take it.\r\n\r\nFurthermore, the new exam will be three hours in length, plus an additional 50 minute optional essay, compared to the current total time of three hours and 45 minutes. According to the press release from the College Board, the test will be administered in both print and computer in March 2016. The new SAT will exclude the notoriously difficult “SAT words” of the current SAT, such as \"punctilious,\" and instead will focus on more relevant vocabulary that students will consistently use in the future, such as \"synthesis.\" There will also be no penalty for wrong answers.\r\n\r\nThese changes leave many students, especially the juniors, to choose whether to take the old or the new SAT.\r\n\r\n“Students can take the old exam before March and colleges will still accept it,” Cernobori said. “Most juniors do not take the exam prior to March, as the vast majority use the PSAT as a practice tool. Juniors could take the current SAT, but I’m not recommending they do that. Students can certainly take both tests if they wanted to.”\r\n\r\nIn addition, according to its website, the College Board has announced its decision to partner with Khan Academy to provide free online test preparation for low-income families, in hopes of eliminating the inequalities surrounding these standardized tests.","excerpt":"The revised SAT is slated to debut in March 2016, and each change has been made to test the knowledge and skills that are essential for success in the real world, according to a press release from the College Board.","date":"2015-09-05 19:39:02","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/FullSizeRender-4.jpg","categories":["Uncategorized"],"tags":{"14165":"cernobori","8604":"college","12294":"college board","52045":"common core","49945":"khan academy","52042":"new SAT","8944":"palo alto high school","8953":"paly","52043":"redesigned SAT","49943":"Sandra Cernobori","29935":"sat"}},{"id":106830,"title":"Bay Area hotspots for Labor Day weekend","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/bay-area-hotspots-for-labor-day-weekend\/","content":"It's always exciting to go on a trip for Labor Day weekend, but for those staying in town, here are a few fun, cheap activities to make the weekend great.\n\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Untitled-Infographic4.png\"><img class=\"alignnone  wp-image-107024\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Untitled-Infographic4.png\" alt=\"Untitled Infographic\" width=\"475\" height=\"982\" \/><\/a>\n\n<iframe src=\"https:\/\/www.google.com\/maps\/d\/u\/2\/embed?mid=zjB4wKLmGR6g.kgyyYuIgqxXM\" width=\"640\" height=\"480\"><\/iframe>","excerpt":"It's fun to go on a trip on Labor Day weekend, but for those of us stuck in the Bay Area here are a few fun cheap things to do!","date":"2015-09-04 21:50:45","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Untitled-Banner.png","categories":["Features","Multimedia","Spotlight"],"tags":{"50270":"bank of america","8512":"Bay Area","50272":"computer history museum","50271":"de young museum","50273":"foothills park","50266":"garden of eden","50274":"hiking","50265":"labor day weekend","50269":"mueseum","8939":"palo alto","8944":"palo alto high school","8953":"paly","50275":"redwood roller rink","50276":"roller skating","50267":"shakespeare","50268":"shakespeare in the park"}},{"id":106870,"title":"Ban on junior Spirit Week theme idea causes uproar","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/ban-on-junior-spirit-week-theme-idea-causes-uproar\/","content":"A few Palo Alto High School juniors prompted a response from Paly administration after harshly criticizing a ruling to ban a Spirit Week theme idea deemed culturally insensitive.\r\n\r\nIn the Class of 2017 Spirit Week theme meeting on Sept. 1, students selected the theme \"Gold Chains\" as one of the top options. The theme would consist of students dressing to mimic hip-hop culture. Student Activities Director Matthew Hall went to administration to approve the theme, but it was quickly ruled out.\r\n\r\nIn the wake of the decision, several juniors posted on Facebook to express their opinions on the matter. According to junior Adrian Smith, he posted a photo of a hand controlling a puppet in the “Paly Class of 2017” Facebook group because the decision brought up issues of student voice.\r\n\r\n“I felt like the student body [Associated Student Body] wasn’t a ‘student-based’ group,” Smith said. “My original goal of posting that picture was to speak for us students and to slightly send a message to the staff.”\r\n\r\nPrincipal Kim Diorio directed an email yesterday towards the whole Class of 2017 but specifically responded to the upset students who posted on Facebook to express their opinions, calling some messages “hurtful, accusatory and cruel.” Diorio explains the rationale and process for banning the theme in her email.\r\n\r\n“First, instead of being upset with your peers or teachers, please know the administrative team at Paly unanimously ruled against the 'Gold chains\/thug life' theme based on concerns of cultural appropriation, offending others and\/or perpetuating stereotypes,” Diorio said in the email. “We recognize, and this Facebook page confirms to some degree, a greater need for sensitivity training and developing empathy and compassion towards one another at Paly.”\r\n\r\nAt first, junior Emily Read said she did not recognize the reasoning for banning the theme. According to Read, other class members were also bothered when the decision first went public. At the time it was not clear to everyone as to who had made the decision, so people incorrectly held ASB accountable for the ban. Junior Ibby Day also believes students directed their frustrations at the wrong people.\r\n\r\n“I think a lot of the people who were angry at the banned theme don't really understand what ASB's part in this whole thing is,” Day said. “I think many people use ASB as a direct way to start a fight because it is mostly student-run, and they don't want to bring up the issue to the Paly admin adults.”\r\n\r\nDay says she wrote a Facebook post in the class group to defend the members of ASB, who were the intended recipients of some unkind messages written by juniors.\r\n\r\n<span style=\"color: #141823;\">\"I want to defend ASB again because all they are doing is making sure that Paly doesn't get sued for a week that honestly has no apparent value besides fun and cooperation amongst peers,\" Day said in the post.<\/span>\r\n\r\nAccording to Day, she was disturbed by the disrespect being aimed toward ASB.\r\n\r\n“People were making rash accusations towards people who were only trying to keep Spirit Week fun and inclusive,\" Day said.\r\n\r\nAccording to Read, she realized the cause of the ban after explanations by Diorio and Hall, though she is still disappointed with the final outcome.\r\n\r\n“I'm still upset that it [the theme] was banned, but I understand why and I agree with it not being used,” Read said.\r\n\r\nDay appreciates Diorio’s message to her class as well.\r\n\r\n“I feel her response was completely appropriate to the situation,” Day said. “She handled it professionally and [was] open-minded, and I'm glad she took action because those who targeted ASB need to understand that if they have a serious concern with why spirit week themes are banned, they have the opportunity to work it out with an admin.”","excerpt":"A few Palo Alto High School juniors prompted a response from administration after harshly criticizing a ruling to ban a Spirit Week theme idea deemed culturally insensitive.","date":"2015-09-04 18:37:44","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/soph1.jpg","categories":["News","Spotlight"],"tags":{"8458":"administration","50762":"ban","8644":"diorio","14282":"hall","9760":"juniors","8944":"palo alto high school","8953":"paly","9119":"Spirit Week","28800":"theme","9244":"Yellow"}},{"id":106876,"title":"Boys’ water polo looks to improve despite construction obstacles","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/boys-water-polo-looks-to-improve-despite-construction-obstacles\/","content":"[caption id=\"attachment_106894\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/600By800BoysWopoPractice-150904.jpg\"><img class=\"wp-image-106894 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/600By800BoysWopoPractice-150904.jpg\" alt=\"The Palo Alto High School boys’ water polo team executes some drills at the Rengstorff Pool in Mountain View during practice. The team’s first game is against Jesuit High School on Sept. 4 at the opponent's school in Davis.\" width=\"800\" height=\"600\" \/><\/a> The Palo Alto High School boys’ water polo team executes some drills at the Rengstorff Pool in Mountain View during practice. The team’s first game is against Jesuit High School on Sept. 4 at at the opponent's school in Davis. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School boys’ water polo team looks to overcome changes and improve on its second round exit from Central Coast Section last year as its season gets underway today with a non-league game.\r\n\r\nOne of the major changes this year for the Vikings will be that the team won’t be able to play in a home pool. Instead, they have been practicing and playing at the Rengstorff Pool in Mountain View. Once the regular season begins, the team will play home games at Gunn High School’s pool.\r\n\r\nAccording to senior right hand driver Winston Rosati, not having a home pool has been an nuisance.\r\n\r\n“It has been a big inconvenience in terms of logistics and has made certain practice drills much harder to do, but we can certainly do our best with it,” Rosati said.\r\n\r\nNew head coach Aaron Johnson agreed that having no pool might be a hindrance, but he attributed a smooth transition to the new Paly athletic director and team parent.\r\n\r\n“It has definitely been a challenge not having our own pool this season, but we have not let it become a set-back,” Johnson said. “Our athletic director Kathleen Bowers and our team parent Kristen Anderson have done an amazing job making the transition go as smooth as possible. We are also grateful to be able to use Gunn High School as our home pool this year.”\r\n\r\nAnother place the team has experienced change is at the coaching position. Although Johnson is a new head coach, he has had some experience working with the Paly water polo team.\r\n\r\n“I was previously the Paly Frosh\/Soph coach for the past few seasons, so when the varsity job opened up, I was ready to step in to the position,\" Johnson said. “It is something I have been looking forward to for quite some time.”\r\n\r\nAccording to junior right hand driver Andrew Jozefov, Johnson’s style will help the team get better this year.\r\n\r\n“I really like his style,” Jozefov said. “It is really structured which I feel is definitely going to help us. … He holds us to a high standard and expects us to be able to execute.”\r\n\r\nThe team also lost a few key contributing seniors including Lucas Novak, Seth Alston, Ray Zhao, Hans Usman and Luke Schroder.\r\n\r\n“There were some really hard-working team leaders that graduated last year, which is a big loss to this team,” Johnson said. “Lucas Novak redefined the role of captain. He was an amazing leader, positive influence on everyone around him and always pushed himself and teammates to be the best they can.”\r\n\r\nHowever, Johnson believes that there are many players who are capable of stepping up to offset losses.\r\n\r\n“I am however, lucky to have a lot of young talent coming up,” Johnson said. “One in particular is Jack Anderson, a sophomore with a starting position on varsity. He is an underclassman with a big task.\"\r\n\r\nDespite the many changes, the team has set high goals.\r\n\r\n“Our goals are to win SCVAL [Santa Clara Valley Athletic League] league and to get top three at CCS [Central Coast Sections],” Rosati said.\r\n\r\nJozefov is using last year’s disappointment to fuel himself this season.\r\n\r\n“Last year we had a first round bye and got knocked out in the second round and that was pretty disappointing,” Jozefov said. “We hope to get to the semis this year.”\r\n\r\nAccording to Johnson, the team has the right mindset and is excited to begin its season.\r\n\r\n“We’re going out focusing on winning one quarter at a time and playing consistent water polo. We are looking forward to getting this season rolling.”\r\n\r\nThe Viking’s first game is against Jesuit High School at 7 p.m. today in Davis.","excerpt":"The Palo Alto High School boys’ water polo team will look to overcome changes and improve on its second round exit from Central Coast Section last year as its season begins today with an out-of-league game.","date":"2015-09-04 16:55:11","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/600By800BoysWopoPractice-1509041.jpg","categories":["Sports"],"tags":{"9845":"boys water polo","8568":"CCS","50763":"jesuit high school","12043":"new coach","9236":"Winston Rosati"}},{"id":106767,"title":"Liveblog: Football vs. Sequoia","permalink":"http:\/\/palyvoice.com\/2015\/09\/04\/liveblog-football-vs-sequoia\/","content":"Check back here beginning at 7:15 p.m. this Friday, Sept. 4 as the Palo Alto High School football team (0-0, 0-0) hosts the Sequoia High School Cherokees (0-0, 0-0) for it's first regular season game of the season.\r\n\r\n[liveblog]","excerpt":"Check back here beginning at 7:15 p.m. this Friday, Sept. 4 as the Palo Alto High School football team (0-0, 0-0) hosts the Sequoia High School Cherokees (0-0, 0-0) for it's first regular season game of the season.","date":"2015-09-04 13:18:21","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2014-11-10-at-8.40.13-PM.png","categories":["Sports","Spotlight"],"tags":{"8714":"football","29126":"home opener","8855":"liveblog","25428":"sequoia"}},{"id":106292,"title":"Yearbook expands senior photo options","permalink":"http:\/\/palyvoice.com\/2015\/09\/03\/yearbook-expands-senior-photo-options\/","content":"This year, seniors will be able to submit their own photos for their yearbook portraits, greatly expanding their options from previous years.\r\n\r\nIn years prior, seniors were limited to paying for a professional photographer, using their student identification cards or attending a free session in which they were unable to chose their photo.\r\n\r\n\"I thought it [the old system] was good, but kind of overpriced,\" senior Courtney Lovely said.\r\n\r\nWith a new leadership team, Madrono is aiming to improve its photo submission policy.\r\n\r\n\"This year, we have [Madrono has] a new teacher, and we both agreed that it was ridiculous that people [felt pressured to] pay for their senior portraits so we decided that this year we would try a new method of doing it,\" Co-editor-in-chief, Blake Ragsdale said. \"We are really trying to redefine the yearbook, and this was one of the steps in order to redefine it.\"\r\n\r\nSeniors seem to enjoy this new option.\r\n\r\n\"I think allowing your own submissions is great,\" senior Alfredo Gonzalez said. \"It's good for people who want the freedom that a professional photo shoot has with location, but don't want to pay the price.\"\r\n\r\nThe photos must follow certain guidelines.\r\n\r\n\"They must be 4 inch by 5 inch, 300DPI, and a professional-looking photo, delivered to the yearbook classroom <span style=\"color: #545454;\">– Room <\/span>101 <span style=\"color: #545454;\">–<\/span> via USB after school on Tuesdays or Thursdays,\" Ragsdale said.\r\n\r\nPhotos will be due by Oct. 15, according to Madrono's photo guide.\r\n\r\nMouse around the Prezi to explore your portrait options. Click the text to zoom in.\r\n[prezi id=\"ajj3_rsitixw\"]","excerpt":"The Paly Voice presents a guide to getting a perfect yearbook picture for seniors confused about senior portrait options. ","date":"2015-09-03 11:24:44","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/Screen-Shot-2015-08-27-at-11.19.06-AM.png","categories":["Multimedia","News"],"tags":{"8953":"paly","23891":"senior portrait","23892":"yearbook"}}]