[{"id":112463,"title":"Boys&#8217; water polo optimistic after disappointing finish to season","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/boys-water-polo-optimistic-after-disappointing-finish-to-season\/","content":"[caption id=\"attachment_112534\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/WaterPoloPractice1.jpg\"><img class=\"wp-image-112534\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/WaterPoloPractice1.jpg\" alt=\"Junior Andrew Jozefov looks to pass during the a Vikings' practice. Jozefov will look to lead the Vikings deep into the CCS playoffs next season. Photo by Cooper Lou.\" width=\"600\" height=\"405\" \/><\/a> Junior Andrew Jozefov looks to pass during the a Vikings' practice. Jozefov will look to lead the Vikings deep into the CCS playoffs next season. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School boys' water polo team (12-13, 8-6) looks improve and change its mentality next year after an unfortunate end to its season.\r\n\r\nDespite earning a first round bye, the Vikings' season ended after falling to Saint Francis High School last Saturday in the Central Coast Section Quarterfinal, 15-4. Last year, the team exited the playoffs one stage earlier.\r\n\r\nJunior Jared Stanley said he thought that the team could have done better in the CCS playoffs.\r\n\r\n“The past season went very well, but we were hoping to get a little bit further in CCS,” Stanley said. “It was disappointing to lose in the quarterfinals of CCS. It was also disappointing to not perform as we had expected to in the league tournament as we were hoping to play in the league final.”\r\n\r\nJunior Andrew Jozefov said that a lack of focus from the team ultimately led to its loss.\r\n\r\n“We had a few dedicated guys who performed well this year,” Jozefov said. “We didn't necessarily have everyone on the team working with the same mentality, which didn't exactly help the team.”\r\n\r\nJozefov said that the Vikings will have high goals going into next season.\r\n\r\n“Next year we plan on winning leagues and beating Gunn [High School] in league play,” Jozefov said. “Hopefully we can earn a good seed for CCS and get a bye into the semis so we have a solid chance at making some good things happen against some of the top private schools.”\r\n\r\nDespite losing eight seniors including Kevin Bowers, Justyn Cheung, Christian Laurence, Ryan Reed, Luke Coleman, Cameron Kahn and Winston Rosati, the Vikings are very optimistic for the future and believe they will have the experience necessary to do well in the CCS playoffs next year. According to Stanley, the team will have a majority of senior starters as there are many current juniors who can step up. However, even though the team will have enough experience, Stanley recognized the importance of the team's mentality.\r\n\r\n“We will have almost a full senior starting lineup next year and as a result hope to definitely be serious contenders for CCS finals,\" Stanley said. \"In order to do so we need to practice hard in the off season and treat every game like it's our last.","excerpt":"The Palo Alto High School boys' water polo team (12-13, 8-6) looks toward a fresh start next year after a disappointing end to its season.","date":"2015-11-30 20:50:12","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/WaterPoloPractice.jpg","categories":["Sports","Spotlight","water polo"],"tags":["boys water polo","CCS","jozefov","stanley","vikings","water polo"]},{"id":112531,"title":"ASB Movie Night &#8220;Home Alone&#8221; is this Friday, Dec. 4 in the Media Arts Center","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/asb-movie-night-home-alone-is-this-friday-dec-4-in-the-media-arts-center\/","content":"","excerpt":"","date":"2015-11-30 15:47:10","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112529,"title":"ASB Kickball Game is this Friday, Dec. 4 during lunch","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/asb-kickball-game-is-this-friday-dec-4-during-lunch\/","content":"","excerpt":"","date":"2015-11-30 15:45:39","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112526,"title":"Choir Madrigal Feaste begins on Dec. 4 and runs through Dec. 6 at Jordan Middle School","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/choir-madrigal-feaste-begins-this-friday-dec-4-and-runs-through-sunday-dec-6-at-jordan-middle-school\/","content":"","excerpt":"","date":"2015-11-30 15:42:08","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112522,"title":"Fiery arts winter sale is this Friday, Dec. 4 and Saturday, Dec. 5, outside the tower building","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/fiery-arts-winter-sale-is-this-friday-dec-4-and-saturday-dec-5-outside-the-tower-building\/","content":"","excerpt":"","date":"2015-11-30 15:35:25","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112500,"title":"Advisory this week is for all sophomores and freshmen (individual meetings)","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/advisory-this-week-is-for-all-sophomores-and-freshmen-individual-meetings\/","content":"","excerpt":"","date":"2015-11-30 11:53:50","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112354,"title":"Season Preview: Girls&#8217; soccer hopes to continue success","permalink":"http:\/\/palyvoice.com\/2015\/11\/30\/season-preview-girls-soccer-hopes-to-continue-success\/","content":"[caption id=\"attachment_112355\" align=\"alignleft\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/MG_3002.jpg\"><img class=\"size-full wp-image-112355\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/MG_3002.jpg\" alt=\"Senior Jacey Pederson dribbles the ball past a defender as the Vikings defeat Menlo Atherton 1-0 in the CCS quarterfinals last season. Photo by George Lu.\" width=\"600\" height=\"399\" \/><\/a> Senior Jacey Pederson dribbles the ball past a defender in the Central Coast Sections quarterfinals last season against Menlo-Atherton High School. The Vikings went on to play in the CCS finals last season. Photo by George Lu.[\/caption]\r\n\r\nThe Palo Alto High School girls' soccer team looks to continue their success, after making it to the Central Coast Section finals last year.\r\n\r\nDespite losing to Mountain View High School in the CCS final, the Vikings ended their last season with an overall record of 17-3-1 and a league record of 9-2-1.\r\n\r\nAs the team prepares for the upcoming season, everyone is working hard to get better despite losing key seniors, according to assistant coach Eric Seedman.\r\n\r\n“Our biggest loss coming into this season was Katie Foug,” Seedman said. “She was a tremendous leader on and off the field, but we have many girls who have stepped up this year.”\r\n\r\nSeedman says that Paly is going to be a major contender in the upcoming season.\r\n\r\n“We’re going to be one of the best teams in the area,\" Seedman said. \"We have a lot of talent up and down the roster, and we have arguably one of the best players in this area, Jacey Pederson. We also have three or four players just a bit under her skill-wise.”\r\n\r\nSenior defender Jacey Pederson shares many of the same sentiments as her coach.\r\n\r\n“Every year we've gotten further and further in CCS,” Pederson said. “Losing last year's championship was disappointing, but this year it's only motivating us to work even harder, and hopefully this year we can win it all.”\r\n\r\nSome players to look out for are seniors Pederson, Heidi Moeser and sophomore Emily Tomz according to Pederson.\r\n\r\nThe Vikings' first game is at 3:15 p.m., Dec. 3 at Los Altos High School.","excerpt":"The Palo Alto High School girls' soccer team looks to bounce back this year after a disappointing loss to Mountain View High School in the Central Coast Section finals last year.\r\n","date":"2015-11-30 11:52:25","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/MG_3002.jpg","categories":["Sports","Uncategorized"],"tags":["CCS","girls","girls soccer","Soccer"]},{"id":112429,"title":"Boys&#8217; cross country to compete at state championships","permalink":"http:\/\/palyvoice.com\/2015\/11\/27\/boys-cross-country-to-compete-at-state-championships\/","content":"[caption id=\"attachment_112451\" align=\"alignnone\" width=\"604\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-27-at-6.38.22-PM.png\"><img class=\" wp-image-112451\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-27-at-6.38.22-PM.png\" alt=\"Juniors Kent Slaney and Naveen pai run at the Sunnyvale baylands earlier this season. According to Coach Kelsey Feeley, the Palo Alto High School boys' cross country team has been working hard to prepare for tomorrow's state championships. Photo courtesy of Malcom Stanley. \" width=\"604\" height=\"395\" \/><\/a> Juniors Kent Slaney and Naveen Pai run at the Sunnyvale Baylands in October. According to Coach Kelsey Feeley, Slaney won the division one Central Coast Section title and she is confident for tomorrow's state championships. Photo courtesy of Malcom Stanley.[\/caption]\r\n\r\nThe Palo Alto High School boys' cross country team will be competing at the California Interscholastic Federation State Championships tomorrow in Fresno after a second place finish at Central Coast Section Championship this month.\r\n\r\nAccording to Coach Kelsey Feeley, the team has been training hard to prepare for States.\r\n\r\n“I think the team is ready to do better than they did last season,” Cross country runner Kai Oda said. “That's not hard since we placed dead last at States last year.”\r\n\r\nOda predicts that the team will place in the top 10 at States this year.\r\n\r\n\"We have used the last two weeks since taking second at CCS finals to focus on form and pacing work,\" Feeley said.\r\n\r\nKey runners to look out for are freshman Henry Saul, sophomore Sam Craig and junior Naveen Pai. According to Oda, the team's fastest runner, junior Kent Slaney, is injured so he may not run at States.\r\n\r\n\"The entire team is hoping that he recovers in time to race,\" Oda said. \"If Slaney does not run, then sophomore Aashai Avadhani will fill in as an alternate.”\r\n\r\nFeeley is confident for tomorrow and is excited to see how all of the boys run.\r\n\r\n“We were lucky to attend an invitational at the Woodward park course earlier in the year, so hopefully the boys will feel more comfortable and prepared this time around,” Feeley said.","excerpt":"The Palo Alto High School boys' cross country team will be competing for the state championship tomorrow in Fresno after a second place finish at Central Coast Section Championship this month.","date":"2015-11-27 18:49:22","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-27-at-6.38.22-PM.png","categories":["Sports"],"tags":["CCS","cross country","feely","Henry","kai","kelsey","kent","naveen","oda","sam","states"]},{"id":112282,"title":"Le Tricolore n&#8217;est pas suffisant?","permalink":"http:\/\/palyvoice.com\/2015\/11\/22\/le-tricolore-nest-pas-suffisant\/","content":"[caption id=\"attachment_112329\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/flag.jpg\"><img class=\"wp-image-112329\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/flag.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"650\" height=\"488\" \/><\/a> Illustration by Portia Barrientos.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In the wake of a series of horrific terrorist attacks in Paris on Nov. 13 that left over 100 dead and many more wounded, people across the globe have moved quickly to denounce the violence and express their solidarity with France. Famous monuments such as the Sydney Opera House, the statue of Christ the Redeemer and the World Trade Center lit up the colors of the <\/span><i><span style=\"font-weight: 400;\">Tricolore<\/span><\/i><span style=\"font-weight: 400;\">. Snapchat offered a temporary filter with the text “Pray for Paris,” and Facebook gave its users the option to superimpose the French flag on their profile pictures.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The day after the attacks, I checked my Facebook feed and encountered a sea of red, white and blue; my Facebook friends had changed their profile pictures in an attempt to express their support for the nation of France. Feeling moved by this display of solidarity, I quickly decided to take up Facebook’s offer and change my profile picture too.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Then, in the very moment I clicked post, a question occurred to me: Was there any value in what I just did?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">I tried to process the rationale behind my decision. Did I change my profile picture to raise awareness? Absolutely not. You’d have to be living under a rock to not know this tragedy occurred. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Did I do it to console people in a time of grief? Well, if that was my objective, I wasn't sure if seeing the French flag overlaid over Facebook profile pictures was of genuine solace to people intimately connected with France. To get more insight, I spoke with junior Emily Read, who lived in a small town outside of Paris for several years. She changed her Facebook profile picture to the \"Peace for Paris\" Eiffel Tower graphic that was widely popularized on social media in the aftermath of the tragedy.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Seeing people’s profile pictures and buildings across the world light up red, white and blue is nice because it’s really uniting,” Read said. “We can’t really do anything actively about the attacks, but we can at least show our support.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Read did note that she was personally disappointed by the fact that Facebook had made it an option to overlay only the French flag, when there had been so many attacks in other parts of the world. However, she criticized some for perpetuating the notion that the attention directed toward the tragedy in France was excessive.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I did not like that some people negated the support toward Paris and said ‘Why are we supporting Paris so much? We should be supporting the other places instead,’” she said. “We shouldn’t be neglecting our support toward Paris; we should be supporting everyone at the same time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Of course, perhaps the thorniest issue surrounding the social media movement is that these gestures are inherently Eurocentric. We had the option to display our support for France, but not for Lebanon, nor Syria nor any other nation that experienced tremendous tragedies that same day. Have people, perhaps inadvertently, espoused Western-centrism by making this display of solidarity?<\/span>\r\n\r\nEven if the gesture does come across as Western-centric, all the blame cannot be placed squarely on the individuals who adopted it. The reason that so many Americans sprung to change their profile pictures to the flag of France and not that of other nations is the result of years and years of close cultural ties with Europe, in tandem with minimal media coverage in non-Western nations. I’m not suggesting that we should shirk our obligations to be informed about world affairs — rather, I’m simply saying that this kind of social media mobilization in response to a tragedy in a western European nation should not have been unexpected.\r\n\r\n<span style=\"font-weight: 400;\">Ultimately, I don’t think that the outpouring of support on social media in this manner was inherently ill-intentioned. It may come across as perfunctory and not all that useful — how is superimposing the French flag over our faces supposed to solve anything? — but there is, oddly enough, an element of pragmatism in such a gesture. It stems from the realization that we don’t have the capability to solve the insidious problem at hand, but we can show our solidarity. And of course, social media is one of the most accessible platforms to display that sentiment. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The French flag stunt is simply the most recent manifestation of a wide-spread cultural phenomenon — taking to social media to express support for causes that are morally resonant but perhaps feel remote and intangible. We should be careful to avoid thinking that social media activity is the sole way we can make a difference. I know that none of us are going to single-handedly stamp out terrorism, but we do have a role to play. We can, for example, combat the rampant Islamophobia and xenophobia that is unfounded and causes extremist organizations to fester, while still engaging in meaningful dialogue about eradicating terrorism. Furthermore, we can take it upon ourselves to become more informed citizens (perhaps all that entails is parsing over the World News section for a little bit longer).<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At some point, the last traces of red, white and blue will disappear from our newsfeeds, perhaps to be replaced by another social media crusade. There is some value to be found in such a display, but it's important that we are not deluded into thinking symbolism is the only means by which we can effect change. <\/span>","excerpt":"Social media gestures in the wake of tragedy may come across as perfunctory and not all that useful, but they, oddly enough, are rooted in pragmatism. ","date":"2015-11-22 18:28:09","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/flag.jpg","categories":["Opinion","Spotlight"],"tags":["emily read","eurocentrism","Facebook","France","paris","social media"]},{"id":112286,"title":"Key Club to host Fun Run","permalink":"http:\/\/palyvoice.com\/2015\/11\/20\/key-club-to-host-fun-run\/","content":"[caption id=\"attachment_112287\" align=\"aligncenter\" width=\"515\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/12244105_970779246313455_1034644347_n.jpg\"><img class=\"wp-image-112287\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/12244105_970779246313455_1034644347_n.jpg\" alt=\"12244105_970779246313455_1034644347_n\" width=\"515\" height=\"386\" \/><\/a> Junior and Key Club President, Albert Hwang works to plan out volunteer shifts for the Fun Run. The run will raise for money for the Pediatric Trauma Program. Photo by Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">From 2 to 4 p.m. Saturday, Palo Alto High School’s Key Club will host its first-ever Fun Run at the Mitchell Park Library to fundraise for the Kiwanis Pediatric Trauma Program. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Key Club’s goal is community service, according to junior and Key Club President Albert Hwang. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our goal is to help out the general community with projects that need volunteers,” Hwang said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Key Club is working with other local organizations to host the event.<\/span>\r\n\r\n“We’re helping the Kiwanis group,” senior and vice president, Minyoung Kim said. “Kiwanis is the adult Key Club and together, we’re working to stand against pediatric trauma. All proceeds will be donated to PTP.”\r\n\r\n<span style=\"font-weight: 400;\">Other partner organizations for the event include the Gunn High School Key Club, Chipotle, Safeway, Starbucks and Spot Pizza, according to the <a href=\"https:\/\/www.facebook.com\/events\/1391408267825416\/\">event webpage.<\/a><\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Pediatric Trauma Program works to help traumatized children. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The mission of the Pediatric Trauma Program is to develop local projects which will reduce the number of children in our three-state district who are killed or injured by traumatic life events,” Kim said. “We want all children live happy, healthy and safe lives.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Pediatric trauma remains the leading cause of death and injury among children ages 14 and under in the United States, according to Hwang. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Key Club aims to draw a large crowd through fun community-wide activities like the run.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We named the event a Fun Run because we think students will have fun running for a cause,” Kim said. “It’s our first year doing this and we hope it’ll be a success.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The fee for the Fun Run is $10, which includes covers pizza, hot dogs, salad and fruits. Coffee and lemonade will also be provided, according to the <a href=\"https:\/\/www.facebook.com\/events\/1391408267825416\/\">Fun Run event page.<\/a><\/span>\r\n\r\n<span style=\"font-weight: 400;\">Attendents will also be entered into a raffle. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For every six laps, or $3, you get a raffle ticket,” Kim said. “You’ll have a chance to win a Powerbeats 2 headphones of a Chipotle gift card.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">If you are interested in learning more about pediatric trauma or about how you can help, <a href=\"http:\/\/www.cnhfoundation.org\/how-to-help\/h2h-pediatric-trauma-program\/\">click here for more information.<\/a><\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"From 2 to 4 p.m. this Saturday, Palo Alto High School’s Key Club will host its first ever Fun Run at the Mitchell Park Library to fundraise for the Pediatric Trauma Program. ","date":"2015-11-20 14:49:19","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/key-club.jpg","categories":["News"],"tags":["charity","fun run","key club","mitchell park","news","pediatric trauma","PTP","run","saturday"]}]