[{"id":97856,"title":"Girls&#8217; soccer looks to win it all","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/girls-soccer-looks-to-win-it-all\/","content":"[caption id=\"attachment_97861\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg\"><img class=\"wp-image-97861 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg\" alt=\"Senior midfielder Katie Foug carries the ball forward into the Los Gatos half. Paly beat Los Gatos 2-0. Photo by George Lu\" width=\"600\" height=\"399\" \/><\/a> Senior midfielder Katie Foug carries the ball forward into the Los Gatos half. Paly beat Los Gatos 2-0 on Jan. 24. Photo by George Lu.[\/caption]\r\n\r\nAfter defeating Santa Clara High School (8-4-4, 5-3-2), the only team to serve it a loss this season, today by a score of 9-2, the Palo Alto High School girls’ soccer team (14-1-0, 8-1-0) is tied for first in the De Anza League, leading the league in most goals scored and fewest goals allowed , according to <a href=\"http:\/\/www.maxpreps.com\/league\/gJhb-VuN5kesTljiplLOEQ\/standings-scval---de-anza.htm\" target=\"_blank\">Maxpreps<\/a>.\r\n\r\nThe team is doing historically well. On Jan. 20, Paly beat Mountain View High School (12-3-0,7-1-0) for the first time since 2007 to move back into a tie for first place in the DAL.\r\n\r\nAssistant Coach Eric Seedman said he feels the team is having a great season so far.\r\n\r\n“If we can keep it up, it could be very special indeed,” Seedman said.\r\n\r\nSeedman said he was impressed with the way the team handled its first setback of the loss to Santa Clara.\r\n\r\n“The team got right back to work and cleaned up some of the details that led up to that setback,” Seedman said. “The players are very resilient. They didn't let it get them down.”\r\n\r\nJunior forward and defender Alison Lu also noted the team’s successful season but said there are a few things the team can do to reach its ultimate goal of winning the DAL and later the Central Coast Section finals.\r\n\r\n“We've had many chances in front of the goal but haven't been able to capitalize on those opportunities,” Lu said. “We're just going to keep practicing and work on starting games off strong. We sometimes start off a bit lackadaisical and have a few moments in the beginning where we don't have full control of the ball.”\r\n\r\nPaly players currently lead the DAL in multiple categories, according to <a href=\"http:\/\/www.maxpreps.com\/league\/gJhb-VuN5kesTljiplLOEQ\/standings-scval---de-anza.htm#standings\" target=\"_blank\">Maxpreps<\/a>. Junior midfielder Jacey Pederson leads the DAL in goals with 20, while sophomore goalie Dhara Yu leads the league in fewest goals allowed per game, with an average of 0.4. The team as a whole has scored 55 goals, while only allowing seven.\r\n\r\nSeedman noted the excellence of Pederson's performance but also attributed the team’s success to a wide range of players, including Lu, senior Katie Foug and freshman Emily Tomz.\r\n\r\n“One of our best attributes is our depth,” Seedman said. “We can put any player out on the field at any juncture and have confidence that they will more than hold their own. Most coaches don't have that flexibility.”\r\n\r\nWith <a href=\"http:\/\/www.maxpreps.com\/rankings\/girls-soccer-winter\/1\/section\/ca\/central+coast+section.htm\" target=\"_blank\">Maxpreps<\/a>' standings placing the Vikings third in CCS, a playoff berth seems inevitable.\r\n\r\n“Can we do it?\" Seedman said. \"Yes. Will we do it? Time will tell. We will need to stay healthy, and keep working hard.\"\r\n\r\nThe Vikings' next game is against Mountain View at 3:30 p.m. on Feb. 10 at Mountain View.\r\n\r\n&nbsp;","excerpt":"After defeating Santa Clara High School (8-4-4, 5-3-2), the only team to serve it a loss this season, by a score of 9-2, the Palo Alto High School girls’ soccer team (14-1-0, 8-1-0) is tied for first in the De Anza League, leading the league in most goals scored and fewest goals allowed.","date":"2015-02-05 20:33:35","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg","categories":["Sports","Spotlight"],"tags":{"38451":"allison lu","8568":"CCS","10199":"eric seedman","10198":"girls soccer","25078":"jacey pederson","37715":"midseason","8944":"palo alto high school","8953":"paly","9012":"preview","10667":"santa clara","9110":"Soccer","38450":"update"}},{"id":96876,"title":"Student Film Festival to be held Friday","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/student-film-festival-to-be-held-friday\/","content":"Palo Alto High School's Student Film Festival will showcase a selection of films from the Video Production classes from 7 to 9 p.m. on Friday Feb. 6 in the Media Arts Center. Admission is free to all attendees.\r\n\r\n[caption id=\"attachment_97819\" align=\"alignright\" width=\"290\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/paly_film_fest_logo2015.png\"><img class=\"wp-image-97819\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/paly_film_fest_logo2015.png\" alt=\"paly_film_fest_logo2015\" width=\"290\" height=\"218\" \/><\/a> The logo for Friday's Student Film Festival created by senior Griffin Bajor. Photo courtesy of Paly.net.[\/caption]\r\n\r\nStudents from the Beginning Video Production class as well as the Advanced Video Production class will have their films showcased. Graphic Design students also designed promotional posters inspired by the films, which can be viewed outside the MAC.\r\n\r\nBeginning Video Production students created films in a variety of genres from silent, to horror, to German Expressionist-influenced films, to enviro-comedies that aim for a spot in Palo Alto's Greenlight Film Festival. Advanced Video Production students created films with genres ranging from original poetry adaptations <span style=\"color: #545454;\">—<\/span> which aim for the Scholastic's Art and Writing Awards for Film contest <span style=\"color: #545454;\">—<\/span> to films inspired by their Individuals and Difference unit and an eight hour challenge examining science fiction, technology and schools.\r\n\r\nSome student works will be submitted to the San Francisco International Film Festival and Cinequest, which is a \"qualifier\" film festivals for the Oscars. Three Paly student films have already been invited to screen at Cinequest for the high school student competition.\r\n\r\nAccording to Video Production and Graphic Design teacher Brett Griffith, the MAC atrium screen will be continuously showing a selection of student work throughout the night. The specific films will not be announced until after the film festival, but they will be posted to the <a href=\"vimeo.com\/palyvideoproductions\">Paly Video vimeo<\/a> in a few weeks time.\r\n\r\nThere will be two different types of awards handed out: the Critic's Choice Awards and the Best Overall award. The Critic's Choice awards will be handed out to four current students from the 2014-15 school year and will be recognized by <span style=\"color: #3f3b30;\">a Los Angeles and New York based group of Griffith's peers working as independent, features and commercial filmmakers or academics within higher education, according to the school's <a href=\"http:\/\/paly.net\/news\/2015-paly-student-film-festival\">website<\/a>. The new Best Overall award will be available to former Advanced students who were active mem<\/span>bers of the student film club, have had a film recognized by a major film festival, have participated in the John Lennon Educational Tour Bus or are going on the Student Television Network field trip to San Diego competing in the National Filmmakers' competition, according to Griffith.\r\n\r\n\"I am featuring this new 'Best Overall' award so that current students can be inspired by all that Paly filmmakers can do,\" Griffith said via an email to <em>The Paly Voice<\/em>.","excerpt":"Palo Alto High School's Student Film Festival will showcase a selection of films from the Video Production classes from 7 to 9 p.m. on Friday Feb. 6 in the Media Arts Center. Admission is free too all attendees.","date":"2015-02-05 20:32:07","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/paly_film_fest_logo2015.png","categories":["News","Spotlight"],"tags":{"12716":"film festival","38425":"paly film festival","38426":"student film festival"}},{"id":96416,"title":"Opinion: Violence in Mexico and why it matters","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/opinion-violence-in-mexico-and-why-it-matters\/","content":"[caption id=\"attachment_97750\" align=\"alignnone\" width=\"661\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Ayotzinapa.jpg\"><img class=\"wp-image-97750\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Ayotzinapa.jpg\" alt=\"Photo of a man and a young boy in Ayotzinapa protests.\" width=\"661\" height=\"496\" \/><\/a> A man and a young boy stand in a crowd surrounded by protesters. The young boy's sign asks, \"And if they were your children?\" while the man's sign reads, \"Alive we want them! Now!\" Photos by Antonio Cervantes.[\/caption]\r\n\r\nWe gather at Bolivar House, home to the Center for Latin American Studies at Stanford. People are crowding doorways and streaming out the front door, sitting down on the carpet next to the podium and ducking under glaring camera lenses. There is a feeling of informality so typical of Latin America that it seems to band the whole group together under the weight and tension that accompanies the event. The event begins with a series of presentations, during which a father valiantly comes forward to share a few words with the group. We don't know the man any better than we know the rest of of the crowd, but we band together under his pain because his pain is our pain; his grief, the grief of all of Mexico.\r\n\r\nThis was a few months ago, I was attending a vigil at Stanford University at the Center for Latin American Studies to honor and inform people of the 43 missing students of Ayotzinapa, Guerrero. <a href=\"http:\/\/www.telesurtv.net\/english\/telesuragenda\/Justice-for-Ayotzinapa-20141014-0077.html\">According to South American television network teleSUR<\/a>, the students were arrested by Mexican police and then turned over to local drug gang Guerreros Unidos. When these students disappeared, a connection was drawn between the police who arrested them and the Mexican drug cartels. According to teleSur, authorities believe that the students were killed.\r\n\r\nOccurrences similar to this massacre have become common over the last 10 years in Mexico’s drug war. However, this event has brought to light a connection between the Mexican government and drug cartels, serving as a wake-up call for not only Mexicans but people all over the world. Mexicans and non-Mexicans alike are saying “basta” or “no more” to the death, the corruption, the disappearances and the abuse of power the Mexican government seems to wield.\r\n\r\nThe reaction to the disappearance of these students has exploded into a movement for social change across Mexico and the world, rallied by students of all ethnic backgrounds against the corruption of the Mexican government and its increasingly translucent connection with the Mexican drug cartels. Since the disappearances of the students in Ayotzinapa, there have been hundreds of non-violent protests all over Latin America, many of them still ongoing today.\r\n\r\nMore than 100 people attended the Stanford vigil, Hispanic and non-Hispanic alike. I was glad to finally see people in my community act. Being from Mexico, the Mexican drug war has always been an issue prominent in my life, and the overwhelming support from the Bay Area community was something I had yet to experience. I felt very moved and empowered by the event.\r\n\r\nIt's disappointing how little American news channels have covered the events in Ayotzinapa. At school, I was surprised by the fact I was one of the few people who knew about the tragedy and the movement for social change. It makes sense, coming from Mexico, that I be informed on this topic; however, it doesn't meant that everyone else in Palo Alto should be oblivious to a tragedy that is happening right next door, in a country whose border we share. After asking around, I was also surprised by our community's lack of education on the Mexican drug war in general and other drug wars happening all over Latin America\r\n\r\nThirty-eight percent of California's population is Latino, and towns in the Bay Area such as Redwood City and East Palo Alto have huge Latino communities. Yet, there is a profound disconnect between the United States and Mexico. Violence in Mexico is not really highlighted by the media, and as a result, the few times that these issues are discussed, it is often in blind ignorance. Perhaps this is caused by the distraction of events in the Middle East. Perhaps people believe it does not affect them, or perhaps the fact that violence is happening a road trip away makes them feel uncomfortable and vulnerable.\r\n\r\nRegardless of the reason, violence in Mexico is not often covered by American media. Real violence by real people in a very real proximity to the United States is often left ignored, and what doesn't appear on the screens or in the papers ceases to exist in the minds of the American people.\r\n\r\nThis has to change because these events affect more than just the families of the those 43 missing Ayotzinapa students. They affect your gardener, the guy who bags your groceries at Safeway, your doctor, that student who sits next to you in class, your nanny.\r\n\r\nWe should address these issues not as far off problems, but as issues deserving of our attention that affect us in in California, right here and right now, even if they're not highlighted by the media. We should give our Mexican neighbors the global support they deserve.","excerpt":"Staff writer Emilia Diaz-Magaloni shares her opinion on the absence of coverage on Mexican violence and protests in American media. ","date":"2015-02-05 19:50:58","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Ayotzinapa.jpg","categories":["Opinion","Spotlight"],"tags":[]},{"id":97583,"title":"Android Club to host local startup","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/android-club-to-host-local-startup\/","content":"[caption id=\"attachment_97852\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965364_10206469737366577_50733423_n1.jpg\"><img class=\"size-full wp-image-97852\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965364_10206469737366577_50733423_n1.jpg\" alt=\"Android Club President Charles Yu and Ios Development Club President Brian Tracy pose during club day. Photo by Josh Yuen.\" width=\"600\" height=\"450\" \/><\/a> Club presidents Charles Yu (Android Club President) and Brian Tracy (iOS Development Club President) pose during club day during the first club day of the 2014-15 school year. Photo by Josh Yuen.[\/caption]\r\n\r\nThe Android Development Club will hold a meeting with the firmware producer Cyanogen Inc. at 2:30 p.m. Tuesday in the Palo Alto High School Media Arts Center.\r\n\r\nCyanogen is a local startup and strives to increase performance and reception reliability as well as unique features to Android-based devices, according to the company's official <a href=\"http:\/\/www.cyanogenmod.org\/about\">website<\/a>.\r\n\r\nAndroid Club secretary Charlie Mihran is interested in gaining a glimpse into Cyanogen's everyday work experience.\r\n\r\n\"I'm most excited about getting to hear from experienced professionals in tech fields,\" Mihran said. \"I would love to work at a place like Cyanogen, so getting a sneak peak into how they work is pretty awesome.\"\r\n\r\nThe club's treasurer, Alex Rose, is excited for the event and is also interested in learning how the small startup became successful.\r\n\r\n\"To meet a company that started right here in Palo Alto that also works on products that are going to be seen on the new tech coming out in the next few years is really exciting,\" Rose said. \"It will be really interesting to hear about the process of building the product and how they got it from their office to hundreds of thousands of phones worldwide.\"\r\n\r\nThe meeting will also boost the club's reputation, which will make it easier to plan future events with similar technology companies, according to Rose.","excerpt":"The Android Development Club will hold a meeting with the firmware producer Cyanogen Inc. at 2:30 p.m. Tuesday in the Palo Alto High School Media Arts Center. ","date":"2015-02-05 16:20:11","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965364_10206469737366577_50733423_n.jpg","categories":["News"],"tags":{"38414":"adc","15665":"alex rose","8476":"android","11980":"Android Development club","11982":"Charlie Mihran","38415":"cyanogen","38416":"startup","38417":"tech","38418":"tech company"}},{"id":97776,"title":"Girls&#8217; wrestling to compete at Championship Cup Series","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/ccs-preview-girls-wrestling\/","content":"[caption id=\"attachment_97891\" align=\"alignright\" width=\"237\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965661_402527606579242_1616725435_n.jpg\"><img class=\"wp-image-97891\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965661_402527606579242_1616725435_n.jpg\" alt=\"Palo Alto high school  wrestling sign. Photo taken by Aisha Chabane \" width=\"237\" height=\"324\" \/><\/a> Palo Alto high school wrestling sign. Photo taken by Aisha Chabane[\/caption]\r\n\r\nThe Palo Alto High School girls' wrestling team will compete at the Championship Cup Series at 4 p.m. this Friday and Saturday at Oak Grove High School.\r\n\r\nThe top three placers in CCS go to the state meet.\r\n\r\nSophomore Sara Aguilar and senior Alexa Austin will participate in the tournament. Last year, Aguilar ranked fourth and Austin ranked third.\r\n\r\nThe team has been doing well this season with Austin placing second and Aguilar third at the last meet.\r\n\r\n“I believe we're ready for the championship and the only thing to do now is just visualize and while in the moment take it one match at a time,\" Aguilar said.\r\n\r\nGeneral admission for students is $4 and $8 for adults, and free for children 5 years old and under.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' wrestling team will compete at the Championship Cup Series at 4 p.m. this Friday and Saturday at Oak Grove High School.","date":"2015-02-05 15:24:00","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965661_402527606579242_1616725435_n.jpg","categories":["Sports"],"tags":{"38439":"alexa austin","8568":"CCS","8734":"girls","38440":"Sara Aguilar","9241":"wrestling"}},{"id":97789,"title":"Liveblog: Girls&#8217; soccer plays Santa Clara","permalink":"http:\/\/palyvoice.com\/2015\/02\/04\/liveblog-girls-soccer-plays-santa-clara\/","content":"[caption id=\"attachment_80611\" align=\"alignnone\" width=\"606\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5098.jpg\"><img class=\"wp-image-80611 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5098.jpg\" alt=\"Junior midfielder Jacey Pederson dribbles past a defender. Pederson made two goals. Photo by Maddy Jones.\" width=\"606\" height=\"404\" \/><\/a> Junior midfielder Jacey Pederson dribbles past a defender. Pederson made two goals. Palo Alto High School beat Gunn High School 6-0. Photo by Maddy Jones.[\/caption]\r\n\r\n<i>Palo Alto High School girls' soccer (13-1, 7-1) takes on Santa Clara High School (8-3-4, 5-2-2), the only team the Vikings have fallen to. Check back at 3:30 p.m. for live coverage of the game. <\/i>\r\n\r\n[liveblog]","excerpt":"Palo Alto High School girls' soccer (13-1, 7-1) takes on Santa Clara High School (8-3-4, 5-2-2), the only team the Vikings have fallen to. Check back at 3:30 p.m. for live coverage of the game. ","date":"2015-02-04 23:34:48","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5098.jpg","categories":["Uncategorized"],"tags":{"10198":"girls soccer","8855":"liveblog","38424":"lose","10667":"santa clara","38315":"undefeated","10981":"win"}},{"id":97739,"title":"ValGrams on sale for $3 during Lunch this week on the Quad","permalink":"http:\/\/palyvoice.com\/2015\/02\/04\/valgrams-on-sale-for-3-during-lunch-this-week-on-the-quad\/","content":"","excerpt":"","date":"2015-02-04 21:42:28","author":"Lizzie Chun","categories":["Ticker"],"tags":{"38413":"valgrams"}},{"id":97135,"title":"News in Review: January 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/04\/news-in-review-january-2015\/","content":"<i>This is the first installment of the News in Review series, in which the month’s news will be summarized. The news is split into two sections based on its level of impact on the Palo Alto High School student body and Palo Alto community.<\/i>\r\n\r\n[caption id=\"attachment_97738\" align=\"aligncenter\" width=\"686\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/PicMonkey-Collage1.jpg\"><img class=\"wp-image-97738\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/PicMonkey-Collage1.jpg\" alt=\"PicMonkey Collage\" width=\"686\" height=\"429\" \/><\/a> A collage summing up the various news stories of January. Top-left: Photo by Alex Merkle-Raymond. Lower-left: Photo by George Lu. Top-center: Photo courtesy of Palo Alto High School ASB. Center-center: Photo by George Lu. Lower-center: Photo by Hannah Nguyen. Top-right: Photo courtesy of Claire Liu. Lower-right: Photo by Ana Caklovic.[\/caption]\r\n\r\n&nbsp;\r\n\r\n<span style=\"text-decoration: underline;\"><b>Stories you need to know<\/b><\/span>\r\n\r\n<b>Community responds to Gunn death<\/b>\r\n\r\nOn Jan. 24, a Gunn high school senior died by suicide, which prompted many community discussions throughout Palo Alto. At Paly, the <a href=\"http:\/\/palyvoice.com\/2015\/02\/01\/editorial-an-appreciation-of-teacher-support-at-paly\/\" target=\"_blank\">administration and teachers focused on supporting the students.<\/a> These discussions of suicide and mental health often led to conversations on student stress. Spearheaded by a Gunn sophomore and former teacher, the <a href=\"http:\/\/palyvoice.com\/2015\/01\/13\/save-the-2008-to-push-school-board-tonight\/\" target=\"_blank\">Save the 2,008 campaign<\/a> made its voice heard at recent school board meetings, advocating for creating a less stressful academic environment. At the Jan. 28 school board meeting, an unusually large number of Gunn students came to express their opinions and reactions to the recent heartbreaking news. They advocated that changes need to reach beyond academic stress and that <a href=\"http:\/\/paloaltoonline.com\/news\/2015\/01\/28\/students-to-board-its-not-gunns-fault\" target=\"_blank\">Gunn is not the only one at fault<\/a>. The Paly Associated Student Body also promoted intradistrict unity at its <a href=\"http:\/\/palyvoice.com\/2015\/01\/29\/hungry-head-on-over-to-the-breakfast-club\/\" target=\"_blank\">Movie Night in the MAC<\/a> by providing special deals to Gunn students and Paly students who attended with their friends from Gunn.\r\n<blockquote class=\"twitter-tweet\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/PaloAlto?src=hash\">#PaloAlto<\/a> students tell school board Tuesday night: 'It's not Gunn's fault.' <a href=\"http:\/\/t.co\/uavTLQZsNl\">http:\/\/t.co\/uavTLQZsNl<\/a> <a href=\"http:\/\/t.co\/Ad2xGGtK4a\">pic.twitter.com\/Ad2xGGtK4a<\/a>\r\n\r\n— Palo Alto Weekly (@paloaltoweekly) <a href=\"https:\/\/twitter.com\/paloaltoweekly\/status\/560503320456859648\">January 28, 2015<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n&nbsp;\r\n\r\n<b>Community pushes to keep Buena Vista Mobile Home Park open <\/b>\r\n\r\nSanta Clara County Supervisor Joe Simitian teamed up with Dave Cortese, board of supervisors president, to <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/01\/20\/county-supervisors-offer-aid-in-preserving-buena-vista\" target=\"_blank\">propose that the county uses $8 million<\/a> from a Stanford University housing fund in an attempt to prevent the <a href=\"http:\/\/verdemagazine.com\/a-community-within-a-community\" target=\"_blank\">mobile park<\/a> from closing. The mobile park is near Gunn High School, and redevelopment plans that would force the current residents to leave have been discussed for the past couple of years. This community push is significant in the tone it sets that Palo Alto cares about these residents and that those of the Buena Vista Mobile Home Park are valued.\r\n\r\n<b>BC Calculus students to represent the nation in international math contest <\/b>\r\n\r\nA team of four Paly juniors in BC Calculus were chosen to be one of the two representative teams for the United States at the International Mathematical Modeling Competition in April after competing at a national contest in November. Juniors Eric Foster, Andrew Lee, Kathryn Li and Allison Zhang received the <a href=\"http:\/\/paly.net\/news\/student-math-contest-winners\" target=\"_blank\">top score in the nation<\/a> for their 33 page-long solution to a mathematical application problem on which they spent 36 hours. Math Department Instructional Supervisor Radu Toma, who served as the team’s adviser, explained in a <a href=\"http:\/\/news.pausd.org\/post.cfm\/palo-alto-high-school-team-will-represent-the-united-states-in-international-mathematical-modeling-competition\" target=\"_blank\">press release<\/a> that these students “have the stamina, determination and courage it takes to tackle and solve serious, real-life problems using sophisticated mathematical modeling” and that “their splendid performance is also a tribute to all the teachers who inspired and guided them over the years, opening their eyes to the beauty of mathematics.”\r\n\r\n<b>Point B: Teen Poetry Jam provides platform for expression<\/b>\r\n\r\n\r\n[caption id=\"attachment_97415\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed.jpg\"><img class=\"wp-image-97415\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed.jpg\" alt=\"Junior Molly Kraus performs an original response to the phrase “daddy issues,” a concept she thinks “our culture likes to hypersexualize.” The audience became emotional after her touching poem. Photo by Ana Caklovic.\" width=\"350\" height=\"232\" \/><\/a> Junior Molly Kraus performs an original response to the phrase “daddy issues,” a concept she thinks “our culture likes to hypersexualize.” The audience became emotional after her touching poem. Photo by Ana Caklovic.[\/caption]\r\n\r\n\r\nThe Teen Arts Council hosted its <a href=\"http:\/\/palyvoice.com\/2015\/01\/15\/teen-arts-council-to-host-poetry-jam-friday\/\" target=\"_blank\">first ever Teen Poetry Jam<\/a> on Jan. 16 in the Palo Alto Children’s Theatre. Founded by Paly sophomores Claire Eberhart and Teddie Stewart, the event aimed to be a place for teens to express themselves through poetry. Students were given access to the event, entitled <a href=\"http:\/\/palyvoice.com\/2015\/01\/22\/sildeshow-teen-arts-council-point-b-poetry-jam\/\" target=\"_blank\">Point B: Teen Poetry Jam<\/a>, which filled an absence of a place to express and share a love for poetry that was noted by Eberhart and Stewart. With the hope of continuing with future Poetry Jams later this year, students will be offered more opportunities to express themselves.\r\n\r\n<b>Prom to be held at San Francisco City Hall on April 18<\/b>\r\n\r\nWith ASB’s Winter Rally <a href=\"http:\/\/palyvoice.com\/2015\/01\/15\/prom-2015-location-sf-city-hall\/\" target=\"_blank\">announcement<\/a> of this year’s Prom location of <a href=\"http:\/\/sfgsa.org\/index.aspx?page=1085\" target=\"_blank\">San Francisco City Hall<\/a>, the “prama” and “promposals” can officially begin. The high-ceilinged, Beauty and the Beast-esque central rotunda combined with three wings will provide for ample dancing room throughout the night (some advice: bring a pair of comfy shoes. Unlike Cinderella, not all of us can dance the night away in glass slippers). ASB has got you covered once all that dancing gets you hungry by serving buffet-style food with tables available to eat at. The Prom theme will be announced during February’s Sadie Hawkins dance.\r\n\r\n<blockquote class=\"twitter-tweet\" lang=\"en\">\r\nJuniors &amp; Seniors: Your Prom 2015 will be at..............San Francisco City Hall!!! <a href=\"http:\/\/t.co\/0mxH3hYgQl\">pic.twitter.com\/0mxH3hYgQl<\/a>\r\n\r\n— Paly ASB (@palyASB) <a href=\"https:\/\/twitter.com\/palyASB\/status\/555797440020754432\">January 15, 2015<\/a>\r\n<\/blockquote>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script><iframe src=\"https:\/\/www.youtube.com\/embed\/bq8vxcz0GxA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<b>Communications elective: Newest addition to English elective course selection<\/b>\r\n\r\nThe new <a href=\"http:\/\/palyvoice.com\/2015\/01\/26\/new-english-elective-to-teach-communication-skills\/\" target=\"_blank\">“Communication and Leadership” English elective<\/a>, taught by English teacher Lucy Filppu, will allow students to learn about business and communication through literature and lessons on rhetoric. The class will be offered for the first time during the 2015-16 school year, so for all you interested sophomores and juniors, make sure to check it out when selecting next year’s courses.\r\n\r\n<span style=\"text-decoration: underline;\"><b>Accolades and accomplishments<\/b><\/span>\r\n\r\n<b>Student recognized at State Capitol, discusses school climate <\/b>\r\n\r\nCongratulations are in order for Associated Student Body President and Campanile Editor in Chief Claire Liu for being <a href=\"http:\/\/palyvoice.com\/2015\/01\/17\/student-recognized-for-leadership-at-state-capitol\/\" target=\"_blank\">recognized at the State Capitol<\/a> for her leadership and getting to discuss school climate with other finalists on Jan. 14. Being selected as the first alternate for the U.S. Senate Youth Program required a nomination from Paly, so props to Liu for standing out for her hard work and leadership skills.\r\n\r\n<b>Students beat staff at annual Winter Rally basketball game<\/b>\r\n\r\nDuring the second week of second semester, ASB hosted the annual student-staff <a href=\"http:\/\/palyvoice.com\/2015\/01\/15\/game-in-review-student-staff-basketball-game-2015\/\" target=\"_blank\">basketball game<\/a> during the Winter Rally in the Big Gym. Shoutout to the <a href=\"http:\/\/palyvoice.com\/2015\/01\/14\/student-athlete-profiles-who-to-watch-out-for-at-winter-rally\/\" target=\"_blank\">senior team<\/a> for the big W, beating the staff 15-8.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/79enT4SGzNY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<b>Inaugural ComedySportz match<\/b>\r\n\r\nThe six members of Paly’s Improv Troupe deserve a standing ovation for participating in Paly’s <a href=\"http:\/\/palyvoice.com\/2015\/01\/22\/student-act-letes-to-battle-in-first-comedysportz-event\/\" target=\"_blank\">first ever ComedySportz event<\/a> on Jan. 23. The six members were split into two teams and competed for audience laughter while being refereed by a professional representative from the ComedySportz organization. Props also to their hope to compete in future ComedySportz events.\r\n\r\n<b>Robotics Team gears up for March competition<\/b>\r\n\r\n[caption id=\"attachment_97667\" align=\"alignright\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0972.jpg\"><img class=\"wp-image-97667\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0972.jpg\" alt=\"Paly's Robotics Team plans on finishing up its robot this week. For the next two weeks of build season, the team work on testing the robot out. Photo by Lizzie Chun.\" width=\"250\" height=\"333\" \/><\/a> Paly's Robotics Team plans on finishing up its robot this week. For the next two weeks of build season, the team will work on testing the robot out. Photo by Lizzie Chun.[\/caption]\r\n\r\nKudos to the Paly Robotics Team for getting ready to finish up its robot this week. The team is currently <a href=\"http:\/\/palyvoice.com\/2015\/01\/29\/robotics-team-prepares-for-competition\/\" target=\"_blank\">preparing for competition<\/a> in March, creating a robot that can stack recycling totes on top of each other and dispose of litter into a garbage container.\r\n\r\n<b>Paly alumni offer advice about college<\/b>\r\n\r\nWe'd like to applaud Paly’s College and Career Center efforts to connect current students with recent grads at a <a href=\"http:\/\/palyvoice.com\/2015\/01\/12\/paly-grads-to-speak-at-listen-and-learn\/\" target=\"_blank\">“Listen and Learn” event<\/a> during Tutorial on Jan. 13 to talk about college application process and college life. The Q&amp;A and breakout sessions let us gain insight into the difference in course expectations between high school and college and advice on how to have a smooth transition into college life.\r\n\r\n<b>Teen programs financed by donation from Bryant St. Garage Fund <\/b>\r\n\r\nThanks go out to the City of Paly Alto sponsored <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/recreation\/teens\/bryant_street_garage_fund\/default.asp\" target=\"_blank\">Bryant Street Garage Fund<\/a>, which offered to <a href=\"http:\/\/palyvoice.com\/2015\/01\/20\/bryant-street-garage-fund-to-finance-teen-programs\/\" target=\"_blank\">fund Palo Alto Unified School District teen programs<\/a>. In the informal meeting held on Jan. 21, it was explained that the fund offers mini-grants of up to $1,000 per year to influential student-run programs that benefit the community, other teens or a cause.\r\n\r\n<strong>Sushirrito opens downtown, combines sushi and burritos <\/strong>\r\n\r\nShoutout to the new downtown restaurant Sushirrito for providing Palo Altans with the best of both worlds. <a href=\"http:\/\/palyvoice.com\/2015\/01\/25\/sushirrito-is-sushi-rrific\/\">Sushirrito opened in downtown Palo Alto<\/a> on Jan. 17, offering a variety of sushi rolls in burrito form. Sushirrito, located at 448 University Ave, is open every day from 11 a.m. to 3 p.m.\r\n<blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 658px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-version=\"4\">\r\n<div style=\"padding: 8px;\">\r\n<div style=\"background: #F8F8F8; line-height: 0; margin-top: 40px; padding: 50% 0; text-align: center; width: 100%;\"><a style=\"color: #000; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none; word-wrap: break-word;\" href=\"https:\/\/instagram.com\/p\/yLCmcJqBHO\/\" target=\"_top\">So glad to finally be open in #paloalto ! Open 11am-3pm for first couple weeks (closed Sunday's) while we get situated. Will add more hours soon. Looking forward to serving #sushiburritos to the #peninsula and #southbay #sushirrito #stanford #afreshwaytoroll<\/a> A photo posted by Sushirrito® (@sushirrito) on <time style=\"font-family: Arial,sans-serif; font-size: 14px; line-height: 17px;\" datetime=\"2015-01-22T22:11:06+00:00\">Jan 22, 2015 at 2:11pm PST<\/time>\r\n<\/blockquote>\r\n<script src=\"\/\/platform.instagram.com\/en_US\/embeds.js\" async=\"\" defer=\"defer\"><\/script>\r\n\r\n&nbsp;","excerpt":"This is the first installment of the News in Review series, in which the month’s news will be summarized. The news is split into two sections: the must reads and the \"accolades and accomplishments.\"","date":"2015-02-04 12:48:07","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/PicMonkey-Collage.jpg","categories":["Editor's Pick","News"],"tags":{"38268":"bc calculus","38270":"buena vista","38269":"international modeling competition","37737":"january news","38271":"mobile park","37736":"month in review","38267":"news in review","9016":"prom","9032":"recap","9045":"review"}},{"id":97710,"title":"No school from Feb. 12 to Feb. 16, T day schedule on Feb. 17","permalink":"http:\/\/palyvoice.com\/2015\/02\/03\/no-school-from-feb-12-to-feb-16-t-day-schedule-on-feb-17\/","content":"","excerpt":"","date":"2015-02-03 23:43:06","author":"Lizzie Chun","categories":["Ticker"],"tags":{"38410":"february break","38411":"no school","38409":"presidents weekend"}},{"id":97704,"title":"Presentation on public out-of-state colleges at 7 p.m. on Feb. 6 in the LRC","permalink":"http:\/\/palyvoice.com\/2015\/02\/03\/presentation-on-public-out-of-state-colleges-at-7-p-m-on-feb-6-in-the-lrc\/","content":"","excerpt":"","date":"2015-02-03 23:40:23","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8604":"college","38408":"colleges"}}]