[{"id":97490,"title":"Upcoming construction projects remain on schedule","permalink":"http:\/\/palyvoice.com\/2015\/02\/17\/upcoming-construction-projects-remain-on-schedule\/","content":"[caption id=\"attachment_98567\" align=\"alignnone\" width=\"480\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10968139_798900016852755_582711681_n.jpg\"><img class=\"wp-image-98567\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10968139_798900016852755_582711681_n.jpg\" alt=\"Construction of Preforming Arts\" width=\"480\" height=\"360\" \/><\/a> The construction for the Performing Arts Center is on the way. The structure currently visible is part of the fly, according to Assistant Principal Jerry Berkson. Photo by Emilia Diaz-Magaloni[\/caption]\r\n\r\nChanges are quickly approaching for the Palo Alto High School campus, as plans for the new Performing Arts Center, athletic facilities and Library buildings buildings develop.\r\n\r\n<b>Performing Arts Center<\/b>\r\n\r\nOver the past couple of weeks, students may have noticed the recent additions to the construction the <a href=\"http:\/\/www.gunkelarchitecture.com\/education-projects\/pahspac\/\">new Performing Arts Center<\/a>, such as structural framing, plumbing and foundation work. According to choir teacher Michael Najar, the construction is going according to plans. At the current pace of construction, the Performing Arts Center should open March 2016, according to Najar.\r\n\r\nAccording to Najar, the school recently received news that many small additional parts to improve the quality of the building will be paid for by the district. These parts include and an automatic platform lift, special lighting, an automatic orchestra lift and extra movable seats.\r\n\r\n“They will give the extra pizzazz that makes the building special,” Najar said.\r\n\r\nThe Performing Arts Center will<a href=\"http:\/\/palyvoice.com\/2014\/01\/23\/added-construction-delays-expenses-for-new-arts-and-athletic-facilities\/\"> still need to fundraise<\/a> for programmatic equipment such as microphones and a piano, according to Najar.\r\n\r\nAccording to Assistant Principal Jerry Berkson, who oversees facilities and budget, the structure currently visible is part of the fly, which is used for storing and changing the background sets on stage. Berkson added that the plumbing for the building is close to completion.\r\n\r\nOther changes to the area include a city-planned removal of the old crosswalk, which <a href=\"http:\/\/palyvoice.com\/2013\/10\/01\/construction-to-alter-campus-bike-and-car-parking\/\">connects Paly to Town and Country<\/a>; however, \"there will be some sort of path,” Berkson said.\r\n\r\n<b>Athletic facilities<\/b>\r\n\r\nVisible action has yet to be taken on the demolition of the Big Gym, which was <a href=\"http:\/\/palyvoice.com\/2014\/01\/23\/added-construction-delays-expenses-for-new-arts-and-athletic-facilities\/\">initially scheduled to be demolished last May<\/a>. However, according to Berkson, plans for construction of the new Gym are in their last stage of approval by the state. According to Berkson, the next stage in the process involves receiving bids from subcontractors.\r\n\r\n“Once the plans get approved, the contractor will get bids from subcontractors, and the remodeling will be on the way,” Berkson said.\r\n\r\nAfter almost a year of delay, the 18-month-long project is slotted to begin this summer, according to Berkson.\r\n\r\n<b>Library<\/b>\r\n\r\nPlans for remodeling the Library are on the way as the librarians push for their turn at a new building.\r\n\r\nDuring the construction, the Library will be moving to the Student Center, according Paly librarian Sima Thomas.\r\n\r\n”If all goes as we hope, demolition of the current Library will start at the beginning of summer and be moved into the Student Center by next school year,\" Thomas said.\r\n\r\nAccording to Thomas, the new Library plans to include the guidance department, student services, a mezzanine level for archives and high density storage, a place for the entire staff to meet, a classroom, digital lockers, reading spaces, a makers space and a computer lab. The librarians went to the Mitchell Park Library for inspiration and have decided to add study rooms similar to the group work rooms at the Mitchell Park Library, according to Thomas.\r\n\r\nAccording to Thomas, one of the main goals of the new Library is to change the ambiance from a walk-through and bustling hotspot to a destination set aside for reading and learning.\r\n\r\n“We [the Paly librarians] are hoping to turn the library into [a] visually more beautiful space but also promote a love of reading,” Thomas said.\r\n\r\nThe high ceilings of the current building cause sound to travel and make the library less of a quiet space used for the purpose of relaxing, reading and studying, so Thomas says she hopes the new library designs will eliminate this problem.\r\n\r\n“We want the library to be much more of a heart of campus,” Thomas said.\r\n\r\n&nbsp;","excerpt":"Changes are quickly approaching for the Palo Alto High School campus, as plans for the Performing Arts Center, gym, library and science buildings develop.","date":"2015-02-17 19:57:40","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10968139_798900016852755_582711681_n.jpg","categories":["News","Spotlight"],"tags":{"9674":"athletic facilities","11893":"athletic facility","9955":"athletics facility","8520":"Berkson","11286":"big gym","8616":"construction","8690":"facilities","9954":"jerry berkson","8848":"Library","30526":"najar","11896":"new buildings","34383":"pac","8944":"palo alto high school","34382":"performing arts center"}},{"id":97164,"title":"Paly film students &#8220;Cinequest to success&#8221;","permalink":"http:\/\/palyvoice.com\/2015\/02\/17\/paly-film-students-cinequest-to-success\/","content":"Three short films produced by Palo Alto High School Video Production students will be screened at <a href=\"http:\/\/www.cinequest.org\/\" target=\"_blank\">Cinequest Film Festival<\/a>, a Silicon Valley-based event designed to promote creativity and technology.\r\n\r\nThe three short films accepted into the festival include \"Eco-Man,\" by senior Jack Brook; \"What If You Slept,\" by sophomores Alec Cohen-Schisler and Ian Woodfill; and \"Where the Sidewalk Ends,\" by seniors Alex Merkle-Raymond and Maeve Lavelle. As a part of the high school level competition, these films, along with six other films produced by high school students, will be shown on Feb. 28 at 1 p.m. and March 7 at 11 a.m at the California Theatre in San Jose. Admission is open to the public for a fee, and <a href=\"http:\/\/www.cinequest.org\/tickets-passes\" target=\"_blank\">ticket information<\/a> can be found on the Cinequest website. The Paly Video Production department also previously debuted the films at the<a href=\"http:\/\/palyvoice.com\/2015\/02\/05\/student-film-festival-to-be-held-friday\/\" target=\"_blank\"> Paly Student Film Festival on Feb. 6.<\/a>\r\n\r\nCinequest is recognized by the Academy of Motion Picture Arts and Sciences as a qualifier for the Academy Awards. Paly Video Production teacher Brent Griffith encouraged his students to submit their work to Cinequest, as well as several other esteemed film festivals that offer high school-level competitions, including but not limited to the San Franciso International Film Festival and the <a href=\"http:\/\/www.whitehouse.gov\/filmfestival\" target=\"_blank\">White House Film Festival<\/a>.\r\n\r\n\"It is my goal to help students reach for the best, most prestigious regional film festivals,\" Griffith said. \"Paly students do amazing work – they ought to be aware of some of the best recognition opportunities.\r\n\r\nIn addition to getting selected for display at the festival by the Cinequest organization among thousands of other submissions, the films were also personally acknowledged for achievement in film by the Cinequest co-founders Halfdan Hussey and Kathleen Powell, who visited the Media Arts Center at Paly in the fall, according to Griffith. Several films on the <a href=\"https:\/\/vimeo.com\/palyvideoproductions\" target=\"_blank\">Paly video production website<\/a> also caught their attention.\r\n\r\n[caption id=\"attachment_98866\" align=\"alignleft\" width=\"314\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-16-at-4.55.13-PM.png\"><img class=\" wp-image-98866\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-16-at-4.55.13-PM.png\" alt=\"Sophomore Jack Brook's film entitled &quot;Eco Man&quot; features a superhero that encourages people to engage in ecologically-friendly practices, such as recycling. &quot;Eco Man&quot; is one of the three student films that will be screened at the 2015 Cinequest Film Festival. Photo courtesy of Paly Video Production.\" width=\"314\" height=\"200\" \/><\/a> Senior  Jack Brook's film entitled \"Eco Man\" features a superhero that encourages people to engage in ecologically-friendly practices, such as recycling. \"Eco Man\" is one of the three student films that will be screened at the 2015 Cinequest Film Festival. Photo courtesy of Paly Video Production.[\/caption]\r\n\r\n<a href=\"https:\/\/www.youtube.com\/watch?v=Bl4EoRpwPrk\" target=\"_blank\">Brook's film, \"Eco Man,\"<\/a> offers commentary on contemporary ecological issues. \"Eco Man\" was well-recieved at several other festivals in addition to Cinequest, including the DC Independent Film Festival, Delta Moon Student Film Festival and Greenlight Film Festival. After making several revisions to the film and audio, Brook submitted it to Cinequest last fall.\r\n\r\n\"It was short, the audio was good and it was funny, but it also had an environmental message,\" Brook said. \"I think that's why it got into Cinequest.\"\r\n\r\nWoodfill, co-creator of \"What If You Slept,\" notes a sense of pride upon selection into Cinequest.\r\n\r\n\"It feels really good to be accepted into such a prestigious festival,\" Woodfill said.\r\n\r\nGriffith also noted the overall importance of filmmaking for young students.\r\n\r\n\"Through practice, students discover how fun it is to have a vision and put it out there start to finish,\" Griffith said. \"Students have powerful visions and voices.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Three short films produced by Palo Alto High School video production students will be screened at Cinequest Film Festival, a Silicon Valley-based event designed to promote creativity and technology, which will take place at the California Theatre from Feb. 24 to March 8.","date":"2015-02-17 13:45:07","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-16-at-4.55.13-PM.png","categories":["Entertainment","Spotlight"],"tags":{"38777":"alec cohen-schisler","34227":"alex merkle-raymond","38773":"cinequest","38774":"cinequest film festival","12716":"film festival","38778":"filmmaking","38775":"ian woodfill","10751":"jack brook","38776":"maeve lavelle","12718":"video production"}},{"id":96475,"title":"Voices of the Week: Cole and Zoe Tierney","permalink":"http:\/\/palyvoice.com\/2015\/02\/17\/voices-of-the-week-cole-and-zoe-tierney\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_96911\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_3656.jpg\"><img class=\"wp-image-96911\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_3656.jpg\" alt=\"IMG_3656\" width=\"600\" height=\"450\" \/><\/a> Siblings Cole and Zoe Tierney goof off on the senior deck after school. The two are considered a dynamic duo by many on campus. Photo by Chloe Fishman.[\/caption]\r\n\r\nThis week, The Paly Voice sat down with two Palo Alto High School siblings, junior Cole Tierney and senior Zoe Tierney, to discuss their best adventures, favorite things about each other and their most disgusting habits (according to each other).\r\n\r\n<strong>The Paly Voice:<\/strong> What is your favorite thing about your sibling?\r\n\r\n<strong>Cole Tierney:<\/strong> There are so many things.\r\n\r\n<strong>Zoe Tierney:<\/strong> His bed. It's a very comfortable bed. But not in a weird way – in a purely comfortable way.\r\n\r\n<strong>CT:<\/strong> Oh god.\r\n\r\n<strong>PV:<\/strong> Okay, Cole. What about Zoe?\r\n\r\n<strong>CT:<\/strong> She has a license. I really like that about her.\r\n\r\n<strong>PV:<\/strong> What's the craziest thing you guys have done together?\r\n\r\n<strong>ZT:<\/strong> One time, Cole and I were at this Harvard camp, and we pretended that we were twins from Britain. But then we met two actual twins from Britain.\r\n\r\n<strong>CT:<\/strong> That was really awkward.\r\n\r\n<strong>ZT:<\/strong> And they asked us what school we went to. We said The School of... Britain. And they said, \"Oh, that one!\"\r\n\r\n<strong>PV:<\/strong> What is it like attending the same school?\r\n\r\n<strong>ZT:<\/strong> It's nice. He brings me food a lot.\r\n\r\n<strong>CT:<\/strong> I get to sit on the Senior Deck sometimes.\r\n\r\n<strong>ZT:<\/strong> Twice.\r\n\r\n<strong>PV:<\/strong> What is one thing your sibling does that grosses you out?\r\n\r\n<strong>CT:<\/strong> Zoe does this thing where she throws up in her mouth sometimes.\r\n\r\n<strong>ZT:<\/strong> What! Cole used to dip his cantaloupe in ketchup. That was pretty nasty.\r\n\r\n<strong>PV:<\/strong> Which of the two of you would you consider more popular?\r\n\r\n<strong>CT:<\/strong> Zoe.\r\n\r\n<strong>ZT:<\/strong> Me.\r\n\r\n<strong>PV:<\/strong> What's your favorite story about each other?\r\n\r\n<strong>ZT:<\/strong> One time, we were on a plane ride to Africa. I was really, really bored, because it's a 16-hour flight. I was chewing gum, and I wondered if I put gum in his hair if it would stick. So I took it out of my mouth and put it in Cole's hair. Then I tried to get it out, but it wouldn't come out. I was like \"...shoot,\" so then I just sat there. Eventually he woke up, and I was like, \"Oh my god! There's gum in your hair! How did that get there? That's so gross.\"\r\n\r\n<strong>CT:<\/strong> She tried to play it off like she didn't do it. I was like, \"You obviously did this....\"\r\n\r\n<strong>ZT:<\/strong> My mom was like, \"Cole, how did you get gum in your hair?\" and I was like, \"Wow! Gross! That's weird!\" So then we had to cut it out of Cole's hair. And that was when he had really long hair, so Cole had a huge patch with no hair. Let me tell you, gum sticks in your hair.\r\n\r\n<strong>PV:<\/strong> When did you find out it was Zoe?\r\n\r\n<strong>ZT:<\/strong> Right now.\r\n\r\n<strong>PV:<\/strong> What's your favorite story about Zoe?\r\n\r\n<strong>CT:<\/strong> One time, I was super frustrated at Zoe, and I was really young, so I did not have great anger management. I had a pencil in my hand, and she was really pissing me off. So I took the sharp end, and I just shoved it up her nose. I don't know how she didn't dodge it or anything. I just stabbed it up there, and I didn't even know what to do. She didn't even react that much.\r\n\r\n<strong>ZT:<\/strong> One time, I got a new belt for Christmas, and I ran around the house with Cole yelling, \"I'm gonna spank you!\"\r\n\r\n<strong>PV:<\/strong> Do you guys consider yourselves close?\r\n\r\n<strong>ZT:<\/strong> No.\r\n\r\n<strong>CT:<\/strong> Yeah.\r\n\r\n<strong>ZT:<\/strong> Squad!\r\n\r\n<strong>PV:<\/strong> What are you going to do when Zoe leaves for college?\r\n\r\n<strong>CT:<\/strong> Cry.\r\n\r\n<strong>ZT:<\/strong> Aw!\r\n\r\n<strong>PV:<\/strong> Any final words for the Paly community?\r\n\r\n<strong>ZT:<\/strong> 42 Wallabee Way, Sydney.\r\n\r\n<strong>CT:<\/strong> Shoutout to the Class of 2015! One for the books.\r\n\r\n<em>If you know a student (or student group) who you think should be interviewed, please leave a comment below.<\/em>","excerpt":"This week, The Paly Voice sat down with two Palo Alto High School siblings, junior Cole Tierney and senior Zoe Tierney, to discuss their best adventures, favorite things about each other and their most disgusting habits (according to each other).","date":"2015-02-17 13:09:47","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_3656.jpg","categories":["Spotlight","Voice of the Week"],"tags":{"37638":"cole tierney","8953":"paly","37639":"siblings","10258":"voice of the week","37637":"zoe tierney"}},{"id":98819,"title":"Slideshow: White House summit calls for cybersecurity improvements","permalink":"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-white-house-summit-calls-for-improvements-in-cybersecurity\/","content":"At the White House summit at Stanford University yesterday, President Barack Obama and a number of speakers advocated for a greater level of cooperation between the private and public sectors to improve cybersecurity practices.\r\n\r\nAfter <a href=\"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-president-obama-arrives-in-san-francisco\/\" target=\"_blank\">arriving<\/a> in San Francisco, Obama gave the keynote speech at the cyber summit after <a href=\"https:\/\/www.youtube.com\/watch?v=iB-LWx1ksmU\" target=\"_blank\">announcing<\/a> the event's location a month ago. Photos from the morning session of the summit are in the slideshow below:\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A8AAOU8KBAyq\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nStanford President John Hennessy, National Security Council Lisa Monaco and National Economic Council Jeff Zients gave introductory speeches to kick off the summit.\r\n\r\nSecretary of Homeland Security Jeh Johnson moderated the first discussion, entitled \"Public-Private Collaboration on Cybersecurity,\" with panelists Kenneth Chenault, chairman and CEO of American Express; Anthony Earley, chairman and CEO of Pacific Gas and Electric; Mark McLaughlin, president and CEO of Palo Alto Networks; Bernard Tyson, chairman and CEO of Kaiser Permanente; and Deputy Secretary of Energy Elizabeth Sherwood-Randall.\r\n\r\nSecretary of Commerce Penny Pritzker moderated the second discussion panel, titled \"Improving Cybersecurity Practices at Consumer Oriented Businesses and Organizations.\" Panelists included Ajay Banga, president and CEO of MasterCard; Peter Hancock, president and CEO of AIG; Renee James, president of Intel; Brian Moynihan,chairman and CEO of Bank of America; and Nuala O'Connor, president and CEO of Center for Democracy and Technology. Apple CEO Tim Cook spoke following the panel discussions.\r\n\r\nAfter his presidential address, Obama concluded the morning session of the summit by signing an executive order that promotes the sharing of cybersecurity threat information both within the private sector and between the private sector and federal government.","excerpt":"At the White House summit at Stanford University yesterday, President Barack Obama and a number of speakers advocated for a greater level of cooperation between the private and public sectors to improve cybersecurity practices.\r\n","date":"2015-02-13 16:50:00","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/obama-close-up-copy.jpg","categories":["Editor's Pick","Multimedia"],"tags":{"38883":"consumer protection","38882":"cyber security","38880":"cyber summit","38902":"cybersecurity","38868":"obama","38901":"president barack obama","9653":"stanford","38885":"stanford university","38903":"tim cook","38881":"white house summit"}},{"id":98702,"title":"Slideshow: Girls&#8217; soccer celebrates victory on senior night","permalink":"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-girls-soccer-celebrates-victory-on-senior-night\/","content":"The Palo Alto girls' soccer team (15-2,9-2) shut out Homestead High School (6-8-3, 2-6-3) by a score of 8-0 while celebrating on its senior night. The team had six graduating seniors who were honored after the game.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AgOAbQsS6fmw\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto girls' soccer team (15-2,9-2) shut out Homestead High School (6-8-3, 2-6-3) by a score of 8-0 while celebrating on its senior night. The team had six graduating seniors who were honored after the game.","date":"2015-02-13 16:47:39","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/LRP_1555.jpg","categories":["Slideshow","Sports","Spotlight"],"tags":{"10198":"girls soccer","38899":"girls soccer senior night","8944":"palo alto high school","9087":"Senior Night","9107":"slideshow","9110":"Soccer","38900":"soccer senior night"}},{"id":98749,"title":"Slideshow: President Obama arrives in San Francisco","permalink":"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-president-obama-arrives-in-san-francisco\/","content":"President Obama is currently on a three-day trip to the Bay Area, after arriving at the San Francisco International Airport on Air Force One yesterday. Obama is scheduled to speak at the White House Summit on Cybersecurity and Consumer Protection at Stanford University today from 11:15 a.m. - 11:45 a.m., <a title=\"Summit on Cybersecurity and Consumer Protection\" href=\"http:\/\/www.whitehouse.gov\/issues\/foreign-policy\/cybersecurity\/summit\" target=\"_blank\">according to The White House<\/a>.\r\n\r\nThe Paly Voice has a <a title=\"Liveblog: Summit on cybersecurity and consumer protection\" href=\"http:\/\/palyvoice.com\/2015\/02\/13\/liveblog-summit-on-cybersecurity-and-consumer-protection\/\" target=\"_blank\">liveblog of the summit<\/a>, which is also <a title=\"White House Summit on Cybersecurity and Consumer Protection\" href=\"https:\/\/www.youtube.com\/watch?v=KlTo9hFAFXs#t=11363\" target=\"_blank\">being livestreamed by The White House<\/a> on YouTube. After speaking at a Democratic National Committee fundraiser in San Francisco tomorrow evening, the president is scheduled to depart SFO at 10:10 a.m. this Saturday to fly to Southern California.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AEGAcTMn_HzF\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"President Obama is currently on a three-day trip to the Bay Area, after arriving at the San Francisco International Airport on Air Force One yesterday.","date":"2015-02-13 14:06:28","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Optimized-IMG_1803.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"38870":"air force one","38867":"barack obama","11240":"emma chiu","38868":"obama","38869":"president obama","38871":"presidential motorcade","9061":"San Francisco","38872":"sfo"}},{"id":98721,"title":"Liveblog: Summit on cybersecurity and consumer protection","permalink":"http:\/\/palyvoice.com\/2015\/02\/13\/liveblog-summit-on-cybersecurity-and-consumer-protection\/","content":"President Barack Obama visits Stanford University for a White House summit meeting, which brings together<span class=\"s1\"> <\/span><span class=\"s2\">leaders from across the country who are concerned with cybersecurity and consumer protection. <\/span>Tune in for live coverage of the morning summit session.\r\n\r\n[liveblog]","excerpt":"President Barack Obama visits Stanford University for a White House summit meeting, which brings together leaders from across the country who are concerned with cybersecurity and consumer protection. Tune in for live coverage of the summit meeting.","date":"2015-02-13 09:47:47","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_3610.jpg","categories":["News","Spotlight"],"tags":{"38883":"consumer protection","38882":"cyber security","38880":"cyber summit","38879":"cybersummit","38884":"internet safety","8855":"liveblog","38868":"obama","38869":"president obama","38885":"stanford university","38881":"white house summit"}},{"id":98548,"title":"Column: Valentine’s, Shmalentine’s – it’s all about Pal- and Galentine’s Day","permalink":"http:\/\/palyvoice.com\/2015\/02\/12\/column-valentines-shmalentines-its-all-about-pal-and-galentines-day\/","content":"Girls hold up big white posters adorned with hearts and the word “SADIES?” Students all over campus chatter and stress about how to best illustrate their love by means of $5 gifts. Bottles of artificially colored pink soda are delivered in the middle of classes to uncomfortable recipients. Red and pink streamers that were likely purchased for less than a dollar decorate the doors of the more spirited teachers on campus. Yes, the coming of Valentine's Day has become almost palpable as the aura of synthetically manufactured love taints the air.\r\n\r\nAs you can tell, like most Palo Alto High School students, we are wholeheartedly enlivened by the fast-approaching date of Feb. 14. Don't get us wrong, we appreciate and have even participated in the school's efforts to brighten up the campus, but we would like to pause for a moment and invite our fellow classmates to partake in an arguably worthier tradition that takes place the day before Valentine's Day: (modified) Galentine's Day.\r\n\r\n[caption id=\"attachment_98708\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-12-at-10.25.43-PM.png\"><img class=\"wp-image-98708\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-12-at-10.25.43-PM.png\" alt=\"Leslie Knope (Amy Poehler) provides her lady friends and family with a number of sentimental gifts over a Galentine’s Day brunch. Photo courtesy of NBC. \" width=\"350\" height=\"197\" \/><\/a> Leslie Knope (Amy Poehler) provides her lady friends and family with a number of sentimental gifts over a Galentine’s Day brunch. Photo courtesy of NBC.[\/caption]\r\n\r\nFor those of you who are unfamiliar with the term, Galentine's Day, as coined by \"Parks and Recreation\" character Leslie Knope (Amy Poehler), is a special day dedicated to the appreciation of female friends, coworkers, family members and strong female influences in women’s lives. Stories and gifts are shared over a hearty brunch meal, and as Knope would say, it's all about \"ladies celebrating ladies.\"\r\n\r\nAs wonderful as Galentine's Day is – and believe us, it is wonderful – we'd like to broaden its sentiment and apply it to the general realm of friendship, regardless of gender: something we'd like to call Pal-entine's Day.\r\n\r\nWith the long weekend upon us, it's an especially ideal time to take your friends out to a glorious brunch excursion and shower them with gifts and appreciation. If you have sufficient time, dedication and knowledge, then you can try pulling a Knope and provide your friends with bouquets of hand-crocheted flower pens; mosaic portraits of each of them made from the crushed bottles of their favorite diet sodas; gift certificates for facials; needlepoint pillows with their faces and the leading headlines from the newspapers on the days they were born on them; and personalized 5,000 word essays of why they're all so awesome. If your gift giving skills aren’t quite up to par, though, never fear – any expression of your love and affection for your friends can be more important than material gifts.\r\n\r\nUltimately, we must remember that love is never exclusive to couples. There's no need to fall into a gloomy funk or secretly hate on those who are in relationships just because it's February. So, whenever February rolls around, instead of distressing and obsessing about your romantic relationship or lack thereof, choose to obsess about the gals and pals in your life who you care about most and who will never leave your side.\r\n\r\nAs Leslie Knope, the epitome of a workaholic, once said, \"We have to remember what's important in life: friends, waffles and work. Or waffles, friends, work. But work has to come third.\" While we agree that friends vs. waffles is an eternal debate, we encourage you to get a healthy dose of both by going out with your friends for some fantastic breakfast food and finding out for yourselves, as we plan to do.\r\n\r\nThe streamers and boxes of chocolates that you purchased for Valentine's Day will fade and likely pollute our planet, but the memories you make of waffles and laughter with your gals and pals will last forever.","excerpt":"Inspired by Galentine's Day from “Parks and Recreation,” News Editor Lizzie Chun and Staff Writer Saba Moussavian propose a Feb. 13 tradition to pause in the time of Valentine’s Day love with something they'd like to call \"Pal-entine's Day.\" ","date":"2015-02-12 22:51:15","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-12-at-10.25.43-PM.png","categories":["Opinion"],"tags":{"31764":"appreciation","38784":"breakfast","38783":"brunch","38785":"friends","38649":"friendship","38646":"galentine's day","38647":"galentines","38781":"leslie knope","8927":"opinion","38780":"palentine's day","38648":"parks and rec","34605":"parks and recreation","11509":"valentine's","11508":"valentine's day","38782":"waffles"}},{"id":98549,"title":"Liveblog: Girls&#8217; soccer vs. Homestead","permalink":"http:\/\/palyvoice.com\/2015\/02\/12\/liveblog-girls-soccer-vs-homestead\/","content":"Check back at 3:30 p.m. for live updates as the Palo Alto High School Girl's soccer team (14-1, 8-1) takes on Homestead (6-6-3, 2-4-3) at home.\n\n[liveblog]","excerpt":"Check back at 3:30 p.m. for live updates as the Palo Alto High School Girl's soccer team (14-1, 8-1) takes on Homestead (6-6-3, 2-4-3) at home.","date":"2015-02-12 15:26:11","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg","categories":["Sports","Uncategorized"],"tags":{"10198":"girls soccer","9087":"Senior Night","9110":"Soccer"}},{"id":97542,"title":"Paly juniors to compete in international math contest","permalink":"http:\/\/palyvoice.com\/2015\/02\/11\/paly-juniors-to-compete-in-international-math-contest\/","content":"[caption id=\"attachment_97747\" align=\"alignnone\" width=\"418\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/math_award_students2.jpg\"><img class=\"wp-image-97747 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/math_award_students2.jpg\" alt=\"math_award_students2\" width=\"418\" height=\"314\" \/><\/a> Juniors Andrew Lee, Kathryn Li, Allison Zhang and Eric Foster pose for a picture after placing at the National High School Mathematical Contest in Modeling. Math instructional supervisor Radu Toma describes the students as “highly intelligent and intellectually curious, [who] also have the stamina, determination and courage it takes to solve serious real life problems using sophisticated mathematical modeling.” Photo courtesy of Andrew Lee.[\/caption]Four Palo Alto High School juniors in Advanced Placement BC Calculus will be representing the United States at the International Math Modeling contest this April after their victory in the 17th Annual National High School Mathematical Contest in Modeling last month.\r\n\r\nThe juniors, Andrew Lee, Kathryn Li, Allison Zhang and Eric Foster, competed in two events and received an outstanding award for their for their 33 page-long solution to a passenger traffic optimization challenge, according to math instructional supervisor Radu Toma.\r\n\r\nThe National High School Mathematical Contest in Modeling is a contest that is held over a 36 hour period all across the nation. According to its <a href=\"http:\/\/www.comap.com\/about\/#b\" target=\"_blank\">website<\/a>, the contest's mission is to establish learning environments where mathematical tools are used to investigate, model and explore real issues in the world.\r\n\r\nHigh schools are given two problem sets, and the teams then set aside 36 hours within a two week period to work on them. Competitors have freedom setting up the parameters of the problem and the problems can therefore have many different correct answers.\r\n\r\nDespite the team’s strong teamwork, victory did not come easily.\r\n\r\n“I was very proud of our thorough research and our model,” Li said. “The question itself was very open-ended, so we needed to make a lot of assumptions. Our model took the longest to make, and it was extremely satisfying to see that the numbers it produced made sense.”\r\n\r\nLi looks forward to the international competition.\r\n\r\n“For the [international competition], our goals are just to try to find a novel way to use math to solve an everyday problem,” Li said. “We also want to learn about different types of mathematical modeling and use them to help us solve problems.”\r\n\r\nThe international contest will be at Paly in a math room yet to be determined, according to Lee, who added that competing teams will choose five consecutive days to compete between mid-April and mid-June.\r\n\r\nThe team has chosen to compete from April 19 to 23.\r\n\r\n“We will try our best and be happy with the outcome,” Zhang said. “It's already a great honor to be selected to represent the United States in the international competition.”","excerpt":"Four Palo Alto High School juniors in BC Calculus will be representing the United States at the International Math Modeling contest this April after their victory in the 17th Annual National High School Mathematical Contest in Modeling last month.","date":"2015-02-11 12:37:00","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/math_award_students2.jpg","categories":["News"],"tags":{"12848":"competition","8788":"International","8871":"math","38288":"math competition","38290":"math modeling contest","38289":"mathematics","8944":"palo alto high school","8953":"paly"}}]