[{"id":106593,"title":"Season preview: Cross country aims to dominate","permalink":"http:\/\/palyvoice.com\/2015\/09\/02\/season-preview-cross-country-aims-to-dominate\/","content":"[caption id=\"attachment_106681\" align=\"alignleft\" width=\"510\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/XCWARMUP1.jpg\"><img class=\"wp-image-106681 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/XCWARMUP1.jpg\" alt=\"XCWARMUP\" width=\"510\" height=\"314\" \/><\/a> The Palo Alto High School boys' cross country team warms up during practice at the Paly track on Friday. \"The biggest obstacle the team has to overcome is the massive overabundance of boys who signed up to run this year,\" head coach Kelsey Feeley said. Photo by Cooper Lou.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nPalo Alto High School's cross country teams are looking to continue their dominance after the boys’ team attended state championships and the girls’ team placed fourth at the Central Coast Section Championships last year.\r\n\r\nThe boys’ team placed second to Bellarmine at CCS but ultimately fell short at the state championship meet in Fresno, Calif., placing last in their division.\r\n\r\nJunior Kent Slaney, who attended the state championship meet, is hoping to improve after the team’s disappointing performance.\r\n\r\n“The state championships didn’t turn out as we wanted to but we are hoping to improve on that this year and hopefully win CCS,” Slaney said.\r\n\r\nAccording to boys’ coach Kelsey Feeley, several key athletes’ graduations will pose a challenge for the team.\r\n\r\n“We will definitely miss the presence of graduated seniors Lucas Matison and Aaron Chandler,” Feeley said. “Not only were they top scorers on the team, but they also set great examples for how to run and how to find a balance between cross country and school work.”\r\n\r\nDespite these losses, Feeley believes that the team will thrive this season.\r\n\r\n“I think that the majority of my returning varsity squad are setting up to have incredibly successful seasons, both as a team but also individually,” Feeley said.\r\n\r\nAccording to Slaney and Feeley, the team prepared for the new season by attending practices over the summer.\r\n\r\n“A good number of the boys, returners and newcomers alike made an effort to come out to our summer practices, so they have a pretty good head start,” Feeley said.\r\n\r\nFeeley says some runners to look out for include Slaney, senior Sam Desre and junior Naveen Pai.\r\n\r\nThe girls’ team is also hoping to improve after its fourth place finish at CCS last year.\r\n\r\n“As a team, I know our number one goal without a doubt is to make the state meet,” senior and team captain Sarah Wang said. “We've gotten really close over the past couple of years, but I know we have the team to make it this year as long as we stay healthy and keep this goal in mind.”\r\n\r\nSenior and team captain Portia Barrientos believes that the team can reach their goal.\r\n\r\n“I’m feeling really optimistic about the season,” Barrientos said. “We have five returning seniors who are capable of contributing on the varsity level, as well as lots of talented sophomores and a freshman that look really promising.”\r\n\r\nAccording to senior Nicole Chen, to achieve the goal of reaching State Championships, the team is adopting a consistent workout schedule.\r\n\r\n“We run two to three hard workouts a week and [have] two easy days to recover,” Chen said.\r\n\r\nIn addition, the team is focusing on building up its stamina.\r\n\r\n“In terms of improvement, we're really working on building mileage right now and also building our endurance for longer meets in the future,” Wang said. “We're working hard every day and really pushing the workouts.”\r\n\r\nAccording to Barrientos, the team was fortunate to have lost only one graduating senior, Katie Foug.\r\n\r\n“We have a lot of young talent that I can see coming up to fill her spot,” Barrientos said.\r\n\r\nBoth the boys' and girls' teams will compete in their first meet at 3 p.m. Thursday at Henry M. Gunn High School.","excerpt":"Palo Alto High School's cross country teams are looking to continue their dominance after the boys’ team attended state championships and the girls’ team placed fourth at the Central Coast Section Championships last year.","date":"2015-09-02 18:55:04","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/XCWARMUP1.jpg","categories":["Sports","Spotlight"],"tags":{"8552":"California","8568":"CCS","8620":"cross country","8751":"gunn","11393":"kelsey feeley","8830":"kent slaney","49948":"long distance","40923":"meet","49946":"nicole chen","8939":"palo alto","8953":"paly","9004":"portia barrientos","9054":"running","49947":"sarah wang","9120":"sports","33010":"state championships"}},{"id":106663,"title":"Video: Big Gym demolition","permalink":"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/","content":"The Palo Alto High School Big Gym came down after exterior demolition began at 7 a.m. this morning.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/z-O3wEE3l5w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School Big Gym came down after exterior demolition began at 7 a.m. this morning.","date":"2015-09-02 13:24:20","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/CN5-KRqUEAI62wT.jpg-large.jpg","categories":["News","Spotlight"],"tags":{"11286":"big gym","8616":"construction","12339":"demolition","9208":"video"}},{"id":106651,"title":"Football home opener at 7:30 p.m. this Friday vs. Sequoia","permalink":"http:\/\/palyvoice.com\/2015\/09\/01\/football-home-opener-at-730-p-m-this-friday-vs-sequoia\/","content":"","excerpt":"","date":"2015-09-01 21:44:45","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":106364,"title":"Gym reconstruction to affect athletic programs","permalink":"http:\/\/palyvoice.com\/2015\/09\/01\/gym-remodel-to-affect-athletic-programs\/","content":"<iframe src=\"https:\/\/www.google.com\/maps\/d\/u\/0\/embed?mid=z3ODxXtF5xE8.kBA27mrIcM8w\" width=\"620\" height=\"480\"><\/iframe>\r\n\r\nPalo Alto High School's students, staff, coaches and parents are facing challenges brought on by recent construction projects, including the <a href=\"http:\/\/palyvoice.com\/2015\/08\/29\/the-final-farewell-big-gym-scheduled-for-demolition-on-monday\/\">Big Gym's <\/a>demolition and the pool's closure, which have caused some sports teams to relocate off-campus.\r\n\r\nBoth volleyball and water polo have been forced to move their practices off campus. Water polo is currently practicing at Rengstorff Park but will move to Gunn's pool in the coming weeks. According to volleyball head coach Jekira Wilson, the team will practice and play games in Gunn's old gym during the 2015 season.\r\n\r\nWilson said she took several days to complete the transition, ensuring that the equipment was properly labeled and ready for transportation.\r\n\r\n“The change in location has only affected me in the sense of making sure all three teams [freshman, junior varsity and varsity] are all organized and getting to Gunn on time for practices and eventually matches,” Wilson said.\r\n\r\nDue to the commute often taking upwards of 20 minutes to get to practice, Wilson's largest concern is giving players enough time to get their homework done.\r\n\r\nJunior volleyball setter Jessica Lee also agreed that having to travel across town is one of the biggest difficulties.\r\n\r\n“The location is a pain to get to every day,\" Lee said. \"You have to allow 30 minutes to get there every time.\"\r\n\r\nDespite disliking the relocation, Lee stays positive about the new gym construction.\r\n\r\n“It’s unfortunate, but it’s for the better for Paly athletics so we are paying it forward,” Lee said.\r\n\r\nAnother major concern for Wilson is getting enough Paly  fans to attend home games.\r\n\r\n“I don’t believe the move will affect the players' performance,\" Wilson said. \"I do encourage Paly student's however, to make it out to games— the girls will need the support.”\r\n\r\nPaly Volleyball is not the only fall sport being affected by the gym construction. Water polo will is also facing  the challenges of no longer having a pool on campus.\r\n\r\nMuch like Lee, junior water polo player Alex Beaudry is also being affected time wise by the move to a new location.\r\n\r\n“The change allows for no procrastination,\" Beaudry said. \"Since practice is right after school and ends at around 6 p.m., there are no big blocks for me to do homework in.\"\r\n\r\nSome winter and spring sports including basketball, wrestling and badminton. will also have to move off campus during their respective seasons.\r\n\r\nOther than changes in location, Paly sports teams are settling into their groove. \"Gunn has been very accommodating and other than the giant \"G\" on the wall and the change in paint colors, we are very much making ourselves at home,\" Wilson said.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School's students, staff, coaches and parents are facing challenges brought on by recent construction projects, including the Big Gym's renovations and the pool's closure, which have caused many sports teams to relocate off-campus.\r\n","date":"2015-09-01 11:34:16","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11911387_1807124139514151_1611859663_n1.jpg","categories":["Sports","Spotlight"],"tags":{"32738":"alex beaudry","49942":"beaudry","11286":"big gym","12358":"coach","8616":"construction","8751":"gunn","49940":"jekira wilson","8944":"palo alto high school","8953":"paly","9863":"pool","49939":"rinconada","9120":"sports","41060":"teams","38450":"update","9216":"volleyball","49938":"waterpolov","49941":"wilson"}},{"id":106526,"title":"Minimum day scheduled for this Friday, Sept. 4 (12:20 p.m. dismissal time)","permalink":"http:\/\/palyvoice.com\/2015\/08\/31\/minimum-day-scheduled-for-this-friday-sept-4-1220-p-m-dismissal-time\/","content":"","excerpt":"","date":"2015-08-31 18:38:41","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":106160,"title":"Palo Alto to raise minimum wage","permalink":"http:\/\/palyvoice.com\/2015\/08\/30\/palo-alto-to-raise-minimum-wage\/","content":"[caption id=\"attachment_106123\" align=\"aligncenter\" width=\"579\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/IMG_9928.jpg\"><img class=\"wp-image-106123\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/IMG_9928.jpg\" alt=\"IMG_9928\" width=\"579\" height=\"386\" \/><\/a> Community members watch as Palo Alto City Council members discuss raising the minimum wage from $9 to $11 per hour. Some people hold signs reading \"15 by '18 Everywhere,\" a reference to the movement advocating for a $15 minimum wage by 2018. The Council unanimously approved the wage increase on Aug. 24. Photo by Emily Hwang.[\/caption]\r\n\r\nPalo Alto's minimum wage will increase from $9 to $11 per hour, effective Jan. 1, after a unanimous vote by the Palo Alto City Council on Aug. 24. The wage hike is part of a phased effort to set the minimum wage to $15 by 2018.\r\n\r\nThe decision came nearly four months after the Council’s Policy and Services Committee approved a recommendation to increase the city’s minimum wage, in light of several neighboring cities’ adoption of wage hikes.\r\n\r\nSeveral open-forum speakers emphatically advocated for a minimum wage hike, and rebutted the claim that an increase would be devastatingly detrimental to businesses.\r\n\r\n“The dire predictions are wrong,” said Paul George, director of the Peninsula Peace and Justice Center. \"We have an excellent real life example from San Jose ... in the food and hospitality industry, the number of jobs increased.\"\r\n\r\nOthers implored the council to vote for a wage increase as a means to combat ever-increasing income inequality.\r\n\r\n\"The rich get richer and the poor get poorer,\" said Andrew Boone, a member of East Palo Alto's Planning Committee. \"There’s no reason not to do it [raise the minimum wage] that I can think of.\"\r\n\r\nA few small business owners, however, urged the council to vote against the measure, explaining that tip compensation, among other factors, are not considered as part of the current wage.\r\n\r\n\"The minimum wage can’t be looked at as a simple minimum wage,\" Coupa Cafe owner Nancy Coupal said.\r\n\r\n[caption id=\"\" align=\"alignright\" width=\"326\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/IMG_9929.jpg\"><img class=\"wp-image-106124\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/IMG_9929.jpg\" alt=\"Nancy Coupal\" width=\"326\" height=\"217\" \/><\/a> Coupa Cafe owner Nancy Coupal speaks before the Palo Alto City Council on Aug. 24, insisting against a $2 minimum wage raise. Labor costs and unfair tip compensation were Coupal's main concerns. \"It'll be very difficult to pay chefs and managers,\" Coupal said. Photo by Emily Hwang.[\/caption]\r\n\r\nMichael Ekwell, the owner of La Bodeguita de Medio, cited dramatic and unnecessary increases in labor costs as reasons for maintaining the $9 minimum wage.\r\n\r\n\"We’ve got to raise our revenue $55,000 to compensate,\" he said.\r\n\r\nAfter hearing several community perspectives on the issue, the Council proceeded to discuss and comment on the potential negative consequences of raising the wage. Though the council members were supportive of the wage hike, they expressed a desire to explore exceptions regarding employee salaries. Councilman Greg Scharff commended the Committee’s gradual approach to raising wages but believes that other wage issues should be considered in future discourse.\r\n\r\n“We should amend the [exempt waitstaff] policy to get where we want to go,\" he said.\r\n\r\nCouncilman Cory Wolbach refuted the claim that teenage workers will be negatively impacted by the wage increase.\r\n\r\n\"'It will hurt teens because they won’t be able to find jobs' is a claim not well supported by economic research,\" he said.\r\n\r\nMayor Karen Holman stated that the potential economic effects on teenagers was factored into her decision.\r\n\r\nJunior Haley Chalmers, who works as a lifeguard, does not think the minimum wage increase will impact her job.\r\n\r\n\"I don't think it [the wage increase] is going to affect me, because I already have a job and I get paid more than the minimum wage that it's getting raised to,\" Chalmers said.\r\n\r\nHowever, Chalmers says she thinks the higher minimum wage might make it more difficult for unskilled teenagers without work experience to find jobs.\r\n\r\n\"It will be harder for companies to pay their employees,\" Chalmers said. \"They [businesses] are going to pick people with more experience over teenagers because there will be less job spaces.\"\r\n\r\nMatthew Glickman, a lecturer at the Stanford Graduate School of Business, believes that the raise will have a negligible effect on local businesses.\r\n\r\n\"The main thing that classic economics says is supply and demand — if you make something more expensive, people want less of it,\" Glickman said. \"But in practice, studies have shown that if it [the wage increase] is not a huge difference, not that many jobs disappear... so you probably won't see a big change here.\"","excerpt":"Palo Alto's minimum wage will increase from $9 to $11, effective Jan. 1, 2016, after a unanimous vote by the Palo Alto City Council on Aug. 24. The wage hike is part of a phased effort to set the minimum wage to $15 by 2018.","date":"2015-08-30 20:11:31","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/IMG_9928.jpg","categories":["News","Spotlight"],"tags":{"49546":"minimum","49547":"palo alto city council","9218":"vote"}},{"id":106489,"title":"Advisory this week is for freshmen and seniors","permalink":"http:\/\/palyvoice.com\/2015\/08\/30\/advisory-this-week-is-for-freshmen-and-seniors\/","content":"","excerpt":"","date":"2015-08-30 10:22:45","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":106381,"title":"The Final Farewell: Big Gym scheduled for demolition on Monday","permalink":"http:\/\/palyvoice.com\/2015\/08\/29\/the-final-farewell-big-gym-scheduled-for-demolition-on-monday\/","content":"Nearly a year and a half after its <a href=\"http:\/\/palyvoice.com\/2014\/03\/25\/slideshow-farewell-big-gym-event-a-fitting-celebration\/\" target=\"_blank\">farewell ceremony<\/a>, Palo Alto High School's 86-year-old Big Gym will be demolished on Monday, according to Assistant Principal Jerry Berkson.\r\n\r\n[caption id=\"attachment_106391\" align=\"alignright\" width=\"316\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/collage.jpg\"><img class=\" wp-image-106391\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/collage.jpg\" alt=\"Palo Alto High School's new sports complex will feature two multi-level gyms connected by a hallway, several locker rooms, a concession stand, an athletic store, a dance and yoga room, a ticket booth and a wrestling room. &quot;It has every possible thing an incredible sports program needs,&quot; Assistant Principal Jerry Berkson said. Screenshots by Jeanette Wong.\" width=\"316\" height=\"422\" \/><\/a> Palo Alto High School's new athletic center will feature a multitude of sports facilities, including two multi-level gyms, a wrestling room and an athletic store. \"It has every possible thing an incredible sports program needs,\" Assistant Principal Jerry Berkson said. Photos by Tolbert Design Architects.[\/caption]\r\n\r\nThe construction project was initially slated to start in the summer of 2014. But, according to Berkson, it was continually delayed due to issues with the bureaucratic process.\r\n\r\n\"It [the entire construction process] is more than just a handshake,\" Berkson said. \"It's a leaseback — technically the construction company buys the property from us and then we get it back later. There's a lot of legal work to go through.\"\r\n\r\nThe architecture firm behind the highly anticipated new gym, <a href=\"http:\/\/www.tolbertdesignarchitects.com\/#!all-projects\/c1l7f\" target=\"_blank\">Tolbert Design Architects<\/a>, first presented its designs at a Palo Alto Unified School District Board of Education meeting in 2013. The state-of-the-art sports complex will be U-shaped, featuring two connected multi-level gyms, a \"Hall of Fame\" corridor, several locker rooms, a concession stand, an athletic store, a dance and yoga room, a ticket booth and a wrestling room. According to Berkson, there may be some minor enhancements to the pool area, such as scoreboards or electrical outlets, but pool facilities will not undergo any major reconstruction.\r\n\r\nAccording to Berkson, assuming that there are no unforeseen changes, the parking lot off of Churchill Avenue will remain at its current parking space capacity. It is even possible that several spots by the East side of the gym may open up once it is torn down, Berkson said.\r\n\r\nAlthough it may not look like it from the outside, construction plans are already well underway inside the gym. According to Berkson, the construction team disassembled the gym floor, so that pieces of it could be sold at a fundraiser hosted by the Paly Sports Boosters. Also, a HazMat [Hazardous Materials] crew has already removed any hazardous materials from inside the gym, Berkson said.\r\n\r\n[caption id=\"attachment_106468\" align=\"alignleft\" width=\"298\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/MG_8139-cropped.jpg\"><img class=\" wp-image-106468\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/MG_8139-cropped.jpg\" alt=\"Construction workers work on the water pipes near the Big Gym on Friday afternoon. Photo by Cooper Lou.\" width=\"298\" height=\"199\" \/><\/a> The construction crew works on the water pipes near the Big Gym on Friday afternoon. According to Berkson, the gym reconstruction project is projected to finish in two years. Photo by Cooper Lou.[\/caption]\r\n\r\n“[On Monday,] you’ll see a physical tear down,” Berkson said. “It will be like a bulldozer-type thing ... during school hours. I don’t think it will be that loud — the loudest thing will just be the reverse beeping sound of the bulldozer.”\r\n\r\nThe proposed complex is scheduled to finish by Fall 2017.\r\n\r\n“If I had to bet, it’s going to finish in less than two years,” Berkson said. “There’s a better chance of it finishing sooner, rather than later.”\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/7572401-gym-reconstruction\" width=\"620\" height=\"976\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n<em>Photos by Cooper Lou. Graphic by Jeanette Wong.<\/em>","excerpt":"Nearly a year and a half after its farewell ceremony, Palo Alto High School's 86-year-old Big Gym will be demolished on Monday.","date":"2015-08-29 22:30:50","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/featured-image.jpg","categories":["Editor's Pick","News","Spotlight"],"tags":{"49935":"athletic center","11286":"big gym","49932":"big gym farewell","49934":"construction project","8944":"palo alto high school","12969":"paly gym","8977":"PAUSD","49933":"reconstruction","29306":"small gym","49936":"sports complex","49937":"torn down"}},{"id":106361,"title":"Freshman election results 2015-16","permalink":"http:\/\/palyvoice.com\/2015\/08\/28\/freshman-election-results-2015-16\/","content":"Results from Palo Alto High School's Associated Student Body freshman officer elections are in after three days of voting. Student Activities Director Matt Hall announced the officers through <a href=\"https:\/\/www.facebook.com\/palyasb?fref=ts\">ASB's Facebook page.<\/a>\r\n\r\n<strong>President<\/strong><strong>:<\/strong> Caroline Furrier\r\n\r\n<strong>Vice President:<\/strong> Vivian Feng","excerpt":"Results from Palo Alto High School's Associated Student Body freshman officer elections are in after three days of voting.","date":"2015-08-28 17:26:23","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/PicMonkey-Collage.jpg","categories":["News"],"tags":{"8496":"ASB","49926":"caroline furrier","9795":"freshman","8721":"freshmen","14809":"officers","9009":"President","9203":"vice president","49927":"vivian feng","9218":"vote"}},{"id":106318,"title":"Students unmask teen mental health discussion through documentary","permalink":"http:\/\/palyvoice.com\/2015\/08\/27\/students-unmask-teen-mental-health-discussion-through-documentary\/","content":"https:\/\/www.youtube.com\/watch?v=-1kPAVxkPmE\r\n\r\nOn the first few days of school, at one point or another, every student is asked the inevitable question: What did you do this summer?\r\n\r\nSome students traveled around the world, exploring far away wonders with family. Others participated in specialized programs at universities, enriching themselves in debate, theatre, business or music.\r\n\r\nFor 13 Palo Alto High School and Gunn High School students, however, the summer was filled with interviews, hard-hitting questionnaires and mental health awareness within their local community.\r\n\r\nAfter a series of teen suicides last year, Paly seniors Christian Leong and Andrew Baer embarked on a five-month journey to capture the effect of mental health issues on their community.\r\n\r\nIn late May, they gathered a team of 13 students, naming themselves “Documenting our Community about X topics” or the “DocX” team. June marked the creation of their storyboard while July turned their vision into reality — filming. Five months later, after the release of a trailer (see <a href=\"https:\/\/www.youtube.com\/watch?v=-1kPAVxkPmE\">here<\/a>); the team is ready to premiere the entirety of their film at 6:30 p.m. Sept. 12 at the Palo Alto Children’s Theater.\r\n\r\nAccording to Baer, the documentary is a direct response to the teen suicides in Palo Alto, serving as a way to spark conversation between youth and adults, break the stigma around mental health and inspire hope throughout the community.\r\n\r\n“We want as many people in the community to see the film because it’s really a community issue,\" Baer said. \"It’s not just school or students or teens.”\r\n\r\n[caption id=\"attachment_106322\" align=\"alignleft\" width=\"355\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11728994_1615094048747922_522563832245246603_o.jpg\"><img class=\"wp-image-106322\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11728994_1615094048747922_522563832245246603_o.jpg\" alt=\"11728994_1615094048747922_522563832245246603_o\" width=\"355\" height=\"355\" \/><\/a> Directors Andrew Baer and Christian Leong work throughout the summer in Baer's house to film and edit their documentary. \"My friend Christian [Leong] and I wanted to take action and make a positive difference,\" Baer said. Photo by Yui Sasajima.[\/caption]The film is a “quasi-documentary,” intertwining a mix of fiction and nonfiction elements, according to Leong.\r\n\r\n“It gives a backstory of what happened last year,” Leong said. “It then moves on to what we can do moving forward about the issue while also giving a fictional storyline.”\r\n\r\nThe narrative aspect of the documentary tells the story of a fabricated high school student, “Winston,” played by Paly senior Daniel Cottrell. According to Baer, the character’s setting and personal life remain vague in order to illustrate a relatable character experiencing something difficult.\r\n\r\n“His [Winston's] purpose is to provide the emotional aspect of the film that you can’t really get through the documentary,” Baer said.\r\n\r\nThe nonfictional component of the film contains interviews with students, teachers and mental health professionals. Seniors Carolyn Walworth, Bryn Carlson and Leslie Garcia share their stories in each respective interview. Paly math teacher Herb Bocksnick and English teacher Shirley Tokheim voice their opinions as well.\r\n\r\nOther interviews include Supt. Max McGee; Chris Sturgeon, a youth pastor at Menlo Park Presbyterian Church; Dr. Shashank Joshi, a Stanford medical psychologist; and V<span style=\"color: #373e4d;\">assi Johri, D<\/span>irector of health and wellness at REACH Ashland Youth Center in San Leandro, which offers support services for teenagers.\r\n\r\nFor the team, the interviews not only provided strong components to the documentary but also added to the filmmakers’ understanding of the topic as a whole.\r\n\r\n“The whole interview process was also a learning process,” Baer said.\r\n\r\nAccording to Leong, the most difficult aspect of the interviews was dealing with the sensitivity of the topic.\r\n\r\n“You really have to be careful in the wording when you reach out to different interviewees and as a team,” Leong said.\r\n\r\nTo ensure consideration, the filmmakers carefully followed the standardized requirements for filmmaking provided by the <a href=\"https:\/\/www.afsp.org\/\">American Foundation for Suicide Prevention<\/a>, specifically in regards to word choice and glorification, according to Leong.\r\n\r\nThe documentary also cites information, ranging from teenage involvement in community issues to sources of stress, that was gathered from local high school students through online surveys composed by the filmmakers. Open-ended questions included:\r\n<ul>\r\n\t<li>Which of the following causes you stress?<\/li>\r\n\t<li>What is your definition of hope?<\/li>\r\n\t<li>What do you suggest the district do to support teen voice?<\/li>\r\n\t<li>Is teen voice being heard in the community?<\/li>\r\n<\/ul>\r\n“We really valued the data because we thought it could give a good sample size of what people in our class really thought of the issue,” Leong said.\r\n\r\nPrior to the creation of “Unmasked,” directors Leong and Baer had separate experiences with filmmaking. Leong took video production courses at Paly and attended a two-week course at Occidental College for its School of Creative and Performing Arts. Baer, on the other hand, gained his film expertise through his father, who is involved with the filmmaking industry.\r\n\r\n“Just making movies for fun has been something I’ve done,” Baer said.\r\n\r\n[caption id=\"attachment_106326\" align=\"alignnone\" width=\"633\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11143417_1610557845868209_4430432207647122128_n.jpg\"><img class=\"wp-image-106326\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11143417_1610557845868209_4430432207647122128_n.jpg\" alt=\"11143417_1610557845868209_4430432207647122128_n\" width=\"633\" height=\"356\" \/><\/a> Senior Daniel Cottrell plays the role of \"Winston,\" a teenage boy struggling with depression who appears in the fictional part of the documentary. Cottrell has experience acting in short films and on stage, including the title role of \"The Stinky Cheese Man,\" a play produced at Paly last year. Photo by Tanner Kerrins.[\/caption]\r\n\r\nAfter working for hours together each day over the summer, the team of 13 students — Paly seniors Baer, Leong, Josh Yuen, Joseph Kao, Daniel Cottrell, Leslie Garcia, Natalie Snyder and Stas Ilyasov; Paly junior Zack Gibson; and Gunn seniors Yui Sasajima, Lydia Sun, Tanner Kerrins and Rachel Rothberg — bonded through their work.\r\n\r\n“We found people who would be interested in both the film and the issue,” Leong said. “Because everyone was super passionate about it, the working environment was really great to be in.”\r\n\r\nLeong is thrilled to showcase the culmination of five months of work.\r\n\r\n“[The filmmakers] really poured their heart and soul into it, and I’m just so proud so many people were able to see this project from the start to finish,” Leong said.\r\n\r\nVideographer Gibson is passionate about the film’s overall message and hopes it rests well with the audience.\r\n\r\n“We aren’t pointing fingers at any particular problem or community member,” Gibson said. “This is about coming together as a community and not blaming one person, place or thing.”\r\n\r\nBaer, as well, looks forward to see the impact the documentary has on the community.\r\n\r\n“The best thing we can do is just help people find an opinion, inspire people to make a positive difference, or think about it more and encourage conversation,” Baer said.\r\n\r\n“Unmasked” is set to premiere from 6:30 p.m. to 8 p.m. Sept. 12 at the Palo Alto Children’s Theater. The venue is limited to 196 tickets, which can be <a href=\"https:\/\/www.eventbrite.com\/e\/unmasked-premiere-childrens-theater-palo-alto-tickets-18339809865?aff=es2\">reserved here for free<\/a>.","excerpt":"Thirteen Paly and Gunn students seek to generate conversation about mental health in the community through the first screening of their documentary \"Unmasked,\" which looks to the past as a form of reflection and to the future as a form of hope.","date":"2015-08-27 20:37:48","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/11143417_1610557845868209_4430432207647122128_n.jpg","categories":["Features","Spotlight"],"tags":{"49920":"andrew baer","8493":"art","49921":"baer","49923":"christian leong","49919":"daniel cottrell","40996":"depression","8706":"film","49925":"filmmakers","8751":"gunn","14293":"joseph kao","49918":"josh yuen","49922":"leong","49105":"leslie garcia","49917":"natalie snyder","8953":"paly","49924":"rachel rothburg","9135":"suicide","49916":"unmasked"}}]