[{"id":101061,"title":"Driverless or dangerous?","permalink":"http:\/\/palyvoice.com\/2015\/03\/15\/driverless-or-dangerous\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_101098\" align=\"aligncenter\" width=\"592\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-4.jpg\"><img class=\"wp-image-101098 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-4.jpg\" alt=\"A self-driving car parks in the Google parking lot. &quot;We've been working on that [designing our own cars] for about the last two years,&quot; Waydo said. &quot;It allows us to customize both what the sensor sees and all the computing.&quot; Photo by Jeanette Wong.\" width=\"592\" height=\"444\" \/><\/a> A self-driving car parks in the Google parking lot. \"We've been working on that [designing our own cars] for about the last two years,\" Waydo said. \"It allows us to customize both what the sensor sees and all the computing.\" Photo by Jeanette Wong.[\/caption]The fact that cars have revolutionized the world is indisputable. In modern times, cars can be a source of frustration, pleasure, and sometimes even fear. However, the feelings that people have towards cars could be completely changed quite soon — maybe sooner than most expect. Local tech giant Google, among other innovators, is working on an ambitious endeavor to transform the future of transportation: cars that can drive themselves.\r\n\r\n[caption id=\"attachment_101094\" align=\"alignright\" width=\"313\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-1.jpg\"><img class=\" wp-image-101094\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-1.jpg\" alt=\"Google employees prepare for a test drive in the parking lot of the Google headquarters in Mountain View. Photo by Jeanette Wong.\" width=\"313\" height=\"235\" \/><\/a> Google employees prepare for a self-driving car test drive at the Google headquarters. Photo by Jeanette Wong.[\/caption]\r\n\r\nAs part of the recent Career Month Speakers Series, Google Vehicle Development Lead Jaime Waydo came to Palo Alto High School to give a presentation and show off her team's project — a self-driving car.\r\n\r\nWaydo shared information on how the Self-Driving Car Project is developing and the future implications of these driverless cars.\r\n\r\n“The leading cause of death from people [of ages from] three to 30 in the United States is motor vehicle fatalities,” Waydo said. “Ninety-two percent of those fatalities are from human error, meaning that the driver of the car has done something wrong. That’s just tragic. So, if you take the human out of the car, you can create a driver that’s never tired, a driver that never gets angry, a driver that’s just always making good decisions, and make that number go away. That’s really the goal of what we’re working on.”\r\n\r\nGoogle has been working on developing autonomous cars since 2009, according to Waydo. Since then, this project has expanded to a much larger scale.\r\n\r\n[caption id=\"attachment_101096\" align=\"alignleft\" width=\"264\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-2.jpg\"><img class=\" wp-image-101096\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-2.jpg\" alt=\"Sensors on either side of the car can recognize people, cars, signs and traffic lights, according to Vehicle Development Lead Jaime Waydo. Photo by Jeanette Wong.\" width=\"264\" height=\"198\" \/><\/a> Sensors on either side of the car can recognize people, cars, signs and traffic lights, according to Waydo. Photo by Jeanette Wong.[\/caption]\r\n\r\n“We’re [Google is] learning a lot about self-driving technology — not just on the freeway, which you saw us doing early on [as early as Jan. 2010, as evidenced by <a href=\"https:\/\/www.youtube.com\/watch?v=VAiH1LX8guk\" target=\"_blank\">this video]<\/a>, but also in more city street environments,” Waydo said. “That’s what why you see the Lexus driving around Mountain View a lot. We’re letting the cars drive autonomously — with our safety drivers in them — and figuring out all the new challenges that can happen when you’re driving in an urban environment like that.”\r\n\r\nAccording to Waydo, the different environments pose different challenges for the design team. On the freeway, although the cars are moving at high speeds and the autonomous car needs to be able to respond quickly, all the cars are moving at more or less the same speed and direction. However, on city streets, there is a lot more randomness involved and other factors that need to be considered. Pedestrians, cyclists, animals all contribute to the variables cars encounter in a city.\r\n\r\nGoogle is not alone in this undertaking. As technology continues to advance, more and more companies are looking to develop innovative ways to aid drivers on the road. Several major car manufacturers such as Audi, Toyota and Ford are in the stages of developing autonomous cars of their own, and Mercedes-Benz’s most recent model features “Steering Assist,” in which sensors on the car can help “maintain the desired distance from another vehicle in front,” according to <a href=\"http:\/\/techcenter.mercedes-benz.com\/en\/distronic_plus_steering_assist\/detail.html\" target=\"_blank\">its website<\/a>.\r\n\r\n[caption id=\"attachment_101097\" align=\"alignright\" width=\"259\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-3.jpg\"><img class=\" wp-image-101097\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-3.jpg\" alt=\"A sensor on the roof of the car spins in place, constantly scanning the surroundings. Photo by Jeanette Wong.\" width=\"259\" height=\"194\" \/><\/a> A sensor on the roof of the car spins in place, constantly scanning the surroundings. Photo by Jeanette Wong.[\/caption]\r\n\r\n“We’re all trying to do the same thing: make the roads a safer place,” Waydo said. “The secondary goal is to make transportation more efficient, and hopefully, with all of us working on that, there’s a great environment to help foster creativity and make those challenges more solvable.”\r\n\r\nAutonomous cars could revolutionize the world as we know it and greatly diminish fatal accidents and road rage, according to Waydo.\r\n\r\n“As you drive home, look at the drivers around you and look what they’re doing in those cars,” Waydo said. “They’re talking on the phone, they’re texting, they’re putting on makeup, they’re reading a book, they’re playing a trumpet — I’ve actually seen someone do that once. Those drivers are distracted and we’re making a system where the driver is never distracted. The driver is never tired. The driver is never drunk. And if we can do that successfully, then I think that’s a huge win for everybody.”\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/4988406-car-quotes\" width=\"600\" height=\"470\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n<em>The Paly Voice asked members of the Paly community to share their opinions on self-driving cars. Graphic by Emily Hwang.<\/em>\r\n\r\n[caption id=\"attachment_101192\" align=\"alignright\" width=\"268\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Attachment-11.jpeg\"><img class=\"wp-image-101192\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Attachment-11.jpeg\" alt=\"Paly students surround and look at a Google self-driving car. Jamie Waydo came to speak at Paly as part of the Career Month Speaker Series on March 9.\" width=\"268\" height=\"201\" \/><\/a> Paly students surround and observe a Google self-driving car. Jamie Waydo came to speak at Paly as part of the Career Month Speaker Series on March 9. Photo by Adrienne Kwok.[\/caption]\r\n\r\nAccording to Waydo, the world of self-driving cars is fairly new, so there are still a lot of logistical problems that need to be worked out. It is still unclear how traffic laws will change to adapt to this new technology, Waydo says.\r\n\r\n“It’s a new frontier of sorts and typically, when you see new frontiers, you see the world adapting and learning what that means to society,\" Waydo said. \"I think that’s a place that we’re just now starting to embark on.”\r\n\r\nWaydo encourages people to ignore cost and other details for now, and instead focus on the significant problems that self-driving cars could potentially solve.\r\n\r\n“Everything we do is making the world better and safer, and that’s what it’s about,” Waydo said.","excerpt":"Local tech giant Google, among other innovators, is working on an ambitious endeavor to transform the future of transportation: cars that can drive themselves. The Paly Voice talked with Google Vehicle Development Lead Jaime Waydo about the future of autonomous cars.","date":"2015-03-15 18:38:17","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/self-driving-car-1.jpg","categories":["Features","Spotlight"],"tags":{"8453":"accident","40815":"awesome","40806":"cars","40810":"clara wolfe","40813":"cool","40807":"driverless","10012":"emily hwang","12050":"Google","40809":"jamie waydo","40814":"jeanette wong","29099":"josh code","8944":"palo alto high school","8953":"paly","40808":"self-driving","40812":"sensor","9154":"technology","25049":"Trinity Klein","40811":"will dougall"}},{"id":101150,"title":"Slideshow: Baseball defeats Mountain View in first league game","permalink":"http:\/\/palyvoice.com\/2015\/03\/15\/slideshow-baseball-defeats-mountain-view-in-first-league-game\/","content":"The Palo Alto High School baseball team (6-1, 2-0) triumphed over Mountain View High School (2-5-1, 0-2), 9-2, in its first league game of the season.\r\n\r\nAccording to <a href=\"http:\/\/www.maxpreps.com\/league\/X9MHmOjHGkaLa-WSYNEs3A\/standings-de-anza.htm\" target=\"_blank\">MaxPreps<\/a>, the Vikings scored their first eight runs in the first inning, kicking off with a strong start that the Spartans failed to overcome. Several players scored one run each, with the exception of junior infielder Riley Schoeben, who scored two.\r\n\r\nThe team defeated Mountain View in its second meeting with the Spartans last week at Mountain View, 13-6. Paly will take on Homestead 4 p.m. next Wednesday at home.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AgOAOZsmV4he\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School baseball team (5-1, 1-0) triumphed over Mountain View High School (2-4-1, 0-1), 9-2, in its first league game of the season.","date":"2015-03-15 11:27:54","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_3377.jpg","categories":["Slideshow","Sports"],"tags":{"8410":"Baseball","8634":"de anza league","10618":"first game","40735":"mountain view spartans","8963":"paly vikings","10981":"win"}},{"id":101010,"title":"SatireDay Cartoon 3","permalink":"http:\/\/palyvoice.com\/2015\/03\/14\/satireday-cartoon-3\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg\"><img class=\"aligncenter wp-image-101011 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg\" alt=\"Scan Feb 19, 2015, 9_40 PM-page4\" width=\"600\" height=\"388\" \/><\/a><strong>Previous Cartoons<\/strong>\r\n\r\n3\/7\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/07\/satireday-cartoon-2\/\">When WASC Leaves<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\"><img class=\"aligncenter wp-image-100808 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\" alt=\"satireday 2\" width=\"600\" height=\"589\" \/><\/a>\r\n\r\n2\/28\/15: <a href=\"http:\/\/palyvoice.com\/2015\/02\/28\/satireday-cartoon\/\">The No Homework Night<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\"><img class=\"aligncenter wp-image-99225 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\" alt=\"satireday cartoon\" width=\"600\" height=\"473\" \/><\/a>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Check out the third installment of the SatireDay Cartoon. ","date":"2015-03-14 13:24:58","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg","categories":["Spotlight"],"tags":{"39025":"cartoon","40209":"humor","40208":"satireday","39024":"satireday cartoon"}},{"id":101167,"title":"Slideshow: Boys&#8217; lacrosse blows out Gunn in crosstown rivalry game","permalink":"http:\/\/palyvoice.com\/2015\/03\/14\/slideshow-boys-lacrosse-blows-out-gunn-in-crosstown-rivalry-game\/","content":"The Palo Alto High School boys' lacrosse team (2-3, 0-3) emphatically beat crosstown rival Gunn High School (3-3, 0-0) by a score of 11-3 Friday night at a packed El Camino Field.\r\n\r\nThe Vikings, who have yet to win a league game, raced into a 6-1 lead early on, which eventually proved insurmountable for the opposing Titans. Junior attacker Matthew Seligson contributed four goals and senior midfielder Zach Levitan scored three to help secure the non-league win. With recent losses in mind, Seligson appreciates the way the team played this game.\r\n\r\n\"I'm happier that we were able to put up a lot of points as an offense collectively,\" Seligson said. \"We haven't had a win in a while, so it definitely means a lot to us.\"\r\n\r\nThe Vikings next play Saratoga High School 7 p.m. this coming Wednesday at home.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AAMAcbsuiQmC\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School boys' lacrosse team (2-3, 0-3) emphatically beat crosstown rivals Gunn High School (3-3, 0-0) by a score of 11-3 last night at a packed El Camino Field.\r\n","date":"2015-03-14 12:38:18","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_2743.jpg","categories":["Sports","Spotlight"],"tags":{"12015":"boys lacrosse","8751":"gunn","8836":"Lacrosse","11983":"Matthew Seligson","8944":"palo alto high school","17488":"rival","9107":"slideshow","10981":"win","12052":"zach levitan"}},{"id":100364,"title":"What they&#8217;re saying: Mid-March &#8220;Break&#8221;?","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/what-theyre-saying-mid-march-break\/","content":"The majority of Palo Alto High School students will seemingly have an unofficial early spring break due to the combination of a local holiday, the weekend and the California High School Exit Examination, or CAHSEE, testing next week.\r\n\r\nAll students will have tomorrow off due to a local holiday. After this weekend, only sophomores and those who need to take the CAHSEE will have school on Tuesday and Wednesday, providing an extended \"break\" for the rest of the school.\r\n\r\n<dl id=\"attachment_100366\" class=\"wp-caption alignnone\"><dt class=\"wp-caption-dt\">\r\n\r\n[caption id=\"attachment_100366\" align=\"aligncenter\" width=\"572\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-01-at-10.38.29-PM.png\"><img class=\"wp-image-100366\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-01-at-10.38.29-PM.png\" alt=\"\" width=\"572\" height=\"407\" \/><\/a> In addition to this Friday's local holiday, students who do not have to take the CAHSEE will have Tuesday, March 17 and Wednesday, March 18 off. School will be in session on Monday, March 16. Screenshot by Josh Yuen.[\/caption]\r\n\r\n<\/dt><\/dl>With so many multiple days off, The Paly Voice investigates how students and faculty are approaching this unusual upcoming schedule.\r\n\r\n<strong>Students<\/strong>\r\n\r\nMonday is the odd day out in the scheduling because school will be in session as a C day. Although most students don’t plan on cutting class, they predict that there will be a fair amount of students that will.\r\n\r\n“I’m not [going to cut], but I know a lot of people that are going to skip,” junior Shivani Parikh said. “They don’t see the point of having three days off and then two more days off.”\r\n\r\nIn agreement of the awkward scheduling, senior Yerem Istanboulian offers a possible solution for next year.\r\n\r\n“If they could just move the day off on Friday to Monday, that would be better,” Istanboulian said.\r\n\r\n<strong>Teachers<\/strong>\r\n\r\nCAHSEE testing has always been mandated by the state as the Tuesday and Wednesday of the third week in March.\r\n\r\nSophomore English teacher Trinity Klein believes that many teachers have gotten used to CAHSEE testing and just see the upcoming schedule as a long weekend followed by a light week of work.\r\n\r\n“I think that the long weekend doesn't really make a difference because we have a regular schedule on Monday,” Klein said. “It [the CAHSEE] is not a labor-intensive process. They [the rest of the weekdays] are just light work days compared to normal.”\r\n\r\n<strong>Administration<\/strong>\r\n\r\nRecognizing that absence rates will naturally be a little higher than usual on Monday, Assistant Principal Jerry Berkson said that missing one day of school is not a big deal. Berkson also agreed that having the district move the local holiday to Monday rather than Friday would have worked out better in hindsight.\r\n\r\n\"It's not the end of the world, kids missing one day,\" Berkson said. \"I think a student could survive missing one day, not that I'm encouraging them to just take it off.\"","excerpt":"The majority of Palo Alto High School students will seemingly have an unofficial early spring break due to the combination of a local holiday, the weekend and the California High School Exit Examination, or CAHSEE, testing next week.  The Paly Voice investigates how students and faculty are approaching this unusual upcoming schedule. ","date":"2015-03-12 22:12:05","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-12-at-9.48.15-PM.png","categories":["Features"],"tags":{"40205":"break","40730":"cahsee","9954":"jerry berkson","40731":"local holiday","40732":"march break","8944":"palo alto high school","40734":"shivani parikh","13289":"testing","25049":"Trinity Klein","9201":"verbatim","40733":"yerem istanboulian"}},{"id":101100,"title":"Liveblog: Varsity girls&#8217; lacrosse takes on Gunn","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/liveblog-varsity-girls-lacrosse-takes-on-gunn\/","content":"The Palo Alto High School varsity girls' lacrosse team is playing Gunn High School on the Paly at tonight at 7p.m. on the Paly lacrosse field.\r\n\r\n[liveblog]\r\n\r\nJunior Maya Benatar scores first goal of the game. Paly is up 1-0.\r\n\r\nJunior Meredith Kinnamon blocks a shot from Gunn, but Gunn is quick to regain possession.\r\n\r\nJunior Maya Benatar scores again. Paly winning 2-0.\r\n\r\nGunn player #6 scores. Paly keeps the lead 2-1.\r\n\r\nSenior Allie Peery bounces the ball into the goal. Paly leads 3-1.\r\n\r\nSenior Paige Bara charges the goal and gets fowled. She makes the goal. Paly leads 5-1.\r\n\r\nGunn Titans score. Paly leads 4-2.\r\n\r\nGunn handles the ball by the goal, but Senior Paige Bara intercepts and runs with it.\r\n\r\nGunn player #5 fowled, and seeks help from trainer. She is able to walk off the field.\r\n\r\nGunn senior Caroline Chou shoots for the goal but is blocked by goalie Meredith Kinnamon.\r\n\r\nThe half ends with Paly leading Gunn 4-2.\r\n\r\n2nd half starts with Gunn possession.\r\n\r\nGunn scores. Vikings keep their slim lead of 4-3.\r\n\r\nSenior Paige Bara shoots and makes the goal, but the referee calls no point. She shoots and makes the 8-meter shot. Paly leads 5-3.\r\n\r\nSenior Caroline Chou intercepts the ball and charges the field. She passes to Gunn player #9 who scores. Vikings lead 5-4.\r\n\r\nSenior Lisa Rogge scores for Paly. Paly is up 6-4.\r\n\r\nSenior Paige Bara scores for the third time. Paly leads 7-4.\r\n\r\nGunn player #11 misses an 8-meter shot. Score remains 7-4, Paly.\r\n\r\nSenior Claire Chevallier scores bring the Vikings up 8-4.\r\n\r\nSenior Caroline Chou makes an 8-meter shot, bringing the Gunn Titans up 8-5.\r\n\r\nMaya Benatar scores with 11 seconds left. Vikings lead 9-5.\r\n\r\nPaly beats Gunn. Final score, 9-5.","excerpt":"The Palo Alto High School varsity girls&#8217; lacrosse team is playing Gunn High School on the Paly at tonight at 7p.m. on the Paly lacrosse <a href=\"http:\/\/palyvoice.com\/2015\/03\/12\/liveblog-varsity-girls-lacrosse-takes-on-gunn\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-03-12 19:11:31","author":"Chloe Fishman","categories":["Uncategorized"],"tags":{"8734":"girls","8751":"gunn","8836":"Lacrosse","8953":"paly","9200":"varsity"}},{"id":100895,"title":"Community mourns, unifies following student death","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/community-mourns-unifies-following-student-death\/","content":"The Palo Alto High School administration and community are providing wide-ranging support options following the death by suicide on Monday of a Paly student.\r\n\r\nThese services include several multiple layers of support services and enhanced communication with Paly families. The goal of these efforts is to send a simple message to the entire Paly community: \"We're here for you,\" Principal Kim Diorio said.\r\n\r\nPerhaps the most innovative support tool made available to students is a new email communication service, which Diorio introduced in a letter sent out to the entire Paly community Monday night. Students can use <a href=\"mailto:palysupport@pausd.org\">palysupport@pausd.org<\/a> to refer friends that they think are in need of professional assistance, or to write out their own thoughts and feelings and receive support.\r\n\r\n\"We need our students to tell us when they're concerned about a friend,\" Diorio said. \"When students are able to talk to us or tell us that they're worried about somebody, we can help.\"\r\n\r\nDiorio also emphasized the importance of communication among community members, including parents and students, and encouraged students to seek help from adults and friends when necessary.\r\n\r\n\"Like most families, we unconditionally love each other,\" Diorio wrote in the letter. \"What unites us and makes us a family is our unconditional love of our students.\"\r\n\r\nThe school's immediate response to the events on Monday morning included a crisis response team, which consisted of Paly guidance counselors and counselors from external agencies such as <a href=\"www.kara-grief.org\" target=\"_blank\">Kara<\/a> and <a href=\"www.acs-teens.org\/\" target=\"_blank\">Adolescent Counseling Services<\/a>. These specialists met with over 200 students over the course of the two days following the event.\r\n\r\n\"Those extra providers are also able to talk to students that just come up to the guidance office or are referred through teachers and other students,\" Diorio said.\r\n\r\n[caption id=\"attachment_101071\" align=\"alignleft\" width=\"377\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11063240_10153091859537332_1013323371_n.jpg\"><img class=\" wp-image-101071\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11063240_10153091859537332_1013323371_n.jpg\" alt=\"Several Palo Alto High School faculty members brought &quot;Therapy Dogs&quot; to campus on Tuesday, to help brighten students' spirits following the death by suicide of a Paly student on Monday. Photo by Emma Chiu.\" width=\"377\" height=\"283\" \/><\/a> Several Palo Alto High School faculty members brought \"therapy dogs\" to campus on Tuesday to help brighten students' spirits following the death by suicide of a Paly student on Monday. Photo by Emma Chiu.[\/caption]\r\n\r\nSeveral students are also making an efforts to reach out to their fellow peers and offer support. The Unity Club hosted a \"safe zone\" during Lunch earlier today. Diorio attended the event, along with several other Paly faculty members.\r\n\r\n\"We want to give students a space to talk about what's going because we know suicide is a conversation that is very hard to start,\" junior Unity Club vice president Siggi Bengston said. \"The main message we want to get across to Paly is we need change. There have been too many young lives lost in just this past school year, and it's time for something different.\"\r\n\r\nIn addition to addressing student welfare, Diorio also noted that the administration is making a great effort to reach out and provide support to teachers. Eight substitute teachers were available on Monday and Tuesday to step into class to allow teachers to take a break. A school psychologist assisted the classes in which the deceased student was enrolled, according to Diorio.\r\n\r\n\"We've been keeping our pulse on how the teachers are doing and coping, and making sure they have the support and counseling that they might need,\" Diorio said.\r\n\r\nSeveral Paly parents were also invited to campus this week to engage in conversation with students and remind them of the counseling resources available.\r\n\r\n\"We have parents on campus ... helping suggest that students go talk to adults up in the guidance area or counselors if they need that support,\" Diorio said.\r\n\r\nDiorio hopes to further engage parents in the conversation and plans to host parent events in the future. Among these events include an open house Coffee with Paly administrators earlier this morning, hosted by the Parent Teacher Student Association, where parents were encouraged to come talk in an informal environment.\r\n\r\n\"We know that they [parents] are concerned, want to help out and want to talk,\" Diorio said.\r\n\r\nDiorio reiterated the main message that the community is here to support everyone.\r\n\r\n\"If you need support or help, please talk with any of your teachers, your teacher adviser or any staff member you see wandering about,\" Diorio wrote. \"We're here for you.\"\r\n\r\n&nbsp;\r\n\r\n<em>A list of school and community resources are available on the <a href=\"http:\/\/paly.net\/crisis-resources\" target=\"_blank\">Paly website Crisis Resources page<\/a> and the <a href=\"http:\/\/pausd.org\/parents\/services\/counseling\/\" target=\"_blank\">PAUSD Counseling Services page<\/a>. If you need immediate assistance, the Santa Clara County Suicide and Crisis Hotline is available at 1-855-278-4204 at any time. These numbers are also available on the back of student ID cards. The new <a href=\"mailto:palysupport@pausd.org\">palysupport@pausd.org<\/a> email is accessible to all students if you are concerned about a friend or wish to receive support. If you feel you or someone you know needs immediate support, please call 911.<\/em>","excerpt":"The Palo Alto High School administration and community are providing various support systems following the recent death of a Paly student in order to send a simple message to the entire Paly community: \"We're here for you.\"","date":"2015-03-12 14:58:24","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11063240_10153091859537332_1013323371_n.jpg","categories":["News","Spotlight"],"tags":{"22666":"admin","8458":"administration","40509":"Bengston","28772":"club","8611":"Community","40506":"crisis","8644":"diorio","8694":"family","40505":"help","40507":"hotline","9954":"jerry berkson","8834":"Kim Diorio","8939":"palo alto","8944":"palo alto high school","8953":"paly","40510":"palysupport","23939":"reaction","40508":"Siggi","37653":"student death","9135":"suicide","37654":"support","40512":"systems","40511":"sytem","31762":"unity"}},{"id":100997,"title":"Girls&#8217; basketball ousted in CIF first round; motivated for next season","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/girls-basketball-ousted-in-cif-first-round-motivated-for-next-season\/","content":"The Palo Alto High School girls' basketball team (22-5, 12-0) had its magical season cut short in the first round of the CIF State Girls Basketball Championships on Wednesday night after it suffered a heartbreaking 55-45 loss at home against Oakland High School (23-6, 8-1).\r\n\r\n[caption id=\"attachment_101059\" align=\"aligncenter\" width=\"593\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-12-at-1.35.43-PM.png\"><img class=\"wp-image-101059 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-12-at-1.35.43-PM.png\" alt=\"Vikings head coach Scott Peters challenges his players during a game against Gunn High School on Feb. 7. The girls' team is expected to have all of its players return next season. Photo by Dhara Yu.  Vikings head coach Scott Peters challenges his players during a game against Gunn High School on Feb. 7. The girls' team is expected to have all of its players return next season. Photo by Dhara Yu.\" width=\"593\" height=\"456\" \/><\/a> Vikings head coach Scott Peters challenges his players during a game against Gunn High School on Feb. 7. The girls' team is expected to have all of its players return next season. Photo by Dhara Yu.[\/caption]\r\n\r\nRanked as one of two No. 4 seeds in a field of 30 teams, the Vikings entered the field as favorites against the No. 13 seed Wildcats, who were captained by senior forward Keyanna Bendy, the team's leading scorer.\r\n\r\nDespite winning 22 of its first 24 games on the season, the Vikings lost three straight to conclude their season: during Open Division of the CCS Playoffs against St. Igantius and Scotts Valley, and Wednesday versus Oakland.\r\n\r\nThe Wildcats outscored the Vikings, 22-13, in the fourth quarter after the Vikings rallied in the third to cut the Wildcats' lead down to one, ending the Vikings season after just one CIF game. Oakland will move on and host No. 5 seed Pittsburg at 6 p.m. this Saturday, March 14.\r\n\r\nWhile the early exit is frustrating, sophomore forward Skylar Burris says that the team will come back next year motivated and stronger compared to this year.\r\n\r\n\"Although we didn't go for as long as wanted to in CIF, it's hard to be disappointed with all the accomplishments we acheived,\" Burris said. \"Our team is so close and there really is no offseason [for us]; we're always together and always working to improve our basketball skills.\"\r\n\r\nWith no seniors on the team this year, the Vikings are expected to return next year with all of their current players. Junior guard Maddy Atwater says that the girls are staying positive and are proud about how far they got.\r\n\r\n\"Obviously we are disappointed we lost and our season was cut short, \" Atwater said. \"We know we could have beat [Oakland] but we are proud of how far we got and are staying very positive about it all.\"\r\n\r\nAccording to Atwater, the team is starting its offseason off by beginning a weight lifting program next week. Burris says that building off of a perfect De Anza League season will result in a dominant team next year.\r\n\r\n\"We're ready to kick some major butt next season,\" Burris said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' basketball team (22-5, 12-0) had its magical season cut short in the first round of the CIF State Girls Basketball Championships Presented by Farmers on Wednesday night after it suffered a heartbreaking 55-45 loss at home against Oakland High School (23-6, 8-1). ","date":"2015-03-12 13:39:45","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_15085b15d.jpg","categories":["Sports"],"tags":{"40638":"first round loss","8735":"girls basketball"}},{"id":99921,"title":"Students pilot study-abroad program","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/students-pilot-study-abroad-program\/","content":"[caption id=\"attachment_101003\" align=\"alignnone\" width=\"591\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/unnamed.jpg\"><img class=\" wp-image-101003\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/unnamed.jpg\" alt=\"Global Glimpse participants congregate to discuss preparations for their trip. Photo courtesy of Steve Foug.\" width=\"591\" height=\"443\" \/><\/a> Global Glimpse participants congregate to discuss preparations for their trip. Photo courtesy of Steve Foug.[\/caption]\r\n\r\nThis summer, 20 Palo Alto High School juniors will have the opportunity to immerse themselves in the culture of a foreign country by participating in the school's chapter of <a href=\"https:\/\/www.globalglimpse.org\">Global Glimpse<\/a>, a newly piloted, leadership-oriented program.\r\n\r\nAccording to Paly's Global Glimpse coordinator, social studies teacher Steve Foug, the program, which is in its first year at Paly, is targeted toward students of diverse backgrounds and strives to give participants a way to learn about other regions of the world while helping them develop management and communication skills. Participants will experience life in a rural community in a Latin American country over a three-week period in the summer and will engage in a variety of community service activities.\r\n\r\n\"Students will travel to a small city in Nicaragua, the Dominican Republic or Ecuador and will stay in a hostel for two to three weeks,\" Foug said. \"They'll teach English to the locals in the evenings for free and work on a community action project.\"\r\n\r\nOne of the goals of the program is to expose students to the realities of life in other parts of the world.\r\n\r\n\"They'll spend a day with the [local] families and see what it's like to live on a dollar a day,\" Foug said.\r\n\r\n[caption id=\"attachment_100776\" align=\"alignright\" width=\"397\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11051015_803181706441324_1325225690_n.jpg\"><img class=\"wp-image-100776\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11051015_803181706441324_1325225690_n.jpg\" alt=\"From left: Juniors Rebecca Sunnerås Jonsson, Claire Krugler and Eli Craveiro Frankel, all participants in the Global Glimpse program, set up a bake sale in downtown Palo Alto. Global Glimpse attendees are expected to fundraise in preparation for their trips to Latin American countries. Photo courtesy of Minyoung Kim.\" width=\"397\" height=\"223\" \/><\/a> Juniors Rebecca Sunnerås Jonsson, Claire Krugler and Eli Craveiro Frankel set up a bake sale in downtown Palo Alto as a part of the Global Glimpse program. Global Glimpse attendees are expected to fundraise in preparation for their trips to Latin American countries. Photo courtesy of Minyoung Kim.[\/caption]\r\n\r\nFoug says the program is an excellent opportunity for students to improve collaboration skills, as participants will have to work with students from different schools while abroad.\r\n\r\n\"It'll be a mix of students from all over the Bay Area,\" Foug said.\r\n\r\nIn the beginning of the school year, teachers nominated around 90 students to take part in the program. Those interested in attending submitted an application and were then accepted into the program by the Global Glimpse team.\r\n\r\n\"I asked social studies teachers to nominate students that they thought would be interested in this program or would do well,\" Foug said. \"This is targeted toward people that are interested in the leadership aspect, fundraising or a service-oriented career.\"\r\n\r\nParticipants are required to attend workshops throughout the year to prepare for their trips.\r\n\r\n\"We have a series of workshops and learn about things like culture, globalization, Latin American history, aid and development so that these students will be well equipped wherever they go,\" Foug said.\r\n\r\nFoug believes that the program is appealing because it offers students a wide range of activities and facilitates the development of valuable personal qualities.\r\n\r\n\"It's a program that has so many facets to it and will hopefully give students skills that will be applicable for all types of careers down the road,\" Foug said.\r\n\r\nAnother major drawing point for Global Glimpse is that attendees are not required to speak any Spanish, so even those who have no knowledge of Spanish whatsoever still have an opportunity to travel to Latin America.\r\n\r\n\"I don't speak a lick of Spanish, and neither do some of the Paly students that will be going,\" Foug said.\r\n\r\nJunior Aiva Petriceks, who will be attending the Global Glimpse program in Matagalpa, Nicaragua, said that she is most excited to interact with others and form friendships that will continue even after the trip has ended.\r\n\r\n\"I'm really looking forward to meeting the people there and making lasting connections,\" Petriceks said.\r\n\r\nFoug also emphasized that the objective is not simply to do a transient community project, but rather to implement meaningful change in communities and have attendees develop important interpersonal skills.\r\n\r\n\"It's not just, 'Let's go down to a third-world country and help and feel good about ourselves,'\" Foug said. \"It's more focused on what we can learn – what we can take away from it ourselves.\"","excerpt":"This summer, 20 Palo Alto High School juniors will have the opportunity to immerse themselves in the culture of a foreign country by participating in the school's chapter of Global Glimpse, a newly piloted, leadership-oriented program.","date":"2015-03-12 13:26:35","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11051015_803181706441324_1325225690_n.jpg","categories":["Features","Spotlight"],"tags":{"30886":"aiva petriceks","40202":"global glimpse","40203":"immersive","38458":"latin america","8944":"palo alto high school","8953":"paly","23598":"steve foug","9137":"summer","9184":"travel","40204":"trip"}},{"id":100948,"title":"Buena Vista supporters rally at City Hall","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/buena-vista-supporters-rally-at-city-hall\/","content":"[caption id=\"attachment_100911\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0092.jpg\"><img class=\"wp-image-100911\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0092.jpg\" alt=\"A woman and boy hold signs alongside about 50 others to protest the closure of Buena Vista Mobile Homes in front of Palo Alto City Hall. Photo by Amy Leung.\" width=\"620\" height=\"413\" \/><\/a> A woman and her son, residents of Buena Vista Mobile Home Park, hold a sign Monday afternoon in front of Palo Alto City Hall protesting the closure of the park. About 50 people held signs among the crowd of 250. Photo by Amy Leung.[\/caption]\r\n\r\nBuena Vista Mobile Home Park residents and supporters looking to prevent the closure of the community congregated Monday at Palo Alto City Hall to garner more assistance.\r\n\r\nRoughly 50 attendees who faced Hamilton Street held signs that urged for the saving of the park, while another roughly 200 joined them to display their support through the strength of numbers. Many bore bright yellow stickers which read, \"Keep B.V. Residents in P.A.\" to indicate their involvement in the cause.\r\n\r\nAccording to longtime Buena Vista resident Melodie Dawn Cheney, Santa Clara County Supervisor Joe Simitian is leading the effort of raising between $30 million and $40 million through charitable support from the county, city and foundations. According to Palo Alto Online, Simitian proposed <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/01\/20\/county-supervisors-offer-aid-in-preserving-buena-vista\" target=\"_blank\">using $8 million set aside by a Stanford University fund<\/a> to produce and maintain affordable housing within a six-mile radius of the university to help secure the homes of the current Buena Vista residents.\r\n\r\n\"We're trying to find a way for us to buy the park so we can own it, or even another non-profit can own it,” Cheney said. “We’re just trying to see who else we can get on board.”\r\n\r\n[caption id=\"attachment_100910\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0122.jpg\"><img class=\"wp-image-100910\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0122.jpg\" alt=\"Santa Clara County Supervisor Joe Simitian, a large advocate to save Buena Vista Mobile Homes Park, thanks the attendees of the rally for showing their support before entering Palo Alto City Hall to listen to speakers. Photo by Amy Leung.\" width=\"620\" height=\"413\" \/><\/a> Santa Clara County Supervisor Joe Simitian, a significant advocate for Buena Vista Mobile Home Park residents, thanks attendees of the rally for showing their support. Afterward, the attendees moved inside Palo Alto City Hall to listen to speakers talk about saving the park. \"Hopefully by the sheer force of numbers, [we can] communicate that there are residents of every neighborhood in this community and beyond who share those two goals: prevent the eviction of 400 Palo Alto residents [and] save the site for affordable housing and inperpetuity,\" Simitian said to the crowd. Photo by Amy Leung.[\/caption]About two-and-a-half years ago, the owner of Buena Vista wanted to sell the property, but the buyers ended up backing out, according to Cheney. Now, the park hangs in a state of limbo as residents and supporters work to preserve the affordable housing units.\r\n\r\nJennifer Munoz-Theo, an eighth grader at Terman Middle School and a Buena Vista resident, described how the closure of the mobile home park would impact her.\r\n\r\n“I’ve made all my friends here, all my memories here, and it’s just going to tear my friendships apart,” Munoz-Theo said. “It’s going to hurt me a lot and affect us all.”\r\n\r\nWhen commenting on the significance the mobile home park and its residents play in her life, Cheney began tearing up.\r\n\r\n“It [the park] is my second family,” she said.","excerpt":"Buena Vista Mobile Home Park residents and supporters looking to prevent the closure of the community congregated Monday at Palo Alto City Hall to garner more assistance.","date":"2015-03-12 13:16:02","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0092.jpg","categories":["News"],"tags":{"40606":"buena vista mobile home park","40608":"closure","40609":"jennifer munoz-theo","12351":"joe simitian","40610":"melodie dawn cheney","8939":"palo alto","40607":"palo alto city hall","9852":"rally","37654":"support"}}]