[{"id":98749,"title":"Slideshow: President Obama arrives in San Francisco","permalink":"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-president-obama-arrives-in-san-francisco\/","content":"President Obama is currently on a three-day trip to the Bay Area, after arriving at the San Francisco International Airport on Air Force One yesterday. Obama is scheduled to speak at the White House Summit on Cybersecurity and Consumer Protection at Stanford University today from 11:15 a.m. - 11:45 a.m., <a title=\"Summit on Cybersecurity and Consumer Protection\" href=\"http:\/\/www.whitehouse.gov\/issues\/foreign-policy\/cybersecurity\/summit\" target=\"_blank\">according to The White House<\/a>.\r\n\r\nThe Paly Voice has a <a title=\"Liveblog: Summit on cybersecurity and consumer protection\" href=\"http:\/\/palyvoice.com\/2015\/02\/13\/liveblog-summit-on-cybersecurity-and-consumer-protection\/\" target=\"_blank\">liveblog of the summit<\/a>, which is also <a title=\"White House Summit on Cybersecurity and Consumer Protection\" href=\"https:\/\/www.youtube.com\/watch?v=KlTo9hFAFXs#t=11363\" target=\"_blank\">being livestreamed by The White House<\/a> on YouTube. After speaking at a Democratic National Committee fundraiser in San Francisco tomorrow evening, the president is scheduled to depart SFO at 10:10 a.m. this Saturday to fly to Southern California.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AEGAcTMn_HzF\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"President Obama is currently on a three-day trip to the Bay Area, after arriving at the San Francisco International Airport on Air Force One yesterday.","date":"2015-02-13 14:06:28","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Optimized-IMG_1803.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"38870":"air force one","38867":"barack obama","11240":"emma chiu","38868":"obama","38869":"president obama","38871":"presidential motorcade","9061":"San Francisco","38872":"sfo"}},{"id":98721,"title":"Liveblog: Summit on cybersecurity and consumer protection","permalink":"http:\/\/palyvoice.com\/2015\/02\/13\/liveblog-summit-on-cybersecurity-and-consumer-protection\/","content":"President Barack Obama visits Stanford University for a White House summit meeting, which brings together<span class=\"s1\"> <\/span><span class=\"s2\">leaders from across the country who are concerned with cybersecurity and consumer protection. <\/span>Tune in for live coverage of the morning summit session.\r\n\r\n[liveblog]","excerpt":"President Barack Obama visits Stanford University for a White House summit meeting, which brings together leaders from across the country who are concerned with cybersecurity and consumer protection. Tune in for live coverage of the summit meeting.","date":"2015-02-13 09:47:47","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_3610.jpg","categories":["News"],"tags":{"38883":"consumer protection","38882":"cyber security","38880":"cyber summit","38879":"cybersummit","38884":"internet safety","8855":"liveblog","38868":"obama","38869":"president obama","38885":"stanford university","38881":"white house summit"}},{"id":98548,"title":"Column: Valentine’s, Shmalentine’s – it’s all about Pal- and Galentine’s Day","permalink":"http:\/\/palyvoice.com\/2015\/02\/12\/column-valentines-shmalentines-its-all-about-pal-and-galentines-day\/","content":"Girls hold up big white posters adorned with hearts and the word “SADIES?” Students all over campus chatter and stress about how to best illustrate their love by means of $5 gifts. Bottles of artificially colored pink soda are delivered in the middle of classes to uncomfortable recipients. Red and pink streamers that were likely purchased for less than a dollar decorate the doors of the more spirited teachers on campus. Yes, the coming of Valentine's Day has become almost palpable as the aura of synthetically manufactured love taints the air.\r\n\r\nAs you can tell, like most Palo Alto High School students, we are wholeheartedly enlivened by the fast-approaching date of Feb. 14. Don't get us wrong, we appreciate and have even participated in the school's efforts to brighten up the campus, but we would like to pause for a moment and invite our fellow classmates to partake in an arguably worthier tradition that takes place the day before Valentine's Day: (modified) Galentine's Day.\r\n\r\n[caption id=\"attachment_98708\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-12-at-10.25.43-PM.png\"><img class=\"wp-image-98708\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-12-at-10.25.43-PM.png\" alt=\"Leslie Knope (Amy Poehler) provides her lady friends and family with a number of sentimental gifts over a Galentine’s Day brunch. Photo courtesy of NBC. \" width=\"350\" height=\"197\" \/><\/a> Leslie Knope (Amy Poehler) provides her lady friends and family with a number of sentimental gifts over a Galentine’s Day brunch. Photo courtesy of NBC.[\/caption]\r\n\r\nFor those of you who are unfamiliar with the term, Galentine's Day, as coined by \"Parks and Recreation\" character Leslie Knope (Amy Poehler), is a special day dedicated to the appreciation of female friends, coworkers, family members and strong female influences in women’s lives. Stories and gifts are shared over a hearty brunch meal, and as Knope would say, it's all about \"ladies celebrating ladies.\"\r\n\r\nAs wonderful as Galentine's Day is – and believe us, it is wonderful – we'd like to broaden its sentiment and apply it to the general realm of friendship, regardless of gender: something we'd like to call Pal-entine's Day.\r\n\r\nWith the long weekend upon us, it's an especially ideal time to take your friends out to a glorious brunch excursion and shower them with gifts and appreciation. If you have sufficient time, dedication and knowledge, then you can try pulling a Knope and provide your friends with bouquets of hand-crocheted flower pens; mosaic portraits of each of them made from the crushed bottles of their favorite diet sodas; gift certificates for facials; needlepoint pillows with their faces and the leading headlines from the newspapers on the days they were born on them; and personalized 5,000 word essays of why they're all so awesome. If your gift giving skills aren’t quite up to par, though, never fear – any expression of your love and affection for your friends can be more important than material gifts.\r\n\r\nUltimately, we must remember that love is never exclusive to couples. There's no need to fall into a gloomy funk or secretly hate on those who are in relationships just because it's February. So, whenever February rolls around, instead of distressing and obsessing about your romantic relationship or lack thereof, choose to obsess about the gals and pals in your life who you care about most and who will never leave your side.\r\n\r\nAs Leslie Knope, the epitome of a workaholic, once said, \"We have to remember what's important in life: friends, waffles and work. Or waffles, friends, work. But work has to come third.\" While we agree that friends vs. waffles is an eternal debate, we encourage you to get a healthy dose of both by going out with your friends for some fantastic breakfast food and finding out for yourselves, as we plan to do.\r\n\r\nThe streamers and boxes of chocolates that you purchased for Valentine's Day will fade and likely pollute our planet, but the memories you make of waffles and laughter with your gals and pals will last forever.","excerpt":"Inspired by Galentine's Day from “Parks and Recreation,” News Editor Lizzie Chun and Staff Writer Saba Moussavian propose a Feb. 13 tradition to pause in the time of Valentine’s Day love with something they'd like to call \"Pal-entine's Day.\" ","date":"2015-02-12 22:51:15","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-12-at-10.25.43-PM.png","categories":["Opinion"],"tags":{"31764":"appreciation","38784":"breakfast","38783":"brunch","38785":"friends","38649":"friendship","38646":"galentine's day","38647":"galentines","38781":"leslie knope","8927":"opinion","38780":"palentine's day","38648":"parks and rec","34605":"parks and recreation","11509":"valentine's","11508":"valentine's day","38782":"waffles"}},{"id":98549,"title":"Liveblog: Girls&#8217; soccer vs. Homestead","permalink":"http:\/\/palyvoice.com\/2015\/02\/12\/liveblog-girls-soccer-vs-homestead\/","content":"Check back at 3:30 p.m. for live updates as the Palo Alto High School Girl's soccer team (14-1, 8-1) takes on Homestead (6-6-3, 2-4-3) at home.\n\n[liveblog]","excerpt":"Check back at 3:30 p.m. for live updates as the Palo Alto High School Girl's soccer team (14-1, 8-1) takes on Homestead (6-6-3, 2-4-3) at home.","date":"2015-02-12 15:26:11","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg","categories":["Sports","Uncategorized"],"tags":{"10198":"girls soccer","9087":"Senior Night","9110":"Soccer"}},{"id":97542,"title":"Paly juniors to compete in international math contest","permalink":"http:\/\/palyvoice.com\/2015\/02\/11\/paly-juniors-to-compete-in-international-math-contest\/","content":"[caption id=\"attachment_97747\" align=\"alignnone\" width=\"418\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/math_award_students2.jpg\"><img class=\"wp-image-97747 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/math_award_students2.jpg\" alt=\"math_award_students2\" width=\"418\" height=\"314\" \/><\/a> Juniors Andrew Lee, Kathryn Li, Allison Zhang and Eric Foster pose for a picture after placing at the National High School Mathematical Contest in Modeling. Math instructional supervisor Radu Toma describes the students as “highly intelligent and intellectually curious, [who] also have the stamina, determination and courage it takes to solve serious real life problems using sophisticated mathematical modeling.” Photo courtesy of Andrew Lee.[\/caption]Four Palo Alto High School juniors in Advanced Placement BC Calculus will be representing the United States at the International Math Modeling contest this April after their victory in the 17th Annual National High School Mathematical Contest in Modeling last month.\r\n\r\nThe juniors, Andrew Lee, Kathryn Li, Allison Zhang and Eric Foster, competed in two events and received an outstanding award for their for their 33 page-long solution to a passenger traffic optimization challenge, according to math instructional supervisor Radu Toma.\r\n\r\nThe National High School Mathematical Contest in Modeling is a contest that is held over a 36 hour period all across the nation. According to its <a href=\"http:\/\/www.comap.com\/about\/#b\" target=\"_blank\">website<\/a>, the contest's mission is to establish learning environments where mathematical tools are used to investigate, model and explore real issues in the world.\r\n\r\nHigh schools are given two problem sets, and the teams then set aside 36 hours within a two week period to work on them. Competitors have freedom setting up the parameters of the problem and the problems can therefore have many different correct answers.\r\n\r\nDespite the team’s strong teamwork, victory did not come easily.\r\n\r\n“I was very proud of our thorough research and our model,” Li said. “The question itself was very open-ended, so we needed to make a lot of assumptions. Our model took the longest to make, and it was extremely satisfying to see that the numbers it produced made sense.”\r\n\r\nLi looks forward to the international competition.\r\n\r\n“For the [international competition], our goals are just to try to find a novel way to use math to solve an everyday problem,” Li said. “We also want to learn about different types of mathematical modeling and use them to help us solve problems.”\r\n\r\nThe international contest will be at Paly in a math room yet to be determined, according to Lee, who added that competing teams will choose five consecutive days to compete between mid-April and mid-June.\r\n\r\nThe team has chosen to compete from April 19 to 23.\r\n\r\n“We will try our best and be happy with the outcome,” Zhang said. “It's already a great honor to be selected to represent the United States in the international competition.”","excerpt":"Four Palo Alto High School juniors in BC Calculus will be representing the United States at the International Math Modeling contest this April after their victory in the 17th Annual National High School Mathematical Contest in Modeling last month.","date":"2015-02-11 12:37:00","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/math_award_students2.jpg","categories":["News"],"tags":{"12848":"competition","8788":"International","8871":"math","38288":"math competition","38290":"math modeling contest","38289":"mathematics","8944":"palo alto high school","8953":"paly"}},{"id":97545,"title":"Valentine&#8217;s Day Gift Guide 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/11\/valentines-day-gift-guide-2015\/","content":"Valentine's Day is right around the corner, and you don't want to wait until the last minute to think of a gift for the one you love.\r\n\r\nIf you feel like flowers, chocolates and teddy bears are too mainstream and want to go for something a little more personalized, look no further! These gifts are sure to warm the hearts of every type of person.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/4418860-valentines-gifts\" width=\"600\" height=\"1813\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n1. Photo courtesy of Piktochart\r\n2. Screenshot by Emily Hwang\r\n3. Photo by Emily Hwang\r\n4. Photo by Emily Hwang\r\n5. Photo by Emily Hwang\r\n6. Photo courtesy of Piktochart\r\n7. Photo courtesy of Piktochart\r\n8. Photo by Emily Hwang","excerpt":"Still trying to find the perfect present for your Valentine? Staff writer Emily Hwang shares her suggestions in this Valentine's Day gift guide!","date":"2015-02-11 12:35:37","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-09-at-11.02.19-PM.png","categories":["Multimedia","Spotlight"],"tags":{"38613":"gift guide","8944":"palo alto high school","38612":"piktochart","30842":"suggestions","14866":"tips","11509":"valentine's","11508":"valentine's day"}},{"id":98396,"title":"Slideshow: Girls&#8217; and boys&#8217; basketball defeat Gunn","permalink":"http:\/\/palyvoice.com\/2015\/02\/10\/slideshow-girls-and-boys-basketball-defeat-gunn\/","content":"The Palo Alto High School boys’ and girls’ basketball teams faced off against the Gunn High School Titans at home on Saturday Jan. 7. Both teams managed to secure victories, the boys' team (17-4, 7-2) with a 71-54 win over the Titans (14-3, 5-1) and the girls' team (20-2, 10-0) with a 35-23 win over the Gunn girls' team (6-10, 3-6).\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AgPAeQsyLPYo\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School boys’ and girls’ basketball teams faced off against the Gunn High School Titans at home on Saturday Jan. 7. Both teams managed to secure  victories over the Titans. ","date":"2015-02-10 17:36:10","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_14503.jpg","categories":["Sports","Spotlight"],"tags":{"10098":"basketball","8537":"Boys","8751":"gunn","9107":"slideshow","9165":"titans"}},{"id":97018,"title":"Opinion: It starts with you","permalink":"http:\/\/palyvoice.com\/2015\/02\/10\/opinion-it-starts-with-you\/","content":"Tragedy. Anxiety. Stress. Pressure. Mental illness. These are all words that have surrounded the recent death of a Gunn High School senior.\r\n\r\nCounseling. Support. Community. Unity. These are the words that have been used to address how, as a society, we can hope to recover from this tragedy and prevent such an event from reoccurring.\r\n\r\nAs a community, we have struggled to find ways to offer consolation and show support for affected loved ones and community members during this time of grieving. The teachers, administration and school board of the district all showed efforts to reach out to students and remind them of the many available resources. However, there still remains conflict among many members of the community, particularly among high school students, about how to confront an issue as sensitive as suicide. Many student Facebook users have posted statuses to communicate to their friends and peers that they are available to offer support. Others argue that the support necessary to address mental health goes far beyond anything a change in a profile picture can offer. Some don red and black to show support for Gunn students, while others believe that such an act only serves to encourage \"copycat syndrome.\"\r\n\r\n[caption id=\"attachment_97988\" align=\"alignleft\" width=\"243\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10888512_10203570932609361_4204563316199167029_n.jpg\"><img class=\" wp-image-97988\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10888512_10203570932609361_4204563316199167029_n.jpg\" alt=\"The recent death of a Gunn  senior prompted a wave of changes in profile pictures, a tactic that many students used to demonstrate support for their peers. Photo courtesy of anonymous Facebook user.\" width=\"243\" height=\"224\" \/><\/a> The recent death of a Gunn senior prompted a wave of changes in profile pictures, a tactic that many students used to demonstrate support for their peers. Photo courtesy of anonymous Facebook user.[\/caption]\r\n\r\nThe teens of Palo Alto may never come to a consensus on how to show that we care about each other. The important thing, however, is to remember that we do. At the end of the day, high school, in the Silicon Valley in particular, is hard for pretty much everyone. It's hard for the jocks who labor under the stereotype of being jocks. It's hard for the closet poets who are too ashamed to reveal their gift of written word. It's hard for the people who are just trying to make it to graduation, when they can embrace the life that awaits outside the walls of high school.\r\n\r\nNo matter what school we go to, what grade we are in or what kind of student we are, we all experience the ups and downs of high school. As adolescents, we all have to endure feelings of awkwardness, unhappiness and mediocrity, whether it be in academics, after school activities, or sociability. Popular culture showed us that in order to be happy, we need to have it all – looks, brains, strength, the whole package.\r\n\r\nThe result: high school becomes a competition where we are pit against our peers, our classmates, and our friends. It doesn't matter how many parties we get invited to, because someone prettier than us or funnier than us gets invited to more. The person who outscores us on the math test ruined the curve and screwed up our GPA, and our futures are thus ruined. The kid who plays six instruments and captains the soccer team is our enemy, because her accomplishments undermine everything we think we should be proud of about ourselves. In this system, we are forced to stay afloat by drowning the people we should be turning to for support.\r\n\r\nWe are all subjects of a strenuous system, and for that reason, we should serve as a support system for one another. It's time we show compassion for our classmates that we never talk to because they are too weird, or too popular, or simply too different. It's time for us to stop resenting the people who are smarter than us, or more athletic, or more musical or more talented in every way. It's time to forge bonds with the people high school turned against us. It's time to create a sense of unity in which all students feel accepted and appreciated by their peers. It's time for us to mean it when we say \"We Are All In This Together.\"\r\n\r\nThe student who outscored you on the test is not your arch-nemesis, but instead a fellow victim of intense pressures created by a society that prides itself in producing top-ranking students. The girl who seems confident all the time is also struggling with self-esteem issues created by the enigmatic hierarchy of high school popularity. The shy kid on the quad sits alone during lunch because nobody talks to him, and nobody talks to him because he is always alone.\r\n\r\nSometimes, the difficulties faced by high schoolers is caused by mental illness, a challenge beyond our reach, yet a challenge we must address. The only way to properly deal with mental health is through professional help, but as fellow peers we play a role in offering emotional comfort and mutual support.\r\n\r\nHigh school hands each individual their own unique experience, but if we make solidarity, acceptance, and friendship the norms for our peer to peer relationships, we will ultimately have a hand in making each experience a positive one. Students should perceive each other as allies during the phase of our lives that challenges us all. It is our obligation to each other as fellow students to remember that the people we see as our competition are experiencing the same anxieties and stresses that we do, and the energy we spend begrudging each other would be better spent befriending each other.\r\n\r\nI have grown up in Palo Alto for nearly my whole life, and I love this beautiful city that I call my home. This is the place where people dream of coming to make a better life. This is the birthplace of innovation, and the heart of opportunity and free-thinking. We have so much to be proud of, yet so much potential to be better. I want Palo Alto to go down in history for its strengths, not the crippling consequences of the actions that we take to become strong.\r\n\r\nThis is a direct message to my fellow Palo Alto teenagers: I am optimistic that each of us has the power to help make high school a happier place for everybody. I believe that if we change our attitudes about our classmates, we can serve as one another's greatest resource in helping to make it through the awkward, challenging and demanding stage that is high school. In order for such a change to occur, we must create a camaraderie among ourselves and remember that the people we encounter on a daily basis are our equals, not our enemies. With the choices we make about how we treat our peers, we can all help make high school a little less hard.\r\n\r\n&nbsp;","excerpt":"Staff writer Hannah Nguyen addresses how, as students, we can help make high school a more positive experience.","date":"2015-02-10 17:26:04","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10888512_10203570932609361_4204563316199167029_n.jpg","categories":["Editor's Pick","Opinion"],"tags":{"8611":"Community","37655":"mental health","9135":"suicide","37654":"support","31762":"unity"}},{"id":98500,"title":"Choir to perform soul-themed Pops Concert","permalink":"http:\/\/palyvoice.com\/2015\/02\/09\/choir-to-perform-soul-themed-pops-concert\/","content":"[caption id=\"attachment_98504\" align=\"alignnone\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/14138647541_ddd91b8a4a_z1.jpg\"><img class=\"size-full wp-image-98504\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/14138647541_ddd91b8a4a_z1.jpg\" alt=\"Paly Choirs bows at the Pops Concert 2014. This years Pops Concert theme is &quot;Soul Searching&quot; and involves songs from various soul artists. Photo courtesy of Paly Choirs. \" width=\"640\" height=\"273\" \/><\/a> Paly Choirs bows at the Pops Concert 2014. This year's Pops Concert theme is \"Soul Searching\" and involves songs from various soul artists. Photo courtesy of Paly Choirs.[\/caption]\r\n\r\nThe Palo Alto High School Choir program will perform its annual Pops Concert at 7:30 p.m. tomorrow and Wednesday at the Haymarket Theatre. Unlike most choir concerts, Paly choirs will be performing contemporary songs as opposed to their typical classical pieces.\r\n\r\nThe theme for the concert is \"Soul Searching\" and the concert will feature music from artists such as Prince and Aretha Franklin.\r\n\r\n\"We're singing a lot of great hits that will truly move your soul,\" Paly choir junior Abira Berezin said. \"[The concert] is really unique because it includes a lot of solos, duets and small ensemble songs.\"\r\n\r\nChoir President senior Jamie Garcia also admires the concert's theme.\r\n\r\n\"I'm really excited for the Pops concert this year because soul is enjoyable for both young viewers and parents and adults,\" Garcia said.\r\n\r\nGarcia is also enthusiastic about the various range of performances and encourages Paly students to attend.\r\n\r\n\"I am excited to hear all of the soloists and to sing 'I Wanna Be Your Lover' by Prince with the Madrigal group,\" Garcia said. \"Everyone should come to this concert because the music is really fun, and we have all worked really hard.\"","excerpt":"The Palo Alto High School Choir program will perform its annual Pops Concert at 7:30 p.m. tomorrow and on Wednesday at the Haymarket Theatre. Unlike most choir concerts, Paly choirs will be performing contemporary songs as opposed to classical pieces.","date":"2015-02-09 21:37:15","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/14138647541_ddd91b8a4a_z.jpg","categories":["Entertainment"],"tags":{"8583":"choir","38611":"jamie garcia","8944":"palo alto high school","11370":"pops concert","38610":"singing","38609":"soul"}},{"id":97481,"title":"What the heck-a is DECA?","permalink":"http:\/\/palyvoice.com\/2015\/02\/09\/what-the-heck-a-is-deca\/","content":"[caption id=\"attachment_97851\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965188_839116899457646_1870902858_o.jpg\"><img class=\"wp-image-97851\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965188_839116899457646_1870902858_o.jpg\" alt=\"Paly DECA members pose for a picture at the Silicon Valley DECA regional competition. Photo by Alice Zhao \" width=\"620\" height=\"412\" \/><\/a> Paly DECA members pose for a picture at the Silicon Valley DECA regional competition. Photo by Alice Zhao.[\/caption]\r\n\r\nThis year, a new club has risen to prominence at Palo Alto High School: DECA.\r\n\r\nIn just a few short months of its existence, the Paly chapter has grown to include over 50 people and has had members place in a prestigious competition. But despite the club’s success as well as its prominent social media presence, quite a few Paly students are unaware of what the club is actually about. Paly DECA co-presidents junior Stephanie Cong and junior Karina Chan help explain the organization’s objectives.\r\n\r\n“DECA is just a club that enhances learning of any business-related topics through competitive conferences,” Cong said.\r\n\r\nDECA, which formerly stood for Distributive Education Clubs of America but is no longer used as an acronym for anything, is a club intended to increase high school students' knowledge of the professional world. Chapters participate in contests at the regional, state and international levels in which students compete in various business-related events. Most of the events involve students showcasing their knowledge of a specific field of business, usually by making a sales pitch to a series of judges.\r\n\r\n“Each person has a different event,\" Chan said. \"There are over 50 events offered, so there’s a lot of detail that goes into it, which is why it’s so hard to explain to people.\"\r\n\r\nSo far, Paly DECA has attended the Leadership and Competitive Excellence Conference, an introductory event that offers workshops for DECA members to learn about the events offered and to improve their skills, and the Silicon Valley district conference.\r\n\r\n“We were pretty successful [in the Silicon Valley conference],\" Chan said \"A third of all members who attended placed in their contests.\"\r\n\r\nLast year’s DECA was practically nonexistent, and Chan said she was inspired to revitalize the club at Paly after seeing the success of DECA programs at other local high schools.\r\n\r\n“Other schools [Gunn, Lynbrook, Monta Vista and Mission San Jose] have big DECA clubs – all 200 to 400 people – and definitely there’s no club like that at Paly,” Chan said. “I wanted to start DECA to help give people that kind of experience.”\r\n\r\nBoth presidents attribute DECA’s popularity at Paly to the idea that the club gives people the opportunity to learn valuable skills and gain real-world business experience.\r\n\r\n“A lot of people can see themselves going into the field [hospitality, finance, entrepreneurship, management, marketing] that they are currently studying for DECA,” Cong said. “As well as that, it [DECA] gives people an opportunity to network with other high school students.”\r\n\r\nTo promote their club, members have taken to social media; on two separate occasions, members have changed their profile pictures on Facebook to DECA-themed images. Cong and Chan both say DECA’s social media approach is an effective way to advertise the club and attract potential members.\r\n\r\n“We know that if people don’t even know what DECA is when we talk to them, we have to have the same conversation over and over,\" Cong said. \"Having a large social media presence gets our name out there initially.”\r\n\r\nChan asserts that having a dynamic social media presence isn’t the main focus of Paly DECA.\r\n\r\n“The value of our club is not our social media presence – it’s what skills we can offer to students,” Chan said. “It’s not about the profile pictures.\"","excerpt":"This year, a new club has risen to prominence at Palo Alto High School: DECA. Despite the club’s success, quite a few Paly students are unaware of what the club is actually about. The Paly Voice gets the scoop.","date":"2015-02-09 19:20:35","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965188_839116899457646_1870902858_o.jpg","categories":["Features","Spotlight"],"tags":{"38437":"business","28772":"club","11337":"clubs","38427":"DECA","38436":"karina chan","8944":"palo alto high school","38438":"stephanie cong"}}]