[{"id":97009,"title":"Liveblog: Boys&#8217; and Girls&#8217; basketball vs. Wilcox","permalink":"http:\/\/palyvoice.com\/2015\/01\/30\/liveblog-boys-and-girls-basketball-vs-wilcox\/","content":"<em> Check back this evening for live coverage of the second Quad Night of the season, as the Palo Alto High School boys' and girls' teams take on the Wilcox High School Chargers. The boys' (13-4, 4-2) will look to snap a two-game losing skid at 6:15 p.m. against a Chargers team (6-10, 0-6) seeking its first league win of the year. The girls' (16-2, 6-0) game will follow looking to follow up last week's 53-40 victory over Mountain View (14-4, 5-1) with another strong performance against the Wilcox girls' team (3-13, 0-6). <\/em>\r\n\r\n[liveblog]\r\n\r\n&nbsp;","excerpt":"Check back this evening for live coverage of the second Quad Night of the season, as the Palo Alto High School boys' and girls' teams take on the Wilcox High School Chargers. ","date":"2015-01-30 15:33:29","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0626.jpg","categories":["Sports"],"tags":{"8538":"boys basketball","8735":"girls basketball","37739":"quad night #2","9658":"wilcox"}},{"id":97186,"title":"Administration making structural changes for better student environment","permalink":"http:\/\/palyvoice.com\/2015\/01\/30\/administration-making-structural-changes-for-better-student-environment\/","content":"In a<a href=\"http:\/\/paly.net\/sites\/default\/files\/kd_letter_to_students_2015-01-30.pdf\" target=\"_blank\"> letter addressed to students<\/a>,* Palo Alto High School Principal Kim Diorio and the Associated Student Body described ways to reduce academic stress and expressed support for the Paly community.\r\n\r\nIn the letter, Diorio explains that she and ASB brainstormed ways to apply ideas that had come up in recent <a href=\"[http:\/\/palyvoice.com\/2014\/09\/21\/what-is-wasc\/\">Western Association of Schools and Colleges<\/a> discussions at Paly. Many of these efforts will be put into effect this school year, such as having a homework-free February break with no tests allowed on the following Tuesday and Wednesday; allowing flexibility when it comes to test and assignment scheduling due to the impact of the recent Henry M. Gunn High School student death by suicide; and proposing a number of minimum days for students, providing the staff with time to discuss homework policies and mindfulness training.\r\n\r\n[caption id=\"attachment_97201\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0472.jpg\"><img class=\"wp-image-97201\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0472.jpg\" alt=\"Paly Principal Kim Diorio stands outside of the Tower Building. Diorio is wearing red and black today in support of Gunn High School. Diorio and ASB worked to create a list of ways to reduce academic stress and improve the school climate. Photo by George Lu.\" width=\"350\" height=\"223\" \/><\/a> Paly Principal Kim Diorio stands outside of the Tower Building. Diorio is wearing red and black today in support of Gunn High School. Diorio and ASB worked to create a list of ways to reduce academic stress and improve the school climate. Photo by George Lu.[\/caption]\r\n\r\nAfter the recent tragedy, Diorio felt that now was especially the time to begin implementing these ideas instead of keeping them on the back burner.\r\n\r\n“We started having these conversations a year and a half ago, and we want people to understand this is not a knee jerk reaction,” Diorio said. “We want to take action. We know this is an issue on our campus.”\r\n\r\nDiorio understands that while these changes cannot solve the problem of mental health issues, she hopes that this will help alleviate unnecessary stress.\r\n\r\n“Recognizing that suicide is an extremely complex mental health issue, we [the administration] acknowledge that academic ‘stress is a problem, but not <i>the <\/i>problem,’ as one Gunn student described for our community,” Diorio said in the letter. “However, we do have the power to take small steps to reduce stress and create opportunities for students to take a well-deserved break from the daily grind.”\r\n\r\nOther possible structural modifications described in the letter will begin to be executed during the 2015-16 school year. These suggestions include working with the Education Council to create homework-free nights or weekends; preventing students from having more than two tests a day or allowing more freedom to reschedule tests; and having no major tests or projects due on seven-period C days.\r\n\r\nDiorio wanted to revise the C day schedule, particularly in response to recent feedback from parents, students and staff. Over 80 percent of parents and students stated their dislike of C days in the survey, but some teachers appreciate some aspects of having all seven periods in one day.\r\n\r\n“Some teachers really like to have contact with students three days a week, so we decided we can keep C days but [to] change them,” Diorio said. “It’s ridiculous to spend all day Saturday and Sunday prepping for a C day. [With the new plan], there just wouldn’t be heavy work for a C day – it’d be more of a review day. We can also make a C day a minimum day, and then the teachers can stay and talk about homework.”\r\n\r\nStudents look forward to a changed C day schedule.\r\n\r\n\"[Changing] C days would be beneficial because it would decrease the amount of homework assigned over the weekend,” junior Sophie Swezey said. “It's also very difficult to get through seven classes in a day, and I feel like shorter periods are considerably less productive than block periods.\"\r\n\r\nDiorio also said she hopes that this letter will help promote increased discussion between students and teachers.\r\n\r\nStudents appreciate the sentiments the administration has been showing and acknowledge the support the school has been giving them during this difficult time.\r\n\r\n“I think it [the letter] sounded really genuine and [that] things will get set in motion,” senior Daryl Dillahunty said. “I think when this [a death] happened before, nothing was really done and nothing was changed. I feel like now, there are plans being made and something will actually change. The students' feelings are really being taken into account, and our stress is finally being validated.”\r\n\r\nThe letter also included a <a href=\"http:\/\/goo.gl\/AzyDmF\" target=\"_blank\">Google survey form<\/a>, which will allow students to provide feedback and suggestions about ways to improve the school climate and reduce stress.\r\n\r\nDiorio hopes to create a safe, supportive environment for students.\r\n\r\n“We want high school to be fun for you,” Diorio said in the letter. “We want high school to be a place where you learn and grow. … We want high school to be a place where you feel your teachers and our entire staff care about you. We want you to know that you matter and you have a voice.”\r\n\r\nDiorio emphasized the importance of students' well-being, not just their academic success.\r\n\r\n“Let’s take time and put our lesson plans aside and focus on what’s important,” Diorio said.\r\n\r\n&nbsp;\r\n\r\n<em>*Editor's note: Since the publishing of this article, the letter that Diorio wrote has been taken down from paly.net.<\/em>","excerpt":"In a letter addressed to students, Palo Alto High School Principal Kim Diorio and the Associated Student Body described ways to reduce academic stress and expressed support for the Paly community.","date":"2015-01-30 13:47:57","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0472.jpg","categories":["News","Spotlight"],"tags":{"33934":"c day","27706":"changes","8644":"diorio","8751":"gunn","37742":"letter","28773":"monday","8944":"palo alto high school","8953":"paly","29302":"schedule"}},{"id":96904,"title":"Voice Q&#038;A: Journalism teacher Wojcicki introduces new book","permalink":"http:\/\/palyvoice.com\/2015\/01\/29\/voice-qa-journalism-teacher-wojcicki-introduces-new-book\/","content":"[caption id=\"attachment_96921\" align=\"alignnone\" width=\"536\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-26-at-10.21.12-PM.png\"><img class=\"wp-image-96921\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-26-at-10.21.12-PM.png\" alt=\"Screen Shot 2015-01-26 at 10.21.12 PM\" width=\"536\" height=\"298\" \/><\/a> Paly journalism teacher Esther Wojcicki speaks about her book \"Moonshots in Education: Blended Learning in the Classroom” on Jan. 24 in the Jewish Community Center. Wojcicki's book describes her goal to change the culture within classrooms. Her passion for teaching stems from how \"amazing it is to see students develop.\" Photo by Lee Hochman.[\/caption]\r\n\r\nThe Paly Voice sat down with Palo Alto High School journalism teacher Esther Wojcicki to discuss her new book “Moonshots in Education: Blended Learning in the Classroom.”\r\n\r\nAccording to Wojcicki, her novel strives to encourage a more collaborative environment within classrooms by minimizing the number of lectures. She also believes that integrating technology will help to create an enjoyable classroom environment where students can thrive.\r\n\r\nWojcicki hopes that other teachers will adopt her methodology for changing the classroom set-up.\r\n\r\n“My idea is to give other teachers ideas for how they can do the same thing in the classrooms,” Wojcicki said in an interview with The Paly Voice.\r\n\r\n<strong><span style=\"color: #000000;\">The Paly Voice: <\/span>Could you give us a brief description of your book?<\/strong>\r\n\r\nWojcicki: It is basically how to teach [and] how to change the culture of a classroom. [It’s] how to teach 21st century skills without lecturing to students. The reason it’s called “Moonshots in Education” is because it takes a tremendous amount of energy and conviction to actually do it. I think it’s even harder than a moonshot, because teachers don’t typically want to change the culture of their classroom.\r\n\r\n<strong>TPV: What inspiration did you have for writing the book?<\/strong>\r\n\r\nWojcicki: The main inspiration are my classes and my students, because over the years I see what a difference it [the journalism program] can make in the lives of students. And not just while they’re in my class, but after they graduate from high school and even after they graduate from college. Many of them come back and tell me that this [journalism] was the single most important class they ever took. So then I thought, maybe I should share this with other teachers. What am I doing that is so unusual? So I had to go back and look at what I was doing to try and understand what was so unusual about it, because I didn’t really know at that point.\r\n\r\n<strong><strong>TPV: <\/strong>How have your ideas on blended learning influenced how you teach in the classroom?<\/strong>\r\n\r\nWojcicki: In most of my classes, I do more than the average project-based learning. … The reason I adopted blended learning is because it’s a movement that says that approximately 50 percent of the class time should be devoted to the [project-based] collaborative work while the other 50 percent of the time is devoted to lecturing.\r\n\r\n<strong><strong>TPV: <\/strong>What is your favorite part about teaching journalism?<\/strong>\r\n\r\nWojcicki: Well, first of all, my favorite part is the students. ... Every year they are different and I learn a lot from being in the classroom with them. A journalist is supposed to be able to be the first one to tell everyone what’s going on. So if more people can get information and analyze it correctly and think about it, the whole society will be better off. I think journalism is the best training that a student can have.\r\n\r\n<strong><strong>TPV: <\/strong>Where can we buy the book?<\/strong>\r\n\r\nWojcicki: It [the first round] is already sold out, but it should be on Amazon. Also they’re bringing in 200 copies at the JCC for purchase. Also, there will be a Kindle version if anyone wants to read it in that form.\r\n\r\n<strong><strong>TPV: <\/strong>What would you say your favorite publication at Paly is?<\/strong>\r\n\r\nWojcicki: That’s like asking who’s your favorite child ... It’s hard for me to say. They’re all great. I hope no one will get offended that I didn’t pick them.","excerpt":"The Paly Voice sat down with Palo Alto High School journalism teacher Esther Wojcicki to discuss her book “Moonshots in Education: Blended Learning in the Classroom.”","date":"2015-01-29 19:27:18","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-26-at-10.21.12-PM.png","categories":["Features","Spotlight"],"tags":{"37647":"book","12704":"esther wojcicki","37714":"jcc","8814":"journalism","37646":"Moonshots in Education","37645":"Woj"}},{"id":96258,"title":"Hungry? Head on over to &#8220;The Breakfast Club&#8221;","permalink":"http:\/\/palyvoice.com\/2015\/01\/29\/hungry-head-on-over-to-the-breakfast-club\/","content":"[caption id=\"attachment_97091\" align=\"alignnone\" width=\"543\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0692.jpg\"><img class=\"wp-image-97091\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0692.jpg\" alt=\"DSC_0692\" width=\"543\" height=\"360\" \/><\/a> ASB will hold a movie night in the Media Arts Center this Friday. Many students are looking forward to the screening of \"The Breakfast Club,\" a classic romantic-comedy. The main actors in the movie include Molly Ringwald, Judd Nelson, Anthony Michael Hall, Emilio Estevez and Ally Sheedy. Photo by Adele Bloch.[\/caption]\r\n\r\nPalo Alto High School's Associated Student Body will screen \"The Breakfast Club\" for students at 6:30 p.m. on Jan. 30 in the Media Arts Center. Admission is free and there will be pizza and popcorn available for purchase, according to the <a href=\"https:\/\/www.facebook.com\/events\/1602662259949375\/?ref=br_tf\">event's official Facebook Page<\/a>.\r\n\r\nTo encourage community bonding, the Paly ASB will offer free popcorn to Paly students who bring a friend from Gunn as well as all Gunn students who attend the movie night.\r\n\r\n\"The Breakfast Club,\" directed by John Hughes in 1985, is a classic comedy-drama about f<span class=\"Apple-style-span\">ive high school students, each a member of a different high school group, who meet in detention and who soon discover that their personalities have many similarities.<\/span>\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">This is ASB's second movie night, following the screening of the romantic-comedy \"500 Days of Summer\" in 2013.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\"It wasn't a total hit [last year's movie night], but we decided this year we were looking for some kind of movie that would get everyone excited,\" sophomore Social Commissioner Cezanne Lane said. \"I know that 'The Breakfast Club' is a very well-liked [movie] so I'm really excited about this movie.\"\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">Junior Ellinor Saltin is looking forward to the movie night.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\"Movie nights are always super nice and cozy, and it's great that Paly organizes events that bring students together,\" Saltin said.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">Junior Ryan Reed is excited to attend his first Paly movie night because it will be a change from the typical school dance environment.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">\"With some school events, namely dances, there's a bit of reluctance for many students to attend,\" Reed said. \"But from what I've heard, plenty of Paly students are really looking forward to it. ... It really seems like a step in the right direction regarding schools events.\"\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9 _2cnu\" data-reactid=\".h3.$mid=11422586422179=2cfa684a1c603b3c228\">See a trailer for \"The Breakfast Club\" <a href=\"https:\/\/www.youtube.com\/watch?v=wryzpBI7yLs&amp;feature=youtu.be\">here<\/a>.<span class=\"Apple-style-span\" style=\"font-family: Georgia, serif; font-size: 14px; line-height: 23px; color: #000000;\"> <\/span>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Associated Student Body will screen \"The Breakfast Club\" for Palo Alto High School students at its movie night at 6:30 p.m. on Jan. 30 in the Media Arts Center.","date":"2015-01-29 17:58:41","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0692.jpg","categories":["News"],"tags":{"8496":"ASB","8499":"Associated Student Body","29481":"Cezanne lane","18366":"mac","37722":"movie night","8944":"palo alto high school","37721":"the breakfast club"}},{"id":77642,"title":"School lowers AP test fee after profits found to be used for unrelated school funding","permalink":"http:\/\/palyvoice.com\/2015\/01\/29\/school-lowers-ap-test-fee-after-profits-found-to-be-used-for-unrelated-school-funding\/","content":"The Palo Alto High School administration has decided to lower the cost of taking an Advanced Placement test on campus after learning that it was overcharging students in previous years. The cost will now be $105 per test, a $10 reduction from last year's fee, according to the schools <a href=\"http:\/\/paly.net\/news\/ap-2015-registration-information\">website<\/a>. AP Chinese and Japanese will be $135 per test, also a $10 reduction from last year's fee.\r\n\r\nThe decision to lower the cost sprung from information that Paly was overcharging its students, and was charging more than most other schools in the Bay Area, as described in a previous <a href=\"http:\/\/palyvoice.com\/2014\/03\/11\/advanced-placement-testing-prices-costly-for-paly-and-gunn-students\/\">Paly Voice article.<\/a>\r\n\r\n\"The administration, after looking at the numbers discussed with The Paly Voice over the last few weeks, felt comfortable lowering the price of the exams for the year and will review the pricing annually,\" Assistant Principal Jerry Berkson said.\r\n\r\n[caption id=\"attachment_96937\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo2.jpg\"><img class=\"wp-image-96937\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo2.jpg\" alt=\"photo\" width=\"400\" height=\"300\" \/><\/a> Senior Viv Bhatia studies for the AP Physics exam in the Academic Resource Center. Bhatia is currently in five AP courses, meaning he will save $50 this year with the new AP testing fee. Photo by Lydia Barry.[\/caption]\r\n\r\nThe College Board charged $89 per test in 2014, but many schools added on a sum of money to cover supplies needed to administer the test. With tests costing $115 in 2014, Paly collected an extra $26 per test.\r\n\r\nSome of that money went to funding AP testing-related resources such as proctors and supplies. However, data provided by Paly administrators revealed that the school had a remaining sum of money from the AP tests and that those excess funds were used to buy a range of general school supplies such as dry erase markers for classrooms and technical equipment not directly related to the AP tests themselves.\r\n\r\nThe numbers recorded by the Paly administration in the schools testing fund for the 2014 AP tests were:<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo2.jpg\">\r\n<\/a>\r\n\r\n<em>Collected testing fees: $159,438.58<\/em>\r\n\r\n<em>Cost of exams: $112,707<\/em>\r\n\r\n<em>Proctors: $17,719.52<\/em>\r\n\r\n<em>Additional fees*: $4,063.68<\/em>\r\n\r\nThat results in $24,948.38 leftover after proctors and additional fees had been paid for. With the amount of money paid per test in 2014 at Paly, the school could have charged $105 per test and still have had money remaining.\r\nFor this spring, the College Board increased the <a href=\"https:\/\/apstudent.collegeboard.org\/takingtheexam\/exam-fees\">testing cost<\/a> to $91, meaning Paly will make $14 per test instead of last years $26.\r\n\r\nPaly administration will not know exactly how much extra money it has until all tests have been paid for and taken, and risks losing money with its lowered cost, but its new cost of $105 per test will still be higher than most Bay Area schools.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-27-at-2.03.25-PM.png\"><img class=\"aligncenter wp-image-96929 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-27-at-2.03.25-PM.png\" alt=\"Screen Shot 2015-01-27 at 2.03.25 PM\" width=\"652\" height=\"320\" \/><\/a>\r\n\r\nMany students were unaware of the additional cost charged to them in 2014, and do not believe the school should have been able to use AP testing funds for things unrelated to the test themselves.\r\n\r\n\"I'd like to know beforehand if what I am paying is partially a donation,\" senior Conner Harden said. \"Palo Alto schools should only make the students in AP classes pay the bare minimum for the cost of the test. If a student likes, they can donate money to the school, but not without being notified.\"\r\n\r\nParents, who generally pay for AP tests for their students, were surprised by the additional charge of an AP test and do not believe the schools should continue to overcharge them.\r\n\r\n\"With so many years of data, Paly and Gunn should be able to forecast these expenses fairly accurately,\" Paly alumni parent Liz Raffel said. \"There's really no excuse for excess profits in the amounts mentioned, and it's just wrong for AP test-takers to be funding, unknowingly, general supplies for the entire school.\"\r\n\r\nAnother Paly alumni parent, Katharine Glazier, echoes Raffel's sentiments.\r\n\r\n\"It seems that the school has unfairly made a nice bit of money off the backs of the AP students and their parents,\" Glazier said.\r\n\r\nAP test takers are appreciative that the administration has made the effort to lower the cost following last year's dramatic over-charge.\r\n\r\n\"It wasn't okay for them to overcharge us, but I'm glad the administration has realized its mistake and has decided to lower the cost,\" senior Olivia Johnson said. \"For students taking AP tests, this will make a difference.\"\r\n\r\n&nbsp;\r\n\r\n<em>*Additional fees include custodial staff costs during AP testing, testing supplies such as snacks, tech support, headphones for listening portions of certain AP tests and AP Conference costs (teachers attend training before they can teach an AP course). <\/em>","excerpt":"Paly administration lowers the cost per AP test for the 2014-15 school year. ","date":"2015-01-29 17:27:34","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo2.jpg","categories":["News","Spotlight"],"tags":{"36402":"advanced placement","36401":"ap tests","36403":"funds","8751":"gunn","8752":"gunn high school","8944":"palo alto high school","8953":"paly","36404":"profit","36405":"spending","13289":"testing"}},{"id":97088,"title":"Boys&#8217; soccer dominates league, ranked 31st in nation","permalink":"http:\/\/palyvoice.com\/2015\/01\/29\/boys-soccer-dominates-league-ranked-31st-in-nation\/","content":"[caption id=\"attachment_80689\" align=\"alignnone\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_53711.jpg\"><img class=\"size-full wp-image-80689\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_53711.jpg\" alt=\"Bolarinwa dribbles the ball towards the goal. Bolarinwa made one goal. Photo by Saba Moussavian\" width=\"500\" height=\"333\" \/><\/a> Bolarinwa dribbles the ball towards the goal. Bolarinwa made one goal. Paly beat Gunn 3-0. Photo by Saba Moussavian.[\/caption]\r\n\r\nThe Palo Alto High School boys’ soccer team (10-1-2, 6-0) is dominating the De Anza League and is currently ranked 31st in the nation and 11th in the state, according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/soccer-winter\/home.htm\" target=\"_blank\">Maxpreps<\/a>.\r\n\r\nJunior goalkeeper Eli Friedlander attributes the Vikings' success to a strong line of defense.\r\n\r\n“We’ve won most of our games 1-0, so even though we’re not scoring a ton, we’re staying in every game just because of the fact that we’re not allowing any goals,” Friedlander said.\r\n\r\nAssistant coach Amir Malekpour agreed, stating that all players have stepped up this season.\r\n\r\n“Our keepers have been great, and really our back line — all of them — have really shut down the opponent and have done great,” Malekpour said. “[Sophomore] Derek [Schoenberger] is a great center midfielder who has been incredible for us. [Sophomore] Michel [Siaba], a great forward with speed, has been through a couple of injuries this season [but is] still fighting for goals.”\r\n\r\nAfter conceding zero goals so far, the team is focused on maintaining its lead and winning league, according to Malekpour.\r\n\r\n“We’re approaching each team differently, focusing more on their weakness, what happened in our previous meeting and working to keep possession and utilize the speed we have,” Malekpour said.\r\n\r\nAs keeper, Friedlander echoed similar sentiments of focusing on the steps along the way of the season and maintaining the shutout.\r\n\r\n“I don’t really look at it as pressure to not allow any goals the entire season,” Friedlander said. “I look at it more as just trying to win game by game and do the best I can to make sure it happens.”\r\n\r\nThe Vikings will take on Los Altos High School at 3:30 p.m. today on the Eagles' turf.","excerpt":"Palo Alto High School’s boys’ soccer (10-1-2, 6-0) dominates the De Anza League and is currently ranked 31st in the nation and 11th in the state.","date":"2015-01-29 14:38:54","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_5371.jpg","categories":["Sports","Spotlight"],"tags":{"10311":"boys soccer","37717":"defense","37719":"derek schoenberger","37718":"eli friedlander","23905":"goals","8751":"gunn","37720":"michel-ange siaba","37715":"midseason","9110":"Soccer","37716":"zero"}},{"id":96220,"title":"Opinion: Destigmatize community college","permalink":"http:\/\/palyvoice.com\/2015\/01\/29\/opinion-destigmatize-community-college\/","content":"[caption id=\"attachment_96254\" align=\"alignnone\" width=\"439\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/FoothillPsych1.jpg\"><img class=\"wp-image-96254\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/FoothillPsych1.jpg\" alt=\"FoothillPsych\" width=\"439\" height=\"329\" \/><\/a> Students study in psychology class at Foothill College, a popular junior college for many Palo Alto High School students. According to the American Association for Community Colleges, smaller classroom sizes are a major benefit for community college students. Photo by Milena Maese-Czeropski.[\/caption]\r\n\r\nIn education-savvy Palo Alto, many students define academic success as attending the most prestigious universities in America. However, in a city where schooling and success are viewed as one, educational alternatives such as community college are sometimes seen as second-rate or last resort options.\r\n\r\nDue to the perceived notion that community colleges are inherently inferior to four-year universities, a stigma has arisen for those who opt for this option.\r\n\r\n“Some people at Paly [Palo Alto High School] will look down on you if you say you’re going to a community college,” sophomore Jacky Moore said. “They might automatically assume that you weren’t smart enough to get into a four-year university.”\r\n\r\nHowever, this belief is both offensive and often inaccurate. Approximately 99 percent of all community college associate degree enrollees have received either a high school diploma or passed a General Education Development test, according to the <a href=\"http:\/\/ccrc.tc.columbia.edu\/Community-College-FAQs.html\">Community College Resource Center<\/a>. In fact, an October 2014 <a href=\"http:\/\/www.sociologicalscience.com\/articles-vol1-25-448\/\">study<\/a> conducted by three UCLA professors concluded that attending junior college actually increases disadvantaged students’ likelihood of eventually receiving a bachelor’s degree at a four-year university. According to the American Association of Community Colleges, 45 percent of undergraduate students enrolled in a four-year college in the 2012-13 school year originally went to a two-year public college. The sum of this information defies the stigma that most community college students are unintelligent.\r\n\r\nJunior colleges and universities also may be acknowledged incorrectly as extremely dissimilar. Although most community colleges award only associate degrees to graduates instead of bachelor’s degrees, students can easily transfer to universities once they have completed junior college. Also, while community colleges usually put a greater emphasis on vocational fields compared to universities, both offer degrees in a large variety of fields.\r\n\r\nCommunity colleges offer additional benefits when compared to four-year colleges. According to AACC, community college tuition rates are approximately 50 percent cheaper than four-year universities. Smaller classroom sizes, superb student support services and the sheer number of available programs are all <a href=\"http:\/\/uhcc.hawaii.edu\/promo\/top10Reasons.php\">extra advantages<\/a>, according to the University of Hawaii Community Colleges. Community colleges may also appeal to high school graduates who are not prepared to move across the state or country to attend college or are unsure of which career path they wish to take.\r\n\r\nPaly College Adviser Sandra Cernobori is one of many junior college advocates.\r\n\r\n\"I think [community colleges] are great options, not only to prepare to transfer [or] to get career training, but also they're economical and have excellent reputations,\" she said.\r\n\r\nCurrent United States Secretary of Education Arne Duncan also declared his support for community colleges during a question and answer <a href=\"http:\/\/www.mlive.com\/education\/index.ssf\/2011\/11\/education_secretary_arne_dunca.html\">session<\/a> through Facebook in 2011.\r\n\r\n“Community colleges, I continue to believe, have this ability to transform young people’s lives, adults’ lives, older people’s lives in very profound ways,” he said during the session.\r\n\r\nDespite these distinct benefits, attending a community college is still often looked down upon in Palo Alto. An informal survey conducted by The Paly Voice on 110 current and past Paly students in late January showed that nearly 93 percent of those surveyed believe that some stigma exists regarding the attendance of a community college. Only approximately 7.2 percent, or eight students, were unsure or stated that they do not believe a stigma exists in Palo Alto.\r\n\r\nThese results bring up an important question: How should we address this widespread issue at Paly?\r\n\r\nSophomore Tara Madhav says that awareness will help slow the prevalence of the stigma.\r\n\r\n“People should become more aware of the options out there for college-bound seniors,” Madhav said. “Community colleges should [also] spread awareness about all they have to offer.”\r\n\r\nWe as students can also help end this stigma simply by offering support to others’ decisions in regards to their own education. It is imperative to understand that our definition of educational success may contrast greatly with that of our peers. Recognizing that one’s high school GPA is one of countless factors taken into account when applying to college is a step in the right direction. Teachers and counselors should also encourage students to look beyond the stigma and check out academic pathways at universities as well as local community colleges.","excerpt":"In Palo Alto, educational alternatives such as community college are sometimes seen as second-rate or last resort options. Staff writer Aidan Maese-Czeropski's calls for a destigmatization of community colleges.\r\n","date":"2015-01-29 13:35:50","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/FoothillPsych1.jpg","categories":["Opinion","Opinion Editor's Pick","Spotlight"],"tags":{"34668":"community college","8715":"Foothill College","10749":"high school","37652":"junior college","36712":"stigma","9198":"University"}},{"id":96201,"title":"Robotics team prepares for competition","permalink":"http:\/\/palyvoice.com\/2015\/01\/29\/robotics-team-prepares-for-competition\/","content":"[caption id=\"attachment_96992\" align=\"alignnone\" width=\"605\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_2221.jpg\"><img class=\" wp-image-96992\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_2221.jpg\" alt=\"Senior Osamu Yasui uses a metal cutter to prepare parts for the robot. Photo by Dhara Yu.\" width=\"605\" height=\"433\" \/><\/a> Senior Osamu Yasui uses a metal cutter to prepare parts for the robot. Photo by Dhara Yu.[\/caption]\r\n\r\nRobot construction is underway for the Palo Alto High School Robotics Team as it prepares for an upcoming tournament March 3 in Madera.\r\n\r\nAccording to sophomore Lauren Nolen, the Public Relations Captain, the team will attend the Madera Regional competition, which is part of the larger <span style=\"color: #000000;\">For Inspiration and Recognition of Science and Technology (<\/span>FIRST) Robotics contest. Currently, the team is in the midst of its build season, a six-week period starting from the day that the robot prompt  is released up until Feb. 17.\r\n\r\n\"During this time, we keep the lab open 36 hours a week, and we all come in and we work on prototyping and the final design of the robot,\" Nolen said.\r\n\r\nNolen said that the objective is to build a robot that can stack recycling totes on top of each other and dispose of litter into a garbage container.\r\n\r\n\"Right now, we're in the middle of prototyping, and some of the ideas have been having an elevator-type thing, getting wheels that move in multiple directions and using pneumatics,\" Nolen said.\r\n\r\nNolen said she believes that this year's team has a lot of potential and enthusiasm.\r\n\r\n\"[This year], we have a better relationship with teams around the community, and we can help each other instead of just seeing each other at competitions,\" Nolen said. \"Generally, I think we are going to have a very strong year because our team members have a lot of experience and have been actively learning in the offseason.\"\r\n\r\nJunior Claire Kokontis, the team's Build Captain echoes Nolen's sentiments.\r\n\r\n\"We have a lot of talented younger members with lots of skills and experience,\" Kokontis said. \"We happen to have many smart and creative underclassmen members, which has not been my experience in previous years.\"\r\n\r\nKokontis also mentioned that the team has exceptionally strong chemistry.\r\n\r\n\"Younger and older members get along really well because we all have one goal: To do well in the competitions,\" Kokontis said.","excerpt":"Robot construction is underway for the Palo Alto High School Robotics Team as it prepares for an upcoming competition in Madera, CA on March 3.","date":"2015-01-29 13:16:27","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_2221.jpg","categories":["News","Spotlight"],"tags":{"37379":"build season","12849":"claire kokontis","37378":"lauren nolen","8944":"palo alto high school","9049":"robotics","25084":"robotics team"}},{"id":96942,"title":"PTSA to host &#8220;Time and Stress&#8221; event","permalink":"http:\/\/palyvoice.com\/2015\/01\/27\/ptsa-to-host-time-and-stress-event\/","content":"[caption id=\"attachment_96946\" align=\"alignright\" width=\"217\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/3.jpg\"><img class=\" wp-image-96946\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/3.jpg\" alt=\"The Western Association of Schools and Colleges team students used visual graphics like this “Stress Tree” to break down the problems students face at Paly. Photo by Maya McNealis.\" width=\"217\" height=\"290\" \/><\/a> During a <a href=\"http:\/\/palyvoice.com\/2014\/09\/21\/what-is-wasc\/\">Western Association of Schools and Colleges<\/a> meeting, student leaders and other members of WASC used visual graphics like this “Stress Tree” to analyze problems students face at Paly. Photo by Maya McNealis.[\/caption]\r\n\r\nThe Parent Teacher Student Association will host a presentation-workshop on time management and stress reduction for parents and students at 7 p.m. on Thursday, Jan. 29 in the Palo Alto High School Media Arts Center.\r\n\r\nGuest speaker Ali Zidel Meyers, executive director of <a href=\"http:\/\/www.meyerslearning.com\/\" target=\"_blank\">Meyers Learning Center<\/a>, will speak on specific strategies parents and students can use to build time awareness, mindfulness and efficacy in daily life. She will provide practical time management tools, exercises and resources for building positive habits and reducing stress.\r\n\r\nMeyers has extensive experience in helping people enhance learning, build confidence and achieve success, and has presented at more than a dozen schools in the Bay Area, according to Meyers.\r\n\r\n“Stress levels are extremely high among students in Silicon Valley,” Meyers wrote in an email to The Paly Voice. “Pressure to succeed and compete is not just a local phenomenon, but the Valley has its own unique brand of it. [At the presentation,] I’m excited to address some modern misconceptions connected to time use and stress. Palo Alto parents and students are always wonderful to present to; they come with great questions, wise insights and wonderful perspectives.”\r\n\r\nThe co-vice presidents of Parent Education for the Paly PTSA, Dawn Billman and Louise Valente, say they believe this event will be beneficial for everyone, as it focuses on stress relief in a time of college admissions frenzy.\r\n\r\nPrior to this presentation, there will be a quick PTSA meeting at which the executive board will discuss proposed budget changes and receive a brief update on the Social Justice Pathway, according to PTSA president Linda van Gelder.","excerpt":"The Parent Teacher Student Association will host a presentation-workshop on time management and stress reduction for parents and students at 7 p.m. this Thursday, Jan. 29 in the Palo Alto High School Media Arts Center.","date":"2015-01-27 23:02:30","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/4.jpg","categories":["News"],"tags":{"37648":"ali zedel meyers","37738":"ali zidel meyers","8944":"palo alto high school","37651":"presentation","9019":"PTSA","9128":"Stress","37650":"stress reduction","37649":"time management","29088":"workshop"}},{"id":96415,"title":"New English elective to teach communication skills","permalink":"http:\/\/palyvoice.com\/2015\/01\/26\/new-english-elective-to-teach-communication-skills\/","content":"The Palo Alto High School English Department will offer a new semester-long elective that focuses on students' business and communication skills for the 2015-16 school year.\r\n\r\nThe class is called Communication and Leadership. English teacher Lucy Filppu, who will be teaching one period of the class each semester, says the University of California-approved course will teach students practical skills regarding persuasive writing, speech writing and presentation, leadership, business models and effective communication, while also incorporating literature into the curriculum.\r\n\r\n“We recognize our students need more global economy skills,” Filppu said. “We’re going to apply literature to what it means to communicate.”\r\n\r\n[caption id=\"attachment_96508\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0001.jpg\"><img class=\"wp-image-96508\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0001.jpg\" alt=\"Photo by Aisha Chabane\" width=\"300\" height=\"241\" \/><\/a> English teacher Lucy Filppu speaks to her class. Filppu will be teaching a new elective called Communication and Leadership next year. \"This class is great for everybody,\" Filppu said. Photo by Aisha Chabane[\/caption]\r\n\r\nStudents in the Sports Career Pathway will be required to take the elective, but the course is open to everyone, Filppu says.\r\n\r\nAccording to Filppu, the course focuses on listening and speaking rather than on the traditional disciplines of reading and writing.\r\n\r\n“I think in the English Department, we privilege writing,\" Filppu said. \"I don’t think we do enough with speaking.”\r\n\r\nHenry M. Gunn High School’s Advanced Communications class is the template for the new course at Paly. Filppu says that the class is immensely popular and successful at Gunn.\r\n\r\nIsha Gupta, a sophomore at Gunn, took Advanced Communications last year.\r\n\r\n“I thought Communications was extremely useful because it taught universal skills that could be applicable to any future career,” Gupta said.\r\n\r\nFor more information regarding the class, contact Filppu at lfilppu@pausd.org.","excerpt":"The Palo Alto High School English Department will offer a new semester-long elective that focuses on students' business and communication skills for the 2015-16 school year.\r\n\r\n\r\n","date":"2015-01-26 18:19:30","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_00011.jpg","categories":["News"],"tags":{"37498":"elective","8674":"english","8912":"new","8944":"palo alto high school"}}]