[{"id":103305,"title":"Boys&#8217; track holds heads high after loss to Lynbrook","permalink":"http:\/\/palyvoice.com\/2015\/05\/02\/boys-track-holds-heads-high-after-loss-to-lynbrook\/","content":"The Palo Alto High School boys’ track and field team is looking forward to the De Anza League meets next week after a close loss against Lynbrook High School on Thursday.\r\n\r\n[caption id=\"attachment_103307\" align=\"alignnone\" width=\"622\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-02-at-1.47.20-PM.png\"><img class=\"size-full wp-image-103307\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-02-at-1.47.20-PM.png\" alt=\"Junior hurdlers Connor Ng and Tak Nishi try to catch up to Lynbrook in the 110-meter high hurdles at Thursday's meet.  Photo by Malcolm Slaney. \" width=\"622\" height=\"411\" \/><\/a> Junior hurdlers Connor Ng and Tak Nishi try to catch up to Lynbrook in the 110-meter high hurdles at Thursday's meet. Photo by Malcolm Slaney.[\/caption]\r\n\r\nAgainst Lynbrook, the varsity boys (4-2) fell short in the 4x400 meter relay, the final, and arguably most exciting event of the meet.\r\n\r\nThe Vikings started out strong with the boys varsity team winning the 4x100 meter relay and sophomore Kent Slaney winning the 1600-meter race, but things started to take a turn for the worse when Lynbrook swept both the 110-meter high hurdles and the 300-meter low hurdle races.\r\n\r\nAccording to former boys sprinter Tak Nishi, who was added to the hurdles team just two weeks before the end of the season to try to get some points in the hurdle events, the team will only get better with time and practice.\r\n\r\n“We have a really good coach who is new this year and even though I haven't been in hurdles for very long from what I've seen, we just don't have the numbers of boys that would allow us to perform well,” Nishi said. “In addition, we have only one varsity hurdler who has been there the entire season so our hurdles team is really very young.”\r\n\r\nPlacing in the hurdle events will be crucial for next year's team success, which will compliment the strong frontline of athletes that have been dominating the varsity scene in sprints and distance races including juniors Dami Bolarinwa, Eli Givens, and sophomore Kent Slaney.\r\n\r\nIn Thursday’s meet against Lynbrook, Slaney showed his impressive abilities in his win in the 1600-meter race, when he opened a three-second gap in the last 150 meters of the race. Slaney finished with a 4:37.48 time.\r\n\r\nYoung talent such as sophomore Thorin Haussecker, who earned a personal record in the 200- meter race and is ranked 13th in the De Anza League, is looking forward to the opportunity of running varsity next season.\r\n\r\n“I'm looking forward to racing varsity next year especially in the 4x100 meter race with some of the other great sprinters and I'm going to do a lot of training in the off season to make sure I'm in shape once next year’s season begins,” Haussecker said.\r\n\r\nDespite the regular season being over and the loss to Lynbrook, the Vikings have their heads held high and many are looking forward to De Anza League trials at 3:15 p.m. next Tuesday, May 5 at Lynbrook High School. The Vikings, along with the other schools in DAL will send their three best athletes for each event to the meet for a chance to earn a qualifying spot in the De Anza League finals, which will occur on Thursday, May 7, again at Lynbrook.","excerpt":"The Palo Alto High School boys’ track and field team is looking forward to the De Anza League meets next week after a close loss against Lynbrook High School on Thursday. ","date":"2015-05-02 13:54:16","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-02-at-1.47.20-PM.png","categories":["Sports","Uncategorized"],"tags":[]},{"id":103072,"title":"Juniors win inaugural Hogwarts Week","permalink":"http:\/\/palyvoice.com\/2015\/05\/01\/juniors-win-inaugural-hogwarts-week\/","content":"Palo Alto High School's <a href=\"http:\/\/palyvoice.com\/2015\/04\/27\/asb-is-sirius-about-hogwarts-week\/\" target=\"_blank\">first Hogwarts Week<\/a> ended with a junior victory today when the juniors clinched the<a href=\"http:\/\/palyvoice.com\/2015\/04\/30\/day-two-of-hogwarts-week\/\" target=\"_blank\"> lead from the sophomores<\/a> after Friday's final Quidditch match on Paly's lacrosse field, according to Paly's Associated Student Body.\r\n\r\nThe juniors beat the seniors 50-20 during today's finals after catching the Snitch, which gave them a 30 point bonus. The juniors ended with 980 points, and the seniors came in second place with 920 points. The sophomores finished 20 points short of the seniors, while the freshmen ended with 780 points, according to Paly's Associated Student Body.\r\n\r\n[caption id=\"attachment_103191\" align=\"alignleft\" width=\"309\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11201270_1090456807637782_1339450122_o.jpg\"><img class=\"wp-image-103191\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11201270_1090456807637782_1339450122_o.jpg\" alt=\"Junior Anant Marur runs with a dodgeball during the Quidditch finals. The juinors beat the seniors and took first place in the activity. Photo by George Lu.\" width=\"309\" height=\"206\" \/><\/a> Junior Anant Marur runs with a dodgeball during the Quidditch finals. The juniors beat the seniors and took first place in the activity. Photo by George Lu.[\/caption]\r\n\r\nThroughout the week, students participated in various Harry Potter-themed activities. Paly ASB assigned a Hogwarts house to each class with seniors as Gryffindor, juniors as Slytherin, sophomores as Ravenclaw and freshmen as Hufflepuff. Students generally enjoyed the new Hogwarts Week and its  events.\r\n\r\n\"Hogwarts Week was super fun,\" senior Sonty Visuthikraisee said. \"I especially liked the first day where we got to dress up and show off all our Hogwarts spirit.\"\r\n\r\nAccording to senior Maeve Lavelle, the activities also provided an opportunity for classes to bond.\r\n\r\n\"I think that Hogwarts Week was a great way for each class to bond before the end of the year,\" Lavelle said.\r\n\r\nHogwarts week was also successful from an ASB standpoint in terms of student participation in all events.\r\n\r\n\"I think that Hogwarts week went really, really well,\" Sophomore Vice President Anmol Nagar said. \"So many people were able to be involved in the Triwizard Tournament, trivia and Quidditch games.\"\r\n\r\nAmong the three events, the Quidditch event, held during Lunch of Thursday and Friday, was the most popular.\r\n\r\nSenior Anna Dukovic enjoyed participating in the new activity.\r\n\r\n\"It was fun to try something new [Quidditch] and do something with our class again outside of Spirit Week,\" Dukovic said.\r\n\r\nASB is sponsoring another event during the week of May 18 called Sports Fest, which will replace the annual powderpuff football.\r\n\r\n\"Hogwarts Week is actually not a replacement for powderpuff,\" Nagar said. \"Our first annual spring Sports Fest will take place in a couple weeks. Sports Fest involves the sporting aspect of powderpuff in a series of even more games, including flag football, throughout the week.\"\r\n\r\nAccording to Nagar, ASB looks to continue these spring events in future years.\r\n\r\n\"Hogwarts Week and Sports Fest are both things we hope to continue as Paly traditions,\" Nagar said.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School's first Hogwarts Week ended with a junior victory today when the juniors clinched the lead from the sophomores after Friday's final Quidditch match on Paly's lacrosse field.","date":"2015-05-01 18:59:07","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11201270_1090456807637782_1339450122_o.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","12848":"competition","17499":"FIRST","42206":"gryffindor","42205":"hogwarts week","42209":"hufflepuff","42916":"new event","8953":"paly","42693":"quidditch","42208":"ravenclaw","42207":"slytherin"}},{"id":103094,"title":"Update: Softball looks to finish strong","permalink":"http:\/\/palyvoice.com\/2015\/05\/01\/update-softball-looks-to-finish-strong\/","content":"[caption id=\"attachment_103189\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MG_3507.jpg\"><img class=\"size-full wp-image-103189\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MG_3507.jpg\" alt=\"Softball convenes in between innings against Santa Clara on 3\/20\/15.\" width=\"800\" height=\"533\" \/><\/a> The Paly softball team converses during a 6-1 loss to Santa Clara High School on March 20. The Vikings are currently sitting in fourth place in the El Camino League standings with five regular season games left to play. Photo by George Lu.[\/caption]\r\n\r\nMidway through the season, the Palo Alto High School softball team (14-8, 4-4) is looking to finish the rest of the season on a high note after a mostly successful start.\r\n\r\nSenior captain Casey Glassford is satisfied with how the season has gone up until this point.\r\n\r\n\"The season [has] been going well,\" Glassford said. \"Our record is good and we've been playing really well. Our offense is great right now.\"\r\n\r\nFreshman Sophie Frick agreed with Glassford's assessment and attributes much of the success to teamwork.\r\n\r\n\"In every game, we have never given up and we give it all until the last pitch,\" Frick said. \"We work extremely well as a team and it has definitely paid off this season.\"\r\n\r\nWhile there have been numerous positives surrounding girls' softball this season, Glassford and Frick both agreed that there is always room for improvement.\r\n\r\n\"For the rest of the season, we just need to keep tightening up our defense,\" Glassford said.\r\n\r\n\"Working on the little details can make a big difference when you play such as focusing on the ball before anything else, and footwork on batting\/fielding,\" Frick added.\r\n\r\nThe girls' next game is at 4 p.m. today at Monta Vista High School.","excerpt":"Players from Palo Alto High School's softball team reflect on how the season has been going and comment on the areas where they can improve.","date":"2015-05-01 14:34:14","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MG_3507.jpg","categories":["Sports"],"tags":[]},{"id":103129,"title":"Speech member triumphs at State tournament","permalink":"http:\/\/palyvoice.com\/2015\/05\/01\/speech-member-triumphs-at-state-tournament\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_100363\" align=\"alignnone\" width=\"372\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-01-at-10.31.18-PM.png\"><img class=\" wp-image-100363\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-01-at-10.31.18-PM.png\" alt=\"Junior Jenny Xin shows off her trophy won at the Coast Forensic League Satellite tournament last week. Her victory at the tournament makes her first ever Paly student to qualify for states. Photo courtesy of Gabi Rossner.\" width=\"372\" height=\"438\" \/><\/a> Junior Jenny Xin shows off her trophy won at the Coast Forensic League Satellite tournament last month. Her victory at the tournament makes her first ever Paly student to qualify for states. Photo by Gabi Rossner[\/caption]\r\n\r\nA Palo Alto High School Speech and Debate team member is celebrating her successes at the California High School Speech Association State tournament earlier this month.\r\n\r\nJunior Jenny Xin qualified for semifinals in the Original Prose and Poetry event. Out of a pool of over 60 competitors, Xin captured 15th in the State.\r\n\r\n“The amount of talent in each of the rounds I competed in was terrifyingly high, and the reactions of people from different areas to different OPPs varied each time, which was really interesting for me, especially since I have a stand-up comedy kind of piece,\" Xin said.\r\n\r\nSpeech and Debate director Jennie Savage expressed her pride for Xin.\r\n\r\n“Anyone from Paly's Speech team earning a spot at the State Championship hasn't happened in over a decade, so it was extremely exciting for Jenny to win districts and qualify to States and even more gratifying that she placed so high once she got there,” Savage said.\r\n\r\nAccording to Xin, one of the highlights of States was meeting new people.\r\n\r\n“Up until now, I've been competing in tournaments in the local league (Coast Forensics League), but qualifying to states meant that I and six other OPPers from CFL got to meet people from every district in California,” Xin said.\r\n\r\nXin said that attending States was one of the best experiences she has had as a speech member.\r\n\r\n“States was an experience I've never had before,” Xin said. “Just having different audiences and different reactions was fantastic.”\r\n\r\n&nbsp;","excerpt":"A Palo Alto High School Speech and Debate team member is celebrating her successes at the California High School Speech Association State tournament this month.","date":"2015-05-01 14:27:34","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-01-at-1.56.32-PM1.png","categories":["News"],"tags":{"42889":"cfl","8638":"debate","10525":"jennie savage","10195":"Jenny Xin","8944":"palo alto high school","8953":"paly","10196":"speech","33011":"states","9175":"tournament"}},{"id":102017,"title":"&#8220;Ghost Bike&#8221; to premiere tomorrow","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/ghost-bike-to-premiere-tomorrow\/","content":"The <a href=\"http:\/\/www.teenartscouncil.org\/\">Teen Arts Council<\/a> plans to host its first student-run production, \"Ghost Bike,\" at 7:30 p.m. on Friday and Saturday and 2 p.m. on Sunday at the Palo Alto Children's Theatre.\r\n\r\n<span style=\"color: #1c1c1c;\">TAC is a group of high schools students who meet weekly to plan creative and relaxing events for its community, according to TAC adviser Joy Brooke Fairfield. H<\/span>igh school students completely produced and directed the play, Fairfield said.\r\n\r\n\"The play itself wrestles with the complex reality of death and the hurdles friends overcome in their attempts to stand by each other,\" Fairfield said.\r\n\r\nThe rehearsals took place around three times a week at either the Haymarket Theatre or the Children's Theatre, according to Ido Gal, director and Paly senior. Many of the students play multiple roles; freshman Mia Trubelja joined \"Ghost Bike\" for her first TAC play as Cady, Wellwisher #1 and Ghost #2.\r\n\r\n<span style=\"color: #373e4d;\">\"It's a really great story,\" Trubelja said. \"It's definitely different than anything I've ever read. Everyone is working really hard and everyone in the cast is very talented.\"<\/span>\r\n\r\n[caption id=\"attachment_103056\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/unnamed.jpg\"><img class=\"size-full wp-image-103056\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/unnamed.jpg\" alt=\"Sophomore Zoe Sego plays the lead character Ora. Junior Ophir Sneh holds onto the &quot;ghost bike.&quot; Photo by Ido Gal.\" width=\"400\" height=\"266\" \/><\/a> Sophomore Zoe Sego plays the lead character, Ora, in the student-run play, \"Ghost Bike.\" Junior Ophir Sneh plays Eddie, Sego's best friend in the play. Photo by Hannah Nguyen.[\/caption]\r\n\r\nThis week, the cast and crew had rehearsals for up to five hours each day after school in preparation for opening night.\r\n\r\n<span style=\"color: #373e4d;\">\"When it comes to student-organized productions like our production of 'Ghost Bike', you get out what you put in,\" junior Paul Bleich said. \"If you want to put on a good show, you have to show commitment. There’s no one to force you to put in the work.\"<\/span>\r\n\r\nFairfield looks forward to seeing the teenagers' hard work pay off.\r\n\r\n\"This is one of the biggest projects we've undertaken in a while, and brings together the talents of over 20 different teens,\" Fairfield said.\r\n\r\nTickets can be bought online <a href=\"http:\/\/www.cityofpaloalto.org\/news\/displaynews.asp?NewsID=1543&amp;TargetID=281\">here<\/a> or at the door for $6.","excerpt":"The Teen Arts Council plans to host its first student-run production, \"Ghost Bike,\" at 7:30 p.m. on Friday and Saturday and 2 p.m. on Sunday at the Palo Alto Children's Theatre.\r\n","date":"2015-04-30 22:55:18","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/unnamed.jpg","categories":["A&amp;E Section Spotlight","Entertainment","News"],"tags":{"42684":"ghost bike","19408":"Ido Gal","42686":"mia trubelja","33460":"paul bleich","9132":"students","42685":"tac","9160":"theatre"}},{"id":103073,"title":"Day two of Hogwarts Week","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/day-two-of-hogwarts-week\/","content":"After day two of Palo Alto High School's <a href=\"https:\/\/docs.google.com\/document\/d\/1XGMtlJttJWuLnnWkZSDdejYUPRZv9mfXKLFkiKpopSU\/edit\">Hogwarts Week<\/a>, the sophomore class holds onto the lead. The first two rounds of the Quidditch tournament took place today during Lunch. The seniors and juniors beat the freshmen and sophomores, respectively.\r\n\r\nTomorrow, the seniors will face the juniors in the grand final, and the sophomores will battle with the freshmen for third and fourth place. The total points for Quidditch are as follows: 1st = 400, 2nd = 340, 3rd = 280, 4th = 220. With the current point totals, whichever grade wins the Quidditch tournament is guaranteed to win the entire Hogwarts Week.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/hogwarts.png\"><img class=\"alignnone size-full wp-image-103103\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/hogwarts.png\" alt=\"hogwarts\" width=\"800\" height=\"1223\" \/><\/a>\r\n\r\n&nbsp;","excerpt":"After day two of Paly's Hogwarts Week, the sophomore class holds onto the lead. ","date":"2015-04-30 20:14:16","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-30-at-6.27.15-PM1.png","categories":["News"],"tags":{"42202":"harry potter","42692":"harry potter week","42887":"hogwarts","42205":"hogwarts week","42693":"quidditch","42888":"triwizard tournament"}},{"id":102975,"title":"Editorial: Transcending the assumptions","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/editorial-transcending-the-assumptions\/","content":"[caption id=\"attachment_103002\" align=\"alignright\" width=\"291\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/daraopinion.jpg\"><img class=\"wp-image-103002\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/daraopinion.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"291\" height=\"518\" \/><\/a> Illustration by Portia Barrientos.[\/caption]\r\n\r\nYear after year, the Palo Alto Unified School District is lauded for producing high-achieving students — average test scores are consistently high, excellence in extracurriculars is commonplace and college matriculation is impressive. But accompanying the district’s apparent success is a stream of criticism from disgruntled parents, students and educators, as well as national media.\r\n\r\nNothing has ignited more vehement condemnation of the schools than the three student deaths by suicide this school year. Everything becomes more urgent, and the weaknesses of the district appear even more magnified in the wake of such tragedies.\r\n\r\nPeople found all kinds of outlets to express their opinions on the schools’ failure to mitigate student stress, including local newspapers, school board meetings, forums and social media. In an article on Palo Alto Online, guest writer and Palo Alto High School junior Carolyn Walworth, the school's appointed student representative to the district Board of Education, <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/03\/25\/guest-opinion-the-sorrows-of-young-palo-altans\">describes her personal experiences and opinion about the community’s actions surrounding the issue<\/a>. Palo Alto’s suicide problem was even addressed in The New York Times — not once, but twice. Frank Bruni writes about the apparent deterioration of mental health in high-performing communities, using Palo Alto as the case study, in his Op-ed, “<a href=\"http:\/\/www.nytimes.com\/2015\/04\/12\/opinion\/sunday\/frank-bruni-best-brightest-and-saddest.html?_r=0\">Best, Brightest — and Saddest?<\/a>” while Matt Richtel tackles the issue of academic pressure at Paly and Gunn High School in his feature, “<a href=\"http:\/\/www.nytimes.com\/2015\/04\/26\/sunday-review\/push-dont-crush-the-students.html?fb_ref=Default&amp;_r=1\">Push, Don’t Crush, the Students<\/a>.” Bruni and Richter quote Walworth as the sole youth voice in both their articles, therefore implying that her perspective is somehow representative of the entire student body.\r\n\r\nAll three seem to have arrived at the same conclusion: Students simply can’t escape the ultra-competitive atmosphere of Palo Alto, and many get sucked in so deep that they come to believe their entire livelihood is dependent on which college they gain admission to.\r\n\r\nWalworth, Bruni and Richtel bring up fair points — no one can deny that competition and stress are pervasive in Palo Alto schools.  We know that there are students who have to deal with unhealthy amounts of pressure and may feel obliged to meet unattainably high expectations.\r\n\r\nBut this is not everyone. The perceived image of the typical Palo Alto student as completely focused on academic success and nothing else, perpetuated by these writers, is overgeneralized. And these absurdly broad accusations indicate a fundamental lack of understanding about the problem.\r\n\r\nIn their attempt to analyze the problem at hand, some observers end up ascribing characteristics of a select few to the entire population of Palo Alto. Not every student takes too many rigorous classes or has a plethora of extracurricular activities, and of those who do, the chief intention is not always to get into a prestigious university. Many of us embark on these endeavours because of a genuine desire to learn, to invent, to improve ourselves and our communities. And with so many opportunities to engage in these interests around us, in part because our schools are so very good at providing them, why not take them on? It’s not a crime to show passion in wide-ranging disciplines like the visual arts, science, athletics, music, politics, writing and theater, just to name a few. Regardless of what some may try to convey, we are passionate about and proud of our pursuits.\r\n\r\nWe would like to dispel the idea that students being stressed means that students are always focused on academic success. Just because people admit to having some anxiety in their lives does not mean they are soulless automatons in rabid pursuit of an Ivy League degree.\r\n\r\nIn addition to implying that Palo Altans are overly success-focused, Richtel in particular insinuates that all of the suicides were caused solely by academic pressure. But each one was caused by a different set of circumstances, and each one should be treated as an individual tragedy. For us to achieve our goal of making schools a healthy and enriching environment for everyone, we need community members and outside observers alike to avoid stereotyping or making blanket statements.\r\n\r\nWe believe that people who blame certain groups for the current problems that exist within our school district — administration for making classes too difficult, parents for pressuring their children to succeed, students for their excessive competitiveness, etc. — are counterproductive. We appreciate that people have stepped forward to share their perspectives on mental health, and it’s nice to know that our community has a vested interest in this problem, but anyone who faults any particular group for this vastly convoluted issue is being unfair and certainly not helpful.\r\n\r\nThe serious problems within the education system should be recognized, but we also need to maintain a positive outlook to avoid a sense of hopelessness that is not conducive to productivity. We realize that the negative comments stem from frustration and sadness about student deaths, but we still want to encourage those who have made abrasive remarks to offer support and constructive criticism rather than tear others down.\r\n\r\nIn all our dialogue about the issue of student pressure, we often forget that educators in the community have very much responded to the community’s cries for change — <a href=\"http:\/\/palyvoice.com\/2015\/02\/01\/editorial-an-appreciation-of-teacher-support-at-paly\/\">easing homework loads<\/a> and <a href=\"http:\/\/palyvoice.com\/2014\/11\/04\/administration-offers-student-support-in-wake-of-gunn-student-death\/\">improving counseling services<\/a> are two of many changes being instated in the schools. We applaud the school board, educators, students and parents for coming together and enacting these measures. We know how difficult it is to make broad, sweeping reforms that are effective for the general populace.\r\n\r\nThere’s no panacea, no one ordinance, that will make all feelings of anxiety and despair disappear completely. But with constructive feedback from students, parents and educators, and a city-wide willingness to listen, we will take steps toward making the school environment more inviting and accommodating for everyone.\r\n\r\nWe Palo Altans are defined by more than just our flaws. We are lively, diverse, compassionate and innovative, and deserve to be viewed as such.\r\n\r\n<i>Editor's note: The author of \"Push, Don't Crush, the Students\" is <span style=\"line-height: normal; -webkit-text-size-adjust: auto; background-color: rgba(255, 255, 255, 0);\">Matt Richtel, not Matt Richter as previously stated.<\/span><\/i>","excerpt":"In the wake of tragedies in Palo Alto, our community and the national media have found various outlets to express their opinions on the schools’ failure to mitigate student stress. Even though it is easy to point to a single cause, we must avoid generalizations and maintain our willingness to improve through constructive feedback.","date":"2015-04-30 20:07:31","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/daraopinionlandscape.jpg","categories":["Editorial","Opinion","Spotlight"],"tags":{"42900":"#mh","42655":"best brightest — and saddest?","8751":"gunn","37655":"mental health","14163":"new york times","42658":"Palo Altans","8939":"palo alto","8944":"palo alto high school","30920":"palo alto online","32677":"palo alto school board","8977":"PAUSD","9004":"portia barrientos","42656":"push don't crush the students","42657":"rigorous classes","9131":"student stress","42654":"students pressure","41536":"the paly voice"}},{"id":102273,"title":"Achievement gap committee convenes, will consolidate solutions, seek input","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/achievement-gap-committee-convenes-will-consolidate-solutions-seek-input\/","content":"[caption id=\"attachment_103064\" align=\"alignnone\" width=\"556\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_20150428_194421.jpg\"><img class=\"wp-image-103064\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_20150428_194421.jpg\" alt=\"IMG_20150428_194421\" width=\"556\" height=\"417\" \/><\/a> PAUSD Supt. Max McGee presents a visual model for assessing the effectiveness of the solutions presented by members of the Minority Achievement and Talent Development committee Tuesday night at the district office. Photo by Charles Yu.[\/caption]\r\n\r\n<em>Editor's Note: The following story was corrected May 1 to read that the committee will be seeking community input after the final draft of the solutions are released and presented to the board and not before the board presentation.\r\n<\/em>\r\nA district-wide committee targeting the achievement gap for students of disadvantaged backgrounds in the Palo Alto Unified School District is refining proposed solutions before presenting to the Board of Education on May 26 and is preparing to seek community input on the finalized draft.\r\n\r\nFive subcommittees of the Minority Achievement and Talent Development committee delivered their recommendations during the committee’s convening meeting Tuesday night at the district office after identifying possible solutions to bridge the achievement divide for students of underrepresented minority and socioeconomically-challenged backgrounds. Each subcommittee was assigned to come up with solutions through looking at one of the following targeted focuses: best practices, data analysis, community and district resources, procuring panels and process design.\r\n\r\nA writing team comprised of members from the MATD committee is tasked with consolidating the recommendations and preparing a draft, according to district Communications Coordinator Tabitha Kappeler-Hurley. In addition to identifying the finalized solutions, the team will be gathering data on cost and implementation of each solution.\r\n\r\nAccording to a timeline by Palo Alto Unified School District Supt. Max McGee, the draft will continue to be revised until May 21 when the final report and solutions will be sent to the Board of Education. McGee said Tuesday that a select group of members from the full committee will present to the board on May 26. Kappeler-Hurley said that the finalized recommendations should be posted online by May 22, at latest.\r\n\r\nDuring Tuesday’s meeting, Kappeler-Hurley proposed several possible communication methods to get feedback on the drafted solutions from the community after the board presentation. Ideas included customizing types of outreach to target specific audiences; translating the report into five common secondary languages; sending out notifications through student, parent and staff portals like Schoology and Infinite Campus; and having district-hired summer interns create a video of the finalized recommendations. None of the ideas have been implemented as of yet, but Kappeler-Hurley said the committee will be trying to maximize outreach to the best of its ability.\r\n\r\n“Although I don’t have an exact timeline or set of specific strategies yet,  I will be working with the writing committee and Dr. McGee to reach all audiences in effective way,” Kappeler-Hurley wrote in an email to The Paly Voice.\r\n\r\nAccording to a letter sent out by McGee in December, the committee was assembled to “prepare a set of strategic, evidence-based recommendations that, when implemented, will enable the PAUSD community to assure underrepresented minority students and other students from disadvantaged circumstances have the necessary opportunities, conditions and supports that will empower and enable them to succeed as well as both realize and maximize their full intellectual, creative and social potential.\"\r\n\r\nAs the final meeting of the committee Tuesday night drew to a close, members expressed differing sentiments about the success of the MATD task force.\r\n\r\n\"We're ground breakers in closing the achievement gap and I think it's important that we appreciate that,\" committee member and Gunn High School sophomore Shannon Yang said.\r\n\r\nCommittee member and instructional aide Arcia Dorosti said, \"I'm cautious to celebrate anything because I don't think we've accomplished anything just yet until the outcomes change. We still have to see it through.”","excerpt":"A district-wide committee targeting the achievement gap for students of disadvantaged backgrounds in the Palo Alto Unified School District is refining proposed solutions before presenting to the Board of Education on May 26 and is preparing to seek community input on the finalized draft.","date":"2015-04-30 16:22:49","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_20150428_194421.jpg","categories":["News"],"tags":{"38291":"achievement gap","11799":"Board of Education","42689":"matd","42687":"max","42691":"May 26","25038":"McGee","42688":"minority achievement and talent development","8977":"PAUSD","42690":"tabitha kappeler-hurley"}},{"id":103023,"title":"Speaker on Japanese internment tonight","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/speaker-on-japanese-internment-tonight\/","content":"Satsuki Ina, the founder of The Children of the Camps Project, will speak about her experience as a Japanese-American during the end of World War II tonight at Palo Alto High School. Her documentary film, \"From a Silk Cocoon,\" will be screened at the event.\r\n\r\nIna was born in the Japanese internment camp Tule Lake, where she and her parents were held for four years. After graduating from University of California, Berkeley, and receiving her Ph.D from Oregon State University, Ina has spent over 20 years in the field of psychotherapy with a particular interest in community trauma.\r\n\r\n[caption id=\"attachment_103051\" align=\"alignleft\" width=\"288\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/guestspeakercroppped.jpg\"><img class=\"wp-image-103051\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/guestspeakercroppped.jpg\" alt=\"guestspeakercroppped\" width=\"288\" height=\"197\" \/><\/a> Dr. Satsuki Ina speaks to a journalism class about her continuous work in bringing racial injustice to public attention. \"I've dedicated my life and career to telling my story,\" Ina said. Photo by George Lu.[\/caption]\r\n\r\n\"I've dedicated my life and career to telling my story,\" Ina said. \"I'm trying to fix myself, and understand what happened to my family.\"\r\n\r\nIna's current social justice work includes speaking to families seeking asylum in the United States, who are currently held in prison camps near the southern border of the country.\r\n\r\n\"I want [people] to know [racial injustice] is not over,\" Ina said. \"It's still happening.\"\r\n\r\nIna will speak at 7 p.m. at Paly's MAC Atrium.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Satsuki Ina, the founder of The Children of the Camps Project, will speak about her experience as a Japanese-American during the end of World War II tonight.","date":"2015-04-30 14:34:23","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/guestspeakercroppped.jpg","categories":["News","Spotlight"],"tags":{"42659":"japanese","34200":"social justice","9115":"speaker"}},{"id":102956,"title":"Preview: &#8220;Fight of the Centuries&#8221; choir concert","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/preview-fight-of-the-centuries-choir-concert\/","content":"[caption id=\"attachment_103038\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_0537.jpg\"><img class=\"size-full wp-image-103038\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_0537.jpg\" alt=\"Vikapella (Georgina Wu, Jenny Xin, Diana Cowie, Abira Berezin, Ryan Jamison, Will Kast), sing on the Quad for Not in Our Schools Week. Although the acapella group will not perform as a group at the concert, the singers will still participate with the rest of the choir. Xin will be one of the soloists featured at the concert. Photo by Liana Pickrell.\" width=\"600\" height=\"400\" \/><\/a> Vikapella (Georgina Wu, Jenny Xin, Diana Cowie, Abira Berezin, Ryan Jamison, Will Kast), sing on the Quad for Not in Our Schools Week. Although the acapella group will not perform as a group at the \"Fight of the Centuries\" concert this Friday, the singers will still participate with the rest of the choir. Xin will be one of the soloists featured at the concert. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe Palo Alto High School Choirs perform their spring concert, “Fight of the Centuries,” on Friday night at the Grace Lutheran Church in Palo Alto.\r\n\r\nAll of the choirs (Concert Choir, Beginning Choir, Madrigals and the Spectrum Singers) will be performing at the concert, which features classical music and centers around the works of Bach and Mozart. According to Paly choir teacher Michael Najar, the choirs will perform Bach’s Cantatas and Mozart’s \"Vesperae solennes de confessore.\"\r\n\r\n“Bach and Mozart are the two greatest composers that one would think of when they would think of classical music,” Najar said. “I’m really excited about pitting these two great composers against each other.”\r\n\r\nThe Paly Choirs will not be the only ones participating in the concert, according to Najar.\r\n\r\n“We’re doing it with a hired orchestra,” Najar said. “Some soloists from Stanford are going to join our own soloists from Paly Choir, so it’s a really remarkable concert.”\r\n\r\nJunior Clare Kemmerer, a member of Paly choir who will be singing at the concert, says that the choirs have been working to get ready for the concert.\r\n\r\n“I think that by the time we perform on Friday, we will be even better,” Kemmerer said. “It has been an educational experience to sing really big classical pieces. We’ve definitely been challenged by it.”\r\n\r\nKemmerer also says the concert is made unique by the challenging and extremely well-known classical music, making it more difficult to sing.\r\n\r\n“We do classical pieces but not to the extent of Bach and Mozart,” Kemmerer said. \"Bach and Mozart are up there in how hard they are to sing, because largely they are not just choral pieces. It’s a different technique of singing. We’ve never done a concert that is purely Bach and Mozart.”\r\n\r\nNajar says that he looking forward to the upcoming concert.\r\n\r\n“We have an outstanding choir,” Najar said. “We always challenge ourselves to do great music because we have incredible students who are really well trained.”\r\n\r\nTickets can be bought at the door for $10 for adults and $5 for seniors, and admission is free for students and children. The show will take place from 7:30 p.m. to 9 p.m. Friday at the <a href=\"http:\/\/palychoirs.com\/events\/locations\/grace-lutheran-church\/\">Grace Lutheran Church<\/a>.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School choirs will be performing a concert called “Fight of the Centuries” at 7:30 p.m. this Friday at the Grace Lutheran Church.","date":"2015-04-30 14:32:39","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_05371.jpg","categories":["A&amp;E Section Spotlight","News"],"tags":{"42428":"bach","42426":"choir concert","42427":"fight of the centuries","42430":"grace lutheran church","42429":"mozart","8906":"music","30526":"najar"}}]