[{"id":80582,"title":"Slideshow: Girls&#8217; soccer shuts out Gunn","permalink":"http:\/\/palyvoice.com\/2015\/01\/05\/slideshow-girls-soccer-shuts-out-gunn-2\/","content":"<p>The Palo Alto High School girls' soccer team (6-0) shut out cross-town rival Gunn High School (2-2-1), 6-0, in Saturday's game at Gunn.<\/p>\r\n<p>Paly pulled ahead in the first half with four goals and solidly finished with a final two goals scored in the second half. Midfielder juniors Jacey Pederson and Nika Woodfill both scored two goals and midfielders senior Katie Foug and sophomore Tess Preising scored one each.<\/p>\r\n<p>The Vikings will next take on Los Altos High School at 3:30 p.m. on Jan. 8 at Los Altos.<\/p>\r\n<p>[slideshow post_id=80582]<\/p>\r\n","excerpt":"The Palo Alto High School girls' soccer team (6-0) shut out cross-town rival Gunn (2-2-1), 6-0, in Saturday's game at Gunn High School.","date":"2015-01-05 10:54:37","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_4723.jpg","categories":["Sports","Spotlight"],"tags":{"10198":"girls soccer","9107":"slideshow","9110":"Soccer"}},{"id":80603,"title":"Gap year fair at 1 p.m. on Jan. 24 at Los Altos High School","permalink":"http:\/\/palyvoice.com\/2015\/01\/04\/gap-year-fair-at-1-p-m-on-jan-24-at-los-altos-high-school\/","content":"","excerpt":"","date":"2015-01-04 11:37:33","author":"Lizzie Chun","categories":["Ticker"],"tags":{"29216":"college fair","34449":"gap year","10615":"los altos high school"}},{"id":80504,"title":"Liveblog: Girls&#8217; basketball at Menlo-Atherton","permalink":"http:\/\/palyvoice.com\/2015\/01\/01\/liveblog-girls-basketball-at-menlo-atherton\/","content":"<em>Check back at 2:30 p.m. this Saturday, Jan. 3 as the Palo Alto Girls' basketball team (10-1, 0-0) looks to extend its current 10-game winning streak as it takes on Menlo-Atherton High School (6-4, 0-0) on the road. The Vikings conclude their preseason with this highly anticipated matchup, and will tip-off their regular season on Wednesday, Jan. 7. <\/em>\r\n\r\n[liveblog]","excerpt":"Check back at 2:30 p.m. this Saturday, Jan. 3 as the Palo Alto Girls' basketball team (10-1, 0-0) looks to extend its current 10-game winning streak as it takes on Menlo-Atherton High School (6-4, 0-0) on the road. ","date":"2015-01-01 22:36:29","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_98301.jpg","categories":["Sports"],"tags":{"10098":"basketball","10306":"menlo-atherton","8953":"paly","34447":"preseason","34446":"winning streak"}},{"id":80448,"title":"PAUSD reaches settlement agreement in construction lawsuit","permalink":"http:\/\/palyvoice.com\/2014\/12\/21\/pausd-reaches-settlement-agreement-in-construction-lawsuit\/","content":"The Palo Alto Unified School District has agreed to pay $540,000 to settle a $3.8 million lawsuit regarding a breach of contract during the construction of the Media Arts Center and the Math and Social Studies Building at Palo Alto High School.\r\n\r\nThe cost of construction for the two buildings came in under budget even after the settlement, according to a <a href=\"http:\/\/news.pausd.org\/post.cfm\/pausd-announces-settlement-in-construction-law-suit\">press release<\/a> from PAUSD.\r\n\r\n\"This settlement puts an end to the legal process and attorney fees,\" Supt. Max McGee said in the press release. \"Even after paying the settlement amount, this project came in under budget, and the remaining amount can be put to further improvements on the campus.\"\r\n\r\nAssistant Principal Jerry Berkson is delighted by the news as it provides money to be spent on future projects to upgrade the campus.\r\n\r\n\"It's good news because we had to set aside $3.5 million just in case we lost the whole thing [lawsuit],\" Berkson said. \"With us only having to pay around $500,000, all the money comes back, and we can put it towards other projects.\"\r\n\r\nThe specific use of the left over money has yet to be decided on. However, it will be used toward improving the Paly campus as a part of the Strong Schools Bond Program according to Berkson.\r\n\r\n\"There's a lot of decision-making going on right now,\" Berkson said. \"We have the new gym coming up, the library project, the science project and we have several smaller projects that would be great with that money. Once the big projects are finished, we may also do some internal construction in some of the buildings. But down the line, any of those would have to be voted on to spend the money.\"\r\n\r\nThe lawsuit filed by Taisei Construction Corporation was in the amount of $3,793,000 against PAUSD, Deem Lewis McKinley Architecture and the construction manager Gilbane. The settlement has been reached by all parties with payments from each, according to the press release.","excerpt":"The Palo Alto Unified School District has agreed to pay $540,000 to settle a $3.5 million lawsuit regarding a breach of contract during the construction of two new Palo Alto High School buildings.","date":"2014-12-21 21:56:23","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/Screen-Shot-2014-12-19-at-9.38.14-PM.png","categories":["News","Spotlight"],"tags":{"34444":"$","34371":"3.5","34368":"5400000","34367":"buildings","8616":"construction","34372":"DLM","34365":"dollars","8690":"facilities","34362":"lawsuit","18366":"mac","34428":"math building","34369":"million","34370":"millions","8893":"money","8912":"new","8944":"palo alto high school","8977":"PAUSD","9069":"School Board","34363":"settlement","34366":"Taisei"}},{"id":80465,"title":"Paly construction persists through rain","permalink":"http:\/\/palyvoice.com\/2014\/12\/19\/paly-construction-persists-through-rain\/","content":"With heavy winter showers pelting Palo Alto, the Palo Alto High School Performing Arts Center and gym construction are still operating on schedule, according to the school's administration.\r\n\r\nAccording to <a href=\"http:\/\/www.weather.com\/forecast\/regional\/news\/california-rain-flood-threat-drought-relief-middec2014\">weather.com<\/a>, last week’s shower on Thursday was the most rain that Palo Alto has received since 2008.\r\n\r\nAssistant Principal Jerry Berkson said the PAC is still on schedule to finish at its predicted March 2016 due date, despite the harsh weather.\r\n\r\n“Within the game plan of construction, they consider that,” Berkson said. “If they say construction is going to take six months, they know that they’ll lose some days.”\r\n\r\nBerkson said that there will be no future repercussions on construction of the PAC barring a consistent couple months of showers.","excerpt":"Construction continues through bad weather.","date":"2014-12-19 11:45:15","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo-41.jpg","categories":["News"],"tags":{"8616":"construction","8690":"facilities","8753":"gym","34383":"pac","8944":"palo alto high school","34382":"performing arts center","9027":"rain","31353":"weather"}},{"id":80445,"title":"Paly to start journalism archive project, looking for missing Campanile editions","permalink":"http:\/\/palyvoice.com\/2014\/12\/19\/paly-to-start-journalism-archive-project-looking-for-missing-campanile-editions\/","content":"As the start of the Palo Alto High School journalism program’s spring archiving project rapidly approaches, organizers are seeking help from alumni to donate missing copies of The Campanile newspaper.\r\n\r\nAccording to Paly's annual student yearbook Madrono , The Campanile began publishing school papers in 1918. However, the school does not have any copies that were published prior to 1923, according to Librarian Rachel Kellerman, who is directing the archiving project.\r\n\r\nThe school is also missing The Campanile publications from 1928 and a significant chunk from 1967 to 1979, Kellerman said.\r\n\r\nThe ambitious project involves two stages: One, assembling and preserving print copies of all of Paly’s rich print media history; and two, making that history available in fully searchable documents online along with the journalism program’s existing digital media archives.\r\n\r\nThe Media Arts Boosters purchased a $9,000 scanner using funds from the Brin-Wojcicki Foundation, to help facilitate the project of scanning every print publication produced by Paly journalism in order to preserve its history.\r\n\r\nKellerman said she is especially excited because the project will not only preserve the decaying articles hidden in the back of the library, but also add perspective on the happenings at the school during each different time period.\r\n\r\n“For the school, all the stories that were written have a focus about the school,” Kellerman said. “World events like World War I were going on, and the journalism program shed a light on what was going on at Paly [at the time]. It gives our students perspective on their community and how it responded to world events.”\r\n\r\nKellerman asks that anyone owning these missing copies to come forward and help preserve the history of Paly journalism.\r\n\r\nShe’s also looking for community volunteers to work with paid and student staff on the scanning project in the Journalism Library of the new Media Arts Center.","excerpt":"As the date of the Paly Journalism archiving project approaches, there are missing editions of The Campanile newspaper that would be appreciated if found.","date":"2014-12-19 11:40:53","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo-6.jpg","categories":["News"],"tags":{"34378":"archive","21439":"Kellerman","8848":"Library","8862":"Madrono","8944":"palo alto high school","34379":"paly journalism","29387":"paul kandell","32714":"the campanile"}},{"id":80419,"title":"Seniors serve snacks at lunch to help lower student stress","permalink":"http:\/\/palyvoice.com\/2014\/12\/16\/seniors-serve-snacks-at-lunch-to-help-lower-student-stress\/","content":"[caption id=\"attachment_80420\" align=\"alignright\" width=\"183\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0987.jpg\"><img class=\" wp-image-80420\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0987.jpg\" alt=\"Seniors Maria Paula Coronado and Chloe Fishman pose in front of Ramirez and Beeson while they served snacks at lunch today. Photo by Caitlin Duff Brown.\" width=\"183\" height=\"324\" \/><\/a> Seniors Maria Paula Coronado and Chloe Fishman pose in front of Ramirez and Beeson while they served snacks at lunch today. Photo by Caitlin Duff Brown.[\/caption]\r\n\r\nTwo Palo Alto High School seniors are kicking off holiday spirit by giving out sweet treats at lunch today in front of the Paly Media Arts Center.\r\n\r\n“To help you guys get through finals week and this cold weather, [senior] Nick [Beeson] and I will be making cookies and hot cider for you guys,” senior Alex Ramirez wrote on the Class of 2015 Facebook page. “We hope to see you there, and we also hope to make this week at least a little bit easier on you all because you deserve it.”\r\n\r\nAfter Beeson formed the idea to help take out people’s stress level during finals week, Ramirez and Beeson brainstormed a list of things they could bring and settled on apple cider and cookies, according to Ramirez.\r\n\r\nThe turnout of today’s event was satisfying, according to Ramirez.\r\n\r\n“The turnout today was close to perfect if you go by how much food we brought and how much was left over,” Ramirez said. “We made around 200 cookies and bought 10 bottles of cider from Trader Joes. In the end, we had the cookies disappear as we were heading to class, and we had half a bottle of cider left over.”\r\n\r\nStudents can expect events like today’s in the future.\r\n\r\n“We are hoping to do this sometime in the near future – perhaps later this week, if we have the time,” Ramirez said. “But people should look forward to food from us next semester as well.”\r\n\r\nMany students are appreciative of Beeson and Ramirez’s actions.\r\n\r\n“It was cool that they were giving out cookies,” junior Ashley Crichton said. “I thought it was really nice of them, and it seemed like it would help people destress a lot.”","excerpt":"Two Palo Alto High School seniors spread the holiday spirit by giving out sweet treats at lunch today in front of the Palo Alto High School Media Arts Center.","date":"2014-12-16 13:59:17","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_09871.jpg","categories":["News"],"tags":{"34360":"alex ramirez","34358":"apple cider","14865":"cookies","34357":"finals week","34361":"nick beeson","34359":"random acts of kindness","9128":"Stress"}},{"id":80184,"title":"Trendy Tuesday: Finals fashion","permalink":"http:\/\/palyvoice.com\/2014\/12\/16\/trendy-tuesday-finals-fashion\/","content":"<p style=\"text-align: left;\">With finals right around the corner, we bet you haven't been thinking much about your fashion choices for the week. But you should be. Should you look stylish? Should you get directly out of bed and go to school? Do you want your peers to see you like that? Do you want your peers to see you at all?<\/p>\r\n<p style=\"text-align: left;\">Disclaimer: we do not know how to make you invisible to your peers, but we can help you decide how to dress for finals. Do not fear, Voice is here.<\/p>\r\n<p style=\"text-align: left;\"><strong>Option 1: Jump out of bed and go directly to school.<\/strong><\/p>\r\n<p style=\"text-align: left;\">You might be thinking, “Haven’t I put enough effort into studying - why must I try with my style?” If you are feeling lazy or if you need a break after staying up studying until 4 a.m., here are some tips for you.<\/p>\r\n<p style=\"text-align: left;\">Feel free to take the literal approach and get directly out of bed in your pajamas, put on your backpack and head to school. Don’t bother brushing your hair or looking in the mirror; just take time to eat breakfast and mentally prepare yourself for the day. We especially recommend this comfortable style for Wednesday because that is <a href=\"https:\/\/www.facebook.com\/events\/310987829091079\/?ref=br_tf\">ASB’s official pajama day<\/a> for the student body.<\/p>\r\n<p style=\"text-align: left;\">“Being comfortable gets you in the right state of mind when you’re taking your finals,” senior Clara Harrington said. “You’re not too worried about how your clothes feel.”<\/p>\r\n\r\n\r\n[caption id=\"attachment_80194\" align=\"alignleft\" width=\"328\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0383.jpg\"><img class=\"wp-image-80194\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0383.jpg\" alt=\"IMG_0383\" width=\"328\" height=\"228\" \/><\/a> Senior Clara Harrington recommends polka dotted fuzzy high socks with purple Tevas for finals fashion. According to Harrington, this makes for a comfortable outfit, therefore allowing her to fully focus on her tests with no added distractions. Photo by Molly Fogarty.[\/caption]\r\n<p style=\"text-align: left;\">Other outfits include your largest pair of sweats, a messy bun (here are some styling <a href=\"https:\/\/www.youtube.com\/watch?v=y8dI6PSpOXE\">tips<\/a>), high fuzzy socks, and Ugg slippers or Tevas, as often acclaimed Paly fashion icon Harrington recommends.<\/p>\r\n<p style=\"text-align: left;\">“Wearing some open-toed shoes stops your feet from getting too warm if you’re stressed,” Harrington said. “Finals are a time where you should be focusing on your test and getting the best grades possible rather than focusing on your outfits.”<\/p>\r\n<p style=\"text-align: left;\">To match Harrington’s style, you can get fuzzy socks at your local CVS or Target, and you can find a nice large sweatshirt for a bargain at the Goodwill, sometimes with a funny saying on it, according to Harrington.<\/p>\r\n<p style=\"text-align: left;\">“My sweatshirt says, ‘This is what a great fisherman looks like,’” Harrington said.<\/p>\r\n<strong>Option 2: Dress for success.<\/strong>\r\n\r\n“Dress for Success” is the saying that many students plan to follow in their finals outfits.\r\n\r\nJunior Bryce Rockwell tried this style out last year and found it to beneficially impact her scores and confidence.\r\n\r\n“It just feels good to dress well and to feel confident about yourself,” Rockwell said.\r\n\r\n[caption id=\"attachment_80188\" align=\"alignright\" width=\"255\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0354.jpg\"><img class=\"wp-image-80188\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0354.jpg\" alt=\"IMG_0354\" width=\"255\" height=\"388\" \/><\/a> Junior Bryce Rockwell dresses in high-waisted jeans, a long sleeve shirt, scarf, necklace and furry booties for her \"Dress for Success\" finals fashion look. According to Rockwell, dressing fashionably provides her with confidence to ace her tests. Photo by Molly Fogarty.[\/caption]\r\n\r\nRockwell plans on wearing high-waisted skinny jeans, a tight long sleeve shirt, a hoodie, booties with fur on them, a beanie and a scarf.\r\n\r\nStrut into your testing center by wearing the nicest outfit in your closet — not only will you “dress for success” but also “to impress.”\r\n\r\n<strong>Option 3: Dress exactly as you would on a regular school day.<\/strong>\r\n\r\nSome students fear that changing their typical routine could potentially mess up their scores.\r\n\r\n“I don’t dress any different for finals then I would for a typical day at school,” junior Griffin Carlson said. “I live my life in a routine and try to not veer from it. … I don’t want to deal with any unknown factors that come with it.”\r\n\r\nFor this style, change absolutely nothing. Prepare for the day exactly as you typically would and dress the same as usual.\r\n\r\n<strong>Option 4: Get in the holiday spirit by wearing holiday outfits.<\/strong>\r\n\r\nWe know that the one thing getting you through this week is the fact that the holidays are right around the corner. Why not get in the spirit a little early? It’s time to pull out your ugly <a href=\"http:\/\/www.kohls.com\/catalog\/christmas-sweaters-tops-clothing.jsp?pfx=pfx_google_roi&amp;cid=aagsweaters&amp;CN=4294735582+4294719467+4294719805+4294719810&amp;kwid=p1592230131&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_term=Christmas%20sweaters&amp;utm_campaign=%7BCampaignName%7D&amp;UTM_Adgroupid=58700000188489479&amp;gclid=Cj0KEQiAzb-kBRDe49qh9s75m-wBEiQATOxgwXfyfKHIb17jm_hwkUS8MqhyVNqJFHbcj14A2pYcszgaAqC88P8HAQ&amp;gclsrc=aw.ds\">Christmas<\/a> and <a href=\"http:\/\/www.wondercostumes.com\/ugly-hanukkah-sweater-mens-costume-ptuhsmc~18.html?gclid=CjwKEAiAh7WkBRCQj-_zwZvk52ISJADj7z8CJ529FvimEGcUmwbxuMTY2MMb-HLz8MXFEnCT7pnMHhoCferw_wcB\">Hannukah<\/a> sweaters and rock them during finals week.","excerpt":"With finals right around the corner, we know you’re thinking hard about your fashion choices for the week. Do not fear, Voice is here.","date":"2014-12-16 13:35:36","author":"Molly Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0383.jpg","categories":["Opinion"],"tags":{"34289":"Bryce rockwell","34288":"Clara Harrington","8697":"fashion","10172":"finals","34287":"finals fashion","9133":"style","29736":"style sunday","34286":"trendy tuesday"}},{"id":80223,"title":"Get your holiday Netflix fix","permalink":"http:\/\/palyvoice.com\/2014\/12\/16\/get-your-holiday-netflix-fix\/","content":"What is better than curling up in front of the fire with hot cocoa and Netflix over winter break? Nothing. The question now is what movie or TV show to watch. Don’t worry. Here are some ideas based off some of our favorites.\r\n\r\n<b>Movies<\/b>\r\n\r\n[caption id=\"attachment_80321\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/movies.jpg.jpg\"><img class=\"wp-image-80321 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/movies.jpg.jpg\" alt=\"movies.jpg\" width=\"600\" height=\"308\" \/><\/a> These are photos from our five movie recommendations- \"Titanic,\" \"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"The Hunger Games,\" \"Safe Haven\" and \"Silver Linings Playbook.\" Photos courtesy of Paramount Pictures, Disney Enterprises, Lions Gate Entertainment, Relativity Media and The Weinstein Company.[\/caption]\r\n\r\n1. \"The Hunger Games\" (2012) and \"Catching Fire\" (2013)\r\n\r\nIf watching the third installment in the Hunger Games series, “Mockingjay – Part 1,” this past month is making you nostalgic for where it all began, you’re in luck. Both “The Hunger Games” and “Catching Fire” are now available online. You can travel back into the arenas with Katniss and relive all of her adventures. Her kick-butt attitude combined with deep passion will make her feel like the best-friend-you-never-had. The emotional, action-driven storyline will keep you on your seat, perfect for a movie night with friends or family (or honestly, if we’re being real here, a movie night with yourself). Read a review <a href=\"http:\/\/palyvoice.com\/2013\/11\/21\/review-is-the-hunger-games-really-catching-fire\/\">here<\/a>.\r\n\r\n<i><i><\/i><\/i>2. \"Silver Linings Playbook\" (2012)\r\n\r\nIf you didn’t get enough of Jennifer Lawrence from religiously watching \"The Hunger Games\" and \"Catching Fire\" from our first suggestion, this will be the perfect fix. A troubled Tiffany meets up with the equally messed up Pat, played by the easy-on-the-eyes Bradley Cooper, and embarks on a slightly off-beat journey to recovery. It’s intense at times with a rough vocabulary and raw emotions. An unconventional friendship tip-toeing around a relationship will be a breath of fresh air for anyone who’s tired of the typical Hollywood romance. Read a review <a href=\"http:\/\/palyvoice.com\/2013\/02\/19\/review-silver-linings-playbook-deserves-gold\/\">here<\/a>.\r\n\r\n3. \"Safe Haven\" (2013)\r\n\r\nSometimes it’s just a Nicholas Sparks kind of night. Indulge yourself in Katie (Julianne Hough) and Alex’s (Josh Duhamel) peaceful life in coastal North Carolina. Coming out of an abusive relationship, Katie is reluctant to fall for widowed Alex, yet she adores his two young children, which brings them closer. All seems perfect until secrets from the past are unearthed. Following the classic Nicholas Sparks storyline with many twists and turns, \"Safe Haven\" will surely hold your attention and warm your heart.\r\n\r\n4. \"Titanic\" (1997)\r\n\r\nAlthough this movie predates students at Palo Alto High School, it is a perfect classic for the holiday season. Watch working-class Jack (Leonardo DiCaprio) fall for aristocrat Rose (Kate Winslet) in the fictionalized story revolving around the R.M.S. Titanic tragedy in 1912. Watch Jack and Rose evade Rose’s judgemental parents and evacuate the ship together. Although we all know that Jack dies from hypothermia while Rose survives by lying on a door (by the way Rose, there was totally room for two – scoot over), \"Titanic,\" whether you have watched it before or not, is the perfect catharsis for crying and eating ice cream on the couch after finals.\r\n\r\n5. \"Pirates of the Caribbean: The Curse of the Black Pearl\" (2003)\r\n\r\nWatching \"Black Pearl\" will bring you back to the beginning of this amazing series by reminding us why this franchise is so fantastic: Johnny Depp as Captain Jack Sparrow is perfect, and the soundtrack is flawless (seriously, adding in that music to any situation automatically makes it 100 percent cooler). Following along with Sparrow on his adventures will keep you thoroughly entertained with his classic one-liners, swagger and winding exploits. You may find yourself developing a soft spot for this infamous pirate, even if you’re really supposed to be pulling for Elizabeth (Keira Knightley) and Will (Orlando Bloom). While their romance is a nice side plot, Jack Sparrow is the true main act. It’s perfect for a throwback Thursday over break and to get you pumped for the release of the next installment of the series, \"Dead Men Tell No Tales,\" due to come out in 2017 (don’t worry if that sounds like forever, there are three other \"Pirates\" movies to keep you satisfied in between).\r\n\r\n<b>T.V. Shows<\/b>\r\n\r\n[caption id=\"attachment_80381\" align=\"aligncenter\" width=\"767\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/netflixcollage.jpg.jpg\"><img class=\"wp-image-80381\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/netflixcollage.jpg.jpg\" alt=\"netflixcollage.jpg\" width=\"767\" height=\"284\" \/><\/a> Photos from our five T.V. recommendations – \"Friends,\" \"How I Met Your Mother,\" \"Gossip Girl,\" \"Parks and Recreation\" and \"The Office.\" Photos courtesy of NBCUniversal, CBS Broadcasting, NBC and CW Network.[\/caption]\r\n\r\n1. \"Friends\" (1994-2004)\r\n\r\nPrepare yourself. On Jan. 1, all 10 seasons of the iconic '90s show, \"Friends,\" will be on Netflix. \"Friends\" is a sitcom revolving around six –  you guessed it – friends experiencing their first years of adulthood in New York. Between Ross (David Schwimmer) and Rachel’s (Jennifer Aniston) famous on-and-off relationship, flashbacks to Monica’s (Courteney Cox) not-so-glamorous high school years, Joey’s (Matt LeBlanc) comic relief, Chandler’s (Matthew Perry) quirkiness and Phoebe’s (Lisa Kudrow) singing, \"Friends\" will keep you laughing through winter break. Even if you have seen every single episode, indulge yourself by watching your favorite episodes or by watching 238.\r\n\r\n2.  \"How I Met Your Mother\" (2005-2014)\r\n\r\nIf you’re looking for a modern comedy series, \"How I Met Your Mother\" is the show for you. Also set in New York, the series follows bachelor Ted Mosby (Josh Radnor) through flashbacks as he recounts to his children in 2030 how he met their mother. Marshall (Jason Segel) and Lily (Alyson Hannigan), Ted’s best friends from college, unconditionally support him as they go from dating to married. Throughout the entire series Ted juggles his complicated relationship with TV news anchor Robin (Cobie Smulders) and often fights with his womanizing “best bro,” Barney (Neil Patrick Harris). After the truly legendary finale that aired this March, all 77 hours (208 episodes) are available for your viewing pleasure.\r\n\r\n3. \"Gossip Girl\" (2007-2012)\r\n\r\nLook no further if you want to enter the lavish secret world of the Manhattan Upper East Side. \"Gossip Girl\" follows Selena (Blake Lively), Blair (Leighton Meester), Chuck (Ed Westwick), Nate (Chace Crawford) and Dan (Penn Badgley) from their last years of high school and through college as they navigate their complicated lives filled with money, lies and betrayal. Despite their internal group drama, they are the victims of an internet blogger, Gossip Girl. Ultimately, after six seasons, Gossip Girl is revealed. Voiced by Kristen Bell, each episode begins with Gossip Girl’s famous slogan, “Gossip Girl here. Your one and only source into the scandalous lives of Manhattan's elite. And who am I? That's one secret I'll never tell. You know you love me. xoxo, Gossip Girl.”\r\n\r\n4. \"The Office\" (2005-2013)\r\n\r\nThe shenanigans of \"The Office\" could lift up anyone’s spirit. Even though it ended nearly two years ago, you can still relive all of the glory days on Netflix over this holiday break. Steve Carell and Rainn Wilson will keep you laughing as you go through the mockumentary of \"The Office<i>.\"<\/i> It has something for everyone, with a variety of pranks and relationships (doesn’t everyone just want to be like Jim and Pam). Perfect as an escape this break from boredom or any awkward relatives, you won’t be able to stop smiling watching \"The Office.\"\r\n\r\n5. \"Parks and Recreation\" (2009-present)\r\n\r\nCurrently finishing up its final season, now is the perfect time to marathon all six seasons in anticipation for the last one. A rock-solid comedic cast will have you falling in love with Pawnee and the affectionate Leslie Knope (Amy Poehler). Similar in style to \"The Office,\" featuring deadpan humor from cast favorites April Ludgate (Aubrey Plaza) and Ron Swanson (Nick Offerman). If you can’t get enough of Aubrey Plaza, she also stars in the Grumpy Cat movie, \"Grump Cat's Worst Christmas Ever,\" which came out late last month. Watching this TV show will make you want to have a friendship like Leslie and Ann (Rashida Jones), make you fall in love with the opposites-attract-romance of April and Andy Dwyer (Chris Pratt), and make you want to treat yo’ self like Tom Haverford (Aziz Ansari) and Donna Meagle (Retta).\r\n\r\n&nbsp;","excerpt":"What is better than curling up in front of the fire with hot cocoa and Netflix over winter break? Nothing. The question now is what movie to watch or TV show to marathon. Don’t worry – here are some ideas.\r\n","date":"2014-12-16 13:35:15","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/movies.jpg.jpg","categories":["Entertainment","Spotlight"],"tags":{"8584":"christmas","32534":"holiday","8901":"movies","34267":"netflix","34268":"tv shows"}},{"id":80087,"title":"Paly parent-owned olive oil company wins food award","permalink":"http:\/\/palyvoice.com\/2014\/12\/16\/paly-parent-owned-olive-oil-company-wins-food-award\/","content":"<em>\"Olive\" you should hear the story behind this parent-owned, award-winning olive oil business.<\/em>\r\n\r\nCloud 9 Orchard, an olive oil company owned by a Palo Alto High School parent, is a 2015 Good Food Awards finalist.\r\n\r\nThe Good Food Awards honor American food producers and farmers who create high quality products using their own ingredients.\r\n\r\nThe orchard, owned by Paly parent May Chevallier, has already been awarded Best of Class and Gold Medal in the 2014 Central Coast Olive Oil Competition for its French and Italian Varietals, according to the Cloud 9 Olive Oil <a href=\"http:\/\/www.cloud9orchard.com\/\">website<\/a>.\r\n\r\nChevallier is the mother of Paly seniors Isabelle and Claire Chevallier. Her olive orchard is seven years old.\r\n\r\n[caption id=\"attachment_80088\" align=\"alignleft\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/olive-oil-long.jpg\"><img class=\"wp-image-80088\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/olive-oil-long.jpg\" alt=\"Bottles of olive oil display Chevallier's numerous accolades. Cloud 9 Olive Oil has won several awards in the past, most recently placing in the 2014 Central Coast Olive Oil Competition. Photo by Maya McNealis.\" width=\"350\" height=\"467\" \/><\/a> Bottles of olive oil display Chevallier's numerous accolades. Cloud 9 Olive Oil has won several awards in the past, most recently placing in the 2014 Central Coast Olive Oil Competition. Photo by Maya McNealis.[\/caption]\r\n\r\n“I started it from scratch, with zero trees and zero water,\" Chevallier said. \"It’s in South Monterey County. Right now, I have over 10,000 trees.\"\r\n\r\nChevallier was originally inspired to start her company by the lack of high quality olive oil in local stores.\r\n\r\n“There’s no good olive oil around,\" Chevallier said. \"About 70 percent of the oil sold here is fake oil or adulterated oil, in every shop.\"\r\n\r\nShe learned how to make extra virgin olive oil from courses and seminars offered at the University of California Davis Extension school.\r\n\r\n“They [UC Davis Extension] wanted to and have succeeded in making California the biggest olive-growing state in the U.S.,” Chevallier said. “I attended a lot of different workshops. Now, I belong to two councils: one up in Berkeley and one down in Paso Robles. We exchange information on what to do about different problems such as frost and fruit flies.\"\r\n\r\nCloud 9 Olive Oil is available in many local stores, including Country Sun in Palo Alto, Draeger’s Market in Menlo Park and Milk Pail Market in Mountain View. However, Chevallier said she chose to sell her products in these locations simply because they are close to home.\r\n\r\n“Because the kids are in school, I needed to stick around,” Chevallier said.\r\n\r\nSo far, Chevallier has limited the growth of her business to the Bay Area to accommodate her daughters' schooling, developing a loyal customer base in the Paly community. She sold her oil at the Holiday Boutique last Wednesday to help support Paly Sports Boosters. Her daughter Claire is now in her fourth season of Paly lacrosse.\r\n\r\n[caption id=\"attachment_80175\" align=\"alignright\" width=\"380\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1758.jpg\"><img class=\"wp-image-80175\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1758.jpg\" alt=\"Claire and May Chevallier stand next to Cloud 9 Orchard's table at the Holiday Boutique. The boutique featured many local crafts companies, and a portion of all sales went to Paly Sports Boosters. Photo by Maya McNealis.\" width=\"380\" height=\"285\" \/><\/a> Claire and May Chevallier stand next to Cloud 9 Orchard's table at the Holiday Boutique. The boutique featured many local crafts companies, and a portion of all sales went to Paly Sports Boosters. Photo by Maya McNealis.[\/caption]\r\n\r\n“I now have some regular customers in the school district, and it [the Holiday Boutique] helps to raise money for the Sports Boosters, which is very important because they need a lot of funds,” Chevallier said.\r\n\r\nChevallier hopes to grow her business starting next year.\r\n\r\n“When the girls go to college, I can expand further,” Chevallier said. “I’m not going to sit at home in an empty nest,” she added, laughing.\r\n\r\nChevallier's Italian Varietal oil was also a top scorer in the Blind Tasting amongst over 1,400 entries, according to the company’s <a href=\"http:\/\/www.goodfoodawards.org\/2015-finalists\/\">website<\/a>. The winner of the 2015 Good Food Awards olive oil competition will be announced on Jan. 8, 2015 in a ceremony at the San Francisco Ferry Building.","excerpt":"\"Olive\" you should hear the story behind this parent-owned, award-winning olive oil business.","date":"2014-12-16 13:19:47","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/olive-oil.jpg","categories":["Features"],"tags":{"34127":"2015 Good Food Awards","34130":"Claire Chevallier","34132":"Cloud 9 Orchard","34131":"Isabelle Chevallier","34129":"May Chevallier","34128":"olive oil","34225":"sports boosters"}}]