[{"id":103765,"title":"Review: One Acts demonstrate variety, versatility of Theatre department","permalink":"http:\/\/palyvoice.com\/2015\/05\/09\/review-one-acts-demonstrate-variety-versatility-of-theatre-department\/","content":"[caption width=\"581\" id=\"attachment_103888\" align=\"aligncenter\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11204437_707448916068103_6054940195031002152_n.jpg\"><img class=\"wp-image-103888\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11204437_707448916068103_6054940195031002152_n.jpg\" alt=\"A balcony shot of Paly Theatre's adaptation of &quot;No Exit,&quot; directed by Sabrina Sonner. &quot; Photo by Dalia Van Zyll\" width=\"581\" height=\"434\"><\/a> A balcony shot of Paly Theatre's adaptation of \"No Exit,\" directed by Sabrina Sonner, featuring senior Guive Assadi, junior Clara Baker and sophomore Claire Eberhart. \"No Exit\" is the only drama featured in \"One Acts.\" Photo by Dalia Van Zyll.[\/caption]After two successful performances, the Palo Alto High School Theatre department's \"One Acts\" has its final performance at 7:30 p.m. tonight in the Haymarket Theatre. The showcase highlights versatile student talent in acting, directing and playwriting and the diverse lineup of plays presented make for a fun and engaging evening of theater.\n\n\"One Acts\" is the theatre department's final showcase of the year, and while it lacks the grandeur of full-length productions, the showcase allows for heavy student involvement, specifically in directing and writing. The night features five one-act plays, all of which are entirely student directed, including a student original, \"The Sphinx,\" written by senior Guive Assadi.\n\nThe night starts off with \"The Marriage Proposal,\" written by the acclaimed Anton Chekhov and directed by senior Katherine Craig. In it, a man named Ivan, played by freshman Sam Kim, has his marriage proposal to Natalyia, played by senior Riley Cassidy, go horribly wrong due to comical miscommunications. Sophomore Joelle Dong's character acts as both the mother of Natalyia and as the mediator between Natalyia and Ivan. The play features excellent control of difficult language by all three actors, a tribute to the directorial work of Craig, as well as skillful comedic timing by Dong as the mother. While the pace of the play feels a bit rushed at times, the show starts off \"One Acts\" in an exciting fashion.\n\nThe next play is \"The Auditioners,\" written by Doug Rand, and co-directed by senior Hannah Nguyen and junior Sophie Swezey. The play follows no structured plot. Instead, it features a collection of comical monologues presented to a panel of stern casting directors. The play includes 17&nbsp;actors, by far the largest cast in \"One Acts\", each of whom contribute something unique. Particular standouts include freshman Alexandra Dinu as Auditioner #1, sophomore Chayenne Greenburg as Auditioner #3 and sophomore Jackson Kienitz as Auditioner #10. While the play was well-directed, it feels a bit too long for \"One Acts,\" and could have been easily been trimmed slightly.\n\nThe next play is an adaptation of \"No Exit,\" written by French playwright Jean-Paul Sartre and directed by senior Sabrina Sonner. The only drama of the night, the plot revolves around three characters: a man named Cradeau, played by Assadi, and two women named Inez and Estelle, played by junior Clara Baker and sophomore Claire Eberhart, respectively. The premise is that their&nbsp;afterlives involve being locked in a room with each other for the rest of eternity. All three actors develop a unique sense of character, and the conflict between Baker and Eberhart's characters is both compelling and effective. While the actors all did a fantastic job, the best aspect of the show is the staging, as it significantly added to the drama of the performance.\n\n\"The Actor's Nightmare\" is the fourth and final adapted script of the evening, written by Christopher Durang and directed by sophomore Jason Pollak.&nbsp;<span style=\"color: #000000;\"> The protagonist, George, played by sophomore Joey Kellison-Lin, is a man who is unwillingly pushed onto the stage to perform plays such as&nbsp;“Hamlet” and “Private Lives.\" His inexperience leads him to do<\/span><span style=\"color: #000000;\">&nbsp;ridiculous things such as slapping his scene partners, sitting in trash cans, and taking off his pants on the middle of the stage.&nbsp;<\/span>\n\nThe play leaves a strong impression, as the comedic display is phenomenal. Kellison-Lin's performance as George is both convincing and hilarious and the show as a whole perfectly fits the atmosphere of \"One Acts.\"\n\nThe last play of the night is \"The Sphinx,\" written by Assadi and directed by senior Oskar Soderberg. A mysterious figure named \"The Sphinx,\" played by junior Zoe Limbrick, comes into a high school student's bedroom and threatens to eat the student's paper unless she completes three tasks. Assadi's comedic writing along with Soderberg's direction helps bring this absurdist tale to life, and effectively ends One Acts on a slightly ridiculous note. While Assadi's script does have a couple jokes that maybe not everybody would understand, the creative original script is the perfect way to end an entertaining evening.\n\n<span style=\"color: #000000;\">The variety of the plays and the versatility of the Paly Theatre students in \"One Acts\" are impressive and speak to the strength of the department. While \"One Acts\" this year runs fairly long, the various plays are must-sees.<\/span>\n\n<span style=\"color: #000000;\">\"One Acts\" will play again at 7:30 p.m. tonight in the Haymarket Theater. Tickets cost $5 for students and seniors, and $10 for adults.<\/span>\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;","excerpt":"After two successful performances, the Palo Alto High School Theatre department's \"One Acts\" has it's final performance tonight at 7:30 p.m. in the Haymarket Theatre. The showcase highlights versatile student talent in acting, directing and playwriting and the diverse lineup of plays presented make for a fun and engaging evening of theater.\r\n","date":"2015-05-09 17:26:10","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11204437_707448916068103_6054940195031002152_n.jpg","categories":["Entertainment"],"tags":{"43768":"actors nightmare","43766":"auditioners","43767":"no exit","17489":"one acts","8953":"paly","17490":"plays","15393":"showcase","43770":"the marriage proposal","43769":"the sphinx","9159":"theater","9160":"theatre"}},{"id":103866,"title":"SatireDay Cartoon 5","permalink":"http:\/\/palyvoice.com\/2015\/05\/09\/satireday-cartoon-5\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-08-at-8.15.15-PM1.png\"><img class=\"alignright size-full wp-image-103869\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-08-at-8.15.15-PM1.png\" alt=\"Screen shot 2015-05-08 at 8.15.15 PM\" width=\"600\" height=\"425\" \/><\/a>\r\n\r\n<strong>Previous Cartoons<\/strong>\r\n\r\n3\/21\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/21\/satireday-cartoon-4\/\">The Other March Madness<\/a>\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/satireday-cartoon-4.jpg\"><img class=\"aligncenter wp-image-101413 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/satireday-cartoon-4.jpg\" alt=\"satireday cartoon 4\" width=\"600\" height=\"388\" \/><\/a>\r\n\r\n3\/14\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/14\/satireday-cartoon-3\/\">The Tissue Issue<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg\"><img class=\"aligncenter wp-image-101011 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg\" alt=\"satireday3\" width=\"600\" height=\"388\" \/><\/a>\r\n\r\n3\/7\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/07\/satireday-cartoon-2\/\">When WASC Leaves<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\"><img class=\"aligncenter wp-image-100808 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\" alt=\"satireday 2\" width=\"600\" height=\"589\" \/><\/a>\r\n\r\n2\/28\/15: <a href=\"http:\/\/palyvoice.com\/2015\/02\/28\/satireday-cartoon\/\">The No Homework Night<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\"><img class=\"aligncenter wp-image-99225 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\" alt=\"satireday cartoon\" width=\"600\" height=\"473\" \/><\/a>","excerpt":"Check the latest cartoon.","date":"2015-05-09 11:52:47","author":"Liana Pickrell","categories":["Entertainment"],"tags":{"39025":"cartoon","40209":"humor","8953":"paly","8975":"parking","40208":"satireday"}},{"id":103821,"title":"Preview: Softball to host Mountain View on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/08\/preview-softball-to-host-mountain-view-on-senior-night\/","content":"The Palo Alto High School softball team (14-11, 4-6) will take on Mountain View High School (18-7, 10-1) at 4 p.m. this afternoon at the Paly softball field for the Viking's last league game at home this season.\r\n\r\nThis is the second time the Vikings and the Spartans will go head-to-head. Last time they played, the Vikings fell to Mountain View, 3-4. Since then, Paly has been working hard to improve their technical skills, as well as their team chemistry, in order for it to be a memorable senior night, according to senior captain Julianna Heron.\r\n\r\n\"We have been working a lot on our hitting and also becoming united as a team to do well in this game,\" Heron said.\r\n\r\nThe team has been impacted by the loss of two of their pitchers late in the season, according to junior outfielder Maddy Atwater.\r\n\r\n\"Since we lost our two pitchers, things have been pretty rough,\" Atwater said. \"Going into this game, we are just looking to play hard and finish the game with our heads up.\"\r\n\r\nThe emotions of Senior Night will also be a factor in the team's success this afternoon, according to Heron.\r\n\r\n\"As a senior, I'm excited for the game,\" Heron said. \"It's bittersweet as the season is coming to an end so soon, and I'll be done with Paly softball.\"\r\n\r\nAtwater emphasized the importance of honoring the seniors and their coach as well.\r\n\r\n\"We want to go out there and play for the seniors,\" Atwater said, \"but also play for our coach Bill [Laskey] because of how supportive he's been since they [the two pitchers] quit.\"","excerpt":"The Palo Alto High School softball team (14-11, 4-6) will take on Mountain View High School (18-7, 10-1) at 4 p.m. this afternoon at the Paly softball field for the Viking's last league game at home this season.","date":"2015-05-08 15:35:15","author":"Molly Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030913_02341.jpg","categories":["Sports"],"tags":{"43765":"julianna heron","8861":"maddy atwater","29989":"mountain view","43764":"paly softball","18372":"softball"}},{"id":103768,"title":"The final stretch: Class of 2015 reflects on its Paly experience","permalink":"http:\/\/palyvoice.com\/2015\/05\/07\/the-final-stretch-class-of-2015-reflects-on-its-paly-experience\/","content":"As the 2014-15 school year comes to a close, Palo Alto High School seniors wind down and reminisce about their high school experiences. Hover over the dots to read about the Class of 2015's favorite memories, biggest regrets and words of wisdom.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/652973910559555584\" width=\"620\" height=\"620\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\nPhotography by George Lu.","excerpt":"As the 2014-15 school year comes to a close, Palo Alto High School seniors wind down and reminisce about their high school experiences, including their favorite memories, biggest regrets and words of wisdom.","date":"2015-05-07 21:57:35","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/tmp652973910559555584.jpg","categories":["Multimedia","Spotlight"],"tags":{"43751":"adam asch","33420":"advice","29374":"andrew lu","10039":"Ariana Tindall","43750":"dexter yanagisawa","29391":"georgeluphotography","43749":"harry halsted","43755":"jaime martinez","43752":"jake van zyll","39378":"jasen liu","43754":"makayla walton","43756":"memories","9765":"multimedia","43753":"natalie holler","8944":"palo alto high school","8953":"paly","43748":"rachel landesmann","43757":"regrets","9090":"seniors","29414":"thinglink","9201":"verbatim","43619":"words of wisdom"}},{"id":103253,"title":"The art of robotics","permalink":"http:\/\/palyvoice.com\/2015\/05\/07\/the-art-of-robotics\/","content":"[caption id=\"attachment_103252\" align=\"aligncenter\" width=\"635\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/team.jpg\"><img class=\"wp-image-103252\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/team.jpg\" alt=\"team\" width=\"635\" height=\"475\" \/><\/a> Robotics art team members meet to work on and plan their storyboards and sketches. From left to right, senior, Emil Ernström, sophomore Helen Herrera Montano, freshman, Adrienne Kwok, freshman, Maya Chin and senior Sebastien Lengre. Photo by Griffin Bajor.[\/caption]\r\n\r\nWhen people think of robotics, they think of math, science, and computers, not art. Palo Alto High School's robotics team, however, breaks this stereotype, having an art team that has been working hard throughout the year, designing graphics, winning the Underground Society of Animator's competition in April and hosting animation classes for students.\r\n\r\nTo some students, it may come as a surprise to learn that the robotics team has an art division.\r\n\r\n“The Team 8 [Paly] Robotics Team has the traditional teams you would think of when working on a robot: like programming and building,” art team member and junior Peter Turnbull said. “However, we also have the art team.”\r\n\r\nThis year, especially, the art team’s importance and responsibilities has grown within Team 8.\r\n\r\n“I expanded the animation team to a whole art division,” senior and art team captain Griffin Bajor said. “The graphic design team creates things like posters, shirts, and flags to make us [the robotics team] look as professional as possible; the sketching and storytelling team brainstorms the ideas, and creates the storyboards for the animators to use; [and] the animation team creates full 3D animation to model.”\r\n\r\nIn addition to animating and designing, members of the art team also have the chance to hone a wide range of skills.\r\n\r\n“Our role as the art team is to attract creative individuals across Paly and give them a place to use their skills to add to robotics, or too learn new completely skills,” Turnbull said. “These artists become exposed to the engineering minds [and] a very real-world work environment for an amazing experience for everyone. Students can range from having no experience at all to being masters of their craft.”\r\n\r\nThis season, the team worked on an entry for the Underground Society Animator’s competition.\r\n\r\n“The USA Competition was our focus from January to April,” Turnbull said. “The idea is that all the teams competing receive the same narrative prompt, and they have to accomplish it in a short animation. We were challenged to somehow, ‘Tell the story of an insect that somehow causes the robot uprising’, in 1 minute.”\r\n\r\nFor their entry, the team<a href=\"https:\/\/www.youtube.com\/watch?v=djbOAmS1TRM&amp;list=PL2U4HKGu4qvGfu_ycvxPobJu4MTWp6CAl&amp;index=2\"> created an animation<\/a> about an ant that was training for a marathon, according to Turnbull.\r\n\r\n“We won the Technical Award, which is first place, and a $1000 prize, \"  Turnbull said. \"It was a very bumpy road, filled with procrastination and cutting scenes that we didn't expect to, but I am incredibly proud of the work that everyone on the team put in, and I'm so happy to be a part of this team. Winning feels pretty good.\"\r\n\r\n[caption id=\"attachment_103250\" align=\"aligncenter\" width=\"556\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/2015_USA_Award_Team_0008_TECHNICAL_AWARD.gif\"><img class=\"wp-image-103250\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/2015_USA_Award_Team_0008_TECHNICAL_AWARD.gif\" alt=\"2015_USA_Award_Team_0008_TECHNICAL_AWARD\" width=\"556\" height=\"313\" \/><\/a> The art team created an animation about an ant training for a marathon for the USA competition. \"To us this animation hit every note,\" the judges said. \"It had well done character animation, nice use of lighting and textures, and it had a cohesive story. Well done team.\" Video Courtesy of Paly Robotics.[\/caption]\r\n\r\nMoving forward, the entire robotics team is transitioning into new leadership roles, while the animation team will also be teaching animation classes.\r\n\r\n“We are in the process of training members and working on our recruitment and intake process for next year,” Turnbull said. “Art team specifically, we are teaching two mini-classes for animation. The Intro class [started last week with] robotics members, [and] some from outside the robotics team, and the Advanced Animation class  starts after the Intro class ends.\r\n\r\nThe team is looking forward to next year and using the experience it has gained this year to improve.\r\n\r\n“We learned so much from this latest animation, ” Bajor said. “I can't wait to see for next year's competition. We made something that was great, and it's incredibly important that each of us in the team remember that. There will be more competitions to compete in, more poster to make, webcomics to draw and so much more. Next year is going to be fantastic.”","excerpt":"When people think of robotics, they think of math, science, and computers, not art. Palo Alto High School's robotics team, however, breaks this stereotype, having an art team that has been working hard throughout the year, designing graphics, winning the Underground Society of Animator's competition in April and hosting animation classes for students.","date":"2015-05-07 19:30:13","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/ant.jpg","categories":["Features","Spotlight"],"tags":{"11632":"animation","43303":"animation classes","8493":"art","9049":"robotics","9153":"team","43304":"underground society of animator","42919":"usa"}},{"id":103716,"title":"One Acts to highlight theater talent","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/one-acts-to-highlight-theater-talent\/","content":"[caption id=\"attachment_103736\" align=\"alignnone\" width=\"435\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11225607_1122472977778450_1265249783_n.jpg\"><img class=\"wp-image-103736\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11225607_1122472977778450_1265249783_n.jpg\" alt=\"11225607_1122472977778450_1265249783_n\" width=\"435\" height=\"271\" \/><\/a> Junior Clara Baker, senior Guive Assadi and sophomore Claire Eberhart (left to right) star in \"No Exit\" by Jean Paul Sartre. The One Acts will premiere at 7:30 p.m. Thursday at the Haymarket Theater. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nThe Palo Alto High School Theater Department’s annual One Acts will feature student-run plays from Thursday, May 7, to Saturday, May 9 in the  Haymarket Theater.\r\n\r\nEach play is directed, produced and acted by students, according to theater teacher Kathleen Woods. While four of the plays are professionally written, the One Acts will include one original script, “The Sphynx”, written by senior Guive Assadi.\r\n\r\nAccording to Woods, the One Acts provide a unique experience to actors and directors.\r\n\r\n“The One Acts Showcase offers opportunities for students to take on leadership roles and offers many roles to actors who may not have participated in Paly Theater before,” Woods said.  “Experienced student actors and directors participate as well, so it is a great mix.”\r\n\r\n[caption id=\"attachment_103724\" align=\"alignright\" width=\"238\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/ZOEEEEEE.jpeg\"><img class=\"wp-image-103724\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/ZOEEEEEE.jpeg\" alt=\"ZOEEEEEE\" width=\"238\" height=\"296\" \/><\/a> Cast members and junior Zoe Limbrick fix their makeup during the final dress rehearsal for One Acts. Photo by Dalia van Zyll.[\/caption]\r\n\r\nDirector and junior Sophie Swezey believes she was able to advance her skills through preparation for the Showcase.\r\n\r\n“I think my directing skills improved a lot,” Swezey said.  “This was such a large cast, and my co-director …  and I really did have full control over the rehearsal process. I learned a lot about time management and how to get things done effectively.”\r\n\r\nActress and sophomore Dalia van Zyll is also looking forward to the performance.\r\n\r\n“I’m super excited for One Acts,” van Zyll said. “The show’s going to be tons of fun for both the cast and the audience. We’ve worked very hard on it and can’t wait to perform.”\r\n\r\nThe One Acts will premiere at 7:30 p.m. Thursday and continue through Saturday. Those attending the Showcase can RSVP on the event’s Facebook <a href=\"https:\/\/www.facebook.com\/events\/460595177436413\/\">page<\/a>. Tickets are $5 and are only available at the door.","excerpt":"The Palo Alto High School Theater Department’s annual One Acts will feature student-run plays from Thursday, May 7, to Saturday, May 9 in the  Haymarket Theater.","date":"2015-05-06 22:54:22","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11225607_1122472977778450_1265249783_n.jpg","categories":["News","Spotlight"],"tags":{"43609":"dalia van zyll","43611":"guive assadi","29689":"kathleen woods","17489":"one acts","8944":"palo alto high school","8953":"paly","17490":"plays","43613":"scene","15393":"showcase","33459":"sophie swezey","43612":"the sphynx","9159":"theater","9160":"theatre"}},{"id":103748,"title":"Boys&#8217; lacrosse routs Mountain View on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/boys-lacrosse-routs-mountain-view-on-senior-night\/","content":"The Palo Alto High School boys’ lacrosse team (16-9-1, 5-6) triumphed over the Mountain View High School Spartans (15-12, 5-4), 12-3, tonight on Senior Night.\r\n\r\nThe Spartans started off strong with two goals at the beginning of the first quarter, but a goal from junior Matthew Seligson shifted the momentum in the first quarter.\r\n\r\nDuring the second quarter, goals from juniors Cole Tierney and Ariya Momeny and seniors Michael Beisheim and Zach Levitan brought the Vikings up 6-2 at the end of the half.\r\n\r\nThe Vikings finished off the game strong only letting in one more goal from Mountain View and scoring six more of their own in the second half.\r\n\r\nSenior Night allowed the team to come together and play its best, according to senior Owen Staiger.\r\n\r\n“I thought the team really did well and I was really happy that we could do this on our senior night,” Staiger said. “It was really nice to have the whole team mesh together like that and rally behind the seniors of the team.”\r\n\r\nBeisheim echoed Staiger’s thought of chemistry being important in the victory.\r\n\r\n“I think we really meshed like a team [tonight] like we have been for the past six games, and that’s how we’ve been able to come back,” Beisheim said.\r\n\r\nThis victory was the seventh win in a row for Paly this season.\r\n\r\n“We’d been going strong for six games and they capped it off with a seventh game, just playing unbelievably, getting better every game,” head coach DJ Shelton said. “This was just an awesome way to end the season, not just for the seniors, but as a team in general. It’s a great way to go into the playoffs so I couldn’t be prouder.”\r\n\r\nThe Vikings will face Mountain View again in the first round of the Santa Clara Valley Athletic League playoffs next Wednesday at Paly.\r\n\r\nMountain View head coach Joe Juter hopes for more competition next week.\r\n\r\n“We’re going to have to work on a few things,” Juter said. “There are certain things you can’t change in one week before the game but you know hopefully it will be a better match next week than it was today. Today obviously did not work out as we’d like.”\r\n\r\nThe Vikings are optimistic about playoffs, according to Beisheim.\r\n\r\n“We’ve beat all of the teams in our league at least once and they’ve all been in the past six games,” Beisheim said. “I think we’ve got a really good chance to win it all.”","excerpt":"The Palo Alto High School boys’ lacrosse team (16-9-1, 5-6) triumphed over Mountain View High School (15-12, 5-4), 12-3, tonight on Senior Night.","date":"2015-05-06 22:51:37","author":"Molly Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_4624.jpg","categories":["Sports"],"tags":{"12015":"boys lacrosse","43616":"boys lax","8836":"Lacrosse","12016":"lax","29989":"mountain view","43617":"mountain view lacrosse","9087":"Senior Night"}},{"id":103664,"title":"Season update: Boys&#8217; and girls&#8217; swimming optimistic for league championships","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/season-update-boys-and-girls-swimming-optimistic-for-league-championships\/","content":"[caption id=\"attachment_103288\" align=\"alignnone\" width=\"626\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-02-at-2.41.45-AM.png\"><img class=\"size-full wp-image-103288\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-02-at-2.41.45-AM.png\" alt=\"Senior and boys captain, Ryan Drover, swims butterfly during practice. The boys' and girls' swim teams have been training hard and will compete at league championships this week. Photo by George Lu.\" width=\"626\" height=\"419\" \/><\/a> Senior and boys' captain, Ryan Drover, swims butterfly during practice. The boys' and girls' swim teams have been training hard and will compete at league championships this week. Photo by George Lu.[\/caption]\r\n\r\nAs the swim season comes to a strong close, the Palo Alto High School boys' (5-1) and girls' swim team (6-0) will compete at Santa Clara Valley Athletic League Championships this week.\r\n\r\nThe boys' swim team expects to be league champions for the fifth year in a row.\r\n\r\nSenior boys’ captain Ryan Drover is satisfied with how the season has gone up to this point.\r\n\r\n“After our first league dual meet against Gunn being a loss, we finished the remainder of the season strongly, ending our dual meet season on Thursday with a record of 5-1,” Drover said. “We've really just been having a great season as a team, both in and out of the water, and as cliché as it is, I think that that's really created a great environment on the team this year.”\r\n\r\nAccording to Drover, there has been a lot of improvement across the entire team. The boys have become a much deeper team, which bodes well for their championship meets.\r\n\r\n“Some of our guys to watch for in the next weeks are sophomores Ethan Bundy and Alex Liang, juniors Andrew Cho, Matthew Liang, Robert Cheng and Daniel Sing and seniors Oliver Tucher, William Shin, Winston Wang and Ryan Drover,” Drover said.\r\n\r\nIn addition, senior and captain for girls' swimming, Sarah Putulin, is proud that the girls' are going into league championships undefeated.\r\n\r\n“I'm so proud of the girls for what they've accomplished and I can't wait to see them swim really fast at at Leagues [Championships] and CCS [Central Coast Sectionals],” Putulin said.\r\n\r\nAs many girls on the swim team have begun tapering, Putulin is excited for the time drops that are likely to come with it.\r\n\r\n“I'm very confident that we'll win Leagues [Championships] and that we'll place top 5 at CCS, \" Putulin said. “We have the talent and the depth to pull through. In addition, we have a fast and young team and I know we'll do great.”\r\n\r\nLeague Championships will take place at 4 p.m on Wednesday, May 6 for the girls and Thursday, May 7 for the boys at Saratoga High School.","excerpt":"As the swim season comes to a strong close, the Palo Alto High School boys' and girls' swim team will compete at SCVAL Championships this week.\r\n","date":"2015-05-06 19:23:38","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-02-at-2.41.45-AM.png","categories":["Sports","Spotlight"],"tags":{"8568":"CCS","15411":"leagues","8944":"palo alto high school","8953":"paly","40102":"ryan drover","40100":"sarah putulin","9143":"Swimming"}},{"id":103687,"title":"Liveblog: Boys&#8217; lacrosse takes Mountain View tonight for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/liveblog-boys-lacrosse-takes-mountain-view-tonight-for-senior-night\/","content":"<span style=\"color: #000000;\">The Palo Alto High School boys’ lacrosse team (15-9-1, 4-6) will take on the Mountain View High School Spartans (15-11, 5-3) at 7 p.m. tonight at the Paly lacrosse field. The stakes are high, as this game determines the No. 2 seed versus the No. 3 seed in the upcoming playoffs.<\/span>\r\n\r\n<span style=\"color: #000000;\">As the last league and home game, there will be a Senior Night celebration before the game at 6:45 p.m. The 11 seniors on the team will be lauded for their high school lacrosse achievements, and their future plans will be announced.<\/span>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School boys’ lacrosse team (15-9-1, 4-6) will take on the Mountain View High School Spartans (15-11, 5-3) at 7 p.m. tonight <a href=\"http:\/\/palyvoice.com\/2015\/05\/06\/liveblog-boys-lacrosse-takes-mountain-view-tonight-for-senior-night\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-06 18:53:41","author":"Chloe Fishman","categories":["lacrosse","Sports"],"tags":[]},{"id":103646,"title":"Slideshow: Students participate in 93rd May Fête parade","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/slideshow-students-participate-in-93rd-may-fete-parade-2\/","content":"On Saturday, members of the Palo Alto community gathered downtown for the 93rd Annual <a href=\"http:\/\/pamayfetefair.com\/\">City of Palo Alto May Fête Children's Parade<\/a>. The event brought together several community groups and organizations to celebrate this year's theme, \"No Space to Alienate.\" Among the marchers in the parade were representatives of the Palo Alto High School community, including Key Club, the Robotics team, the Pep Band and the cheerleading team.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A0AAQj8OEJoE\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Several student groups joined the Palo Alto community downtown during the 93rd Annual City of Palo Alto May Fête Children's Parade last Saturday.","date":"2015-05-06 17:25:00","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DSC_0280.jpg","categories":["Multimedia","Slideshow"],"tags":{"29374":"andrew lu","43603":"august soderberg","43598":"cheerleading","43601":"children's parade","43602":"joelle dong","43597":"key club","43592":"may fete parade","43604":"paly pep band","29485":"paly robotics","15094":"parade"}}]