[{"id":100036,"title":"A change in lineup: New coach brings fresh spirit to baseball team","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/a-change-in-lineup-new-coach-brings-fresh-spirit-to-baseball-team\/","content":"[caption id=\"attachment_100037\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_9918.jpg\"><img class=\"size-full wp-image-100037\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_9918.jpg\" alt=\"Junior catcher Lawrence Han goes up to bat against St. Ignatius High School. Paly defeated St. Ignatius 6-3. Photo by Amy Leung.\" width=\"600\" height=\"450\" \/><\/a> Junior catcher Lawrence Han goes up to bat against St. Ignatius High School. Paly defeated St. Ignatius 6-3 in a non-conference game. Photo by Amy Leung.[\/caption]\r\n\r\nThe Palo Alto High School baseball team (1-0, 0-0) looks forward to a new season with a new coach, holding high hopes despite graduating nine seniors as it takes on rival Gunn High School at noon tomorrow at home.\r\n\r\nPete Fukuhara is this season's new head coach, taking over for Erick Raich, who coached for five seasons.\r\n\r\n“The new coach is a little more laid back,” junior third baseman Shaun Pike said. “It makes the sport a little bit more fun, and it makes people want to play for him.”\r\n\r\nFukuhara stresses the importance of camaraderie on the team over setting a concrete goal of winning a designated number of games.\r\n\r\n“I just want to be one family — the JV [junior varsity] program to the varsity program,” Fukuhara said. “I want to play the game the right way [with] a lot of hustle and just being one family together.”\r\n\r\nA key difference this year is the graduation of nine seniors.\r\n\r\n“We lost Jack Cleasby and Danny Erlich,” junior catcher Lawrence Han said. “Jack [Cleasby] was a big bat. He provided a lot of offense.”\r\n\r\nDespite losing firepower, Han believes that winning league is a viable goal.\r\n\r\n“It [the loss of seniors] hasn’t affected us nearly as much as I had anticipated as we’ve had people step up to fill the places that we lost,” Han said. “I’d say winning league is the team goal.”\r\n\r\nWhen it comes to key players, Fukuhara has a similar philosophy of communal strength as he does for the goals of the team.\r\n\r\n“Our [senior] center fielder Phil Lewis has been fantastic, [sophomore] Ben Cleasby stepped up [and] we’ve had [senior] Isaac [Kasevich] step up on the mound,” Fukuhara said. “Hopefully it’s a shared role — there’s a different star [in] every game.”\r\n\r\nAs the team looks to its next game, Fukuhara approaches it with a relaxed mindset.\r\n\r\n“We’re just going to come out prepared to play the game of baseball,” Fukuhara said. “Just play hard and hope that we come out on top. That’s all you can do.”\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School baseball team (1-0, 0-0) looks forward to a new season with a new coach, holding high hopes despite graduating nine seniors as it takes on rival Gunn High School at noon tomorrow at home.","date":"2015-02-27 20:31:55","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_9918.jpg","categories":["Sports"],"tags":{"8410":"Baseball","17780":"boys baseball","12358":"coach","8912":"new","8944":"palo alto high school","9012":"preview","39703":"season"}},{"id":100136,"title":"Slideshow: Former U.S. Secretary of Energy speaks on energy use, climate change","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/slideshow-former-u-s-secretary-of-energy-speaks-on-energy-use-climate-change\/","content":"Former U.S. Secretary of Energy Steven Chu spoke to students, parents and community members Wednesday night in the Palo Alto High School Media Arts Center during the first installment of the \"Great Minds at Campus\" speaker series. Chu's slideshow presentation, which featured charts, graphs and jokes, covered various topics including climate change, the future of energy and his work in politics and academia.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AIAAAWccGOnX\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Former U.S. Secretary of Energy Stephen Chu spoke to Palo Alto High School parents and students in the Palo Alto High School Media Arts Center during the first installment of the \"Great Minds at Campus\" speaker series Wednesday night.","date":"2015-02-27 16:02:36","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/featuredimage-steven.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"39937":"change","14850":"climate","39936":"energy","39938":"EV","39939":"global warming","39935":"great minds","18366":"mac","11127":"media arts center","8944":"palo alto high school","8953":"paly","9083":"secretary","9107":"slideshow","38959":"speaker series","38960":"steven chu","9129":"student","12702":"wojcicki"}},{"id":100182,"title":"Deadline for dropping a class is Thursday, March 12","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/deadline-for-dropping-a-class-is-thursday-march-12\/","content":"","excerpt":"","date":"2015-02-27 15:27:25","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8636":"deadline","39955":"drop class"}},{"id":99912,"title":"ASB releases election packets","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/asb-releases-election-packets\/","content":"Election packets for students interested in running for an elected Palo Alto High School Associated Student Body position are available in front of the Student Activities Office and on <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/\">Paly ASB's website<\/a>.\r\n\r\nAccording to Student Activities Director Matt Hall, there have been some minor changes in the application packets and in the required duties of elected officers.\r\n\r\n\"The campaign budget [for individual candidates] changed from $40 to $20, so we have more equity,\" Hall said. \"We encourage students to use the Student Activities Office's materials for making posters and other campaign materials.\"\r\n\r\n[caption id=\"attachment_100085\" align=\"alignright\" width=\"299\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.37.29-PM.png\"><img class=\"wp-image-100085 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.37.29-PM.png\" alt=\"ASB election packets can be found in front of the SAO, and must be submitted by Wednesday, March 11. Photo by Dhara Yu. \" width=\"299\" height=\"326\" \/><\/a> ASB election packets can be found in front of the SAO and must be submitted by March 11. Photo by Dhara Yu.[\/caption]\r\n\r\nIn past years, candidates have spent money on poster materials and food to distribute to voters. They will be expected to fill out a financial disclosure form so that ASB can ensure that they do not spend more than the allotted $20.\r\n\r\nIn addition to the budget cut, ASB elected officers will now be required to attend Camp Unity (formerly known as \"Camp Everytown\"), an annual four-day Paly program intended to promote awareness and acceptance among students.\r\n\r\n\"We want officers to be connected with the student body and have the opportunity to hear everyone's stories,\" Hall said.\r\n\r\nBeyond that, all facets of the ASB election process will remain the same as previous years.\r\n\r\nApplications for candidates will be due on March 11, and the elections will take place online from March 25 to March 27.\r\n\r\n&nbsp;","excerpt":"Election packets for students interested in running for an elected Palo Alto High School Associated Student Body position are now available in front of the Student Activities Office and on Paly ASB's website.","date":"2015-02-27 15:01:25","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.37.29-PM.png","categories":["News"],"tags":{"8496":"ASB","8497":"ASB elections","8499":"Associated Student Body","8667":"elections","8873":"Matt Hall","8944":"palo alto high school"}},{"id":100000,"title":"AP exam registration ends March 14, late registration ends March 19","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/ap-exam-registration-ends-march-14-late-registration-ends-march-19\/","content":"","excerpt":"","date":"2015-02-26 22:33:58","author":"Lizzie Chun","categories":["Ticker"],"tags":{"39700":"ap exams","36401":"ap tests","8636":"deadline","11636":"registration"}},{"id":100004,"title":"Early bird prices for Prom tickets from March 9 to March 22, all sales end April 10","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/early-bird-prices-for-prom-tickets-from-march-9-to-march-22-all-sales-end-april-10\/","content":"","excerpt":"","date":"2015-02-26 22:33:47","author":"Lizzie Chun","categories":["Ticker"],"tags":{"9016":"prom","39701":"prom tickets","39702":"sales"}},{"id":100053,"title":"Award-winning photojournalist to speak at annual forum","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/award-winning-photojournalist-to-speak-at-annual-forum\/","content":"[caption id=\"attachment_100062\" align=\"alignnone\" width=\"575\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/AIUP.jpg\"><img class=\" wp-image-100062\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/AIUP.jpg\" alt=\"The  band plays during Art in Unusual Places Week. Photo by Aidan Maese-Czeropski.\" width=\"575\" height=\"431\" \/><\/a> The Paly jazz band performs at lunch during the Art in Unusual Places week. The annual photojournalism forum will conclude the week-long event and feature photojournalist Ed Kashi. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nThe Palo Alto High School photography program will host an annual day-long photojournalism forum tomorrow  in the Media Arts Center tomorrow.\r\n\r\nAward-winning photojournalist Ed Kashi will be featured in the forum, and will present on a variety of present-day issues and share his journalism experiences.\r\n\r\n\"[The forum will] expose Paly students to professional practice in the Arts and inspire them to use their talents in authentic applications, like publication and blogging,\" photography teacher Margo Wixsom said. \"Giving students professional models like this takes learning out of textbooks and applies it in the real world.\"\r\n\r\nArt displayed during the presentations will relate to a number of alternating themes throughout the day, including \"Social Media and Instagram,\" \"Advocacy Journalism\" and \"The Western Drought and Resources.\" Kashi will speak at the event to help promote these growing topics and discuss professional practice in the fields of journalism and photography, according to the event flier.\r\n\r\nAccording to Wixsom, the forum will display a series of art pieces relevant to these themes and will include works from both Kashi and Paly students.\r\n\r\nThe free event will conclude the “Art in Unusual Places” week, which showcased student work in traditional, digital and performing arts on campus.","excerpt":"The Palo Alto High School photography program will host an annual day-long photojournalism forum  in the Media Arts Center tomorrow, featuring award-winning photojournalist Ed Kashi.","date":"2015-02-26 21:03:03","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/AIUP.jpg","categories":["News"],"tags":{"39940":"ed kashi","18368":"forum","8814":"journalism","18366":"mac","8944":"palo alto high school","8987":"photography","39941":"photojournalism"}},{"id":100058,"title":"Opinion: Blended learning proposes better alternative to traditional learning experience","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/opinion-blended-learning-is-better\/","content":"While the learning environment at school is satisfactory for some, to others, it is too uniform. School has been taught the same for generations, and lacks many areas of passion and further projects to develop these. While the current American teaching system involves many lectures and tests that are not as conducive to finding and delving into one's passion as they could be, a learning environment in which students have complete freedom to do as much or as little work as they choose does not seem right either. So, the question is, how can we find a balance?\r\n\r\nPalo Alto High School journalism adviser Esther Wojcicki pushes for blended learning, a possibly solution.\r\n\r\nWojcicki’s new book \"Moonshots in Education\" and recent presentation at Paly’s <a href=\"http:\/\/palyvoice.com\/2015\/02\/08\/paly-hosts-second-annual-tedx\/\">TEDx<\/a> talk earlier this month discuss the concept of blended learning, or a way to “teach 21st century skills without lecturing to students,” as she described it in a recent <a href=\"http:\/\/palyvoice.com\/2015\/01\/29\/voice-qa-journalism-teacher-wojcicki-introduces-new-book\/\">interview<\/a> with The Paly Voice. Her book describes how to change the culture of the classroom and revolutionize the American school system.\r\n\r\nWe whole-heartedly agree with this style of teaching as it encourages students to take control of their own learning. The current rigid structure of some classes traps many high school students in an educational system they do not feel passionate learning in. Learning extends far beyond sitting behind a desk for 90 minutes while listening to a teacher lecture. For certain classes, like classes in STEM subjects, it is understandable that lectures are unavoidable – it would be pretty hard to figure out how to design and code your own website without any prior lessons. That being said, there can still be ways for learning to branch off into innovative territories.\r\n\r\nPhysics teacher Gul Eris is one of several Paly teachers who have implemented blended learning into their class curriculums. Having introduced the new format last fall, she strays away from the traditional teaching style of class lectures and homework and instead provides lecture videos for students to watch at home and practice problems or labs to do in class.\r\n\r\n“What I’ve noticed in the past is that some students struggle to keep up with writing stuff [during class lectures] or cannot pay full attention in class,” Eris said. “So, if they can do it [learn the material] on their own terms in their own time, where they can make it [the lecture video] as slow or as fast as they want it to be, they can pay better attention and take better notes and can reach a better understanding of the concepts.”\r\n\r\nThe numbers speak favorably in support of her theory.\r\n\r\n“The test scores are a little bit higher compared to last year,” Eris said. “It’s not a lot, but [they're] still higher.”\r\n\r\nIt’s a huge challenge to fit a square peg into a round hole — and even harder to fit each person's individual learning preferences into a strict, cookie-cutter model. That's why education should be personalized with blended learning. Students are currently unmotivated to learn in school, which detracts from the overall enjoyment of school. With blended learning, however, learning is more personalized, and students will be given the opportunity to pursue their true interests. The American high school system is too factory-like and not conducive to success because interests do not exactly lie in the domain. Ultimately, we push for teachers to experiment more with blended learning in classrooms because it allows students to take control of their learning experience.","excerpt":"While the learning environment at school is satisfactory for some, to others, it is too uniform. The Paly Voice analyzes if Esther Wojcicki's moonshot idea can solve this.","date":"2015-02-26 15:06:27","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo.jpg","categories":["Opinion"],"tags":{"39739":"blended learning","12704":"esther wojcicki","39740":"gul eris","8944":"palo alto high school"}},{"id":99872,"title":"Boys&#8217; wrestling to attend CCS this weekend","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/boys-wrestling-to-attend-ccs-this-weekend\/","content":"In its first season with a new coach, the Palo Alto High School boys’ wrestling team will send four wrestlers to the Central Coast Section finals this weekend.\r\n\r\n[caption id=\"attachment_100047\" align=\"alignright\" width=\"372\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0962.jpg\"><img class=\"wp-image-100047\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0962.jpg\" alt=\"\" width=\"372\" height=\"279\" \/><\/a> Boys' wrestling schedules and news hang in the Big Gym. The Vikings will go to CCS this weekend. Photo by Julia Asin.[\/caption]\r\n\r\nAlthough the Vikings struggled early in the season, head coach Braumon Creighton said the team improved its conditioning and positioning this month and expects to qualify three of the four CCS-qualified Paly wrestlers to the California Interscholastic Federation state championship.\r\n\r\n“We are training hard the rest of the week to prepare for CCS,” Creighton said. “[We will be] mainly drilling and working on tactical things for each individual – lots of stretching and paying attention to our nutrition.”\r\n\r\nThe four wrestlers going to CCS are senior captain James Giaccia, sophomore Seth Goyal, senior Chioke Bryant Anderson and freshman Noah Asing.\r\n\r\nGiaccia said the team is practicing every day to prepare for CCS.\r\n\r\n“We've been training all season for this,\" Giaccia said. \"[We] practice every single day, and for me, twice a day. ... Our expectations are to have three CCS champions. Team expectation [is to place] within the top 10.”\r\n\r\nThe boys will participate in the first day of CCS finals on Friday at Independence High School.","excerpt":"In its first season with a new coach, the Palo Alto High School boys’ wrestling team will send four wrestlers to the Central Coast Section finals this weekend.\r\n","date":"2015-02-26 13:06:09","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0962.jpg","categories":["Sports"],"tags":{"39599":"boys wrestling","8568":"CCS","9951":"chioke bryant-anderson","36388":"james giaccia","39601":"noah asing","8944":"palo alto high school","39600":"seth goyal","9241":"wrestling"}},{"id":99790,"title":"Science Bowl places third at regional competition","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/science-bowl-places-third-at-regional-competition\/","content":"[caption id=\"attachment_99850\" align=\"alignnone\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg\"><img class=\"wp-image-99850\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg\" alt=\"\" width=\"350\" height=\"263\" \/><\/a> Palo Alto High School Science Bowl team members Samarth Venkatasubramaniam, Andrew Lee, Jasen Liu, Matthew Li and Gary Chen (left to right) pose with the medals they earned at the regional Science Bowl last week. The team placed third out of 20 schools in the 11th Annual Department of Energy Bay Area Science Bowl competition at Stanford University. Photo courtesy of Gary Chen.[\/caption]\r\n\r\nPalo Alto High School’s Science Bowl team returned to school victorious in February after placing third out of 20 schools in the 11th Annual Department of Energy Bay Area Science Bowl competition at Stanford University. This strong finish marks the Paly team’s debut in the regional competition and season.\r\n\r\nThe Paly SciBowl team, which consists of sophomore Samarth Venkatasubramaniam, junior Andrew Lee and seniors Gary Chen, Matthew Li and Jasen Liu, competed against other strong schools, including Lynbrook High School and the Harker School, who placed first and second respectively. However, only the top two teams in each division advanced to the double elimination round, so the Paly team did not move to the next round.\r\n\r\n“It felt nice to place at regionals since we have been practicing a lot,\"  Lee said. “We were all definitely surprised once we found out that we placed third overall.”\r\n\r\nAccording to its <a href=\"https:\/\/www6.slac.stanford.edu\/news\/2015-02-09-slac-hosts-11th-annual-regional-doe-science-bowl.aspx\">website<\/a>, the Regional Science Bowl “encourages students to excel in STEM disciplines – science, technology, engineering and mathematics – and to pursue careers in these field.” Students are also expected to answer multiple choice and short answer questions covering biology, chemistry, Earth science, physics, energy and math in a fast-paced format that requires them to think quickly and spend months practicing.\r\n\r\nAccording to Lee, to work on speed, the team met every week for about two hours to go through previous competitions and practice buzzing.\r\n\r\nOverall, Venkatasubramaniam was content with the performance of the team.\r\n\r\n“Although only first place gets to advance to nationals, we are super happy with our third place because it is one of the hardest regionals, and it was a good show for the last SciBowl for the three seniors on the team,” Venkatasubramaniam said.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s Science Bowl team returned to school victorious in February after placing third out of 20 schools in the 11th Annual Department of Energy Bay Area Science Bowl competition at Stanford University. This strong finish marks the Paly team’s debut in the regional competition and season.","date":"2015-02-26 13:05:50","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg","categories":["News"],"tags":{"39379":"andrew lee","12848":"competition","39382":"gary chen","39378":"jasen liu","39381":"matthew li","8944":"palo alto high school","39380":"samarth venkatasubramanian","39377":"scibowl","9072":"science","9073":"science bowl"}}]