[{"id":100651,"title":"Robotics team to compete at regional competition","permalink":"http:\/\/palyvoice.com\/2015\/03\/05\/robotics-team-to-compete-at-regional-competition\/","content":"[caption id=\"attachment_100723\" align=\"alignnone\" width=\"378\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11045754_1605464913003074_623212239_o.jpg\"><img class=\" wp-image-100723\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11045754_1605464913003074_623212239_o.jpg\" alt=\"The Palo Alto High School robotics team completed constructing its robot last week. The team spent over 220 hours on building and hopes to win at the Central Valley Regional robotics competition this weekend in Madera. Photo by Lauren Nolen\" width=\"378\" height=\"284\" \/><\/a> The Palo Alto High School robotics team completed constructing its robot last week. The team spent over 220 hours on building and hopes to win at the Central Valley Regional robotics competition this weekend in Madera. Photo by Lauren Nolen.[\/caption]\r\n\r\nAfter hundreds of hours spent in the lab dedicated to robot construction, the Palo Alto High School robotics team will compete this weekend at the Central Valley Regional robotics competition in Madera.\r\n\r\nAccording to sophomore public relations captain Lauren Nolen, each year there is a different game that the robot must be designed to compete in and in this year's competition, the game is called “Recycle Rush,\" with the objective being to pick up and stack as many totes as possible.\r\n\r\n“To accomplish this, we’ve built a robot with two 'arms' that tighten against the sides of the totes,” Nolen said. “Because of the amount of pressure used, the arms can also pick up recycling bins as well.”\r\n\r\nThe team additionally constructed another robot  to get more practice, according to Nolen.\r\n\r\n<span style=\"color: #373e4d;\">\"We’ve also actually built a second, practice robot, that will allow us to get a little more practice in before competitions since we aren’t allowed to use the original until we un-bag it at the competition site,\" Nolen said. <\/span>\r\n\r\nNolen said that the robotic lab was officially open for more than 220 hours over six weeks and believes that the team has a high chance of winning because of the hard work they put in the past couple seasons.\r\n\r\n“Obviously, we want to win or get as close to winning as possible,” Nolen said. “If we win this competition, we get to goto the World Championships in St. Louis, Missouri.”\r\n\r\nAccording to sophomore lab management captain Kenny Cheung, teamwork played a large role in making the robot since everyone has to communicate and make sure everything works when it all comes together.\r\n\r\n“Because the robot is so complex with many different subsystems, teamwork is essential in constructing it — and we definitely have been on a great upward trajectory in every aspect of the team,” Cheung said.\r\n\r\nFollowing the Central Valley Regional competition, which starts on Thursday, March 5, and ends March 8, the team will be able to attend the Silicon Valley Regional competition from April 1 to 4.\r\n\r\nCheung said that after the amount of effort put into constructing the robot, it will be exciting to see the robot on the field competing for the first time.\r\n\r\n“This year's robot turned out really well and we are eager to see it compete against other teams,” Cheung said.\r\n\r\n&nbsp;","excerpt":"After hundreds of hours spent in the lab dedicated to robot construction, the Palo Alto High School robotics team will compete this weekend at the Central Valley Regional robotics competition in Madera.","date":"2015-03-05 13:42:22","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11045754_1605464913003074_623212239_o.jpg","categories":["News","Spotlight"],"tags":{"40131":"central valley regional competition","40130":"kenny cheung","37378":"lauren nolen","8944":"palo alto high school","8953":"paly","9049":"robotics"}},{"id":100569,"title":"WASC reports positively, focuses on fixing academic disparities","permalink":"http:\/\/palyvoice.com\/2015\/03\/04\/wasc-reports-positively-focuses-on-fixing-academic-disparities\/","content":"[caption id=\"attachment_100586\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_1121.jpg\"><img class=\"wp-image-100586\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_1121.jpg\" alt=\"Member of the WASC Visiting Committee Mary Ann Shapiro talks to the staff during the WASC meeting today in the Media Arts Center atrium. &quot;I don't think I've been on a more respectful or responsible high school campus, and I've been doing this for a very long time,&quot; Mary Ann Shapiro said. Photo by Takaaki Sagawa.\" width=\"620\" height=\"414\" \/><\/a> WASC Visiting Committee member Mary Ann Shapiro talks to the Palo Alto High School staff during the WASC meeting today in the Media Arts Center atrium. \"I don't think I've been on a more respectful or responsible high school campus, and I've been doing this for a very long time,\" Shapiro said. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nThe Western Association of Schools and Colleges Visiting Committee reported many strengths in Palo Alto High School's community and curriculum, but recommended minimizing the achievement gap and aligning courses for homogeneity at the WASC Evaluation Meeting today.\r\n\r\nAccording to the evaluative WASC Report of Findings, strengths in the Paly curriculum include successfully implementing a block schedule, using technology to improve learning and preparing students for college through rigorous classes. Many of these findings matched the evaluation in Paly's <a title=\"WASC Self-Study Report\" href=\"http:\/\/paly.net\/sites\/default\/files\/PalyWASC1415_Feb23.pdf\" target=\"_blank\">516-paged self-study report<\/a>. The WASC Visiting Committee also praised the community for offering curricular and extracurricular activities that create specified experiences for students, providing adequate financial support, creating connections and working passionately and enthusiastically.\r\n\r\nHowever, the committee stated that some critical areas of improvement include reducing the achievement gap for underrepresented minority groups by providing access to rigorous classes, developing a plan to increase knowledge in order to align standards and continuing to improve communication in the community.\r\n\r\nOverall, the WASC Committee lauded Paly and its achievements.\r\n\r\n\"It's not that often that I can come to a WASC and feel the energy in the faculty pursuing and stepping into a new change,\" one of the WASC Visiting Committee members said to the staff in the meeting. \"You have all the capacity, all the energy, all the knowledge to move forward to really, as your superintendent said, be a stellar mark in the nation of what to do for students to deal with the whole student.\"\r\n\r\n[caption id=\"attachment_100588\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_1141.jpg\"><img class=\"wp-image-100588\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_1141.jpg\" alt=\"WASC Coordinator and Spanish teacher Emily Garrison and Principal Kim Diorio embrace after the positive WASC report. Photo by Takaaki Sagawa.\" width=\"350\" height=\"233\" \/><\/a> WASC Coordinator and Spanish teacher Emily Garrison and Principal Kim Diorio embrace after the positive WASC report. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nPaly WASC Coordinator Emily Garrison expressed her excitement over the successful report.\r\n\r\n\"I am very, very, very happy with the WASC visit,\" Garrison said. \"They really did what they needed to do, which was to validate our work, validate our self-study and also push us to that next level in 'How can we improve and do even better than what we already have planned?'\"\r\n\r\nWith this in mind, Garrison recognizes the areas in which growth is necessary.\r\n\r\n\"Our action plan was very comprehensive, very good, but [there are] a couple of small things [changes] that we'll do,\" Garrison said. \"The hard work now really starts. It's the next six years of where Paly is going to go.\"","excerpt":"The Western Association of Schools and Colleges Visiting Committee reported many strengths in Palo Alto High School's community and curriculum, but recommended minimizing the achievement gap and aligning courses for homogeneity at the WASC Evaluation Meeting today.","date":"2015-03-04 22:05:37","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_1121.jpg","categories":["News","Spotlight"],"tags":{"29828":"Committee","27775":"emily garrison","40121":"evaluation","8944":"palo alto high school","38963":"report","40122":"report of findings","40120":"visiting committee","27774":"WASC"}},{"id":99851,"title":"Season preview: Softball looks to make big strides","permalink":"http:\/\/palyvoice.com\/2015\/03\/04\/season-preview-softball-looks-to-make-big-strides\/","content":"[caption id=\"attachment_100554\" align=\"alignnone\" width=\"630\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11039358_10202463600030274_542839_n.jpg\"><img class=\" wp-image-100554\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11039358_10202463600030274_542839_n.jpg\" alt=\"Sophomore Teddie Stewart awaits the next pitch as hitting coach Liz Roscoe watches from the third base coach's box in an early season game against Menlo Atherton on March 3. The Vikings run-ruled the Bears 10-0 in six innings. Photo by Maddy Jones. \" width=\"630\" height=\"415\" \/><\/a> Sophomore Teddie Stewart waits for the incoming pitch as hitting coach Liz Roscoe watches from the third base coach's box during a game against Menlo-Atherton on March 3. The Vikings run-ruled the Bears 10-0 in six innings. Photo by Maddy Jones.[\/caption]\r\n\r\nThe Palo Alto High School softball team (1-1, 0-0) is seeking to move up in the standings after last year's mediocre season, inspired by a manager stressing the importance of working hard.\r\n\r\nLast season, the team finished with an overall record of 14-13, a fifth place finish in the El Camino League Standings. With six departing seniors highlighted by pitcher Julia Saul and second baseman Hannah Bundy, second-year manager Bill Laskey, former San Francisco Giants, Montreal Expos and Cleveland Indians pitcher, will need this year's five seniors to step up to the plate in their absence.\r\n\r\nLike in previous years, this year's team captains consist of the seniors: first baseman\/outfielder Autumn Macareno, outfielder Julianna Heron, outfielder Maddy Jones, outfielder\/designated hitter Kabria Dame and pitcher\/infielder Casey Glassford.\r\n\r\n\"The goal of the team this season is to improve on what we did last year,\" assistant coach Mike Dutto said. \"We want to be better than just a little over .500 [record].\"\r\n\r\nDuring team tryouts, coaches made the decision to cut three senior players, one of whom was playing for the team last season. Dutto explained the move as a tough but necessary decision.\r\n\r\n\"We would like to keep everyone, but we can't if [the players] are just going to sit on the bench the whole time,\" Dutto said. \"We have a new program here, and we are developing our younger players, who need to play.\"\r\n\r\nSophomore third basemen Maggie Renteria praised Laskey's motivating influence.\r\n\r\n\"I like how he really pushes us to work hard,\" Renteria said. \"He is really motivating and focused on helping us. I think his number one priority is for everyone to be the best they can be and always play one hundred percent as a team.\"\r\n\r\nJunior second basemen Jesse Kim agreed with Renteria, emphasizing Laskey's dedication to his players.\r\n\r\n\"I like how he seems to be very dedicated and intent on improving everyone,\" Kim said.\r\n\r\nThe girls' first league game is at 4 p.m. on Wednesday, March 18 at Monta Vista High School.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School softball team (1-1, 0-0) is striving to improve drastically after last year's mediocre season, inspired by a manager stressing the importance of working hard.","date":"2015-03-04 17:47:40","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11039358_10202463600030274_542839_n.jpg","categories":["Sports","Spotlight"],"tags":{"40096":"bill laskey","40095":"girls softball","40098":"jesse kim","40099":"maggie renteria","11391":"new season","8944":"palo alto high school","12045":"season preview","18372":"softball"}},{"id":99849,"title":"Boys&#8217; golf begins title defense with win over Homestead","permalink":"http:\/\/palyvoice.com\/2015\/03\/03\/boys-golf-begins-title-defense-with-win-over-homestead\/","content":"[caption id=\"attachment_100564\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11024953_10206069050267994_1790611489_o.jpg\"><img class=\"wp-image-100564 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11024953_10206069050267994_1790611489_o.jpg\" alt=\"11024953_10206069050267994_1790611489_o\" width=\"800\" height=\"600\" \/><\/a> Senior captain Alex Hwang chips a shot from the sand trap. Hwang is one of three seniors on the team this year. Photo by Doyle Knight.[\/caption]\r\n<p style=\"color: #000000;\">The Palo Alto High School boys’ golf team (1-0) began the defense of its league title with a close 205-216 win against Homestead last Wednesday at Sunnyvale Municipal Golf Course.<\/p>\r\nReturning senior captain Alex Hwang said that the overall match was disappointing, despite the result.\r\n\r\n\"Our goal is to break [under] 200 every time,\" Hwang said. \"But it was kind of a windy day so that was tough. However, I still felt that we played poorly in general.\"\r\n\r\nCoach Doyle Knight added that the close score is not necessarily representative of the rest of the upcoming season.\r\n\r\n\"We never play well, for whatever reason, at Sunnyvale Muni, so that score of 205 is not anywhere close to the talent of the kids that played that day,\" Knight said. \"[The course] just gets in their head or something. We've never scored well there [but] they did what they needed to do.\"\r\n\r\nAfter winning a second consecutive Santa Clara Valley Athletic League title last season, the boys' golf team set even loftier goals this season with three key freshman additions. Hwang highlighted the potential he sees in the team this year as central to this year's success.\r\n\r\n<span style=\"color: #373e4d;\">\"We've been pretty good lately, winning our division the last three years and league the last two years,\" Hwang said. \"I think we definitely have a shot to move past CCS to NorCals for the maybe first time ever.\" Last year, the team was knocked out in the first round of CCS.<\/span>\r\n\r\nFellow senior captain John Knowles added that high expectations for returning players and incoming freshmen should adequately diminish the big losses of graduated seniors Patrick Fuery and Sam Niethammer.\r\n\r\n\"The k<span style=\"color: #373e4d;\">ey to the upcoming season are two new talented freshmen, Ahmed Ali and Joon-Sung Ha,\" Knowles said. \"<\/span>Also, [returning juniors] Henry Gordon and Matt Lewis have gotten a lot better and so, under the watchful gaze of our great coach [Knight], we expect to go far.\"\r\n\r\nKnight especially underlined how well the new freshmen are adjusting to high school golf.\r\n\r\n\"[The team has] three new freshmen, two [Ali and Ha] right now are our number one and two in terms of averages,\" Knight said. \"[The] third freshman did really well when we played Valley Christian [last Tuesday] ... He isn't quite as talented as the other two yet, but he's showing a lot of promise.\"\r\n\r\nThe team's next league match will be against Fremont High School at 3 p.m. on Thursday at Sunnyvale Municipal Golf Course.\r\n\r\n&nbsp;","excerpt":"After winning a second consecutive Santa Clara Valley Athletic League title, the Palo Alto High School boys' golf team sets even loftier goals with three key freshman additions.","date":"2015-03-03 22:28:13","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11024953_10206069050267994_1790611489_o.jpg","categories":["Golf","Sports"],"tags":{"40009":"boys' golf","40011":"freshman on golf","40012":"freshmen on golf","8738":"Golf","40010":"golf 2015","32704":"homestead","14521":"paly golf","12045":"season preview"}},{"id":100454,"title":"Season preview: Boys’ lacrosse uncertain yet optimistic about future","permalink":"http:\/\/palyvoice.com\/2015\/03\/03\/season-preview-boys-lacrosse-uncertain-yet-optimistic-about-future\/","content":"[caption id=\"attachment_100455\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_0003.jpg\"><img class=\"wp-image-100455\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_0003.jpg\" alt=\"Senior midfielder Owen Staiger prepares to throw the ball. In this game, Paly defeated Woodside High School, 17-12, at 7 p.m. on March 4, 2015 at Palo Alto High School. Photo by Emma Chiu.\" width=\"620\" height=\"413\" \/><\/a> Senior midfielder Owen Staiger prepares to throw the ball in a game against Woodside High School last March. The Vikings defeated Woodside, 17-12. Photo by Emma Chiu.[\/caption]\r\n\r\nAmidst the deficit of 14 seniors and the loss of dominant private schools in its league, the Palo Alto High School boys' lacrosse team (1-0, 0-0) is teetering on the brink of success as it adjusts to new team dynamics.\r\n\r\nAs the Vikings take on Sacred Heart Prep at 7 p.m. Thursday at home, they entertain high hopes after defeating Archbishop Mitty High School, 12-10 in a non-league game. Sophomore Hayden Libbey said the game was challenging, and required a strong effort.\r\n\r\n“It was a pretty hard-fought game,” Libbey said. “We don’t have many players in total, so it was a lot of running for all of us.”\r\n\r\nWith this win under the belt, head coach DJ Shelton predicts the team dynamic to change, as the team is no longer so senior-heavy.\r\n\r\n“It was definitely a veteran group that had carried the program,” Shelton said. “This year, we have more of a complete team and it’s a little bit more balanced in age. The kids seem to be less focused on hierarchy and more about development.”\r\n\r\nSenior captain Zach Levitan also stressed that the team this year will be drastically different.\r\n\r\n“Our whole defense has changed,” Levitan said.\r\n\r\nJunior Matt Seligson echoed Levitan’s sentiments, but emphasized that there are some up-and-coming players that will make an impact on the field.\r\n\r\n“We lost a lot of firepower this year,” Seligson said. “ We’ve got some promising talent in sophomores Hayden Libbey, who’s been doing really well, and Christian Rider.”\r\n\r\nIn addition to the younger players, this year’s squad has several seasoned players that will be instrumental to Paly’s success, according to Shelton.\r\n\r\n“[Captains] Jon Rogers and Zach Levitan are just two of our outstanding players,” Shelton said. “[Juniors] Matt Seligson, Cole Tierney, and Quintin Valenti are some other players to look out for.”\r\n\r\nLast year the team finished 13-8 overall, 9-6 in league, and advanced to the semifinals of the SCVAL playoffs before being defeated by Menlo-Atherton High School. Now that fewer private schools, which have historically fielded strong lacrosse programs, are competing with Paly in the De Anza league, Shelton believes that the team has a shot at winning the league title.\r\n\r\n“We are looking to win league this year, and I think that’s a reality,” Shelton said. “All the private schools are gone, so while we play those teams, they’re not in our league. League is becoming a very strong option for us.”\r\n\r\nDespite the loss of the seniors and a smaller roster, the team seems optimistic about its chances for success this season.\r\n\r\n“I don’t think there’s anything that really stands in our way [of winning league], except ourselves,” Shelton said.","excerpt":"Despite losing 14 seniors from last year, the Palo Alto High School boys’ lacrosse team (1-0, 0-0) entertains high hopes for the upcoming season.","date":"2015-03-03 21:23:01","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_0003.jpg","categories":["Sports"],"tags":{"8491":"archbishop mitty","8537":"Boys","19371":"DJ Shelton","8836":"Lacrosse","9884":"league","8953":"paly","40097":"sacred heart prep","18834":"scvals","12045":"season preview","9090":"seniors"}},{"id":100468,"title":"Liveblog: Girls&#8217; soccer CCS semifinals vs. Santa Teresa","permalink":"http:\/\/palyvoice.com\/2015\/03\/03\/liveblog-girls-soccer-ccs-semifinals-vs-santa-teresa\/","content":"The Palo Alto High School girls' soccer team (16-2-1, 9-2-1) will be playing against Santa Teresa High School (15-6, 10-4) in the semifinals of the Cental Coast Section playoffs at 4:30 p.m. tomorrow at Palo Alto High School. Check back tomorrow for live updates!\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School girls' soccer team (16-2-1, 9-2-1) will be playing against Santa Teresa High School (15-6, 10-4) in the semifinals of the Cental Coast Section playoffs at 4:30 p.m. tomorrow at Palo Alto High School. Check back tomorrow for live updates!","date":"2015-03-03 13:35:28","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_2498.jpg","categories":["Sports"],"tags":{"40081":"4:40 p.m.","8568":"CCS","40079":"girls soccer team","8944":"palo alto high school","40082":"santa teresa high school","18835":"semifinals","40080":"wednesday 4"}},{"id":100074,"title":"News in Review: February 2015","permalink":"http:\/\/palyvoice.com\/2015\/03\/03\/news-in-review-february-2015\/","content":"<i>This is the second installment of the News in Review series, in which the month’s news will be summarized. The news is split into two sections: \"Stories you need to know,\" which highlights the news that had a wider impact on the Palo Alto High School student body and Palo Alto community, and \"Accomplishments and accolades,\" which highlights news stories that had an impact on a smaller group but are still worthy of recognition.<\/i>\r\n\r\n[caption id=\"attachment_100353\" align=\"aligncenter\" width=\"657\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/PicMonkey-Collage.jpg\"><img class=\"wp-image-100353\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/PicMonkey-Collage.jpg\" alt=\"PicMonkey Collage\" width=\"657\" height=\"407\" \/><\/a> A collage representing campus and local news stories of February 2015. Photos by (from left to right) Aidan Maese-Czeropski, Royce Wang, Reid Walters, Emma Chiu, Takaaki Sagawa, Alex Merkle-Raymond, Maya McNealis, George Lu and Gary Chen.[\/caption]\r\n\r\n<strong><span style=\"text-decoration: underline;\">Stories you need to know<\/span><\/strong>\r\n\r\n<strong>President Barack Obama visits Stanford, discusses cybersecurity<\/strong>\r\n\r\n[caption id=\"attachment_98830\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/obama-close-up-copy.jpg\"><img class=\"wp-image-98830\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/obama-close-up-copy.jpg\" alt=\"President Barack Obama gives a keynote speech at the White House summit at Stanford University on . Photo by Aidan Maese-Czeropski.\" width=\"300\" height=\"200\" \/><\/a> President Barack Obama gives a keynote speech at the White House summit at Stanford University on Feb. 13. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nAfter <a href=\"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-president-obama-arrives-in-san-francisco\/\">arriving at the San Francisco International Airport<\/a>, President Barack Obama held a White House <a href=\"http:\/\/palyvoice.com\/2015\/02\/13\/slideshow-white-house-summit-calls-for-improvements-in-cybersecurity\/\">summit at Stanford University<\/a> on Feb. 13 to spark a conversation with tech and business leaders about <a href=\"http:\/\/palyvoice.com\/2015\/02\/13\/liveblog-summit-on-cybersecurity-and-consumer-protection\/\">cybersecurity and consumer protection<\/a>. Obama signed an executive order to encourage companies to improve the way they share threat information, and the speaking panels discussed ways to increase the cooperation between private and public sectors to deter cyber threats.\r\n\r\n<strong>Paly wraps up six year WASC cycle, announces self-study report results<\/strong>\r\n\r\nCulminating the end of a six year cycle, Palo Alto High School’s Western Association of Schools and Colleges team <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/wasc-team-announces-results-of-self-study-report\/\">announced the results<\/a> of its 500-page <a href=\"http:\/\/pausd.org\/community\/board\/downloads\/brd_packet\/PalyWASC1415_Feb2.pdf\">self-study report<\/a>.The WASC team was comprised of administrators, parents and students who combined their efforts to evaluate the effectiveness of Paly's current methods. The assessment produced three goals for the next WASC cycle: systems alignment, student engagement and innovation. This week, a WASC team will be visiting to evaluate Paly and assess the validity of its WASC report – so, don't be too weirded out if you see someone you don't know sitting in on your class. The WASC committee will later present its evaluations, which will determine how long of a cycle the next accreditation process will be.\r\n\r\n<strong>New PAUSD committee working to reduce achievement gap<\/strong>\r\n\r\nPalo Alto Unified School District’s new <a href=\"http:\/\/palyvoice.com\/2015\/02\/03\/committee-to-address-achievement-gap\/\">Minority Achievement and Talent Development Advisory Committee continues to convene <\/a>in order to address the district’s achievement gap for students of color and lower socioeconomic standings. The committee consists of students, faculty, parents and other community members and is focused on identifying and eventually resolving key issues. The next meeting will be at 7 p.m. today at the PAUSD District Office Board Room.\r\n\r\n<strong>Former U.S. Secretary of Energy speaks on climate change<\/strong>\r\n\r\n[caption id=\"attachment_100314\" align=\"alignleft\" width=\"285\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_2200.jpg\"><img class=\"wp-image-100314\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_2200.jpg\" alt=\"Steven Chu begins his presentation by talking about the issue of climate change and how current energy consumption patterns are contributing to the problem. Photo by George Lu.\" width=\"285\" height=\"190\" \/><\/a> Steven Chu begins his presentation by talking about the issue of climate change and how current energy consumption patterns are contributing to the problem. Photo by George Lu.[\/caption]\r\n\r\nNobel laureate and former U.S. Secretary of Energy Steven Chu <a href=\"http:\/\/palyvoice.com\/2015\/02\/27\/slideshow-former-u-s-secretary-of-energy-speaks-on-energy-use-climate-change\/\">discussed climate change in the Media Arts Center<\/a> on Feb. 25 during his talk “Energy, Climate Change and a Path Forward.” Chu talked about subjects ranging from the impact of our current consumption of energy, to the importance of thinking about the future impact of environmentally harmful present human activities, to the shrinking timeframe to take mitigation action on climate change. This was the first presentation of the <a href=\"http:\/\/palyvoice.com\/2015\/02\/21\/former-secretary-of-energy-to-kick-off-mac-speaker-series\/\">MAC booster-sponsored speaker series<\/a>.\r\n\r\n<strong>Mayor gives State of Palo Alto Address<\/strong>\r\n\r\nCity of Palo Alto Mayor Karen Holman gave her <a href=\"http:\/\/palyvoice.com\/2015\/02\/23\/mayor-holman-delivers-state-of-palo-alto-address\/\">State of Palo Alto Address<\/a> on Feb. 18 at the Mitchell Park Community Center. In the address, Holman highlighted three main goals: maintaining a balance of retail vs. technology business space in order to focus on the walkability of the city, encouraging youth to take action in things they are passionate about and giving youth a voice by creating a communication channel between them and the city through town hall-style meetings.\r\n\r\n<strong>City-wide discussion on school climate expands to include student body<\/strong>\r\n\r\nThe Associated Student Body and the Paly administration invited <a href=\"http:\/\/palyvoice.com\/2015\/02\/25\/students-to-voice-opinions-at-student-forum\/\">students to voice their opinions<\/a> on anything related to their experiences at Paly in an open student forum on Feb. 26. The open forum allowed students to speak directly with Principal Kim Diorio and PAUSD Superintendent Max McGee. Though the turnout totaled just around two dozen, <a href=\"http:\/\/palyvoice.com\/2015\/03\/01\/students-address-schools-systemic-flaws-at-student-forum\/\" target=\"_blank\">students offered<\/a> a number of ideas and suggestions to address ideas like the effectiveness of Advisory, the issue of laning and the lack of openness surrounding mental health and wellness.\r\n\r\n[soundcloud url=\"https:\/\/api.soundcloud.com\/tracks\/193907064\" params=\"color=ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false\" width=\"100%\" height=\"166\" iframe=\"true\" \/]\r\n\r\n<strong>ASB’s modifies Sadie Hawkins dance challenges gender roles and stereotypes, announces Prom theme<\/strong>\r\n\r\nASB hosted an <a href=\"http:\/\/palyvoice.com\/2015\/02\/19\/asb-to-host-all-inclusive-sadie-hawkins-dance\/\">“all-inclusive” Sadie Hawkins dance<\/a> on Feb. 20 for which all students, regardless of gender, were welcome to ask whomever they wanted to attend with them. <a href=\"http:\/\/palyvoice.com\/2015\/02\/20\/liveblog-sadie-hawkins-formal-dance-2015\/\">At the dance<\/a>, ASB announced the <a href=\"http:\/\/palyvoice.com\/2015\/03\/03\/leave-your-heart-in-san-francisco-at-prom-2015\/\" target=\"_blank\">“I Left My Heart in San Francisco” Prom theme<\/a>. Ticket sales begin on March 9 and end on April 10.\r\n\r\n<strong><span style=\"text-decoration: underline;\">Accomplishments and accolades<\/span><\/strong>\r\n\r\n<strong>Art in Unusual Places week exposes campus to student work<\/strong>\r\n\r\nProps to all those artists on campus for getting showcased during the last week of February’s “Arts in Unusual Places” events which brought out various student work in the traditional, digital and performing arts to the larger Paly community. The performances included artwork posted along buildings, glass-blown pieces hung from trees on the Quad, an a cappella performance outside the MAC and <a href=\"https:\/\/www.facebook.com\/video.php?v=10152721585681305&amp;permPage=1\" target=\"_blank\">Paly band performances<\/a> next to the math and history buildings and on the Quad, among others. The “Arts in Unusual Places” week culminated with an annual all-day photojournalism event in the Media Arts Center with <a href=\"http:\/\/palyvoice.com\/2015\/02\/26\/award-winning-photojournalist-to-speak-at-annual-forum\/\">award-winning photojournalist Ed Kashi.<\/a>\r\n\r\n<strong>SciBowl team wins third at regionals<\/strong>\r\n\r\n[caption id=\"attachment_99850\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg\"><img class=\"wp-image-99850\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg\" alt=\"Paly Science Bowl members (from left to right) sophomore Samarth Venkatasubramanian, junior Andrew Lee, senior Jasen Liu, senior Matthew Li and senior Gary Chen pose for a photo after placing third at regionals. Photo courtesy of Gary Chen.\" width=\"300\" height=\"225\" \/><\/a> Paly Science Bowl members (from left to right) sophomore Samarth Venkatasubramanian, junior Andrew Lee, senior Jasen Liu, senior Matthew Li and senior Gary Chen pose for a photo after placing third at regionals. Photo courtesy of Gary Chen.[\/caption]\r\n\r\nCongrats to the Paly Science Bowl team for <a href=\"http:\/\/palyvoice.com\/2015\/02\/26\/science-bowl-places-third-at-regional-competition\/\" target=\"_blank\">placing third at the regional competition<\/a>. As the last SciBowl competition of the season, the team ended on a high note, especially for seniors Gary Chen, Matthew Li and Jasen Liu since it was their final SciBowl contest.\r\n\r\n<strong>Paly hosts second annual TEDx speaking series<\/strong>\r\n\r\nShoutout to Paly’s TEDx Club for hosting a number of <a href=\"http:\/\/palyvoice.com\/2015\/02\/08\/paly-hosts-second-annual-tedx\/\">student, teacher and professional speakers <\/a>throughout the school day on Feb. 9 for its second TEDx since the club’s founding. The presentations covered a variety of topics, such as the importance of scientific journalism, the stigma around introversion and the implementation of blended learning in classrooms.\r\n\r\n<strong>Second pearl milk tea shop opens downtown<\/strong>\r\n\r\nThe numerous Pearl Milk Tea addicts rejoiced to hear that Gong Cha opened on Feb. 14 as the city’s second PMT shop. Though the store has received some <a href=\"http:\/\/palyvoice.com\/2015\/02\/19\/review-dontcha-want-to-try-gong-cha\/\" target=\"_blank\">mixed reviews<\/a>, it provides Palo Altans with more options than just the <a href=\"http:\/\/palyvoice.com\/2014\/10\/29\/pearl-milk-tea-comes-to-palo-alto-from-taiwans-t4\/\" target=\"_blank\">ever-popular T4<\/a> and <a href=\"http:\/\/palyvoice.com\/2014\/10\/11\/the-ultimate-pearl-milk-tea-challenge-the-castro-quadruplets\/\" target=\"_blank\">Castro favorites<\/a>. Gong Cha is located at 439 Waverly St. and is open from 11:30 a.m. to 5 p.m.\r\n\r\n<iframe src=\"https:\/\/www.google.com\/maps\/embed?pb=!1m18!1m12!1m3!1d3167.5482145524957!2d-122.16100210185239!3d37.44777622682334!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x808fbb3856c8b7db%3A0x79bcf0d970ea1c97!2s439+Waverley+St%2C+Palo+Alto%2C+CA+94301!5e0!3m2!1sen!2sus!4v1425171684391\" width=\"300\" height=\"300\" frameborder=\"0\"><\/iframe>\r\n\r\n<strong>Paly fencers place first in Junior Olympics<\/strong>\r\n\r\nCongratulations are in order for Paly fencers senior Royce Wang and junior Julian Knodt, who <a href=\"http:\/\/palyvoice.com\/2015\/02\/18\/paly-fencers-win-gold-at-2015-junior-olympics\/\">won gold at this year’s Junior Olympics<\/a> for the Cardinal Fencing junior men’s sabre team and the individual junior men’s foil division, respectively.\r\n\r\n<strong>Paly sports teams advanced to Central Coast Section competitions<\/strong>\r\n\r\nAfter strong regular seasons, all winter sports athletes should be recognized for their hard work and contributions to the Paly athletics program.\r\n\r\nGirls’ soccer <a href=\"http:\/\/palyvoice.com\/2015\/02\/28\/slideshow-girls-soccer-beats-m-a-in-ccs-quarterfinals\/\" target=\"_blank\">defeated Menlo-Atherton<\/a> High School by 1-0 on Feb. 28 and will advance to the semifinal round of CCS against Santa Teresa High School on March 4. Boys’ soccer <a href=\"http:\/\/palyvoice.com\/2015\/02\/24\/liveblog-boys-soccer-ccs-first-round-vs-santa-teresa\/\">won the first round of CCS<\/a> but <a href=\"http:\/\/palyvoice.com\/2015\/03\/01\/boys-soccer-falls-to-bellarmine-in-season-ending-loss\/\" target=\"_blank\">fell to Bellarmine<\/a> in the quarterfinals on Feb. 28 by a score of 2-0.\r\n\r\nAfter going undefeated, the girls’ basketball team <a href=\"http:\/\/palyvoice.com\/2015\/02\/23\/girls-basketball-to-play-no-1-st-ignatius-friday\/\">lost in the first round of CCS<\/a> to St. Ignatius College Preparatory, which is ranked fifth in the nation, on Feb. 27 and will play Scotts Valley High School this Tuesday, <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-basketball\/home.htm\">according to Maxpreps<\/a>. Boys’ basketball narrowly lost to Santa Teresa in the second round of CCS after a first-round bye, <a href=\"http:\/\/www.maxpreps.com\/games\/basketball-winter-14-15\/palo-alto-vs-santa-teresa\/2-26-2015-Y3t-mMWl-E2TxifIyxQmXw.htm\">according to Maxpreps<\/a>.\r\n\r\nBoys' wrestling <a href=\"http:\/\/palyvoice.com\/2015\/02\/26\/boys-wrestling-to-attend-ccs-this-weekend\/\" target=\"_blank\">went to CCS<\/a>, most notably with senior Chioke Bryant-Anderson placing fifth in his weight category and senior captain James Giaccia qualifying for the state competition after placing third in his weight division. Senior Alexa Austin and sophomore Sarah Aguilar both placed first in their respective weight divisions at CCS but ultimately <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/02\/28\/three-local-wrestlers-reach-semifinals-at-ccs-tourney\" target=\"_blank\">lost in consolation rounds<\/a> at the <a href=\"http:\/\/palyvoice.com\/2015\/03\/01\/girls-wrestling-builds-momentum-at-paly\/\" target=\"_blank\">State Championships<\/a>, according to Austin.\r\n<blockquote class=\"twitter-tweet\" lang=\"en\">Paly's Sarah Aguilar &amp; Alexa Austin are <a href=\"https:\/\/twitter.com\/hashtag\/CCS?src=hash\">#CCS<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/wrestling?src=hash\">#wrestling<\/a> champions! <a href=\"https:\/\/twitter.com\/Alexa9264\">@alexa9264<\/a> <a href=\"https:\/\/twitter.com\/thevikingmag\">@thevikingmag<\/a> <a href=\"https:\/\/twitter.com\/PalyVikings\">@PalyVikings<\/a> <a href=\"https:\/\/twitter.com\/Braumon\">@braumon<\/a> <a href=\"http:\/\/t.co\/BE6yAyY5kT\">pic.twitter.com\/BE6yAyY5kT<\/a>\r\n\r\n— KFair Sports (@kfairsports) <a href=\"https:\/\/twitter.com\/kfairsports\/status\/564488656593756160\">February 8, 2015<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"This is the second installment of the News in Review series, in which the month’s news will be summarized. The news is split into two sections: the must reads and the \"accolades and accomplishments.\"","date":"2015-03-03 13:18:33","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/PicMonkey-Collage.jpg","categories":["News","Spotlight"],"tags":{"40007":"art in unusual places","8568":"CCS","40075":"february news","18368":"forum","40078":"gender roles","40077":"karen holman","40076":"monthly news","8916":"news","38267":"news in review","38868":"obama","8944":"palo alto high school","8953":"paly","9016":"prom","39377":"scibowl","38960":"steven chu","11635":"TEDx","27774":"WASC","9241":"wrestling"}},{"id":98587,"title":"Leave your heart in San Francisco at Prom 2015","permalink":"http:\/\/palyvoice.com\/2015\/03\/03\/leave-your-heart-in-san-francisco-at-prom-2015\/","content":"<div class=\"page\" title=\"Page 1\">\r\n\r\nAs we move into March, the student population awaits anxiously on the Quad waiting for the social phenomenon that strikes Palo Alto High School each spring. There's a buzz in the air as we anticipate who will be the first to march onto the Quad bearing flowers, posters and perhaps even \"Star Wars\" paraphernalia. After the creation of \"PROM DRESSES 2015\" on Facebook in January, everyone knows Prom season is here. With one of Paly's biggest events of the year rolling around in less than two months, The Paly Voice is here to fill you in on all things Prom.\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\n<strong>Location<\/strong>\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\nPreparations for <a href=\"https:\/\/www.youtube.com\/watch?v=bq8vxcz0GxA\" target=\"_blank\">Prom 2015<\/a> have been in high gear since <a href=\"http:\/\/palyvoice.com\/2015\/01\/15\/prom-2015-location-sf-city-hall\/\" target=\"_blank\">ASB announced the location<\/a>, San Francisco City Hall, at the Winter Rally in January.\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\nSenior class president Maya Ben-Efraim notes that the location is a particularly exciting feature of this year's Prom.\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\n\"Usually, events just rent out the rotunda, but we're getting the rotunda and the upstairs balconies,\" Ben-Efraim said. \"We're going to have a ton of space, with lots of places to hang out, dance, eat and take pictures.\"\r\n<div class=\"page\" title=\"Page 1\">Ben-Efraim believes the location will provide an elagant backdrop for the evening's festivities.\r\n\"It's really beautiful and I'm very excited,\" Ben-Efraim said. \"I think it's going to be our most beautiful Prom yet.\"\r\n\r\n[caption id=\"attachment_100262\" align=\"alignleft\" width=\"371\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10931011_907653035920069_8507970456468805690_n.jpg\"><img class=\" wp-image-100262\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10931011_907653035920069_8507970456468805690_n.jpg\" alt=\"Palo Alto High School's Associated Student Body will host Prom 2015 on April 18 at San Francisco City Hall. The rotunda and upper balcony spaces will all be available for students to enjoy. Photo courtesy of Paly ASB. \" width=\"371\" height=\"170\" \/><\/a> Palo Alto High School's Associated Student Body will host Prom 2015 on April 18 at San Francisco City Hall. The rotunda and upper balcony spaces will all be available for students to enjoy. Photo courtesy of Paly ASB.[\/caption]\r\n\r\n<strong>Theme<\/strong>\r\n\r\nASB announced the complementing theme, \"I Left My Heart in San Francisco,\" at the <a href=\"http:\/\/palyvoice.com\/2015\/02\/20\/liveblog-sadie-hawkins-formal-dance-2015\/\" target=\"_blank\">Sadie Hawkins dance<\/a> on Feb. 20. The theme, according to Ben-Efraim, will primarily be used for publicity purposes.\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\n\"It [the theme] does not affect the attire,\" Maya Ben-Efraim said. \"Just wear your usual black-tie formal outwear.\"\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\n<strong>Dining and Entertainment<\/strong>\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\nAccording to Ben-Efraim, the dining for the evening will be a heavy <span style=\"color: #252525;\">hors d'oeuvres-style international tasting menu, with four different stations: <\/span>American, Italian, Mexican and Mediterranean. Entertainment will feature DJ Hightop, who has deejayed several ASB events in the past, including Prom 2014. Other activities available to students include a photo booth and a caricature artist.\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n\r\n<strong>Tickets and Donations<\/strong>\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n\r\nTickets, which can <a href=\"https:\/\/palywebstore.myschoolcentral.com\/asbworks\/(S(dyhau1r1lbos2a55cqryhmur))\/WebStore.aspx\" target=\"_blank\">be bought online<\/a>, will go on sale on March 9. The \"Early Bird\" prices are $120 or $110 for ASB cardholders. Prices will increase on March 27 to $130 or $120 for ASB cardholders. Sales will end on April 10.\r\n\r\nAdditionally, <a href=\"https:\/\/docs.google.com\/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxwYWhzYXNifGd4OjExYzg2NTkwNzgwMjcyN2I\" target=\"_blank\">in a letter<\/a> released on Feb. 6, ASB officers Maya Ben-Efraim and Olivia Scola announced the opportunity for families to donate to ASB in order to subsidize ticket prices to provide scholarships for students. In the letter, ASB cites a lack of revenue from parking permit sales as the primary cause behind ASB's inability to subsidize ticket prices. <a href=\"http:\/\/palyvoice.com\/2015\/02\/17\/upcoming-construction-projects-remain-on-schedule\/\" target=\"_blank\">Construction projects<\/a> were the main cause of lower permit sales in the fall. Last year, ASB was able to subsidize $40 per ticket. According to the letter, each $7,000 dollars donated will subsidize each ticket by $10.\r\n\r\nDonations <a href=\"http:\/\/goo.gl\/woA7jV\">can be made online<\/a> or in a letter addressed to <span style=\"font-style: italic;\">Palo Alto High School, C\/O Matt Hall, 50 Embarcadero Road, Palo Alto, CA 94301.<\/span>\r\n\r\n<strong>Bus Sign-Ups<\/strong>\r\n\r\nInformation regarding bus-signups will be made available closer to the event. According to Ben-Efraim, students may only sign up for a bus if they have purchased a ticket.\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"With one of Paly's biggest events of the year rolling around in less than two months, The Paly Voice is here to fill you in on all things Prom.","date":"2015-03-03 13:13:43","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10931011_907653035920069_8507970456468805690_n.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","33469":"city hall","39969":"i left my heart in san francisco","30858":"maya ben-efraim","8944":"palo alto high school","9016":"prom","36408":"prom 2015","39968":"prom theme","9061":"San Francisco"}},{"id":99890,"title":"Career Month Speaker Series kicks off","permalink":"http:\/\/palyvoice.com\/2015\/03\/03\/career-month-speaker-series-kicks-off\/","content":"<p>[caption id=\"attachment_100051\" align=\"alignright\" width=\"368\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.05.27-PM.png\"><img class=\" wp-image-100051\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.05.27-PM.png\" alt=\"There will be seventeen speakers this year, covering a wide range of occupations. Organizer by Jeanette Wong.  \" width=\"368\" height=\"289\" \/><\/a> There will be seventeen speakers this year, covering a wide range of occupations. Photo by  Jeanette Wong.[\/caption]<\/p>\r\n<p>Palo Alto High School’s Seventh Annual Career Month Speaker Series started yesterday during lunch in the library and will continue through March 12. Unlike in previous years, this year, Paly Career &amp; Community Engagement Advisor Christina Owen is working with a student leadership team to organize the event.<\/p>\r\n<p>“The biggest change by far is the implementation of a student leadership team,” Owen said. “The team of five students has been working for the past four months to produce the event, with me as their advisor.”<\/p>\r\n<p>According to co-chair of the student planning committee,  junior Pryia Misner, the purpose of the series is to help students plan for the future.<\/p>\r\n<p>“The committee is hoping to expose Paly students to a wide range of careers so that they start thinking about their future and imagine themselves in different fields,” Misner said. “Hopefully this will help them solidify prior interests as well as discover new passions.”<\/p>\r\n<p>This year' speakers cover a variety of occupations from new technology to sports.<\/p>\r\n<p>[caption id=\"attachment_100379\" align=\"aligncenter\" width=\"315\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_0517.jpg\"><img class=\"wp-image-100379\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_0517.jpg\" alt=\"IMG_0517\" width=\"315\" height=\"236\" \/><\/a> Yesterday during lunch, Social Media Consultant and Dentist Dr. Edward Zuckerberg, talked about the importance of pursuing passion and how he modernized the dentistry industry. Photo by Jeanette Wong.[\/caption]<\/p>\r\n<p>“Some of the more unique speakers we have coming are the people who are responsible for the Google driverless car, as well as NFL officials,” Misner said.<\/p>\r\n<p>In addition to learning about careers, the first 250 students to attend will also receive free lunch, according to Owen.<\/p>\r\n<p>Junior Eric Chiang attended the Speaker Series yesterday after a positive experience last year.<\/p>\r\n<p>“I’m excited to learn about the different fields,” Chiang said. “I feel like some people go for the food, but the talks are pretty informative. [Last year] I liked the hands-on talks: when the speakers brought in stuff so I'm hoping there will be some of those this year.”<\/p>\r\n<p>The Speaker Series continues tomorrow with speakers covering lung surgery in the SSRC and city economic development in the ERC.<\/p>\r\n<p>&nbsp;<\/p>\r\n","excerpt":"Palo Alto High School’s Seventh Annual Career Month Speaker Series started yesterday during lunch in the library and will continue until March 12.","date":"2015-03-03 09:25:09","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_0517.jpg","categories":["News","Spotlight"],"tags":{"11888":"career month","11390":"field","39602":"job. food","38959":"speaker series"}},{"id":100098,"title":"Girls&#8217; wrestling builds momentum at Paly","permalink":"http:\/\/palyvoice.com\/2015\/03\/01\/girls-wrestling-builds-momentum-at-paly\/","content":"[caption id=\"attachment_100332\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/image1.jpg\"><img class=\"wp-image-100332\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/image1.jpg\" alt=\"image\" width=\"450\" height=\"316\" \/><\/a> Sophmore Sara Aguilar and junior Alexa Austin stand with former Coach Duran after winning CCS 2014. Photo courtesy of the Palo Alto wrestling team.[\/caption]\r\n\r\nNationwide, around 9,000 high school girls wrestled last year, which is nearly nine times more than from a decade earlier, according to the National Wrestling Coaches Association. Although girls' wrestling is growing in numbers, only about three percent of high school wrestlers are girls. Sophomore Sara Aguilar and senior Alexa Austin are the two female members of the Palo Alto High School wrestling team. The girls compete this weekend at the California Interscholastic Federation girls' state tournament in Visalia. The Paly Voice sat down with the two female wrestlers to ask them about their wrestling experiences at Paly.\r\n\r\n<b>The Paly Voice: <\/b>How did you get interested in wrestling?<b> <\/b>\r\n\r\n<b>Sara Aguilar<\/b>: Well, I started because at JLS (Jane Lathrop Stanford Middle School), I had Physical Education with Coach Braumon Creighton. He asked me if I wanted to do it, and I just did because it seemed fun.\r\n\r\n<b>Alexa Austin:<\/b> For me, I also was in Mr. Creighton’s class, and he wanted me to join. I thought I was too cool for wrestling, so I didn't. I actually played basketball freshmen year. Then, my mom and I started going to church, and my youth pastor was a wrestler, and he told me to join. I tried it just to try it and liked it, so I stayed.\r\n\r\n<b>TPV: <\/b>What would you suggest for other girls interested in wrestling?\r\n\r\n<b>SA<\/b>: Don't be afraid to try out even if you're the only girl. It is really fun, and you learn a lot. Mentally and physically, you grow.\r\n\r\n<b>AA<\/b>: It really is a fun sport. It might seem scary and intimidating, but it's a really welcoming team. Once you come out, we just like embrace each other.\r\n\r\n<b>TPV: <\/b>How much of a time commitment is it?\r\n\r\n<b>AA<\/b>: Practice is after school every day until 5:30 or 6 p.m. We don't really have any morning practices. Tournaments are on the weekends.\r\n\r\n<b>TPV: <\/b>How do you get on the team?\r\n\r\n<b>SA<\/b>: It's not a cut sport, so that means anyone can try out.\r\n\r\n<b>AA:<\/b> We start conditioning in September. Our first tournament is in December, so we just train for a few months.\r\n\r\n<b>TPV: <\/b>What's your favorite part about wrestling?\r\n\r\n<b>SA<\/b>: Being aggressive (laughs). It's just fun. You get obsessed with it sometimes.\r\n\r\n<b>AA<\/b>: I like competing. In a lot of tournaments, you compete with each other, but once the match is over, you become close friends. A lot of my toughest competitors, I train with a lot in the off season, and we are really close.\r\n\r\n<b>TPV: <\/b>What competitions are big for the girls' team?\r\n\r\n<b>AA<\/b>: A big one for the girls is Napa. Before girls' wrestling was part of the school, that was the state tournament, so we just keep going to it. We usually go to the <a href=\"http:\/\/www.sbhsd.k12.ca.us\/tournament\">Hollister Baler Bash<\/a>, which is very fun. Its a country tournament with hay bales and stuff like that. We always go to CSS (Central Coast Section) and State. We play in the dual meets, which is our school versus another school. Sometimes we do that in the league finals.\r\n\r\n<b>SA<\/b>: We also go to the boys' tournaments.\r\n\r\n<b>TPV: <\/b>Are there more girl wrestlers now than before?\r\n\r\n<b>AA<\/b>: Girls' wrestling is definitely growing and getting bigger. CCS is a lot bigger this year than it was last year, and it's been growing the three years we have been going. It grows – people get invited to come and just try it out.\r\n\r\n<em>The girls will attend the weekend-long CIF tournament this weekend at the Visalia Convention Center in Visalia.<\/em>","excerpt":"Sophomore Sara Aguilar and senior Alexa Austin are the two female members of the Palo Alto High School wrestling team. The girls compete this weekend at the California Interscholastic Federation girls' state tournament in Visalia.","date":"2015-03-01 17:07:26","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/image1.jpg","categories":["Features"],"tags":{"38439":"alexa austin","39960":"cif tournament","39959":"girls wrestling","25040":"interview","8944":"palo alto high school","38440":"Sara Aguilar","9120":"sports","9241":"wrestling"}}]