[{"id":105267,"title":"Timeline: May 2015 News in Review","permalink":"http:\/\/palyvoice.com\/2015\/06\/01\/timeline-may-2015-news-in-review\/","content":"<em>This is the fifth installment of the News in Review series, which summarizes the most important news stories and events from the month of May in a timeline format. <\/em>\r\n\r\n<iframe src=\"\/\/cdn.knightlab.com\/libs\/timeline\/latest\/embed\/index.html?source=0AmmgLOliFmExdE05RzBMRUJZVUJCZl8zRDItbEc4Umc#gid&amp;font=Bevan-PotanoSans&amp;maptype=toner&amp;lang=en&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This is the fifth installment of the News in Review series, which summarizes the most important news stories and events from the month of May in a timeline format.","date":"2015-06-01 14:21:07","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-7.39.26-PM.png","categories":["Multimedia","Spotlight"],"tags":{"19460":"2015","11628":"ap bio","12357":"athletic director","44632":"best of the best","43482":"bowers","44928":"diepenbrock","44930":"dismissed","8704":"field day","44932":"gunn bell schedule","42205":"hogwarts week","43329":"may","43592":"may fete parade","42896":"measure A","8916":"news","38267":"news in review","17489":"one acts","8944":"palo alto high school","8953":"paly","44931":"senior cut day","9121":"Spring Sports","44929":"staff positions","41536":"the paly voice","9792":"viking","9214":"voice"}},{"id":105055,"title":"Seniors launch gaming community","permalink":"http:\/\/palyvoice.com\/2015\/06\/01\/seniors-launch-gaming-community\/","content":"Two Palo Alto High School seniors are actively publicizing their new gaming-community website \"<a href=\"http:\/\/playongaming.com\">Play On<\/a>,\" designed for students who are interested in relaxing by playing video games.\r\n\r\n[caption id=\"attachment_105322\" align=\"alignright\" width=\"271\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-11.10.35-AM.png\"><img class=\"wp-image-105322 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-11.10.35-AM.png\" alt=\"Screen Shot 2015-05-28 at 11.10.35 AM\" width=\"271\" height=\"107\" \/><\/a> Two Paly seniors Griffin Bajor and Jake Gurle co-founded \"Play On,\" a gaming community targeted towards students who are looking to relax by playing video games.[\/caption]\r\n\r\nGriffin Bajor and Jake Gurle co-founded \"Play On\" for Palo Alto Unified School District students with all levels of expertise in the gaming world.\r\n\r\n\"You might already play games, you might not,\" Bajor said. \"If you don't, you can discover the great games out there to play on your Windows or Mac computer. If you do already play games, add your favorite games to the service to find new people to play with.\"\r\n\r\nUsers are encouraged to purchase the easily accessible \"Disco Dodgeball,\" \"Garry's Mod,\" \"Risk of Rain\" and \"Hammerwatch\" to have gaming compatibility with other users. With the donation from an Indie Developer 82apps, free copies of \"Robot Roller-Derby Disco Dodgeball\" are available for the first few people who sign up, according to Bajor.\r\n\r\n\"Play On\" is distinct from other gaming websites because it urges high schoolers to expand from their typical friend groups to play games with unfamiliar faces on larger servers in smaller, more intimate, matches, its creators say. Bajor and Griffin say they also plan to schedule community events for larger groups to join.\r\n\r\n\"My primary goal for 'Play On' is to make students feel welcome to a great community,\" Bajor said. \"It's just ... a place for anyone to have fun.\"\r\n\r\nA series of suicides motivated Bajor to create something beneficial for his community.\r\n\r\n\"I thought about my past experiences forming small gaming communities for my friends,\" Bajor said. \"I realized that I could take something I could love doing and bring it to the audience of all PAUSD students.\"\r\n\r\nTogether, Bajor and Gurle coded a website accessible for all students.\r\n\r\n\"When you join, you'll be a part of a community of fellow students, all looking to have fun,\" Bajor said. \"It's to take a break from the stresses of school, or to just have something fun to do.\"","excerpt":"Two Palo Alto High School seniors are actively publicizing their new gaming website \"Play On,\" designed for students who are interested in relaxing by playing video games.","date":"2015-06-01 14:11:33","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-11.10.35-AM.png","categories":["Features"],"tags":{"44905":"cofounded","8611":"Community","15410":"game","32466":"gaming","25086":"griffin bajor","44904":"jake gurle","8939":"palo alto","8977":"PAUSD","44906":"play on"}},{"id":103915,"title":"Athlete of the Year: Sophie Frick","permalink":"http:\/\/palyvoice.com\/2015\/05\/30\/athlete-of-the-year-sophie-frick\/","content":"On a cool and windy Friday afternoon in the middle of softball season, the Palo Alto High School softball team hosted the Santa Clara Bruins at their home field. It was a typical regular season league game, and the Vikings uneventfully fell short by a score of 6-1. It was during the last inning when the Vikings, having been out-dueled all game offensively by the pitching of Bruins phenom Kathryn Caravalho, finally showed signs of life for the first time. \r\n\r\nFreshman first baseman Sophie Frick worked the count full against Caravalho, who prior to the at-bat had only allowed two hits in the game. Even though her team trailed by six runs, Frick continued to persist by fouling off multiple pitches. On the eighth pitch of the at-bat, she ripped a double down the left-field line, knocking in the first run of the game for the Vikings, her teammates and coaches applauding. She's been doing that kind of thing all season. \r\n\r\nPlaying on a team with 10 upperclassmen, it would be natural to assume that Frick wouldn't receive the starting job at first base and a spot in the middle of the order. But after an impressive performance early in the season, her manager Bill Laskey did just that. \r\n\r\nAs it turns out, Frick isn't just good at softball. In the fall, she helped lead the girls' water polo team's push into the CCS playoffs. Later, she became a part of Coach Scott Peters' eight-player rotation, playing key minutes throughout a championship season for girls' basketball. She also finished in the top three on the softball team in hits (18), runs batted in (14), and batting average (.316), according to MaxPreps.com. \r\n\r\n[caption id=\"attachment_104992\" align=\"alignnone\" width=\"590\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11303970_1602089120038641_1694026943_o.jpg\"><img class=\" wp-image-104992\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11303970_1602089120038641_1694026943_o.jpg\" alt=\"Freshman Sophie Frick looks to pass to a nearby teammate in a home water polo game against Mountain View. Frick began the season on JV and eventually moved up to varsity. Photo by Howard Look. \" width=\"590\" height=\"393\" \/><\/a> Freshman Sophie Frick looks to pass to a nearby teammate in a home water polo game against Mountain View. Frick began the season on JV and eventually moved up to varsity. Photo by Howard Look.[\/caption]\r\n\r\nAfter a class online vote that featured eight Paly athletes, Frick's accomplishments this year were enough to earn recognition as the Paly Voice's Athlete of the Year.\r\n\r\nFor many young athletes around the world, the title \"student-athlete\" applies for one particular sport. Maybe two. Playing three sports year-round in high school is a feat that requires not just athleticism, but patience, determination, and a consistently assiduous attitude. What about three sports, all at the varsity level, as a <em>freshman<\/em> in high school? Is that even sustainable? \r\n\r\nFor Frick, it's more than just possible. It's a lifestyle. Palo Alto High School's next super-athlete is loving every moment of Paly sports. \r\n\r\n\"I don't know if I could just pick a favorite [sport],\" Frick said in a recent interview. \"My favorite is the one that I'm playing at the time during the season.\"\r\n\r\n[caption id=\"attachment_105043\" align=\"alignleft\" width=\"335\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11304157_1602089183371968_1945597461_n.jpg\"><img class=\"wp-image-105043\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11304157_1602089183371968_1945597461_n.jpg\" alt=\"Frick participates in a summer softball tournament during 2013. Two years later, Frick is a big presence in the middle of the Paly softball team's lineup. Photo by Jeff Frick. \" width=\"335\" height=\"224\" \/><\/a> Frick participates in a summer middle school softball tournament in 2013. Two years later, Frick is a big presence in the Paly softball team's lineup. Photo by Jeff Frick.[\/caption]\r\n\r\nThe time management required to juggle high school academics and overlapping sports games and practices has always been a part of Frick's teenage lifestyle.\r\n\r\n\"I've been used to the timing [of playing multiple sports],\" Frick said. \"I did the same thing in middle school where I was playing a sport throughout every season, so I'm definitely used to the time management and doing homework when I have free time especially. It hasn't been that hard this year, and it definitely helps with managing my time.\"\r\n\r\nFrick began playing sports at an early age, beginning with basketball, and baseball as well, during kindergarten. According to Frick, she played little league baseball until fifth grade before switching over to softball in sixth grade, the year that she was introduced to water polo. Both of her older siblings, Andrew, a current freshman at Claremont McKenna College, and Maddie, a sophomore at Paly, have experience playing sports in high school. \r\n\r\n[caption id=\"attachment_105027\" align=\"alignright\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11267042_10153408011083413_2787173618381490382_o.jpg\"><img class=\"wp-image-105027\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11267042_10153408011083413_2787173618381490382_o.jpg\" alt=\"Frick began her playing career at a young age, participating in little league baseball in kindergarten before transferring to softball in sixth grade. Photo by Jeff Frick. \" width=\"393\" height=\"262\" \/><\/a> Frick began her playing career at a young age, participating in little league baseball in kindergarten before transferring to softball in sixth grade. Photo by Jeff Frick.[\/caption]\r\n\r\n\"They are both as athletic as I am, if not more,\" Frick said humbly. \"Watching them grow up really pushed me to thrive in sports. I also love the feeling of winning and making a team. I think it's really cool how teammates form and how close a team comes together.\"\r\n\r\nThroughout the year, Frick acted in a very mature manner for a freshman. Despite a minimal amount of playing time in certain sports, she maintained a positive attitude and focused more on team success, not just her own.\r\n\r\n\"The hardest part of this year was probably during basketball season when I did not play very often for stretches,\" Frick said. \"I got a good amount of minutes during the regular season primarily, which I was very happy about. It was during practice when I would just try to continue to be a team player and not get down on myself or others as well.\"\r\n\r\nMany of Frick's teammates, including junior water polo player Katie Francis, acknowledged her outgoing personality and supportiveness, especially in practice.\r\n\r\n\"Sophie is very fun to be around and has a bubbly personality,\" Francis said. \"She is a very supportive teammate and pushes you hard in practice, which is good for the team.\"\r\n\r\nOther teammates expressed Frick's positivity and ability to get along with teammates easily. \r\n\r\n\"She is very supportive of all of us, especially bringing people up and our spirits up when we are down,\" freshman basketball guard Carly Leong said. \"She brings positivity by being the best teammate a person can have.\"\r\n\r\n\"She is super easy to get along with and is so friendly and outgoing that she fit right in with our team,\" junior Maddy Atwater said, a basketball and softball teammate of Frick's. \"She was a great teammate on the court and an even better friend off the court.\"\r\n\r\n[caption id=\"attachment_98904\" align=\"alignnone\" width=\"711\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_8696.jpg\"><img class=\"wp-image-98904\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_8696.jpg\" alt=\"Frick warms up behind the three-point line prior to a game vs. Gunn High School. Frick was one of two freshmen on the girls' team this season. Photo by George Lu. \" width=\"711\" height=\"474\" \/><\/a> Frick warms up behind the three-point line prior to a game against Gunn High School. Frick was one of two<br \/> freshmen on the girls' team this season. Photo by George Lu.[\/caption]\r\n\r\nFrick says that her favorite moment was winning the league championship during basketball season, especially with a team that had no seniors.\r\n\r\n\"Winning leagues in basketball was an extremely special experience, especially considering it doesn't just happen that easily or often,\" Frick said. \"We also had a really young team, which makes it all the better.\" \r\n\r\nFrick added that strong coaching in both water polo and softball were key to her enjoyment of sports this year. \r\n\r\n\"It was great to get better at water polo and have really awesome coaches at the same time,\" Frick said. \"My softball coach Bill Laskey also knows how to coach effectively, and even though he can get a little mad at times, it's all for making us [players] better.\"\r\n\r\nAccording to Frick, unlike basketball and water polo, softball and the immediate impact she was able to make on the softball team provided her with a surge of confidence for the future. \r\n\r\n\"Softball and the playing time gave me an incredible amount of confidence, especially coming in about four weeks after tryouts,\" Frick said. \"I didn't even know the coach personally. It was nice to go in right after basketball and start right away, knowing that the coach trusted me and the team trusted me to do what I could as a freshman. It did mean a lot to start and bat in the middle of the order even with a lot of the older players on the team.\"\r\n\r\nWhen asked if Frick looked up to a particular teammate, the first name that came to mind was a basketball teammate, junior guard Courtney Lovely.\r\n\r\n\"Coco is an overall extremely positive, well-rounded person and obviously a very good basketball player too,\" Frick said.\r\n\r\nGiven her noteworthy talent, Frick says she hopes to play all three sports for as long as she can. While nothing can take away her hard-working, focused and caring attitude, Frick says that only the hectic nature of high school would prevent her from competing for the duration of all four years.\r\n\r\n\"As of right now, I am hoping to play for as long as I can; hopefully all four years,\" Frick said. \"I know that it gets busy as a junior with SATs and as a senior with college apps, so if I feel overwhelmed I will probably step out of one or two sports. That being said, I really hope I will continue to manage my time well enough so that I can play all three sports throughout high school.\"\r\n\r\nWhen she's not practicing or competing, Frick is passionate about music and television, especially when it involves her siblings.\r\n\r\n[caption id=\"attachment_105040\" align=\"alignleft\" width=\"189\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11297661_1602089340038619_538719075_n.jpg\"><img class=\"wp-image-105040\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11297661_1602089340038619_538719075_n.jpg\" alt=\"Frick protects the ball as she squeezes between defenders in a game against Mountain View. Frick and the girls' varsity team won the De Anza League championship this season. Photo by Jeff Tobin. \" width=\"189\" height=\"284\" \/><\/a> Frick protects the ball as she squeezes between defenders in a game against Mountain View. Frick and the girls' varsity team won the De Anza League championship this season. Photo by Jeff Tobin.[\/caption]\r\n\r\n\"I am passionate about music, mostly finding new music in general,\" Frick said. \"I'm also very passionate about watching TV. I have a lot of shows that I'm always up to date with.\"\r\n\r\nAccording to Frick, her primary goals for the next few years are to establish strong bonds with teammates. As for looking beyond her time at Paly, Frick says that playing in college would be a dream come true.\r\n\r\n\"I pursue sports for obviously the awesomeness of school legacy and to win championships and building teams that you'll remember for the rest of your life,\" Frick said. \"I would also love to play a sport in college if I ever get the opportunity. I think it would be really fun and really pursuing a dream.\"\r\n\r\n&nbsp;","excerpt":"After participating in water polo, basketball and softball during her first year in high school, freshman Sophie Frick looks poised for a number of athletic accomplishments in the near future, marking herself as the Paly Voice's athlete of the year. ","date":"2015-05-30 17:06:31","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11303970_1602089120038641_1694026943_o.jpg","categories":["Spotlight"],"tags":{"44596":"athlete of the year","39038":"carly leong","11270":"courtney lovely","29696":"Katie Francis","8861":"maddy atwater","38660":"sophie frick"}},{"id":105507,"title":"Seniors celebrate at Baccalaureate","permalink":"http:\/\/palyvoice.com\/2015\/05\/30\/seniors-celebrate-at-baccalaureate\/","content":"The Palo Alto High School Class of 2015 is one step closer to graduation, after celebrating at Baccalaureate in the Flint Center last night. Click on the photo to navigate through the highlights.\r\n\r\n<em>Photos and videos by Jeanette Wong.<\/em>\r\n<div class=\"stlr-embed-container stlr-embed-is-medium\" data-type=\"lateststory\" data-user-id=\"368035303157401398\">\r\n\r\n<script src=\"https:\/\/steller.co\/site\/static\/js\/steller.js\"><\/script>\r\n\r\n","excerpt":"The Palo Alto High School Class of 2015 is one step closer to graduation, after celebrating at Baccalaureate last night at the Flint Center.  Explore the celebration by clicking through the photos and videos.","date":"2015-05-30 16:35:02","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9639b.jpg","categories":["News","Spotlight"],"tags":{"44939":"ann miura-ko","19372":"baccalaureate","8583":"choir","8592":"class of 2015","11372":"daryl dillahunty","8742":"graduation","44936":"hannah zhang","44938":"maggie peng","44937":"maya mcauliffe","29378":"sally wang","44935":"senior baccalaureate","9090":"seniors"}},{"id":105350,"title":"Max McGee on zero period","permalink":"http:\/\/palyvoice.com\/2015\/05\/30\/max-mcgee-on-zero-period\/","content":"<em>The cancellation of academic zero period at Gunn High School has sparked controversy throughout the Palo Alto community. The Paly Voice sat down with Palo Alto Unified School District Supt. Glenn \"Max\" McGee to discuss his rationale behind the decision to remove academic zero period.<\/em>\r\n\r\nThe Paly Voice: When and how did academic zero period start in this district?\r\n\r\nDr. Max McGee: It’s been here for a while.\r\n\r\nPV: Do you know why Gunn has it, but Paly doesn’t?\r\n\r\nMM: I think the schedule had something to do with it. Gunn had a more traditional schedule, with six classes every day, and because of that schedule, students wanted to have an F and G [fifth and sixth] period break later in the day.\r\n\r\nPV: Why do you think there are major differences in the scheduling and academic offerings at Paly and Gunn?\r\n\r\nMM: Those emerged over time, and I don’t think it’s good for our students or our community. I talked at the beginning of the year to all our teachers about the importance of being a collective community, not just a collection of autonomous communities. There’s a balance — you need to maintain school autonomy and character — but when you have a common vision and more collaboration amongst schools, you get better ideas. I think we could build on ideas from both schools. There are things at Gunn that would benefit Paly students, and vice versa.\r\n\r\nPV: Out of the board members, parents, teachers and other community members, who has been most vocal in wanting to end it [zero period]?\r\n\r\nMM: First of all, it was an administrative decision, so it’s my decision. And I think that’s important because some people assume that it’s a board decision, but it was my decision to do so ... I think one of the board members got the ball rolling on this — Mr. [Ken] Dauber was very interested in this — and we heard from several pediatricians. Frankly, the most vocal ones have been the pediatricians.\r\n\r\nPV: Where did you get your evidence to support your position? Did you actively look for studies about sleeping habits, or did you consult\r\n\r\n[caption id=\"attachment_105520\" align=\"alignright\" width=\"290\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/McGee.png\"><img class=\"wp-image-105520 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/McGee.png\" alt=\"PAUSD Superintendent Max McGee has made the executive decision to end academic zero period at Gunn. Screenshot by Dhara Yu.\" width=\"290\" height=\"390\" \/><\/a> PAUSD Superintendent Max McGee has made the executive decision to end academic zero period at Gunn. Screenshot by Dhara Yu.[\/caption]\r\n\r\nwith students or teachers?\r\n\r\nMM: I did. I have a book called \"The Teenage Brain.\" It’s really good. And that had information about sleep. And I heard from Dr. [Shashank] Joshi, who I deeply respect, and also Dr. [Steven] Adelsheim. These weren’t just random scientists or doctors; these are people who I’ve worked with, who I trust and who are really knowledgeable about this. I also talked with the faculty. Some of them supported the idea, but most of the them preferred the idea of student choice. I talked with students. I read Chloe Sorenson’s survey end to end. Ms. Haas, the department chair of math, did a survey with 92 students and I read that. The survey asked ‘Why do you want to take zero period?’ and they responded, ‘Because I want a break F and G period.’ And that was the reason behind 80, 90 percent [of respondents]. The reason driving this was a need for a break. And why was there a need for a break? Because they had a more traditional schedule.\r\n\r\nPV: It [the zero period ban] is not something that pertains to everyone, yet it’s such a focal issue for the Gunn students. What about it makes it such a big problem for them?\r\n\r\nMM: Well, two things. One, I think they’re right about the student choice. Had we had more time, I would have liked to spend more time listening to the students and really having some serious dialogue. The fact of the matter is, we [the Board] have a lot of issues, one being the creative bell schedule, the report from the minority talent and achievement committee, next year’s budget, multimillion dollar building projects, and frankly, I need to retain our focus on significant education issues. At some point, you need to make a decision and move on. I wish I had spent more time listening to students. Whether it would have changed the decision — maybe, maybe not — but one of the students actually said, ‘I feel like we’ve been heard. It’s just human nature to think that if you tell people your opinion but it doesn’t go your way, people feel that they haven’t been heard.' I hate to disappoint people, but again for most people, this is the best decision. And part of the reason was to drive [Gunn’s] schedule change.\r\n\r\nPV: When the first suicide happened in early November, was that when you first caught on to this idea of ending academic zero period?\r\n\r\nMM: I went to the student memorial for Cameron [Lee]...<strong> <\/strong>and one of the students spoke about how you could videochat and text Cameron at any time at night; he was always there, whether it was two or four in the morning. He was such a great, gregarious person, and he really cared about others. She said that, and others repeated that theme. And that made me think of my own kids, one of whom slept with his computer by his bed — I could not get him out of bed in the morning — and I thought, sleep is involved in this somehow. It really made me think hard about the part that sleep deprivation plays in behaviors. Dr. Joshi, who investigates these deaths by suicide, and I had a conversation about that.\r\n\r\nPV: And then as the next Gunn suicide, and eventually the Paly suicide, happened, did this movement gain more traction?\r\n\r\nMM: Yes, it did. They both happened very early in the morning. I’ve had the opportunity to talk with the parents of these students, which is just — it’s hard to describe how badly I feel for them — and I have kids of my own. And it’s hard to describe because we are all just so focused on our own lives and what matters to us. But as superintendent, as a leader, what matters to 4,000 high school students is more important than what matters to anyone individually.\r\n\r\nPV: There have been some rumors about the administration clamping down and preventing students from taking two academic classes in a certain subject, or putting a limit on Advanced Placement classes. Is this true?\r\n\r\nMM: Right now, we have a new sign off form required for if you take three or more AP classes. Basically it’s a release. It says, ‘taking too many APs can be hazardous to your mental health and wellbeing.’ That’s trivializing an important issue, but it’s true; you’re putting yourself at risk. We instituted that this year, but for right now, there’s no discussion about limiting APs.\r\n\r\nPV: What would you say to the students at Gunn who are upset or disappointed by this decision?\r\n\r\nMM: First of all, I wish I had listened [to student voices] more. I wish that I had spent more time with them. But I did meet with a group of 25 students — not ASB, not SEC, just regular students — and we got some great ideas from them. I will commit to listening to them. But I did take their feedback and survey data into mind, and I made a decision, once again, that’s the best decisions for the greatest number of students. I think the debate about zero period is essentially a schedule problem. It had really been a problem with the more traditional schedule at Gunn versus the block schedule at Paly. If students are losing sleep because of a schedule problem, then we need to fix the schedule.","excerpt":"The cancellation of academic zero period at Gunn High School has sparked controversy throughout the Palo Alto community. The Paly Voice sat down with PAUSD Supt. Glenn \"Max\" McGee to discuss his rationale behind the decision to remove academic zero period.","date":"2015-05-30 10:50:08","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/McGee.png","categories":["Features"],"tags":{"36402":"advanced placement","11799":"Board of Education","44882":"creative bell schedule","20197":"glenn max mcgee","44932":"gunn bell schedule","8752":"gunn high school","8828":"ken dauber","32445":"max mcgee","8977":"PAUSD","42273":"zero period"}},{"id":105369,"title":"Badminton sends four members to compete at CCS","permalink":"http:\/\/palyvoice.com\/2015\/05\/29\/badminton-sends-four-members-to-compete-at-ccs\/","content":"[caption id=\"attachment_105426\" align=\"alignnone\" width=\"534\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-2.44.17-PM.png\"><img class=\" wp-image-105426\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-2.44.17-PM.png\" alt=\"Juniors Eric Chiang and James Wang pose with coaches Wesley Hsieh and Len Hill after placing fourth at Central Coast Selection playoffs last year. Chiang and Wang will \" width=\"534\" height=\"426\" \/><\/a> Juniors Eric Chiang and James Wang pose with coaches Wesley Hsieh and Len Hill after placing fourth at Central Coast Selections playoffs last year. Chiang and Wang will compete at CCS this year again, along with freshman Jackie Cai and Promise Lee. Photo courtesy of Eric Chiang.[\/caption]\r\n\r\nThe Palo Alto High School badminton team will be sending four members to compete at the Central Coast Selections playoffs tomorrow.\r\n\r\nJuniors Eric Chiang and James Wang will be playing together in the boys doubles event, while freshman Jackie Cai and senior Promise Lee will be playing in the girls doubles event.\r\n\r\n“Paly's seeding for CCS is pretty high, especially compared to last year,” Chiang said. “James [Wang] and I are seeded third while Promise [Lee] and Jackie [Cai] are seeded fourth.”\r\n\r\nChiang and Wang hope to place in the top three in their event.\r\n\r\n“There's only one pair that's participating in CCS this year from last year that beat us so we've got high hopes for getting top three,” Chiang said.\r\n\r\nMany new players from around the bay area will be competing at CCS, according to Chiang.\r\n\r\n“For both boys doubles and girls doubles, there are new pairs and players from all over the region, which makes it hard to predict how well we'll do this year,” Chiang said.\r\n\r\nCai and Lee also hope to place in the top three; however, they will primarily be focusing on trying to win matches.\r\n\r\n“Honestly, we hope to do the best we can and try to win as many matches as possible,” Cai said.\r\n\r\nThe CCS playoffs will be held from May 29-30 at Independence High School. Both the Paly boys' and girls' doubles will compete tomorrow.","excerpt":"The Palo Alto High School badminton team will be sending four members to compete at the Central Coast Selections playoffs this week.","date":"2015-05-29 12:34:00","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-2.44.17-PM.png","categories":["Sports"],"tags":{"15905":"badminton","8568":"CCS","44915":"eric chiang","44916":"jackie cai","44917":"james wang","8953":"paly","44918":"promise lee"}},{"id":104724,"title":"What to write in someone&#8217;s yearbook","permalink":"http:\/\/palyvoice.com\/2015\/05\/29\/what-to-write-in-someones-yearbook\/","content":"[caption id=\"attachment_105366\" align=\"aligncenter\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9050.jpg\"><img class=\"wp-image-105366\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9050.jpg\" alt=\"Senior staff writer Charles Yu ponders what to write in a yearbook. Photo by Emma Chiu.\" width=\"400\" height=\"300\" \/><\/a> Senior staff writer Charles Yu ponders what to write in a yearbook. Photo by Emma Chiu.[\/caption]\r\n\r\nNot knowing what to write in someone else's yearbook can be stressful and even awkward. If you’re ever caught staring at a blank page, tapping your pen, you are likely to be perceived as an apathetic human being. Even if you truly are indifferent, out of general consideration you should still easily be able to contrive three sentences for someone (and yes, that’s three sentences <i>minimum<\/i>)! If this sounds like a daunting task, here are the solutions for the most common types of people you will have to ponder:\r\n\r\n<b>1. The kid you've talked to once this entire year<\/b>\r\n\r\nWhen someone puts you in this position, it can feel a bit unfair of them and you may think that they don’t deserve your time to write a message. However, chances are that this person is probably experiencing a bit of social anxiety and he or she, more than anyone, could use a nice sign-off. It’s fine to give a generic compliment to this person, as long as you genuinely feel there's truth to in it! Example: “It was super fun having English with you this year. You always have really great things to say! Hope you have a fantastic summer :)”\r\n\r\n<b>2. A friend you used to be a lot closer with than you are now<\/b>\r\n\r\nWhether it was just a regular falling out or a specific awkward event, we have all lost a certain level of closeness with some friends. It’s fine to write about the good times you had with this person, even if they happened a while ago. Mention attributes of his or her character that you admire or accomplishments you know they will achieve in the future. If it’s someone you want to strengthen your friendship with, then <i>express that<\/i>. If it’s not, then <i>don’t<\/i> - the most important thing to remember in this situation is to be both friendly and honest.\r\n\r\n<b>3. A solid homie<\/b>\r\n\r\nEven if you know a person well, you can still find yourself thinking “I don’t know what to say!” How do you make it sound detailed yet not overdone, or funny yet sincere? An easy way to start is to talk about where you first met, and then go off about favorite memories from the past year (or anything from your K-12 history if you’re a senior). Try to throw in an inside joke you guys have shared, and be sure to mention <i>why<\/i> you like being friends with this person anyway. If you can’t think of anything, maybe that tells you something about your friendship.\r\n\r\n<b>4. That person you want to get with ;)<\/b>\r\n\r\nAgain, it’s always good to talk about how you spent time together the past year. Mention how fun he or she is to be around or how much they make you laugh. Although a list of qualities shouldn’t consist of the entire message, compliments are KEY. If you’re feeling adventurous, you can list a bunch of adjectives and slip in the word “pretty” or “attractive\". They’ll definitely get the picture and if they’ve ever been slightly interested in you, their desire to hit you up over the summer will definitely increase. If this risk sounds daunting, keep in mind that the worst that would happen is that the person you like will be flattered but won’t reciprocate feelings. Low risk, high reward!\r\n\r\n<b>5. Your best friend to whom no amount of writing could ever do justice<\/b>\r\n\r\nFor these types of people, you wonder, “Where do I even begin?!” Sometimes it might feel hard because you’ve written the same thing for them over the past 10 years in birthday cards, Christmas cards and let’s not forget old yearbook signings. The thing to remember about this case is that you need to let go of the expectation that this yearbook signing has to be perfect. It doesn’t have to flow well. It doesn’t have to be the deepest thing you’ve ever written to your friend. Feel free to combine all of the advice from the last four points. Just remember that your friend knows how awesome you are and no mediocre yearbook signing is going to change their positive perception of you.","excerpt":"Not knowing what to write in someone else's yearbook can be stressful and even awkward. If you’re ever caught staring at a blank page tapping your pen, you are likely to be perceived as an apathetic human being. Here are some tricks to avoiding this dilemma. ","date":"2015-05-29 06:20:48","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9050.jpg","categories":["Opinion","Spotlight"],"tags":{"44888":"edward chen","44886":"signing","44887":"what to write","23892":"yearbook"}},{"id":105387,"title":"Badminton prevails at SCVALs","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/badminton-prevails-at-scvals\/","content":"[caption id=\"attachment_105373\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-1.10.11-PM.png\"><img class=\" wp-image-105373\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-1.10.11-PM.png\" alt=\"Freshman Jackie Cai, juniors Eric Chiang and James Wang. and senior Promise Lee pose for a picture with their coaches Arne Lim and Justin Halas after competing at Silicon Valley Athletic Leagues. They will be competing at Central Coast Selection playoffs tomorrow. Photo by \" width=\"603\" height=\"456\" \/><\/a> Freshman Jackie Cai, juniors Eric Chiang and James Wang and senior Promise Lee pose for a picture with their coaches Arne Lim and Justin Halas after competing at the Santa Clara Valley Athletic League Championships last weekend. Chiang and Wang placed first in boys' doubles, while Cai and Lee took second place in girls' doubles. Photo courtesy of Eric Chiang.[\/caption]\r\n\r\nMembers of the Palo Alto High School badminton team celebrate their successful performance at the Santa Clara Valley Athletics League Championships last weekend.\r\n\r\nFour standout performances include juniors Eric Chiang and James Wang, who placed first in boys’ doubles, and freshman Jackie Cai and senior Promise Lee, who placed second in girls’ doubles.\r\n\r\nChiang, Cai, Wang and Lee qualified for the Central Coast Selection playoffs.\r\n\r\nOther notable performances include sophomores Ally Zhu and Linus Wang, who got 13th place in mixed doubles. Sophomores Alice Zhang and Ericka Wu placed ninth in girls' doubles and sophomores Justin Yip and Samarth Venkatasubramaniam took 13th place in boys' doubles.\r\n\r\nCai is proud of the team’s performance at SCVALs.\r\n\r\n“Paly did pretty well overall,” Cai said. “The results were predictable and I think our performance reflects our improvement throughout the season.”\r\n\r\nChiang echoed Cai's evaluation of the tournament.\r\n\r\n\"Compared to last year's results with James [Wang] and I getting fourth in boys' doubles and Derek [Young] and Promise [Lee] getting third in mixed doubles, Paly performed a lot better this year,\" Chiang said.\r\n\r\nAccording to Cai, a key factor of her performance is her work ethic with Lee.\r\n\r\n“I think Promise [Lee] and I performed well together,” Cai said. “She sets up for me, and I kill it. I think we have both improved a lot by playing at SCVALs.”","excerpt":"Members of the Palo Alto High School Badminton team celebrate their successful performance at the Santa Clara Valley Athletics League Championship last weekend.","date":"2015-05-28 18:31:47","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-1.10.11-PM.png","categories":["Sports"],"tags":{"44920":"alice zhang","44921":"ally zhu","15905":"badminton","44915":"eric chiang","44919":"ericka wu","44916":"jackie cai","44917":"james wang","44923":"justin yip","44922":"linus wang","8953":"paly","44918":"promise lee","44924":"samarth venkatasubramaniam","44925":"svcals"}},{"id":105240,"title":"Boys&#8217; and girls&#8217; swimming attend first ever State championship meet","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/boys-and-girls-swimming-attend-first-ever-state-championship-meet\/","content":"[caption id=\"attachment_105244\" align=\"alignnone\" width=\"622\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-27-at-5.10.59-PM.png\"><img class=\" wp-image-105244\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-27-at-5.10.59-PM.png\" alt=\"The Palo Alto High School girls' \" width=\"622\" height=\"490\" \/><\/a> Freshmen Zoe Lusk, Claire Lin, sophomore Grace Zhao and junior Kayleigh Svensson stand on the podium after winning a state championship relay in the 200 yard Freestyle Relay. The girls' and boys' swimming teams both performed well at the first ever California Interscholastic Federation State Swimming and Diving Championships, placing in sixth and eighth, respectively. Photo by Grace Zhao.[\/caption]\r\n\r\nThe Palo Alto High School boys’ and girls’ swimming teams are celebrating their successes this season after competing at the California Interscholastic Federation State Swimming and Diving Championships last weekend.\r\n\r\nAccording to senior captain Ryan Drover, this year was the first time California has held a state championship for swimming.\r\n\r\n“With California being the biggest and fast swimming state, everyone had always asked to see a state championship,” Drover said. “It was one of the fastest high school meets in the country.”\r\n\r\nMany major colleges sent swim coaches to the meet to keep an eye on possible future recruits, according to Drover.\r\n\r\n\"For many sophomores and juniors, there could not be a more valuable meet for college recruiting purposes,” Drover said. “As a meet that will only grow, it will only be more valuable, since coaches can see top swimmers racing in [the] short course yards pool ... and not be overshadowed by elite level swimmers as they will be at the U.S. Olympic Trials next summer.”\r\n\r\nAccording to Drover, the girls' team came away with a sixth place overall finish, highlighted by a winning state championship relay in the 200 Freestyle Relay (freshmen Zoe Lusk, Claire Lin, sophomore Grace Zhao, and junior Kayleigh Svensson). The boys' team finished in eighth overall.\r\n\r\n“Overall, we had a great season,” Drover said. “It's been a great four years, and I couldn't have asked for a better way or a better group of people to end it with.”","excerpt":"The Palo Alto High School boys’ and girls’ swimming teams are celebrating their successes this season after competing at the California Interscholastic Federation State Swimming and Diving Championships last weekend.","date":"2015-05-28 18:31:02","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-27-at-5.10.59-PM.png","categories":["Sports"],"tags":{"40940":"claire lin","40114":"grace zhao","40101":"kayleigh svensson","8944":"palo alto high school","8953":"paly","40102":"ryan drover","33010":"state championships","33011":"states","9143":"Swimming","40112":"zoe lusk"}},{"id":104348,"title":"Paly students channel creativity through blogging","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/paly-students-channel-creativity-through-blogging\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/562242537.jpg\"><img class=\"aligncenter wp-image-104381\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/562242537.jpg\" alt=\"562242537\" width=\"508\" height=\"420\" \/><\/a>\r\n\r\nThe development of technology has given root to new methods for channeling creativity. Blogging is a way for anyone to create their own voice and unique “space” within the vastness of this tangled web we call the Internet. As blogging continues to expand and transform, many students at Palo Alto High School have found it to be a rewarding and creative outlet.\r\n\r\nCheck out some of these student bloggers:\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/jannat-hashmis-fashion-and-photography-blog-to-wear-is-to-love\/\">Jannat Hashmi's fashion and photography blog: To wear is to love<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/belle-dougmans-fashion-blog-frills-and-freckles\/\">Belle Doughman's fashion blog: Frills and freckles<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/karina-chan-and-stephanie-congs-lifestyle-blog-the-adventures-of-k-and-s\/\">Karina Chan and Stephanie Cong's lifestyle blog: The Adventures of K and S<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/serina-nguyens-beauty-blog-serinaland\/\">Serina Nguyen's beauty blog: Serinaland<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/alisha-kumars-travel-blog-by-the-breeze\/\">Alisha Kumar's travel blog: By the Breeze<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/andrew-lus-personal-blog-bronard\/\">Andrew Lu's personal blog: Bronard<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/oskar-soderbergs-comedic-blog-california-person\/\">Oskar Soderberg's comedic blog: California Person <\/a>\r\n\r\n&nbsp;","excerpt":"As blogging continues to expand and transform, many students at Palo Alto High School have found it to be a rewarding and creative outlet. Check out some student bloggers here.","date":"2015-05-28 14:49:25","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/562242537.jpg","categories":["Features"],"tags":[]}]