[{"id":112429,"title":"Boys&#8217; cross country to compete at state championships","permalink":"http:\/\/palyvoice.com\/2015\/11\/27\/boys-cross-country-to-compete-at-state-championships\/","content":"[caption id=\"attachment_112451\" align=\"alignnone\" width=\"604\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-27-at-6.38.22-PM.png\"><img class=\" wp-image-112451\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-27-at-6.38.22-PM.png\" alt=\"Juniors Kent Slaney and Naveen pai run at the Sunnyvale baylands earlier this season. According to Coach Kelsey Feeley, the Palo Alto High School boys' cross country team has been working hard to prepare for tomorrow's state championships. Photo courtesy of Malcom Stanley. \" width=\"604\" height=\"395\" \/><\/a> Juniors Kent Slaney and Naveen Pai run at the Sunnyvale Baylands in October. According to Coach Kelsey Feeley, Slaney won the division one Central Coast Section title and she is confident for tomorrow's state championships. Photo courtesy of Malcom Stanley.[\/caption]\r\n\r\nThe Palo Alto High School boys' cross country team will be competing at the California Interscholastic Federation State Championships tomorrow in Fresno after a second place finish at Central Coast Section Championship this month.\r\n\r\nAccording to Coach Kelsey Feeley, the team has been training hard to prepare for States.\r\n\r\n“I think the team is ready to do better than they did last season,” Cross country runner Kai Oda said. “That's not hard since we placed dead last at States last year.”\r\n\r\nOda predicts that the team will place in the top 10 at States this year.\r\n\r\n\"We have used the last two weeks since taking second at CCS finals to focus on form and pacing work,\" Feeley said.\r\n\r\nKey runners to look out for are freshman Henry Saul, sophomore Sam Craig and junior Naveen Pai. According to Oda, the team's fastest runner, junior Kent Slaney, is injured so he may not run at States.\r\n\r\n\"The entire team is hoping that he recovers in time to race,\" Oda said. \"If Slaney does not run, then sophomore Aashai Avadhani will fill in as an alternate.”\r\n\r\nFeeley is confident for tomorrow and is excited to see how all of the boys run.\r\n\r\n“We were lucky to attend an invitational at the Woodward park course earlier in the year, so hopefully the boys will feel more comfortable and prepared this time around,” Feeley said.","excerpt":"The Palo Alto High School boys' cross country team will be competing for the state championship tomorrow in Fresno after a second place finish at Central Coast Section Championship this month.","date":"2015-11-27 18:49:22","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-27-at-6.38.22-PM.png","categories":["Sports"],"tags":["CCS","cross country","feely","Henry","kai","kelsey","kent","naveen","oda","sam","states"]},{"id":112282,"title":"Le Tricolore n&#8217;est pas suffisant?","permalink":"http:\/\/palyvoice.com\/2015\/11\/22\/le-tricolore-nest-pas-suffisant\/","content":"[caption id=\"attachment_112329\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/flag.jpg\"><img class=\"wp-image-112329\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/flag.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"650\" height=\"488\" \/><\/a> Illustration by Portia Barrientos.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In the wake of a series of horrific terrorist attacks in Paris on Nov. 13 that left over 100 dead and many more wounded, people across the globe have moved quickly to denounce the violence and express their solidarity with France. Famous monuments such as the Sydney Opera House, the statue of Christ the Redeemer and the World Trade Center lit up the colors of the <\/span><i><span style=\"font-weight: 400;\">Tricolore<\/span><\/i><span style=\"font-weight: 400;\">. Snapchat offered a temporary filter with the text “Pray for Paris,” and Facebook gave its users the option to superimpose the French flag on their profile pictures.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The day after the attacks, I checked my Facebook feed and encountered a sea of red, white and blue; my Facebook friends had changed their profile pictures in an attempt to express their support for the nation of France. Feeling moved by this display of solidarity, I quickly decided to take up Facebook’s offer and change my profile picture too.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Then, in the very moment I clicked post, a question occurred to me: Was there any value in what I just did?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">I tried to process the rationale behind my decision. Did I change my profile picture to raise awareness? Absolutely not. You’d have to be living under a rock to not know this tragedy occurred. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Did I do it to console people in a time of grief? Well, if that was my objective, I wasn't sure if seeing the French flag overlaid over Facebook profile pictures was of genuine solace to people intimately connected with France. To get more insight, I spoke with junior Emily Read, who lived in a small town outside of Paris for several years. She changed her Facebook profile picture to the \"Peace for Paris\" Eiffel Tower graphic that was widely popularized on social media in the aftermath of the tragedy.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Seeing people’s profile pictures and buildings across the world light up red, white and blue is nice because it’s really uniting,” Read said. “We can’t really do anything actively about the attacks, but we can at least show our support.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Read did note that she was personally disappointed by the fact that Facebook had made it an option to overlay only the French flag, when there had been so many attacks in other parts of the world. However, she criticized some for perpetuating the notion that the attention directed toward the tragedy in France was excessive.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I did not like that some people negated the support toward Paris and said ‘Why are we supporting Paris so much? We should be supporting the other places instead,’” she said. “We shouldn’t be neglecting our support toward Paris; we should be supporting everyone at the same time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Of course, perhaps the thorniest issue surrounding the social media movement is that these gestures are inherently Eurocentric. We had the option to display our support for France, but not for Lebanon, nor Syria nor any other nation that experienced tremendous tragedies that same day. Have people, perhaps inadvertently, espoused Western-centrism by making this display of solidarity?<\/span>\r\n\r\nEven if the gesture does come across as Western-centric, all the blame cannot be placed squarely on the individuals who adopted it. The reason that so many Americans sprung to change their profile pictures to the flag of France and not that of other nations is the result of years and years of close cultural ties with Europe, in tandem with minimal media coverage in non-Western nations. I’m not suggesting that we should shirk our obligations to be informed about world affairs — rather, I’m simply saying that this kind of social media mobilization in response to a tragedy in a western European nation should not have been unexpected.\r\n\r\n<span style=\"font-weight: 400;\">Ultimately, I don’t think that the outpouring of support on social media in this manner was inherently ill-intentioned. It may come across as perfunctory and not all that useful — how is superimposing the French flag over our faces supposed to solve anything? — but there is, oddly enough, an element of pragmatism in such a gesture. It stems from the realization that we don’t have the capability to solve the insidious problem at hand, but we can show our solidarity. And of course, social media is one of the most accessible platforms to display that sentiment. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The French flag stunt is simply the most recent manifestation of a wide-spread cultural phenomenon — taking to social media to express support for causes that are morally resonant but perhaps feel remote and intangible. We should be careful to avoid thinking that social media activity is the sole way we can make a difference. I know that none of us are going to single-handedly stamp out terrorism, but we do have a role to play. We can, for example, combat the rampant Islamophobia and xenophobia that is unfounded and causes extremist organizations to fester, while still engaging in meaningful dialogue about eradicating terrorism. Furthermore, we can take it upon ourselves to become more informed citizens (perhaps all that entails is parsing over the World News section for a little bit longer).<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At some point, the last traces of red, white and blue will disappear from our newsfeeds, perhaps to be replaced by another social media crusade. There is some value to be found in such a display, but it's important that we are not deluded into thinking symbolism is the only means by which we can effect change. <\/span>","excerpt":"Social media gestures in the wake of tragedy may come across as perfunctory and not all that useful, but they, oddly enough, are rooted in pragmatism. ","date":"2015-11-22 18:28:09","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/flag.jpg","categories":["Opinion","Spotlight"],"tags":["emily read","eurocentrism","Facebook","France","paris","social media"]},{"id":112317,"title":"Thanksgiving Break is from Nov. 25-Nov. 29","permalink":"http:\/\/palyvoice.com\/2015\/11\/21\/thanksgiving-break-is-from-nov-25-nov-29\/","content":"","excerpt":"","date":"2015-11-21 11:50:26","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":112286,"title":"Key Club to host Fun Run","permalink":"http:\/\/palyvoice.com\/2015\/11\/20\/key-club-to-host-fun-run\/","content":"[caption id=\"attachment_112287\" align=\"aligncenter\" width=\"515\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/12244105_970779246313455_1034644347_n.jpg\"><img class=\"wp-image-112287\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/12244105_970779246313455_1034644347_n.jpg\" alt=\"12244105_970779246313455_1034644347_n\" width=\"515\" height=\"386\" \/><\/a> Junior and Key Club President, Albert Hwang works to plan out volunteer shifts for the Fun Run. The run will raise for money for the Pediatric Trauma Program. Photo by Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">From 2 to 4 p.m. Saturday, Palo Alto High School’s Key Club will host its first-ever Fun Run at the Mitchell Park Library to fundraise for the Kiwanis Pediatric Trauma Program. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Key Club’s goal is community service, according to junior and Key Club President Albert Hwang. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our goal is to help out the general community with projects that need volunteers,” Hwang said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Key Club is working with other local organizations to host the event.<\/span>\r\n\r\n“We’re helping the Kiwanis group,” senior and vice president, Minyoung Kim said. “Kiwanis is the adult Key Club and together, we’re working to stand against pediatric trauma. All proceeds will be donated to PTP.”\r\n\r\n<span style=\"font-weight: 400;\">Other partner organizations for the event include the Gunn High School Key Club, Chipotle, Safeway, Starbucks and Spot Pizza, according to the <a href=\"https:\/\/www.facebook.com\/events\/1391408267825416\/\">event webpage.<\/a><\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Pediatric Trauma Program works to help traumatized children. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The mission of the Pediatric Trauma Program is to develop local projects which will reduce the number of children in our three-state district who are killed or injured by traumatic life events,” Kim said. “We want all children live happy, healthy and safe lives.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Pediatric trauma remains the leading cause of death and injury among children ages 14 and under in the United States, according to Hwang. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Key Club aims to draw a large crowd through fun community-wide activities like the run.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We named the event a Fun Run because we think students will have fun running for a cause,” Kim said. “It’s our first year doing this and we hope it’ll be a success.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The fee for the Fun Run is $10, which includes covers pizza, hot dogs, salad and fruits. Coffee and lemonade will also be provided, according to the <a href=\"https:\/\/www.facebook.com\/events\/1391408267825416\/\">Fun Run event page.<\/a><\/span>\r\n\r\n<span style=\"font-weight: 400;\">Attendents will also be entered into a raffle. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For every six laps, or $3, you get a raffle ticket,” Kim said. “You’ll have a chance to win a Powerbeats 2 headphones of a Chipotle gift card.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">If you are interested in learning more about pediatric trauma or about how you can help, <a href=\"http:\/\/www.cnhfoundation.org\/how-to-help\/h2h-pediatric-trauma-program\/\">click here for more information.<\/a><\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"From 2 to 4 p.m. this Saturday, Palo Alto High School’s Key Club will host its first ever Fun Run at the Mitchell Park Library to fundraise for the Pediatric Trauma Program. ","date":"2015-11-20 14:49:19","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/key-club.jpg","categories":["News"],"tags":["charity","fun run","key club","mitchell park","news","pediatric trauma","PTP","run","saturday"]},{"id":112031,"title":"Paly library promotes nationwide event: The Great Thanksgiving Listen","permalink":"http:\/\/palyvoice.com\/2015\/11\/19\/paly-library-promotes-nationwide-event-the-great-thanksgiving-listen\/","content":"[caption id=\"attachment_112236\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/TGL-Horizontal-w-background.png\"><img class=\"size-full wp-image-112236\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/TGL-Horizontal-w-background.png\" alt=\"ftyk\" width=\"600\" height=\"250\" \/><\/a> The Palo Alto High School library is promoting a nationwide story sharing event to help connect students to their elders called \"The Great Thanksgiving Listen\". Photo courtesy of storycorps.com[\/caption]\r\n\r\nThe Palo Alto High School library is encouraging participation in \"The Great Thanksgiving Listen\", a story sharing project held created by <a href=\"https:\/\/storycorps.me\/about\/the-great-thanksgiving-listen\/\">Storycorps<\/a>.The Great Thanksgiving Listen takes place online through Nov. 28, the end of Thanksgiving weekend. Storycorps is a non-profit organization dedicated to oral-based story telling. Those who participate in Storycorps record their life experiences that are then transformed into animations. It's Storycorps' goal to create videos that reflect the powerful, individual experiences of Americans across the country.\r\n\r\nThe Great Thanksgiving Listen gives students a chance to interview an “elder” and capture his or her life stories, according to librarian Rachel Kellerman. Afterwards, students are given the option to upload the finished animated videos to the United States Library of Congress.\r\n\r\nKellerman says she finds value in helping students participate in the nationwide project.\r\n\r\n“We are such a diverse and interesting country and I have such a limited experience in this world that when I hear other people’s stories it helps me to feel connected to my fellow citizens,” Kellerman said. “I also learn a lot about compassion and courage from listening to how people struggle and embrace life’s challenges.”\r\n\r\nAccording to Kellerman, during the event, students are free to book an online time to record a story of the person they choose to listen to. StoryCorps has an app that is designed to help students create questions, take pictures with the storyteller and upload the clip. In order to download the app, students must have parent permission, according to Kellerman.\r\n\r\n“The Storycorps interview process only takes a couple of hours, and it can be very uplifting and memorable,” Kellerman said.\r\n\r\nThe Paly library is providing more information for students who are interested in Storycorps. To get help in participating, see Kellerman in the Paly library on Friday or check her updates on Schoology.","excerpt":"The library is encouraging participation in The Great Thanksgiving Listen, a story sharing project by a non-profit organization called Storycorps.","date":"2015-11-19 21:06:08","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/TGL-Horizontal-w-background.png","categories":["News"],"tags":["Library","paly","storycorp","storytelling","the great thanksgiving listen"]},{"id":112188,"title":"Football faces Salinas in CCS Playoffs","permalink":"http:\/\/palyvoice.com\/2015\/11\/19\/football-faces-salinas-in-ccs-playoffs\/","content":"[caption id=\"attachment_111207\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P8242.jpg\"><img class=\"size-full wp-image-111207\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P8242.jpg\" alt=\"ehauifheia\" width=\"600\" height=\"400\" \/><\/a> Sophomore running back Paul Jackson III drives downfield in the Vikings' last home game of the season against the Homestead Mustangs. The Vikings' victory against Homestead led them to secure a spot in the Central Coast Section playoffs. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School football team (4-6, 3-3) is set to face the Salinas Cowboys (6-4, 4-2) in its first Central Coast Section playoff game of the season at 7 p.m. on Friday in Salinas.\r\n\r\nAccording to head coach Jake Halas, the mental side of the game will be the biggest challenge for the team.\r\n\r\n“We feel that we are the more physical team and playing the type of schedule that we played this year, I feel confident with the matchup,” Halas said. “Our players need to play with confidence. We had a good week of preparation which will ensure that our kids will play fast.”\r\n\r\nThe Vikings are preparing for a fast-paced game, according to senior quarterback Justin Hull.\r\n\r\n“We've been focusing a lot on their offense and how quickly they run their plays,” Hull said. “This whole week, the coaches have been doing a great job trying to simulate their pace and we should be prepared.”\r\n\r\nStaying focused and in-tune to the game will help the Vikings stay competitive, according to senior wide receiver Eli Givens.\r\n\r\n“My goal is to not give up on any play and not give up on my teammates,” Givens said. “I’ve played with some of these guys for four years now and I know we aren’t leaving any field without a fight.”\r\n\r\nAccording to Hull, the lack of support from fans may impact the game.\r\n\r\n“A big challenge for this game is going to be the long drive and being able to come out strong in a very rowdy environment,” Hull said. “Our coaches have warned us about their very vocal student section and have emphasized that we have to do our own thing and not worry too much about them.”\r\n\r\nHalas has high hopes for the team’s effort, something that will be carried through the game by players and coaches alike.\r\n\r\n“The only thing that I predict is that Palo Alto Football will play extremely hard and regardless of the outcome, I know I'll be proud of my guys,” Halas said. “For all but a few seniors, the playoffs are unchartered territory. They’re excited to play in the post-season and the energy is great. Our goal is to play every snap from the first whistle to the final horn as hard as we possibly can.”","excerpt":"The Palo Alto High School football team (4-6, 3-3) is set to face the Salinas Cowboys (6-4, 4-2) in its first Central Coast Section playoff game of the season at 7 p.m. on Friday in Salinas.","date":"2015-11-19 20:55:36","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P8242.jpg","categories":["Football","Sports"],"tags":["CCS","football","givens","halas","hull","palo alto high school","playoffs","salinas","schoeben","sports"]},{"id":112192,"title":"Stuff(ing) yourself at the Turkey Trot","permalink":"http:\/\/palyvoice.com\/2015\/11\/19\/stuffing-yourself-at-the-turkey-trot\/","content":"The 11th annual Turkey Trot is coming to Palo Alto High School tomorrow during an extended lunch in celebration of Thanksgiving.\r\n\r\nIn exchange for either five dollars or two dollars plus three cans, students will be able to feast on turkey, pies and bread rolls. There is also a baked potato option for vegetarians.\r\n\r\n\"It’s a huge effort involving lots of volunteers, donors and coordination,\" event organizer Melissa Anderson said. \"While it’s a great community event for Paly students, staff and parents, it’s also an important fundraiser. ... It’s a win-win for everyone.\"\r\n\r\nSimilarly to last year, Anderson says collected cans and donations will be given to the Ecumenical Hunger Program in East Palo Alto while leftover food will be given to the Downtown Food Closet at All Saints Episcopal Church.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/9482404-turkey-trot\" width=\"620\" height=\"844\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"The 11th annual Turkey Trot is coming to Palo Alto High School tomorrow during an extended lunch in celebration of Thanksgiving.","date":"2015-11-19 20:40:49","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg","categories":["News","Spotlight"],"tags":["2015","camille","feast","gunn","lunch","numbers","statistics","Townsend","trot","turkey"]},{"id":112041,"title":"Treading the line between cultural appropriation and cultural exchange","permalink":"http:\/\/palyvoice.com\/2015\/11\/19\/treading-the-line-between-cultural-appropriation-and-cultural-exchange\/","content":"[caption id=\"attachment_112229\" align=\"alignnone\" width=\"601\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/culturalappropriation.jpg\"><img class=\" wp-image-112229\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/culturalappropriation.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"601\" height=\"448\" \/><\/a> Illustration by Portia Barrientos.[\/caption]\r\n\r\nGrowing up in the Bay Area, I have submerged myself into vastly different traditions. I have participated in my friends’ Hanukkah dinners, Swedish glogg parties, Christmas “Secret Santa” games and Diwali celebrations. When I first heard the term “cultural appropriation” without fully understanding the definition, I reflected back on my own life and anxiously wondered if these events had been innocuous exposures to different cultures or if I had been unknowingly appropriating cultures since my elementary school years. In reality, I had simply celebrated these festivities alongside my friends. It's appropriate to experience other cultures, as long as individuals maintain and recognize the meaning to ethnic and racial groups.\r\n\r\n<span style=\"font-weight: 400;\">Recently at Yale University, the <\/span><a href=\"http:\/\/www.nytimes.com\/2015\/11\/09\/nyregion\/yale-culturally-insensitive-halloween-costumes-free-speech.html\"><span style=\"font-weight: 400;\">Intercultural Affairs Council reminded students<\/span><\/a><span style=\"font-weight: 400;\"> to stay sensitive of other cultures when choosing Halloween costumes in preparation for the holiday. Erika Christakis, a residential college associate master, ignited an uproar when she <\/span><a href=\"http:\/\/pastebin.com\/egSQGfgK\"><span style=\"font-weight: 400;\">replied to this reminder<\/span><\/a><span style=\"font-weight: 400;\"> asking, “Is there no room anymore for a child or young person to be a little bit obnoxious … a little bit inappropriate or provocative or, yes, offensive?” She elaborated on her own experience, saying, “When I lived in Bangladesh, I bought a sari because it was beautiful, even though I looked stupid in it and never wore it once. Am I fetishizing and appropriating others’ cultural experiences? Probably. But I really, really like them too.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Christakis demonstrated exactly what Yale’s Intercultural Affairs Council wanted to avoid. Although she recognizes her insensitivity in the email, her tone indicates little remorse because she focused on the aesthetic appeal of the sari without regard to its practical or symbolic value to the Bangladeshi. Her remarks veered into the dangerous and offensive area of appropriation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The immediate student body reaction to Christaki's email was visceral, and many demanded her resignation. While onlookers may view this as an overreaction, <\/span><span style=\"font-weight: 400;\"><a href=\"https:\/\/medium.com\/@aaronzlewis\/what-s-really-going-on-at-yale-6bdbbeeb57a6\">Yale student Aaron Lewis wrote<\/a><\/span><span style=\"font-weight: 400;\"> that trivial Halloween costumes were not the basis of the students’ protests, but rather the prolonged failure of Yale administration to combat racism on campus. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Without a doubt, the issue of <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.nytimes.com\/2015\/11\/12\/us\/racial-discrimination-protests-ignite-at-colleges-across-the-us.html\">racial discrimination is and has been prevalent at many universities<\/a> throughout the United States, notably including the <a href=\"http:\/\/www.nytimes.com\/2015\/11\/12\/us\/university-of-missouri-protests.html?_r=0\">University of Missouri<\/a>, where there were race-inspired death threats.<\/span><span style=\"font-weight: 400;\"> Clearly, it is unacceptable for students and faculty to perpetuate others’ discomfort through racist remarks or actions. Despite disagreeing with Christakis’s overarching message, her email made me think about the expansive gray area between inappropriate exploitations of other cultures and the opportunity to explore various cultures to expand one's own perspective.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">One of my first introductions to the term “cultural appropriation” was through actress Amandla Stenberg, who created a <\/span><span style=\"font-weight: 400;\"><a href=\"https:\/\/www.youtube.com\/watch?v=O1KJRRSB_XA\">video to promote awareness of the issue<\/a> in African-American culture.<\/span><span style=\"font-weight: 400;\"> Stenberg addresses the exploitation of cornrows, a practical hairstyle for African-Americans that has become a fundamental component of their identity. As hip-hop, another part of African-American culture, became increasingly popular, many African-Americans' cultural markers <\/span><span style=\"font-weight: 400;\">became adopted by a wider, predominantly white, society. Soon, celebrities and models of Caucasian descent sported the hairstyle, and transitively, African-American culture became a trend, one that exists even at our own school. Before Spirit Week during the theme selection process, many students viewed a <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/palyvoice.com\/2015\/09\/04\/ban-on-junior-spirit-week-theme-idea-causes-uproar\/\">nominated Spirit Week theme of “Gold Chains<\/a>\"<\/span><span style=\"font-weight: 400;\"> as marginalizing a minority.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">But should Eminem and Iggy Azalea not rap simply because they aren't African-American? If imitation is the sincerest form of flattery, why is there such a loud uproar in defiance of these actions?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The broader issue is not necessarily that people are experimenting with different cultures, but rather that gestures can often be interpreted as an ignorance of the symbolic significance to a distinct group of people.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The United States is supposed to be a cultural melting pot; sharing ways of life is an integral foundation of American culture itself. Jazz music, considered a classic American music genre, epitomizes the consolidation of many cultures. It originated in New Orleans and has roots from all over the world, ranging from French and Italian opera to Caribbean and Mexican music. If this form of cultural diffusion had been mislabeled as cultural appropriation at that time, it could have hindered the growth of this treasured part of American culture. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yes, it is inappropriate to stereotype and trivialize ways of life. Furthermore, it is unacceptable to claim ownership over another culture's aspects. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, upon understanding the backstories, it should be acceptable to celebrate alongside others. S<\/span><span style=\"font-weight: 400;\">haring cultures is essential to expanding an individual’s perspectives. Instead of quickly adopting the new trend and remaining oblivious to its historic meaning, celebrate and learn the significance of others’ racial or religious celebrations and practices. E<\/span><span style=\"font-weight: 400;\">mbracing and adapting a component of another’s culture based on a personal agreement with its baseline sentiments should not be reprimanded or branded as cultural appropriation. I can celebrate the Christmas spirit with my friends to evoke joy and generosity in myself and others.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Racial tensions are and will continue to be the forefront struggle of civil rights. As society continues to evolve and change, cultural appropriation can be avoided through cultural education, either self-imposed or in school, and the conscious decision to embrace these cultures rather than to exploit them.<\/span>","excerpt":"Instead of quickly adopting the new trend and remaining oblivious to its historic meaning, celebrate and learn the significance of others’ racial or religious celebrations and practices. ","date":"2015-11-19 17:28:22","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/culturalappropriation.jpg","categories":["Opinion","Spotlight"],"tags":["amandla stenberg","amy leung","cornrows","cultural appropriation","cultural diffusion","cultural exchange","culture","difference","erika christakis","gray area","halloween costume","jazz music","opinion","racism","rap","yale university"]},{"id":112173,"title":"Nation-wide initiative focuses on positive culture at Paly","permalink":"http:\/\/palyvoice.com\/2015\/11\/19\/nation-wide-initiative-focuses-on-positive-culture-at-paly\/","content":"[caption id=\"attachment_112178\" align=\"alignnone\" width=\"623\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/21.jpg\"><img class=\"wp-image-112178\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/21.jpg\" alt=\"2\" width=\"623\" height=\"467\" \/><\/a> Students and mentors discuss their campaigns during a Sources of Strength lunch meeting in October. According to Palo Alto High School psychologist Jonathan Frecceri, Paly students will be able to see many of the campaigns put into action on campus this month. Photo by Vivian Wu.[\/caption]\r\n\r\nSources of Strength, an initiative at Palo Alto and Gunn high schools, is organizing student-run campaigns in order for staff, students and parents to spread ideas of hope, health and strength.\r\n\r\nThe program is in its inaugural year at both Paly and Gunn and its objective is to spread stories of resilience and the overcoming of struggles, rather than sharing those of pain or trauma, according to Paly school psychologist Jonathan Frecceri. One major goal of the initiative is to replace any negative culture, such as bullying, suicide and substance abuse with the development of a more positive culture.\r\n\r\n“We don’t talk about sadness, shock or trauma messaging, but rather hope, health and strength messaging,” Frecceri said. “We can start to change the way that we talk about past failure and the way we talk about disappointment and struggle, to talking about how we bounced back.”\r\n\r\nAccording to the <a href=\"https:\/\/sourcesofstrength.org\/discover\/history\/\" target=\"_blank\">Source of Strength website<\/a>, the initiative has spread to become a nationwide movement across the United States since its founding in a Native American reservation system in North Dakota in 1988 as a suicide prevention program. Sources of Strength has reduced the number of suicide attempts in other communities similar to that of Palo Alto, according to Frecceri.\r\n\r\n“Sources of Strength has been implemented in communities like ours where we’ve had suicide contagion, and it’s been shown to build protective factors in those communities,” Frecceri said. “We live in a community here in Palo Alto where there is a certain culture of achievement. Success kind of looks one way. We have to change that narrative somehow and I think Sources of Strength is a good way for us to start that. It’s not about being silent but it is about sharing the hope, the health, and the strength that we’ve learned and used to come through hard times.”\r\n\r\nInitially, staff nominated approximately 150 students to be part of the initiative's core members, but the group is now comprised of 68 students, along with 25 mentors who are Paly staff members. Members underwent a training session in October to understand what it takes to be a peer leader and learn about the variety of sources of strength that people rely on.\r\n\r\n“We asked teachers and staff across campus to send us a list of nominations of students in ninth, 10th, 11th and 12th grade that they thought were students who in their various social groups had a voice,” Frecceri said. “We didn’t say to send us a list of leaders or to send us a list of those traditional high-achieving students or popular students.”\r\n\r\nTogether, mentors will work with students on two overarching campaigns. While mentors facilitate progress and provide the students with materials, students are mostly in charge of conducting the project. One campaign seeks to identify and thank trusted adults on campus while the other is centered on gratitude. Sources of Strength students are divided into eight different groups with approximately eight students and three mentors who will focus on more specific subsets of the two main campaigns.\r\n\r\nSome of the groups will specialize in campaigning through social media, audio-visual means, presentations or event coordinating, according to Frecceri. Students meet twice a month with their groups to help brainstorm, plan, execute and reflect on their campaigns.\r\n\r\n“I'm the adviser for the audio-visual committee,\" said Sharla May, math teacher and a Sources of Strength adviser. \"They're dealing with audio aspects of the campaign. Currently, the members are trying to publicize their campaign through InFocus, Paly Radio or even the MAC [Media Arts Center] screens.”\r\n\r\nPaly students will witness many of these campaigns implemented on campus this month.\r\n\r\n“The groups have been meeting since Oct. 12,” Frecceri said. “Now they’re in the phase of implementation and in the week following Thanksgiving, you’ll see a lot of these campaigns getting rolled out.”\r\n\r\nJunior Zahra Muzaffar, a member of Sources of Strength, is one of six students who, along with the guidance of two mentors, has developed and launched a campaign this Monday. Her campaign is a mixture of both identifying trusted adults and sources of gratitude.\r\n\r\n“My group did the ‘Have you been pinned?’ campaign,” Muzaffar said. “We started with 100 clothespins and wrote people messages. The idea was that they would keep their messages and pass it on to someone else. We also created a <a href=\"http:\/\/paly.io\/pinned\" target=\"_blank\">virtual board<\/a> that anyone can add to.”\r\n\r\n<span style=\"font-weight: 400;\">Sources of Strength member and junior Timothy Liu is working in another group on completing a school mural to spread messages of strength and gratitude.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're looking to create a mural that will allow students to contribute to it and add their own flair and feel so that at the end, we have a school mural in a sense,” Liu said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Frecceri stresses that Sources of Strength is not a club, but an initiative whose long-term goal is to is to implement a positive, long-lasting culture of support.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My goal is that in a couple of years Paly will identify itself as a Sources of Strength school,” Frecceri said. \"We all are responsible for coming around this. … It’s going to be Paly and Gunn, together, united, doing this as a community.”<\/span>","excerpt":"Sources of Strength, an initiative at Palo Alto and Gunn high schools, is organizing student-run campaigns in order for staff, students and parents to spread ideas of hope, health and strength.","date":"2015-11-19 11:02:38","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/21.jpg","categories":["Features","News"],"tags":["bloom","brimhall","Frecceri","gunn","jonathan","josh","lauren","layla","leinhos","liu","muzaffar","nadia","new","nolen","of","paly","prevention","program","solatan","sources","strength","suicide","timothy","zahra"]},{"id":112108,"title":"Tuesday Tunes: James Franco","permalink":"http:\/\/palyvoice.com\/2015\/11\/17\/tuesday-tunes-james-franco\/","content":"[caption id=\"attachment_112135\" align=\"alignleft\" width=\"347\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/franco.png\"><img class=\"wp-image-112135\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/franco.png\" alt=\"James Franco currently mentors high school students through his film workshop located in Palo Alto High School's Media Arts Center. Photo by Ethan Kao.\" width=\"347\" height=\"522\" \/><\/a> James Franco pauses to have a chat with The Paly Voice after his film workshop at Palo Alto High School's Media Arts Center on Sunday. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Paly Voice sat down on Sunday with successful actor, artist, writer and Palo Alto High School alumnus James Franco to discuss how music influenced his Paly experience and career.\r\n\r\nFranco, a graduate of the Class of 1996, has since gained success through many roles in mainstream movies such as \"Spiderman\" and more recently, \"<a href=\"http:\/\/www.theinterview-movie.com\/\" target=\"_blank\">The Interview<\/a>.\" However, Franco still remains involved in Palo Alto’s community by mentoring students approximately once a month for a <a href=\"http:\/\/palyvoice.com\/2015\/09\/13\/james-franco-teaches-first-film-workshop\/\" target=\"_blank\">film workshop<\/a> in Paly’s Media Art Center.\r\n\r\nAccording to Franco, music has been a large part of his life, even when he went to school at Paly. Franco recalls how music surrounded many of his school experiences.\r\n\r\n“One of my best friends was in a band called Smiley Face,” Franco said. \"There were a lot of battles of the bands.”\r\n\r\nOf the various bands that participated in battle of the bands, Franco recalls a female band to be his favorite.\r\n\r\n“Raggedy Ann was the only female band,” Franco said. “They were the biggest band to come out of all of them and they actually went on to become <a href=\"http:\/\/www.the-donnas.com\/\" target=\"_blank\">The Donnas<\/a>.”\r\n\r\nFranco currently enjoys all types of music, but is especially drawn to alternative music, much like his alternative work displayed in his art and short movies.\r\n\r\n“I really enjoy listening to Motown, and I listen to a lot of Rolling Stones,” Franco said. “But I have to admit, I currently really like all three of Justin Bieber’s new singles.”\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Aethankao55%3Aplaylist%3A6tWPWBZi0IL7ojQF3KClZY\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"The Paly Voice sat down with successful actor and Palo Alto High School graduate James Franco to discuss how music influenced his Paly experience and career.","date":"2015-11-17 20:53:31","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-17-at-8.54.26-PM.png","categories":["Tuesday Tunes"],"tags":["famous","film workshop","james","james franco","the interview","tuesday","Tuesday Tunes","tunes"]}]