[{"id":111082,"title":"Liveblog: Football vs. Homestead for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/10\/30\/liveblog-football-vs-homestead-for-senior-night\/","content":"[liveblog]","excerpt":"Tune in to the Paly Voice liveblog of the Palo Alto Vikings' last home game of the regular season against Homestead on Senior Night.","date":"2015-10-30 19:25:11","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P6770.jpg","categories":["Uncategorized"],"tags":[]},{"id":110988,"title":"School Board discusses achievement gap solutions","permalink":"http:\/\/palyvoice.com\/2015\/10\/29\/school-board-discusses-achievement-gap-solutions\/","content":"[caption id=\"attachment_111035\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_4144.jpg\"><img class=\"wp-image-111035 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_4144.jpg\" alt=\"Board Meeting 10\/27 Melissa Caswell\" width=\"600\" height=\"400\" \/><\/a> School board president Melissa Caswell speaks at the Palo Alto Board of Education meeting on Oct. 27. The board addressed issues of the achievement gap of historically underrepresented racial group students and Palo Alto demographics of ACT, SAT and Advanced Placement exam scores. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\nThe Palo Alto Unified School District Board of Education plans to take action to improve school climate and decrease the achievement gap of historically underrepresented racial groups within the school district.\r\n\r\nAt the board meeting on Oct. 27, members looked over the High School Measures Report which includes college readiness metrics such as ACT scores, SAT scores and Advanced Placement exam scores. The data points revealed that historically underrepresented racial group students at Palo Alto high schools score significantly lower than those of Caucasian or Asian ethnicity.\r\n\r\n“Increasing achievement for underrepresented minorities is a high priority,” board member Ken Dauber said. “But we need to do more, including improving how well curriculum and teaching meets the needs of all students and examining how well laning is supporting students in increasing achievement.”\r\n\r\nThe Minority Achievement and Talent Development committee, created earlier this year, is working with elementary schools to combat the issues of struggling students as early as kindergarten and first grade. MATD is providing increased access to support resources for students and their parents, according to Judy Argumedo, the PAUSD director of Academic Supports\r\n\r\nIn addition to establishing the MATD committee, the school board members also implemented early literacy and math after school programs for non-native English speakers at the Hoover and Fairmeadow elementary schools in order to help students catch up at an early age.\r\n\r\n“I’ve talked to a lot of historically underrepresented racial group parents whose kids are struggling in math,\" school board president Melissa Caswell said. \"I believe that if you wait until middle school, you’ll never be able to catch up.\"\r\n\r\nThe board members also discussed the necessity of changing the overall climate surrounding Advanced Placement courses. The board emphasized the importance of encouraging all students to take advanced classes and providing them with access to a more rich education through these courses.\r\n\r\n“Some kids in our district may feel intimidated by the APs, thinking that they are only for a select group,” board member Camille Townsend said. “This should become a continual focus that our that kids take at least one AP class, so they gain confidence in themselves.”\r\n\r\nCaswell emphasized that the board will be focusing on improving the quality of education across all the schools within the district.\r\n\r\n“We need to ask [ourselves], ‘Are we providing advanced topics to enough of our kids?’” Caswell said.","excerpt":"The Palo Alto Unified School District Board of Education plans to take action to improve school climate and decrease the achievement gap of historically underrepresented racial groups within the school district.\r\n","date":"2015-10-29 21:44:38","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_4144.jpg","categories":["News","Spotlight"],"tags":["achievement gap","ACT","AP testing","Camille Townsend","ken dauber","Melissa Caswell","sat"]},{"id":111002,"title":"Football takes on Homestead in Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/10\/29\/football-takes-on-homestead-in-senior-night\/","content":"[caption id=\"attachment_111004\" align=\"alignnone\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P6770.jpg\"><img class=\"wp-image-111004\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P6770.jpg\" alt=\"_I9P6770\" width=\"581\" height=\"387\" \/><\/a> Sophomore running back Paul Jackson III runs the ball during the Palo Alto High School Homecoming game last Friday. The Vikings fell to the Los Gatos Wildcats 42-20. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School football team (3-5, 2-2) will take on the Homestead Mustangs (3-4, 1-2) in its last home game at 7 p.m. on Friday for the Vikings’ Senior Night.\r\n\r\nWinning one of the next games will determine whether or not the Viking go to the Central Coast Section playoffs, according to head coach Jake Halas.\r\n\r\n“We’re just going to rally together,” Halas said. “If we win one of our last two [games], we go to the playoffs.\"\r\n\r\nThough the team did not achieve its goals in the past week, falling to Los Gatos in Paly’s Homecoming game, the Vikings are still working hard, according to junior center Peter Snodgrass.\r\n\r\n“We should keep on game planning and working hard,” Snodgrass said. “Each practice we should get better and build on it [past experiences].”\r\n\r\nAccording to senior wide receiver Eli Givens, this game holds a lot of meaning for the players, especially the seniors.\r\n\r\n“It surprises me because it seemed like just yesterday I was playing as a sophomore, and now it’s my last home game,” Givens said. “I want the feeling of a good win on my last night playing on that field with my family watching.”\r\n\r\nAccording to Givens, The Vikings are focusing on being defensively consistent.\r\n\r\n“We are getting ready for their [Homestead's] offense,” Givens said. “Our defense is going to have to step up and make big plays. We can’t let them get big plays on us.”\r\n\r\nAdditionally, Givens said that the team needs to work to stay focused throughout the game.\r\n\r\n“We need to work on not giving up and making sure we finish our plays and our tackles until the whistle blows,” Givens said.","excerpt":"The Palo Alto High School football team (3-5, 2-2) will take on the Homestead Mustangs (3-4, 1-2) in their last home game at 7 p.m. on Friday, the Vikings’ senior night.\r\n","date":"2015-10-29 20:47:57","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P6770.jpg","categories":["Football","Sports"],"tags":["eli givens","football","halas","homecoming","homestead","palo alto high school","peter snodgrass","Senior Night"]},{"id":110910,"title":"Liveblog: Republican nominees square off in debate","permalink":"http:\/\/palyvoice.com\/2015\/10\/28\/liveblog-republican-nominees-square-off-in-debate\/","content":"<em>Join The Paly Voice as we liveblog all the exciting action during the Republican debate  5 p.m. tonight on CNBC.<\/em>\r\n\r\n[liveblog]\r\n\r\n","excerpt":"Join The Paly Voice as we live blog all the exciting action during the Republican debate tonight at 5 p.m. on CNBC. ","date":"2015-10-28 16:52:45","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Sherwins-voice-stuff.jpg","categories":["Election 2016"],"tags":[]},{"id":109593,"title":"How to prevent bike theft","permalink":"http:\/\/palyvoice.com\/2015\/10\/27\/how-to-prevent-bike-theft\/","content":"Palo Alto is often considered a safe, suburban environment that is geared towards bikers and bike safety. But with any small city, bike theft is still prevalent.\r\n\r\nAccording to Main Office Receptionist Jenny Gardiner, 11 bike thefts have already been reported on campus this year. Palo Alto High School student Thomas Crouch is one of many students who has had his bike stolen after leaving it for a short period of time.\r\n\r\n“I left it outside CVS under the watch of the cashier and then I went into CVS for about one minute,” Crouch said. “When I came back the bike was gone and the cashier said he had no idea where it went or who took it.”\r\n\r\nIn order to prevent you from becoming susceptible to bike theft, the Paly Voice has some tips.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/710548910728282113\/1024\/10\/scaletowidth#tl-710548910728282113;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Palo Alto is often considered a safe, suburban environment that is geared towards bikers and bike safety. But with any small city, bike theft is still prevalent.","date":"2015-10-27 17:11:20","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/image.jpeg","categories":["Features"],"tags":["bike","police","School","theft"]},{"id":109343,"title":"Blogger without borders: Students take action","permalink":"http:\/\/palyvoice.com\/2015\/10\/27\/blogger-without-borders-students-take-action\/","content":"<em>The following piece is the second installation of “Blogger without borders,” a blog by junior Bianca Al-Shamari that details her gap semester in Austria from September 2015 to January 2016. Al-Shamari will discuss everything from the refugee crisis in Western Europe to the cultural experience she’s encountering in Vienna. She plans to immerse herself into a new culture and share an international perspective with Palo Alto High School through photos, interviews and travel updates.<\/em>\r\n\r\n<strong>Students take action: Migrant crisis receives mass assistance from younger generation<\/strong>\r\n\r\n\"Imagine the difficulty to leave your home country, travel thousands of miles with very little food, water and a makeshift shelter,\" said Emma Graham, a Canadian exchange student in eastern Austria who volunteers for a local refugee camp.\r\n\r\nThe largest population migration in modern history is spreading its influence across Western Europe, directly influencing the lives of the public. Austria has found itself overwhelmed by the sheer number of migrants seeking asylum, as Austria is one of the countries en route to Germany for the refugees.\r\n\r\n[caption id=\"attachment_110000\" align=\"alignnone\" width=\"591\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/web-s645-BOAT.jpg\"><img class=\" wp-image-110000\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/web-s645-BOAT.jpg\" alt=\"Migrants travel from Greece, through the Balkans and Hungary, and north toward Western Europe, movement made possible by Europe’s open borders,&quot; according to a New York Times article. http:\/\/www.nytimes.com\/2013\/11\/30\/world\/middleeast\/out-of-syria-into-a-european-maze.html?pagewanted=all . Graphic courtesy of The New York Times.\" width=\"591\" height=\"378\" \/><\/a> Migrants travel from Greece, through the Balkans and Hungary, and north toward Western Europe, movement made possible by Europe’s open borders, according to a <a href=\"http:\/\/www.nytimes.com\/2013\/11\/30\/world\/middleeast\/out-of-syria-into-a-european-maze.html?pagewanted=all\">New York Times article<\/a>. Graphic courtesy of The New York Times.[\/caption]\r\n\r\nThroughout my stay here in Austria, I have witnessed friends, families and classmates come together to foster a community of humanitarians. Movements such as \"#RefugeesWelcome\" instigate students to put stickers and banners around the school, which serve as words of encouragement to assist refugees in need. Many also volunteer at nearby public community centers that harbor refugees each week, one of which is located a block away from my school. Volunteers offer food and shelter, provide guidance to travel to Germany and assist with travel to neighboring camps.\r\n\r\n[caption id=\"attachment_110043\" align=\"alignleft\" width=\"422\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Screen-Shot-2015-10-18-at-10.13.02-AM.png\"><img class=\"wp-image-110043\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Screen-Shot-2015-10-18-at-10.13.02-AM.png\" alt=\"\" width=\"422\" height=\"315\" \/><\/a> The logo for \"#RefugeesWelcome\" can be found all throughout Austria, from student iPhones to city buildings. The movement is centered around protecting migrants by providing them with a place of residency during Western Europe's refugee crisis. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\nKarim El Moataoui, an 18-year-old who attends Bundesgymnasium und Bundesrealgymnasium Schwechat, a high school in Schwechat, volunteers at the local community center.\r\n\r\n\"I've never seen this many of my neighbors together before,\" El Moataoui said. \"We all do our part and I've seen how good people have been with each other lately.\"\r\n\r\nEl Moataoui works alongside his mother and sister to assist the refugees.\r\n\r\n\"Tomorrow, I'm going to be teaching the families here [Schwechat] German,\" El Moataoui said. \"My mother teaches whenever she has time and my little 16-year-old sister watches over the kids. By this point, everyone just does what they can.\"\r\n\r\nEl Moataoui's began his volunteer work by building beds and writing six pages of necessary supplies.\r\n\r\n\"My friend built 150 in one day, after we heard that 600 refugees were coming in that night,\" El Moataoui said.\r\n\r\nMiriam Haschak, a 16-year-old student at BG\/BRG Schwechat, actively helps a group of families who were placed beside her apartment by the local government.\r\n\r\n\"I've really gotten to know the families,” Haschak said. “I usually bring the kids to the doctors and make them food. I’ve been over so often they know around what time I’ll be there, and they make little snacks and tea for me. They're really warm families.\"\r\n\r\n[caption id=\"attachment_108320\" align=\"alignright\" width=\"284\"]<img class=\"wp-image-108320\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/image7.jpg\" alt=\"image\" width=\"284\" height=\"379\" \/> Einen Moment is an Austrian site that raises awareness about social issues and political controversy. In recent news it has spread awareness on how future politicians will act on the crisis. By doing so they give the public information that thoroughly influences important political and social decisions. The site is primarily targeted for German speakers who tackle hundreds of issues concerning change in the country. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\nGraham, the Canadian exchange student, believes that volunteering at a refugee camp has changed her perspective of the world.\r\n\r\n\"What I've seen at this camp is honestly something I will remember for the rest of my life,\" Graham said. \"To see people who were desperate for clothing, money and shelter ... so grateful when receiving proper shoes and clothing. Being a Canadian citizen, I live a sheltered life. But working in the camp was a real eye-opener.\"\r\n\r\nGraham helped to sort clothing, organizing it in bunkers for future refugees, and spent the remainder of her volunteer work at the children's table, playing with the kids using puzzles and coloring books.\r\n\r\n\"How happy the toys made the children was indescribable and it made me feel amazing at what I had done to help these people with so little,\" Graham said. \"Those four hours were the most selfless hours of my life and that pure euphoric joy was the best feeling in the world.\"\r\n\r\nGraham encourages others to volunteer after seeing the value associated with such offered services.\r\n\r\n\"I firmly believe that this camp was like a motivation for the refugees to keep going and to continue their journey,\" Graham said. \"These camps are what keeps them motivated to get their family and themselves to safety.\"\r\n\r\nGraham admires the strength that each Syrian refugee holds by making their journey across countries.\r\n\r\n<span style=\"line-height: 1.5;\">\"The refugees, mentally and physically, were probably exhausted,\" Graham said. \"But the majority of the people managed to keep smiling and put effort in to keep moving forward. To think that some had to do all of this with a family is phenomenal, they possess so much physical and mental strength. Considering the long way and all that these refugees endured, I have so much respect for each and every one of the Syrian refugees.\"<\/span>\r\n\r\nAfter witnessing the refugee crisis firsthand, Graham believes that countries should be more heavily involved in saving lives.\r\n\r\n\"Take refugees into your country, provide them with the basic necessities and make them thrive,\" Graham said. \"Train them to be able to work, so they can support their families, so the cycle of poverty doesn't either continue or begin. Even just letting them pass through all of the European countries so they can reach their destination could be better than putting up barricades and putting them through more emotional, physical and mental pain.\"\r\n\r\nBut one does not have to be located in Western Europe to provide a helping hand. Students and adults alike can offer their assistance worldwide.\r\n\r\n\"I would recommend helping out any type of humanitarian group, and in any way possible, because the satisfaction of seeing all that one group can accomplished was beyond mesmerizing,\" Graham said.\r\n\r\n<span style=\"line-height: 1.5;\">If you would like to join the thousands of people that are a part of the movement to help, feel free to visit any of the following sites: <a href=\"http:\/\/www.theguardian.com\/world\/2015\/sep\/03\/refugee-crisis-what-can-you-do-to-help\">The Guardian<\/a>, <a href=\"http:\/\/www.unrefugees.org\/can-help\/\">Unrefugees<\/a>, <a href=\"http:\/\/www.savethechildren.org\/site\/c.8rKLIXMGIpI4E\/b.7998857\/k.D075\/Syria.htm\">Savethechildren<\/a>, <a href=\"http:\/\/www.rescue.org\/crisis-syria\">Rescue.org<\/a><\/span>\r\n\r\nHere's to the start of a better world.","excerpt":"The second installation of “Blogger without borders,” a blog by junior Bianca Al-Shamari that details her gap semester in Austria from September 2015 to January 2016.","date":"2015-10-27 11:25:25","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Screen-Shot-2015-10-15-at-5.15.48-PM.png","categories":["Blog","Blogger without borders","Spotlight"],"tags":[]},{"id":109856,"title":"Voice of the Week: Chelsea Mclntosh","permalink":"http:\/\/palyvoice.com\/2015\/10\/26\/voice-of-the-week-chelsea-mclntosh\/","content":"<em>This week, the Paly Voice sat down with senior Chelsea Mclntosh to learn about the her passion for bananas, running and her cat. <\/em>\r\n\r\nThe Paly Voice: Tell us about yourself.\r\n\r\nChelsea McIntosh: I really like bananas, I’m vegan and I enjoy singing, running and yoga.\r\n\r\nTPV: Why bananas?\r\n\r\nCM: They’re delicious, practical, great and really delicious. It started from a young age. I'd have them for breakfast when my mom was too busy.\r\n\r\nTPV: How many do you eat a day?\r\n\r\nCM: On average, six, at most 12.\r\n\r\nTPV: That’s a lot of bananas. Do you have a tree in your yard?\r\n\r\nCM: I do have a banana tree ... but it bears no fruit.\r\n\r\nTPV: So how did you become vegan?\r\n\r\nCM: I read a book on nutrition and starting second semester of sophomore year, I began going vegan. At first it was for health reasons, but then I saw a video on Facebook on factory farms that made me not want to contribute [to the meat industry.]\r\n\r\nTPV: Do you like being vegan?\r\n\r\nCM: It’s really fun. I love fruits and veggies, and there’s also a great community of vegans. I look up to <a href=\"https:\/\/www.youtube.com\/user\/essenaoneill\" target=\"_blank\">Essena ONeill<\/a>, a vegan YouTuber who travels a lot and is really compassionate. We have a lot of similar qualities.\r\n\r\nTPV: I’ve heard you have a cow costume?\r\n\r\n[caption id=\"attachment_109168\" align=\"alignright\" width=\"277\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12086910_10203608407811147_1601616122_n.jpg\"><img class=\" wp-image-109168\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12086910_10203608407811147_1601616122_n.jpg\" alt=\"Mclntosh poses in her dalmatian costume for Halloween with a 1\/2 eaten banana and her cat Chewy. Photo Courtesy [[[[courtesy]]] of Chelsea Mclntosh.\" width=\"277\" height=\"370\" \/><\/a> Mclntosh poses in her dalmatian costume for Halloween with a half eaten banana and her cat Chewy. Photo courtesy of Chelsea Mclntosh.[\/caption]CM: It’s actually a dalmatian [costume]. I thought it would be cool to be a dalmatian for Halloween and [in the picture] I was also holding a half eaten banana and my fat cat Chewy was just there...I also own a banana costume.\r\n\r\nTPV: Tell me more about your cat.\r\n\r\nCM: I’ve had him since 2nd grade. He weighs 30 pounds and likes to lie on his back to tan in the sun.\r\n\r\n[caption id=\"attachment_109169\" align=\"aligncenter\" width=\"237\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12071711_10203608406451113_1573525640_n.jpg\"><img class=\"wp-image-109169\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12071711_10203608406451113_1573525640_n.jpg\" alt=\"12071711_10203608406451113_1573525640_n\" width=\"237\" height=\"316\" \/><\/a> Mclntosh's cat, Chewy, likes to sun tan upside-down. Photo courtesy of Chelsea Mclntosh.[\/caption]\r\n\r\n&nbsp;\r\n\r\nTPV: What got you into running?\r\n\r\nCM: I get up every morning at 4 a.m. to plan my day and then I run 2-4 miles at 6 a.m.\r\n\r\nTPV: Why so early?\r\n\r\nCM: I found that I wasn’t as productive later in the day, and was more productive in the mornings after a run. Some of my favorite running spots are Foothills, Lake Lagunita and the Dish.\r\n\r\nTPV: What’s the weirdest thing in your fridge?\r\n\r\nCM: Kelp noodles. I looked up this recipe that needed kelp noodles so I went to Country Sun [grocery store] and got them. They are very kelpy. You have to mix them in with something else or else it just tastes like the ocean.\r\n\r\nTPV: What’s your message to the rest of Paly?\r\n\r\nCM: Think about your actions today and if they’re contributing to where you want to be in the future.\r\n\r\n&nbsp;","excerpt":"This week, The Paly Voice sat down with senior Chelsea Mclntosh to learn about the her passion for bananas, running and her cat.","date":"2015-10-26 12:01:40","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_1807.jpg","categories":["Features"],"tags":["banana","cat","chelsea mclntosh","kelp","vegan","voice of the week","yoga"]},{"id":110863,"title":"Spirit Week final results","permalink":"http:\/\/palyvoice.com\/2015\/10\/25\/spirit-week-final-results-2\/","content":"Seniors are the champions of Spirit Week 2015, as announced at the <a href=\"http:\/\/palyvoice.com\/2015\/10\/24\/liveblog-homecoming-dance-2015\/\" target=\"_blank\">Homecoming dance last night<\/a>. They won both the <a href=\"http:\/\/palyvoice.com\/2015\/10\/23\/recap-floats-float-dancers-dance-seniors-prance-to-victory\/\" target=\"_blank\">best float<\/a> and the best <a href=\"http:\/\/palyvoice.com\/2015\/10\/23\/spirit-dances-2015\/\" target=\"_blank\">Spirit Dance<\/a>, allowing them to gain an unprecedented 5,170 point lead from the first runner-ups, the juniors. After a hard-fought week, sophomores secured third place, while the freshmen came in last.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/8565759-spirit-week-day-cinco\" width=\"620\" height=\"1896\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Take a comprehensive look at the final scores of Spirit Week 2015.","date":"2015-10-25 18:19:19","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12066021_10153204423121305_3700141584344537740_n.jpg","categories":["Spirit Week 2015"],"tags":["final results","palo alto high school","paly spirit","restuls","results","scores","Spirit Week","spirit week 2015 results"]},{"id":110880,"title":"Advisory this week is for all freshman and individual meetings for sophomores and seniors","permalink":"http:\/\/palyvoice.com\/2015\/10\/25\/advisory-this-week-is-for-all-freshman-and-individual-meetings-for-sophomores-and-seniors\/","content":"","excerpt":"","date":"2015-10-25 17:13:49","author":"Josh Yuen","categories":["Ticker","Uncategorized"],"tags":[]},{"id":110770,"title":"Slideshow: Staff shows off spirit","permalink":"http:\/\/palyvoice.com\/2015\/10\/25\/slideshow-staff-shows-off-spirit\/","content":"Suits, onesies and walking canes — Palo Alto High School students showed their creativity during Spirit Week 2015. However, students were not the only ones who displayed their enthusiasm. View the slideshow to see how teachers, with a variety of outfits, also added to school spirit throughout the week.\r\n<div id=\"cp_widget_d8c849a4-7007-4825-bc78-7c2d747641a3\">\r\n<div id=\"cp_widget_b7c7fd4f-6014-4a27-bd08-217e29358a50\">\r\n\r\n<div id=\"cp_widget_c886ee8c-1e85-487a-9019-3610d0070bf7\">...<script type=\"text\/javascript\">\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_c886ee8c-1e85-487a-9019-3610d0070bf7\"; cpo[\"_fid\"] = \"AYFAACNPoIIR\";\r\nvar _cpmp = _cpmp || []; _cpmp.push(cpo);\r\n(function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\";\r\ncp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\";\r\nvar c = document.getElementsByTagName(\"script\")[0];\r\nc.parentNode.insertBefore(cp, c); })(); <\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting for Business<\/a> solution.<\/noscript>\r\n\r\n","excerpt":"Suits, onesies and walking canes — Palo Alto High School students showed their creativity during Spirit Week 2015. However, students were not the only ones who displayed their enthusiasm. View the slideshow to see how teachers, with a variety of outfits, also added to school spirit throughout the week.","date":"2015-10-25 12:40:22","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN2274.jpg","categories":["Spirit Week 2015"],"tags":["2015","bungarden","Chen","costume","erber","eris","hall","jennifer","jenny","johnson","kamikihara","kim","kirsten","kwan","lindsay","matt","matthew","outfits","schultz","singares","snell","soo","spirit","taylor","Teacher","tolentino","Vuong","week","zhuge"]}]