[{"id":100098,"title":"Girls&#8217; wrestling builds momentum at Paly","permalink":"http:\/\/palyvoice.com\/2015\/03\/01\/girls-wrestling-builds-momentum-at-paly\/","content":"[caption id=\"attachment_100332\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/image1.jpg\"><img class=\"wp-image-100332\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/image1.jpg\" alt=\"image\" width=\"450\" height=\"316\" \/><\/a> Sophmore Sara Aguilar and junior Alexa Austin stand with former Coach Duran after winning CCS 2014. Photo courtesy of the Palo Alto wrestling team.[\/caption]\r\n\r\nNationwide, around 9,000 high school girls wrestled last year, which is nearly nine times more than from a decade earlier, according to the National Wrestling Coaches Association. Although girls' wrestling is growing in numbers, only about three percent of high school wrestlers are girls. Sophomore Sara Aguilar and senior Alexa Austin are the two female members of the Palo Alto High School wrestling team. The girls compete this weekend at the California Interscholastic Federation girls' state tournament in Visalia. The Paly Voice sat down with the two female wrestlers to ask them about their wrestling experiences at Paly.\r\n\r\n<b>The Paly Voice: <\/b>How did you get interested in wrestling?<b> <\/b>\r\n\r\n<b>Sara Aguilar<\/b>: Well, I started because at JLS (Jane Lathrop Stanford Middle School), I had Physical Education with Coach Braumon Creighton. He asked me if I wanted to do it, and I just did because it seemed fun.\r\n\r\n<b>Alexa Austin:<\/b> For me, I also was in Mr. Creighton’s class, and he wanted me to join. I thought I was too cool for wrestling, so I didn't. I actually played basketball freshmen year. Then, my mom and I started going to church, and my youth pastor was a wrestler, and he told me to join. I tried it just to try it and liked it, so I stayed.\r\n\r\n<b>TPV: <\/b>What would you suggest for other girls interested in wrestling?\r\n\r\n<b>SA<\/b>: Don't be afraid to try out even if you're the only girl. It is really fun, and you learn a lot. Mentally and physically, you grow.\r\n\r\n<b>AA<\/b>: It really is a fun sport. It might seem scary and intimidating, but it's a really welcoming team. Once you come out, we just like embrace each other.\r\n\r\n<b>TPV: <\/b>How much of a time commitment is it?\r\n\r\n<b>AA<\/b>: Practice is after school every day until 5:30 or 6 p.m. We don't really have any morning practices. Tournaments are on the weekends.\r\n\r\n<b>TPV: <\/b>How do you get on the team?\r\n\r\n<b>SA<\/b>: It's not a cut sport, so that means anyone can try out.\r\n\r\n<b>AA:<\/b> We start conditioning in September. Our first tournament is in December, so we just train for a few months.\r\n\r\n<b>TPV: <\/b>What's your favorite part about wrestling?\r\n\r\n<b>SA<\/b>: Being aggressive (laughs). It's just fun. You get obsessed with it sometimes.\r\n\r\n<b>AA<\/b>: I like competing. In a lot of tournaments, you compete with each other, but once the match is over, you become close friends. A lot of my toughest competitors, I train with a lot in the off season, and we are really close.\r\n\r\n<b>TPV: <\/b>What competitions are big for the girls' team?\r\n\r\n<b>AA<\/b>: A big one for the girls is Napa. Before girls' wrestling was part of the school, that was the state tournament, so we just keep going to it. We usually go to the <a href=\"http:\/\/www.sbhsd.k12.ca.us\/tournament\">Hollister Baler Bash<\/a>, which is very fun. Its a country tournament with hay bales and stuff like that. We always go to CSS (Central Coast Section) and State. We play in the dual meets, which is our school versus another school. Sometimes we do that in the league finals.\r\n\r\n<b>SA<\/b>: We also go to the boys' tournaments.\r\n\r\n<b>TPV: <\/b>Are there more girl wrestlers now than before?\r\n\r\n<b>AA<\/b>: Girls' wrestling is definitely growing and getting bigger. CCS is a lot bigger this year than it was last year, and it's been growing the three years we have been going. It grows – people get invited to come and just try it out.\r\n\r\n<em>The girls will attend the weekend-long CIF tournament this weekend at the Visalia Convention Center in Visalia.<\/em>","excerpt":"Sophomore Sara Aguilar and senior Alexa Austin are the two female members of the Palo Alto High School wrestling team. The girls compete this weekend at the California Interscholastic Federation girls' state tournament in Visalia.","date":"2015-03-01 17:07:26","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/image1.jpg","categories":["Features"],"tags":{"38439":"alexa austin","39960":"cif tournament","39959":"girls wrestling","25040":"interview","8944":"palo alto high school","38440":"Sara Aguilar","9120":"sports","9241":"wrestling"}},{"id":100228,"title":"Boys&#8217; soccer falls to Bellarmine in season-ending loss","permalink":"http:\/\/palyvoice.com\/2015\/03\/01\/boys-soccer-falls-to-bellarmine-in-season-ending-loss\/","content":"[caption id=\"attachment_100240\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_1414.jpg\"><img class=\"size-full wp-image-100240\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_1414.jpg\" alt=\"Junior goalkeeper Eli Friedlander dives to stop a Los Gatos High School attempt at a shot. The ball bounces off the post. The Vikings defeated Los Gatos, 2-1, securing first place in the De Anza League.Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> Junior goalkeeper Eli Friedlander dives to stop a Los Gatos High School attempt at a shot. The ball bounced off the post. The Vikings defeated Los Gatos, 2-1, on Feb. 17, securing first place in the De Anza League. Photo by Amy Leung.[\/caption]\r\n\r\nThe Palo Alto High School boys' soccer team (<span style=\"color: #000000;\">13-4-3, 8-2-1)<\/span> lost to Bellarmine College Preparatory (11-4-4, 8-2-3), 2-0, in the Central Coast Section quarterfinals yesterday, bringing its season to a close.\r\n\r\nSenior captain and defender Steven Blatman explained the reason for the loss.\r\n\r\n“We started out strong today [yesterday] but lost some organization as the first half progressed, which ultimately led to the two goals [scored by Bellarmine],” Blatman said. “In the second half, we played well, and overall I’m proud of our performance.”\r\n\r\nDespite yesterday's loss, the Vikings did well in the De Anza league, finishing first place in the league after finishing last four years ago.\r\n\r\n“I feel that we really improved over the years, both in quality of players and general cohesiveness,” Blatman said. “This is definitely the best varsity squad I’ve played with during my four years.\"\r\n\r\nSenior captain and defender Preston Kuppe accredits the success of the season to the chemistry of the team.\r\n\r\n“Our success this season was because we played as a team, both defensively and offensively,” Kuppe said. “We were all on the same page during the game, working toward a common goal.”\r\n\r\nJunior midfielder Cole Tierney agrees, specifying helpful plays and players.\r\n\r\n“A lot of our success came from through balls and crosses from the outside,” Tierney said. “But I think our defense is what kept us in for so long, so I would attribute our success to the back four and [junior goalkeeper] Eli [Friedlander].”\r\n\r\nWith five graduating seniors this year, Tierney holds high hopes for next season.\r\n\r\n“We have 11 seniors next year, which is enough for a whole team,” Tierney said. “Next year, our team will be stronger and have better chemistry than [in] past years.”\r\n\r\nTierney said being with the rest of the team was the best part of the season.\r\n\r\n“We had a lot of fun and yelled at each other a lot,” Tierney said. “But at the end of the day, we all looked out for each other.”","excerpt":"The Palo Alto High School boys' soccer team (13-4-3, 8-2-1) lost to Bellarmine College Preparatory (11-4-4, 8-2-3), 2-0, in the Central Coast Section quarterfinals yesterday in season-ending loss.","date":"2015-03-01 12:19:00","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_1414.jpg","categories":["Sports","Spotlight"],"tags":{"10311":"boys soccer","8568":"CCS","37638":"cole tierney","18382":"loss","8944":"palo alto high school","9703":"preston kuppe","9110":"Soccer","10666":"steven blatman"}},{"id":99865,"title":"English building furniture delayed for months","permalink":"http:\/\/palyvoice.com\/2015\/03\/01\/english-building-furniture-delayed-for-months\/","content":"The Palo Alto High School administration is awaiting the Board of Education's approval of new furniture for the English building, causing a delay of a few months from the <a href=\"http:\/\/palyvoice.com\/2014\/11\/23\/new-library-furniture-temporarily-inhibits-computer-access\/\">original plan to furnish over Winter Break<\/a>.\r\n\r\nAccording to Principal Kim Diorio, the process requires approval from the Board due to district policies and the <a href=\"http:\/\/www.leginfo.ca.gov\/cgi-bin\/displaycode?section=edc&amp;group=60001-61000&amp;file=60510-60511\">Ed Code 60511<\/a> regarding donations and gifts.\r\n\r\n\"We were hoping to have the furniture in over the break, but because of the dollar amount to make the purchase, we had to go up to bid,\" Diorio said. \"What we need to do now is to take the bid to the Board of Education for approval, and then we'll move forward. So it will probably take few more months.\"\r\n\r\n[caption id=\"attachment_100039\" align=\"alignright\" width=\"454\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-2.jpg\"><img class=\"wp-image-100039\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-2.jpg\" alt=\"photo-2\" width=\"454\" height=\"340\" \/><\/a> The current classroom furniture will remain in all classrooms of the 200 building for few more months as the administration and the English Department await for Board approval on the incoming furniture. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nThe Board approval is the final step before ordering and installing the new furniture as the selection process was already completed before Winter Break, according to English teacher Melissa Laptalo.\r\n\r\n\"We met with a designer individually, and she drafted an image based on what we told her about the way we teach and the ideas we had of how we wanted to use the space,\" Laptalo said. \"She then brought the images to us, and we approved them before Winter Break.\"\r\n\r\nLaptalo said she believes that the new furniture, which resembles furniture installed in the Media Arts Center, will be a great improvement to cater to current teaching styles.\r\n\r\n\"In terms of educational research, the furniture we have is bad furniture because it's uncomfortable and limiting,\" Laptalo said. \"The way we teach now is different and doesn't work well with this furniture. A lot of the new furniture at the MAC is more ergonomic, and it's supposed to allow us to be more mobile and fluid.\"\r\n\r\nAccording to Diorio, the 300 and 400 buildings will also receive new furniture in the future along with new carpeting and painting.\r\n\r\n\"This [anonymous] donor also offered kindly to help us with the [furniture for the] 300 building and the 400 building,\" Diorio said. \"Basically all the old buildings would get a refurbishing. New carpet, new paint and new furniture are what we want to do.\"","excerpt":"The administration is awaiting for Board approval of new furnitures for the English building, causing a delay of a few months.","date":"2015-03-01 12:17:44","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-2.jpg","categories":["News","Spotlight"],"tags":{"39708":"200","39706":"300","39707":"400","39560":"anonymous","39705":"approval","8524":"bid","11799":"Board of Education","39709":"carpet","8644":"diorio","25041":"donation","39561":"donor","39704":"ed code","8674":"english","34277":"english building","8690":"facilities","11130":"furniture","33853":"gift","33856":"laptalo","18366":"mac","11127":"media arts center","39710":"paint"}},{"id":100223,"title":"Students address school&#8217;s systemic flaws at student forum","permalink":"http:\/\/palyvoice.com\/2015\/03\/01\/students-address-schools-systemic-flaws-at-student-forum\/","content":"[caption id=\"attachment_100283\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/photo-3.jpg\"><img class=\"wp-image-100283\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/photo-3.jpg\" alt=\"PAUSD Supt. Max McGee gives an opening remark in front of students, staff and parents which totaled less than 25 at the Student Forum at 7:00 p.m. Thursday night in the Media Arts Center.\" width=\"600\" height=\"450\" \/><\/a> PAUSD Supt. Max McGee gives opening remarks in front of students, staff and parents who totaled less than two dozen at the Student Forum at 7 p.m. Thursday night in the Media Arts Center. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nPalo Alto Unified School District administrators hope to cater to students' opinions on several campus and district issues following discussions at a Palo Alto High School student forum on Thursday night in the Media Arts Center.\r\n\r\nPaly's Associated Student Body coordinated with PAUSD Supt. Max McGee and Paly Principal Kim Diorio to provide students with a platform to express their opinions on academic and school climate issues. Around 25 students, staff members and parents attended the forum. Students brought up a wide variety of topics as Diorio and McGee listened, focusing on aspects that need improvement as well as recognizing practices that they believe to be successful.\r\n\r\nJunior Unity Club Vice President Siggi Bengston emphasized the lack of support for mental illnesses as a pressing issue on campus.\r\n\r\n\"I think everyone can agree that mental health is a huge issue at this school,” Bengston said. “I know that many people have gone through various forms of mental disorders, but no one talks about it. … A big issue is that we don't have any guidance on what to do with it.\"\r\n\r\nSenior ASB President Claire Liu expressed her idea that Advisory has the potential to be effective as support for many student issues, including mental health and wellness.\r\n\r\n“Advisory is and can be extremely powerful,” Liu said. “Some advisers make it as powerful as possible … but in a usual Advisory with a group of around 25 students, it’s really hard to talk about non-academic topics with your adviser.”\r\n\r\nStudents pointed to many other specific systemic issues of the school and the district, providing their own ideas in certain circumstances.\r\n\r\n“I find it very stressful to choose my classes,” sophomore Jordan Schilling said. “It’s very hard to choose when all you get is a paragraph on each course in the course book. I think that instead, there should be something like Club Day so that you can learn more about the courses you are taking.”\r\n\r\nSenior Rachel Segars pointed out that the school lacks focus in providing learning for the sake of gaining knowledge, as she has lost motivation to attend classes as a second semester senior.\r\n\r\n[caption id=\"attachment_100226\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-13.jpg\"><img class=\"wp-image-100226\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-13.jpg\" alt=\"photo 1\" width=\"350\" height=\"263\" \/><\/a> (From left to right) Senior Ellen Shuan, Unity Club President Rachel Segars and Vice President Siggi Bengston express their opinions regarding mental health at Paly alongside Assistant Principal Kathleen Laurence. \"We don't have any guidance on how to deal with it [mental health],\" Bengston (third from left) said. \"It's intimidating to say 'I need help' and 'I feel vulnerable.' We need to have more support.\" Photo by Takaaki Sagawa.[\/caption]“One thing I’ve been kind of thinking to myself as a second semester senior is that I literally have n0 motivation to go to some of my classes,” Segars said. “Some of the classes seem like I’m getting credit just to graduate. ... It would be cool to do something like a project individually or meet with a teacher who knows a lot about the field you want to enter and work [together] on how to broaden our knowledge on that.”\r\n\r\nASB Senior President Maya Ben-Efraim addressed the topic of rigor and grade deflation.\r\n\r\n“Something that has come up for me is that compared to friends who go to other schools, I feel that I have to work a lot harder to achieve the same thing on the transcript than those friends,” Ben-Efraim said. “And when you apply to UCs, I think it’s pretty hard to come from Paly because of that challenge in grades.”\r\n\r\nMany students and staff members agreed on the stigma surrounding laning as well as how early the lanes are assigned.\r\n\r\n“I think it's ridiculous that as a sixth grader, your entire career in mathematics is determined,” sophomore Cezanne Lane said. “If you are put in a low lane or if you ever drop a lane, it brings up a lot of judgment. ... There [are] even labels like 'dumb' and 'stupid' math.\"\r\n\r\nAccording to McGee, the topics of a recent student forum at Gunn High School overlapped with Paly’s forum in many areas, allowing him to see that the issues were district-wide.\r\n\r\n“It repeated themes that we heard at Gunn's student forum,” McGee said. “I learned that this is not a Gunn specific issue. … The idea of stress, the importance of focusing on mental health and wellness — it's across the district.”\r\n\r\nMcGee said he believes that although low in attendance, the forum sparked significant conversations on district issues.\r\n\r\n\"I really wish there were more students, but what I really liked about the small number of students is that we had more dialogue,” McGee said. “We really had the opportunity for what I thought were some really meaningful conversations.”","excerpt":"Palo Alto Unified School District administrators hope to cater to students' opinions on several campus and district issues following discussions at a Palo Alto High School student forum on Thursday night in the Media Arts Center.","date":"2015-03-01 12:16:42","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/photo-3.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","29481":"Cezanne lane","14290":"claire liu","39962":"depressions","8644":"diorio","18368":"forum","8771":"homework","39967":"jordan schilling","39965":"learning","18366":"mac","32445":"max mcgee","30858":"maya ben-efraim","37655":"mental health","39963":"policy","9013":"principal","39966":"rebecca segars","39964":"research","9102":"siggi bengston","9129":"student","39961":"student forum","11606":"superintendent"}},{"id":99222,"title":"SatireDay Cartoon","permalink":"http:\/\/palyvoice.com\/2015\/02\/28\/satireday-cartoon\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\"><img class=\"alignright size-full wp-image-99225\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\" alt=\"satireday cartoon\" width=\"600\" height=\"473\" \/><\/a>","excerpt":"Check out the weekly cartoon.","date":"2015-02-28 09:14:51","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg","categories":["Entertainment","Uncategorized"],"tags":{"39025":"cartoon","8953":"paly","39024":"satireday cartoon"}},{"id":99830,"title":"Preview: Girls&#8217; soccer to play M-A in CCS quarterfinals","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/preview-girls-soccer-to-play-m-a-in-ccs-quarterfinals\/","content":"After a first-round  bye, the Palo Alto High School girls' soccer team (9-2-1, 15-2-1), No. 2 seed, will play No. 7 Menlo-Atherton High School (7-4-3, 11-5-4) in the Central Coast Section quarterfinals this Saturday at Paly.\r\n\r\n[caption id=\"attachment_100121\" align=\"alignright\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_4767.jpg\"><img class=\"wp-image-100121 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_4767.jpg\" alt=\"Junior forward Heidi Moesner controls the ball in a game against Gunn on Jan. 5. Paly won (6-0). Photo by Maddy Jones.\" width=\"393\" height=\"261\" \/><\/a> Junior forward Heidi Moeser controls the ball in a game against Gunn on Jan. 5. The Vikings won 6-0. Photo by Maddy Jones.[\/caption]\r\n\r\nAlthough this will be the first time the Vikings take on M-A this season, the teams met in a scrimmage last year that resulted in a Viking loss (2-1).\r\n\r\n\"It was a tough game and a hard battle, so I expect Saturday to be a good game,\" junior forward Heidi Moeser said.\r\n\r\nAssistant coach Eric Seedman said he does not believe the Vikings' loss to M-A last year will affect their play tomorrow.\r\n\r\n\"Each year is a new one, so past results against a specific team are not really relevant,\" Seedman said. \"M-A has a good team. That is our focus.\"\r\n\r\nIn order to prepare for CCS, Seedman says the team has been working on the smaller details of the game.\r\n\r\n\"Things like executing and defending throw-ins, corner kicks, set plays [and] penalty kicks,\" Seedman said. \"We have also done some conditioning and work on defensive clearances. This should all help us get ready for tough competition.\"\r\n\r\nThe Vikings have been playing strongly this season, with only two losses out of the 18 games played. Moeser says the team expects to make it far into the playoffs.\r\n\r\n\"We expect to make it all the way to the finals and win by playing the way we know how to,\" Moeser said.\r\n\r\nThe Vikings will kick off against M-A at noon tomorrow at the Hod Ray Field.\r\n\r\n&nbsp;","excerpt":"After a bye, the Palo Alto High School girls' soccer team (9-2-1, 15-2-1) will play Menlo-Atherton High School (7-4-3, 11-5-4) in the Central Coast Section quarterfinals this Saturday at Paly.","date":"2015-02-27 21:22:29","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_4767.jpg","categories":["Sports"],"tags":{"10199":"eric seedman","8734":"girls","10198":"girls soccer","39958":"heidi moeser","8944":"palo alto high school","39957":"seedman","9110":"Soccer"}},{"id":100036,"title":"A change in lineup: New coach brings fresh spirit to baseball team","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/a-change-in-lineup-new-coach-brings-fresh-spirit-to-baseball-team\/","content":"[caption id=\"attachment_100037\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_9918.jpg\"><img class=\"size-full wp-image-100037\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_9918.jpg\" alt=\"Junior catcher Lawrence Han goes up to bat against St. Ignatius High School. Paly defeated St. Ignatius 6-3. Photo by Amy Leung.\" width=\"600\" height=\"450\" \/><\/a> Junior catcher Lawrence Han goes up to bat against St. Ignatius High School. Paly defeated St. Ignatius 6-3 in a non-conference game. Photo by Amy Leung.[\/caption]\r\n\r\nThe Palo Alto High School baseball team (1-0, 0-0) looks forward to a new season with a new coach, holding high hopes despite graduating nine seniors as it takes on rival Gunn High School at noon tomorrow at home.\r\n\r\nPete Fukuhara is this season's new head coach, taking over for Erick Raich, who coached for five seasons.\r\n\r\n“The new coach is a little more laid back,” junior third baseman Shaun Pike said. “It makes the sport a little bit more fun, and it makes people want to play for him.”\r\n\r\nFukuhara stresses the importance of camaraderie on the team over setting a concrete goal of winning a designated number of games.\r\n\r\n“I just want to be one family — the JV [junior varsity] program to the varsity program,” Fukuhara said. “I want to play the game the right way [with] a lot of hustle and just being one family together.”\r\n\r\nA key difference this year is the graduation of nine seniors.\r\n\r\n“We lost Jack Cleasby and Danny Erlich,” junior catcher Lawrence Han said. “Jack [Cleasby] was a big bat. He provided a lot of offense.”\r\n\r\nDespite losing firepower, Han believes that winning league is a viable goal.\r\n\r\n“It [the loss of seniors] hasn’t affected us nearly as much as I had anticipated as we’ve had people step up to fill the places that we lost,” Han said. “I’d say winning league is the team goal.”\r\n\r\nWhen it comes to key players, Fukuhara has a similar philosophy of communal strength as he does for the goals of the team.\r\n\r\n“Our [senior] center fielder Phil Lewis has been fantastic, [sophomore] Ben Cleasby stepped up [and] we’ve had [senior] Isaac [Kasevich] step up on the mound,” Fukuhara said. “Hopefully it’s a shared role — there’s a different star [in] every game.”\r\n\r\nAs the team looks to its next game, Fukuhara approaches it with a relaxed mindset.\r\n\r\n“We’re just going to come out prepared to play the game of baseball,” Fukuhara said. “Just play hard and hope that we come out on top. That’s all you can do.”\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School baseball team (1-0, 0-0) looks forward to a new season with a new coach, holding high hopes despite graduating nine seniors as it takes on rival Gunn High School at noon tomorrow at home.","date":"2015-02-27 20:31:55","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_9918.jpg","categories":["Sports"],"tags":{"8410":"Baseball","17780":"boys baseball","12358":"coach","8912":"new","8944":"palo alto high school","9012":"preview","39703":"season"}},{"id":100136,"title":"Slideshow: Former U.S. Secretary of Energy speaks on energy use, climate change","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/slideshow-former-u-s-secretary-of-energy-speaks-on-energy-use-climate-change\/","content":"Former U.S. Secretary of Energy Steven Chu spoke to students, parents and community members Wednesday night in the Palo Alto High School Media Arts Center during the first installment of the \"Great Minds at Campus\" speaker series. Chu's slideshow presentation, which featured charts, graphs and jokes, covered various topics including climate change, the future of energy and his work in politics and academia.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AIAAAWccGOnX\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Former U.S. Secretary of Energy Stephen Chu spoke to Palo Alto High School parents and students in the Palo Alto High School Media Arts Center during the first installment of the \"Great Minds at Campus\" speaker series Wednesday night.","date":"2015-02-27 16:02:36","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/featuredimage-steven.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"39937":"change","14850":"climate","39936":"energy","39938":"EV","39939":"global warming","39935":"great minds","18366":"mac","11127":"media arts center","8944":"palo alto high school","8953":"paly","9083":"secretary","9107":"slideshow","38959":"speaker series","38960":"steven chu","9129":"student","12702":"wojcicki"}},{"id":100182,"title":"Deadline for dropping a class is Thursday, March 12","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/deadline-for-dropping-a-class-is-thursday-march-12\/","content":"","excerpt":"","date":"2015-02-27 15:27:25","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8636":"deadline","39955":"drop class"}},{"id":99912,"title":"ASB releases election packets","permalink":"http:\/\/palyvoice.com\/2015\/02\/27\/asb-releases-election-packets\/","content":"Election packets for students interested in running for an elected Palo Alto High School Associated Student Body position are available in front of the Student Activities Office and on <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/\">Paly ASB's website<\/a>.\r\n\r\nAccording to Student Activities Director Matt Hall, there have been some minor changes in the application packets and in the required duties of elected officers.\r\n\r\n\"The campaign budget [for individual candidates] changed from $40 to $20, so we have more equity,\" Hall said. \"We encourage students to use the Student Activities Office's materials for making posters and other campaign materials.\"\r\n\r\n[caption id=\"attachment_100085\" align=\"alignright\" width=\"299\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.37.29-PM.png\"><img class=\"wp-image-100085 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.37.29-PM.png\" alt=\"ASB election packets can be found in front of the SAO, and must be submitted by Wednesday, March 11. Photo by Dhara Yu. \" width=\"299\" height=\"326\" \/><\/a> ASB election packets can be found in front of the SAO and must be submitted by March 11. Photo by Dhara Yu.[\/caption]\r\n\r\nIn past years, candidates have spent money on poster materials and food to distribute to voters. They will be expected to fill out a financial disclosure form so that ASB can ensure that they do not spend more than the allotted $20.\r\n\r\nIn addition to the budget cut, ASB elected officers will now be required to attend Camp Unity (formerly known as \"Camp Everytown\"), an annual four-day Paly program intended to promote awareness and acceptance among students.\r\n\r\n\"We want officers to be connected with the student body and have the opportunity to hear everyone's stories,\" Hall said.\r\n\r\nBeyond that, all facets of the ASB election process will remain the same as previous years.\r\n\r\nApplications for candidates will be due on March 11, and the elections will take place online from March 25 to March 27.\r\n\r\n&nbsp;","excerpt":"Election packets for students interested in running for an elected Palo Alto High School Associated Student Body position are now available in front of the Student Activities Office and on Paly ASB's website.","date":"2015-02-27 15:01:25","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.37.29-PM.png","categories":["News"],"tags":{"8496":"ASB","8497":"ASB elections","8499":"Associated Student Body","8667":"elections","8873":"Matt Hall","8944":"palo alto high school"}}]