[{"id":102903,"title":"Palo Alto opens nation&#8217;s first all-inclusive park","permalink":"http:\/\/palyvoice.com\/2015\/05\/04\/palo-alto-opens-nations-first-all-inclusive-park\/","content":"As children, most people don't thinks twice about their abilities to run around on play structures or glide through the air on swings. Nevertheless, for children with disabilities, this is often an impossibility.  An ideal summer full of seesaws and slides is a far-fetched and an impractical dream.\r\n\r\n[caption id=\"attachment_102942\" align=\"alignright\" width=\"319\"]<img class=\"wp-image-102942\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11128435_840577942684962_475924628_n1.jpg\" alt=\"11128435_840577942684962_475924628_n\" width=\"319\" height=\"239\" \/> The entrance to the Magical Bridge playground \"where everyone can play!\" The playground opened April 18 at Mitchell Park in Palo Alto, drawing in a hundreds of people. Photo by Emilia Diaz-Magaloni.[\/caption]\r\n\r\nHowever, this month, Palo Alto introduced a revolutionary new park completely inclusive to all individuals. The Magical Bridge Playground drew a large crowd during its grand opening on April 18 at Mitchell Park and included performances by differently abled children on the community stage.\r\n\r\nAccording to Jill Asher, co-creator of the playground, outdoor play is an essential way for young children to develop gross motor skills and to form friendships.\r\n\r\nThe idea began when Olenka Villarreal, a Palo Alto mom, could not take her child with special needs to any of the 34 parks in Palo Alto. Instead, Villarreal was forced to spend $150 an hour on a round-trip to San Jose so that her daughter could simply swing on a special swing set, Asher said.\r\n\r\nDespite Villarreal's complaints to the City of Palo Alto regarding the lack of inclusivity in the city parks, all city parks were compliant with the requirements of the <a href=\"http:\/\/www.ada.gov\/\">Americans with Disabilities Act.<\/a> An ADA-compliant park gives differently abled children the ability to enter the park, but not necessarily the ability to play in it. Villarreal soon decided to make matters into her own hands.\r\n\r\nAfter six years of extensive planning and nine months of building, Villarreal utilized $4 million raised through fundraising and the $300,000 given by the City of Palo Alto to finally turn her dream into a reality.\r\n\r\n“It truly is a playground for everybody regardless of physical and cognitive disabilities or abilities,” Asher said.\r\n\r\nAccording to Nick Peterson, head contractor of the project, the park is separated into seven different zones: the kindness corner, picnic\/playhouse zone, slide zone, music zone, swinging\/sway zone, spinning zone and tot zone.\r\n\r\nAccording to Peterson, the inclusion experts and contractors have been working hard to make sure every structure and surface is inclusive to all cognitive and physical disabilities. For example, every inch of the park is covered in a special surface that is wheelchair-friendly, making it easier for all children to get around the park.\r\n\r\n[caption id=\"attachment_102943\" align=\"alignright\" width=\"215\"]<img class=\"wp-image-102943\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11185441_840578059351617_467290310_n.jpg\" alt=\"11185441_840578059351617_467290310_n\" width=\"215\" height=\"287\" \/> This is one of the 'magical bridges' in the Magical Bridge park. These bridges help children with physical disabilities reach elevated heights in the park. Photo by Emilia Diaz-Magaloni[\/caption]\r\n\r\nBoth audio and visual tools are integrated into all seven zones alongside the different slides and structures to help children with disabilities.\r\n\r\n“Its important to include a lot of audio and visual for all the abilities and disabilities that kids have,” Peterson said.\r\n\r\nCo-founder Asher hopes that everyone, from children to teens, will enjoy the Magical Bridge Playground.\r\n\r\n“We hope that teenagers from Palo Alto High School will come and have discussions about being kind and compassionate and a good friend,” Asher said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Magical-Bridge-Park-1.m4a\"][\/audio]\r\n\r\n<em>Audio: Children perform \"part of your world\" during the grand opening of the Magical Bridge Playground<\/em>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Untitled-Infographic-3.jpeg\"><img class=\"alignnone  wp-image-103421\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Untitled-Infographic-3.jpeg\" alt=\"Magical Bridge tour \" width=\"1215\" height=\"2111\" \/><\/a>","excerpt":"As children, most people don&#8217;t thinks twice about their abilities to run around on play structures or glide through the air on swings. Nevertheless, for children <a href=\"http:\/\/palyvoice.com\/2015\/05\/04\/palo-alto-opens-nations-first-all-inclusive-park\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-04 15:36:08","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/2x4w8K9D_WGksIHBlL86BSmgGRcAUcUd5DdYw5VEr_0.png","categories":["News","Spotlight"],"tags":{"42424":"All inclusive","42425":"disability","42423":"Magical bridge park","8939":"palo alto","33857":"park"}},{"id":103383,"title":"Preview: Girls&#8217; lacrosse to face Mountain View for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/04\/preview-girls-lacrosse-to-face-mountain-view-for-senior-night\/","content":"[caption id=\"attachment_71673\" align=\"alignnone\" width=\"700\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/216.jpg\"><img class=\"wp-image-71673\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/216.jpg\" alt=\"Junior midfielder Paige Bara sprints down the field with the ball. Photo by Maddy Jones.\" width=\"700\" height=\"466\" \/><\/a> Viking midfielder Paige Bara sprints downfield with the ball. Bara is one of 10 seniors to be honored tomorrow during Senior Night festivities. Photo by Maddy Jones.[\/caption]\r\n\r\n<span style=\"color: #000000;\">The Palo Alto High School girls’ lacrosse team (15-1, 11-0) will play the Mountain View High School Spartans (7-12, 5-8) at 7 p.m. tomorrow at the Paly lacrosse field. T<\/span>here is very little at stake here for the Vikings who are playoff-bound.\r\n\r\n<span style=\"color: #000000;\">As the last home game of the season, there is a Senior Night celebration preceding the game at 6:45 p.m. The senior players will be honored for their hard work on the team throughout the years. <\/span>\r\n\r\nJunior Meredith Kinnaman looks forward to the game. As starting goalie, Kinnaman is a vital component of the team.\r\n\r\n\"It's our last league game as a team, so it's really our chance to finish out the season strong,\" Kinnaman said. \"I think if we play our game and play together, we have a pretty good shot of winning.\"\r\n\r\nKinnaman emphasizes the difficulty of playing on Senior Night.\r\n\r\n\"There are always a lot of emotions on the field, because this is the last time that we will probably all play as a team,\" Kinnaman said. \"It's sad, but it's exciting to see what each one of them will do in the future.\"\r\n\r\nShe notes that this group of seniors has brought a lot of both leadership and skill to the team.\r\n\r\n\"Since there are 10 of them, we will definitely miss them since they have had such a large impact on the team on and off the field.\"\r\n\r\nThe Viking senior girls who are graduating include: Allie Peery, Amalia Roth, Liana Pickrell, Paige Bara, Claire Chevallier, Lauren Gargiulo, Lisa Rogge, Megan Valencia, Paige Anderson, Sarah McDonnell","excerpt":"The Paly girls’ lacrosse team (15-1, 11-0) will play Mountain View High School Spartans (7-12, 5-8) at 7 p.m. tomorrow at the Paly lacrosse field for Senior Night. ","date":"2015-05-04 14:32:13","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/216.jpg","categories":["Sports"],"tags":{"12854":"girls lax","8736":"girls' lacrosse","8836":"Lacrosse","12016":"lax","43332":"meredith kinnaman","29989":"mountain view","9087":"Senior Night"}},{"id":102487,"title":"Students await results of international math competition","permalink":"http:\/\/palyvoice.com\/2015\/05\/04\/students-await-results-of-international-math-competition\/","content":"A team of four Palo Alto High School juniors is awaiting its scores after completing a solution for the International Mathematical Modeling Challenge contest in late April as representatives of the United States.\r\n\r\n[caption id=\"attachment_103405\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_90951.jpg\"><img class=\"wp-image-103405\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_90951.jpg\" alt=\"Palo Alto High School teacher Radu Toma and juniors Allison Zhang, Kathryn Li, Eric Foster and Andrew Lee (left to right) pose in their Advanced Placement Calculus BC class. The team wrote up its solution for the International Mathematical Modeling Challenge competition from April 19 to April 23. Contest results will be out in June. Photo by Lizzie Chun.\" width=\"400\" height=\"267\" \/><\/a> Palo Alto High School teacher Radu Toma and juniors Allison Zhang, Kathryn Li, Eric Foster and Andrew Lee (left to right) pose in their Advanced Placement Calculus BC class. The team wrote up its solution for the International Mathematical Modeling Challenge competition from April 19 to April 23. Toma served as the team's adviser. Photo by Lizzie Chun.[\/caption]\r\n\r\nJuniors Eric Foster, Andrew Lee, Kathryn Li and Allison Zhang had to solve a real world application problem in a five-day window from mid-April to mid-May. The team submitted its 20 page-long solution at the end of the five days.\r\n\r\nAccording to the <a href=\"http:\/\/immchallenge.com\/Pages\/About.html\" target=\"_blank\">IMMC website<\/a>, the contest promotes the idea that students and teachers need to \"experience the power of mathematics to help better understand, analyze and solve real world problems outside of mathematics itself — and to do so in realistic contexts.\"\r\n\r\nAfter receiving the top score in the nation for its 33 page-long solution at a national mathematical modeling contest earlier this year, the team <a href=\"http:\/\/palyvoice.com\/2015\/02\/11\/paly-juniors-to-compete-in-international-math-contest\/\" target=\"_blank\">was selected to represent the U.S.<\/a> at the international level. Teams from eight other countries are also participating in the IMMC.\r\n\r\nFoster noted that the team's experience with the national High School Mathematical Contest in Modeling competition improved its efficiency for the IMMC.\r\n\r\n\"All of us brought something different to the table for the IMMC,\" Foster said. \"Since the HiMCM, ... we learned how to better put those strengths and weaknesses to work when we were writing. Instead of having everyone do 25 percent of everything, we specialized a little more, and we saw how much that can help when you're trying to do something as a team.\"\r\n\r\nLi said that the international aspect of the IMMC served as motivation for the team.\r\n\r\n\"The fact that this was an international competition definitely pushed us to produce a more complete report,\" Li said. \"There were sections in our previous paper that were hastily put together, and since we had a longer work period, we tried to flesh out our ideas as much as possible within the 20-page limit.\"\r\n\r\nLi emphasized that the competition tested more than the team's ability to solve a math problem.\r\n\r\n\"As much as this was a math competition, it was also a test to see how well you could explain your ideas,\" Li said. \"I feel that my expository writing skills have also improved as a result of this competition.\"\r\n\r\nThe three possible levels of recognition for the competition in ascending order are Honorable Mention, Meritorious and Outstanding. Teams who receive Outstanding awards will have their solutions published. While Foster says the team hopes to do well, he is happy to have already made it this far.\r\n\r\n\"Since the IMMC is completely international and we're literally competing against the entire world, our expectations aren't especially high, but just being ranked next to teams from around the world – even if our names are below everyone else's – is really exciting,\" Foster said. \"It would be really exciting if they rank our work as Outstanding, but even if we just get Honorable Mention, it's enough just to have gotten here, and none of us would be too disappointed.\"\r\n\r\nThe results of the competition will be released in June, according to the <a href=\"http:\/\/immchallenge.com\/Pages\/Rules.html\" target=\"_blank\">IMMC website<\/a>.","excerpt":"A team of four Palo Alto High School juniors is awaiting its scores after completing a solution for the International Mathematical Modeling Challenge contest in late April as representatives of the United States.","date":"2015-05-04 14:26:28","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_90951.jpg","categories":["News"],"tags":{"42265":"allison zhang","39379":"andrew lee","42269":"bc calc","38268":"bc calculus","12848":"competition","10046":"contest","42266":"eric foster","42907":"immc","42268":"international mathematical modeling competition","42267":"kathryn li","8871":"math","8944":"palo alto high school","8953":"paly","9042":"representatives","42270":"united states"}},{"id":103176,"title":"Freshman wins top award at golf tourney","permalink":"http:\/\/palyvoice.com\/2015\/05\/03\/freshman-wins-top-award-at-golf-tourney\/","content":"[caption id=\"attachment_103337\" align=\"alignright\" width=\"380\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/image1.png\"><img class=\"wp-image-103337\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/image1.png\" alt=\"Freshman ahmed ali lines up a putt. Ali had the best individual score of the SCVAL tournament, shooting five under. Photo courtesy of Ahmed Ali\" width=\"380\" height=\"253\" \/><\/a> Freshman Ahmed Ali lines up a putt. Ali had the best individual score of the SCVAL tournament, shooting five under. Photo courtesy of Ahmed Ali.[\/caption]\r\n\r\nA Palo Alto High School freshman won the League Champion award for the best individual golf score at the Santa Clara Valley Athletic League tournament Tuesday at the Santa Teresa Golf Club.\r\n\r\nAhmed Ali, who shot five strokes under par for a score of 66 at the SCVAL tournament, also won the top individual award for his performance in the regular league season, leading the league with an average score of 35.2 for 9 holes, according to coach Doyle Knight.\r\n\r\n\"Ahmed is an outstanding player,\" Knight said. \"He is not extremely long off the tee but is accurate down the middle. His hybrids and long irons are straight and accurate and he has an outstanding short game, [both] chipping and putting.\"\r\n\r\nAccording to Ali, the team's overall success helped him appreciate the individual award even more.\r\n\r\n\"I really enjoyed it [Ali's performance on Tuesday],\" Ali said. \"I played well and so did the team, which made it really fun. It is one of the lowest scores as a team in high school that I've ever seen. The team is really coming together at the right time and I can't wait for CCS [Central Coast Sectionals].\"\r\n\r\nSenior captain John Knowles expressed positive sentiments towards the addition of Ali this year.\r\n\r\n\"Ahmed has been an excellent addition to the team,\" Knowles said. \"As a freshman, not only has he stepped in and played our number one, but he has fit in well with the team. He's just a great guy to be around in general, whether it's at practice, during a van ride or playing in a match.\"\r\n\r\nAli's tournament-best score helped Paly claim first place overall at the SCVAL tournament. His and the team's next challenge will be at the CCS tournament, where the Paly golf team must finish top three in the first round to qualify for the second round.  The first round will be 8 a.m. Wednesday in Carmel-by-the-Sea at the Rancho Canada Golf Club.","excerpt":"A Palo Alto High School freshman won the League Champion award for the best individual golf score at the Santa Clara Valley Athletic League tournament Tuesday at the Santa Teresa Golf Club.","date":"2015-05-03 22:06:45","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/image1.png","categories":["Golf","Sports"],"tags":{"41552":"ahmed ali","40009":"boys' golf","30253":"doyle knight","8738":"Golf","14526":"john knowles","43321":"league champion","43330":"palo alto high school golf","14521":"paly golf","9078":"scval","43322":"sportz"}},{"id":103158,"title":"Measure A in five minutes or less","permalink":"http:\/\/palyvoice.com\/2015\/05\/03\/measure-a-in-five-minutes-or-less\/","content":"<em style=\"color: #000000;\">Editor’s Note: The following story was corrected May 4 to correct where the funding for Measure A will go.<\/em>\r\n\r\nThe students of Palo Alto High School have an undeniably wide range of resources available to them on a daily basis, ranging from technological equipment such as iPads and laptops, to staff members who meet one-on-one with students to ensure that they receive the academic and emotional support they need. What the Paly community may not always take the time to consider, however, is where the funding to provide these readily available resources comes from. On May 5, voters of the Palo Alto Unified School District will determine the fate of Measure A, a raise in parcel tax that would increase funding for the Palo Alto education system.\r\n\r\nThe Paly Voice presents the Measure A controversy in five minutes or less.\r\n\r\n<b>What is the parcel tax?<\/b>\r\n\r\nA parcel tax is a tax assessed against each unit or “parcel” of taxable land in a district. Palo Alto’s parcel tax is on a six-year cycle designed to ensure that the community is supporting the Palo Alto Unified School District’s current programs, goals for class size reduction and staff salaries. According to the school board's <a href=\"http:\/\/pausd.org\/community\/MeasureA\/downloads\/2015ParcelTaxRenewalResolution_012715.pdf\">2015 Parcel Tax Renewal Resolution<\/a>, the last parcel tax, passed on May 4, 2010, was an assessment of $589 per parcel with an annual two percent escalation. In January, the PAUSD school board decided to add Measure A, which will increase the current parcel tax to $758 per parcel, on a special May ballot.\r\n\r\n<b>What are the issues at stake?<\/b>\r\n\r\nThe district’s financial stability will be impacted by voters’ decision on the proposed increase of parcel tax. Supporters of the $120 increase claim that PAUSD needs the extra money because state and local governments cannot provide sufficient unrestricted funding.\r\n\r\nAccording to a poll conducted by the school board, 79 percent of voters felt that the most important use of the potential revenue produced from the parcel tax is “adding support staff to help at-risk students who are struggling with the basics.”\r\n\r\n<b>Why are people divided on this issue?<\/b>\r\n\r\nThe high tax vs. low tax issue is not a new point of political and economic contention. However, this time, Measure A is in jeopardy after the school board made certain decisions to reduce student stress, which faced great scrutiny from the public. A <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/04\/24\/battle-over-measure-a-heats-up\">Palo Alto Online article<\/a> cited parents who voted against the measure in hopes of sending a dissatisfied message to the district and school administration, as they believe there have not been sufficient fiscal resources spent ensuring stable mental health amongst students. They disagree with the idea of pouring more money into what they argue is a failing system. Supporters of the tax counter this argument by claiming that there is no way emotional health initiatives will strengthen without additional funding.\r\n\r\nIn addition, opponents of Measure A may include the demographic of citizens of Palo Alto who do not have students enrolled in the education system, who would not directly benefit from the increase in parcel tax revenue.\r\n\r\n<b>How do you vote?<\/b>\r\n\r\nBallots can be returned by mail using a purple postage-paid return envelope included in the ballot packet. The registrar encourages voters to return their ballots as soon as possible, so that there is enough time to receive all eligible ballots by Election Day. Ballots that are returned in-person must be received by 8 p.m. on May 5. Ballots returned by mail must be postmarked on or before Election Day and must be received by Friday, May 8 (three days after the election).","excerpt":"On May 5, voters of the Palo Alto Unified School District will determine the fate of Measure A, a raise in parcel tax that would increase funding for the Palo Alto education system. The Paly Voice summarizes the controversy at hand and presents them in five minutes or less.","date":"2015-05-03 19:07:35","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MeasureA.jpg","categories":["News","Spotlight"],"tags":{"8647":"district","43327":"funding","43329":"may","42896":"measure A","8950":"Palo Alto Unified School District","42898":"parcel","42897":"parcel tax","8977":"PAUSD","42899":"tax","9218":"vote","9219":"voting"}},{"id":103305,"title":"Boys&#8217; track holds heads high after loss to Lynbrook","permalink":"http:\/\/palyvoice.com\/2015\/05\/02\/boys-track-holds-heads-high-after-loss-to-lynbrook\/","content":"The Palo Alto High School boys’ track and field team is looking forward to the De Anza League meets next week after a close loss against Lynbrook High School on Thursday.\r\n\r\n[caption id=\"attachment_103307\" align=\"alignnone\" width=\"622\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-02-at-1.47.20-PM.png\"><img class=\"size-full wp-image-103307\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-02-at-1.47.20-PM.png\" alt=\"Junior hurdlers Connor Ng and Tak Nishi try to catch up to Lynbrook in the 110-meter high hurdles at Thursday's meet.  Photo by Malcolm Slaney. \" width=\"622\" height=\"411\" \/><\/a> Junior hurdlers Connor Ng and Tak Nishi try to catch up to Lynbrook in the 110-meter high hurdles at Thursday's meet. Photo by Malcolm Slaney.[\/caption]\r\n\r\nAgainst Lynbrook, the varsity boys (4-2) fell short in the 4x400 meter relay, the final, and arguably most exciting event of the meet.\r\n\r\nThe Vikings started out strong with the boys varsity team winning the 4x100 meter relay and sophomore Kent Slaney winning the 1600-meter race, but things started to take a turn for the worse when Lynbrook swept both the 110-meter high hurdles and the 300-meter low hurdle races.\r\n\r\nAccording to former boys sprinter Tak Nishi, who was added to the hurdles team just two weeks before the end of the season to try to get some points in the hurdle events, the team will only get better with time and practice.\r\n\r\n“We have a really good coach who is new this year and even though I haven't been in hurdles for very long from what I've seen, we just don't have the numbers of boys that would allow us to perform well,” Nishi said. “In addition, we have only one varsity hurdler who has been there the entire season so our hurdles team is really very young.”\r\n\r\nPlacing in the hurdle events will be crucial for next year's team success, which will compliment the strong frontline of athletes that have been dominating the varsity scene in sprints and distance races including juniors Dami Bolarinwa, Eli Givens, and sophomore Kent Slaney.\r\n\r\nIn Thursday’s meet against Lynbrook, Slaney showed his impressive abilities in his win in the 1600-meter race, when he opened a three-second gap in the last 150 meters of the race. Slaney finished with a 4:37.48 time.\r\n\r\nYoung talent such as sophomore Thorin Haussecker, who earned a personal record in the 200- meter race and is ranked 13th in the De Anza League, is looking forward to the opportunity of running varsity next season.\r\n\r\n“I'm looking forward to racing varsity next year especially in the 4x100 meter race with some of the other great sprinters and I'm going to do a lot of training in the off season to make sure I'm in shape once next year’s season begins,” Haussecker said.\r\n\r\nDespite the regular season being over and the loss to Lynbrook, the Vikings have their heads held high and many are looking forward to De Anza League trials at 3:15 p.m. next Tuesday, May 5 at Lynbrook High School. The Vikings, along with the other schools in DAL will send their three best athletes for each event to the meet for a chance to earn a qualifying spot in the De Anza League finals, which will occur on Thursday, May 7, again at Lynbrook.","excerpt":"The Palo Alto High School boys’ track and field team is looking forward to the De Anza League meets next week after a close loss against Lynbrook High School on Thursday. ","date":"2015-05-02 13:54:16","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-02-at-1.47.20-PM.png","categories":["Sports","Uncategorized"],"tags":[]},{"id":103072,"title":"Juniors win inaugural Hogwarts Week","permalink":"http:\/\/palyvoice.com\/2015\/05\/01\/juniors-win-inaugural-hogwarts-week\/","content":"Palo Alto High School's <a href=\"http:\/\/palyvoice.com\/2015\/04\/27\/asb-is-sirius-about-hogwarts-week\/\" target=\"_blank\">first Hogwarts Week<\/a> ended with a junior victory today when the juniors clinched the<a href=\"http:\/\/palyvoice.com\/2015\/04\/30\/day-two-of-hogwarts-week\/\" target=\"_blank\"> lead from the sophomores<\/a> after Friday's final Quidditch match on Paly's lacrosse field, according to Paly's Associated Student Body.\r\n\r\nThe juniors beat the seniors 50-20 during today's finals after catching the Snitch, which gave them a 30 point bonus. The juniors ended with 980 points, and the seniors came in second place with 920 points. The sophomores finished 20 points short of the seniors, while the freshmen ended with 780 points, according to Paly's Associated Student Body.\r\n\r\n[caption id=\"attachment_103191\" align=\"alignleft\" width=\"309\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11201270_1090456807637782_1339450122_o.jpg\"><img class=\"wp-image-103191\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11201270_1090456807637782_1339450122_o.jpg\" alt=\"Junior Anant Marur runs with a dodgeball during the Quidditch finals. The juinors beat the seniors and took first place in the activity. Photo by George Lu.\" width=\"309\" height=\"206\" \/><\/a> Junior Anant Marur runs with a dodgeball during the Quidditch finals. The juniors beat the seniors and took first place in the activity. Photo by George Lu.[\/caption]\r\n\r\nThroughout the week, students participated in various Harry Potter-themed activities. Paly ASB assigned a Hogwarts house to each class with seniors as Gryffindor, juniors as Slytherin, sophomores as Ravenclaw and freshmen as Hufflepuff. Students generally enjoyed the new Hogwarts Week and its  events.\r\n\r\n\"Hogwarts Week was super fun,\" senior Sonty Visuthikraisee said. \"I especially liked the first day where we got to dress up and show off all our Hogwarts spirit.\"\r\n\r\nAccording to senior Maeve Lavelle, the activities also provided an opportunity for classes to bond.\r\n\r\n\"I think that Hogwarts Week was a great way for each class to bond before the end of the year,\" Lavelle said.\r\n\r\nHogwarts week was also successful from an ASB standpoint in terms of student participation in all events.\r\n\r\n\"I think that Hogwarts week went really, really well,\" Sophomore Vice President Anmol Nagar said. \"So many people were able to be involved in the Triwizard Tournament, trivia and Quidditch games.\"\r\n\r\nAmong the three events, the Quidditch event, held during Lunch of Thursday and Friday, was the most popular.\r\n\r\nSenior Anna Dukovic enjoyed participating in the new activity.\r\n\r\n\"It was fun to try something new [Quidditch] and do something with our class again outside of Spirit Week,\" Dukovic said.\r\n\r\nASB is sponsoring another event during the week of May 18 called Sports Fest, which will replace the annual powderpuff football.\r\n\r\n\"Hogwarts Week is actually not a replacement for powderpuff,\" Nagar said. \"Our first annual spring Sports Fest will take place in a couple weeks. Sports Fest involves the sporting aspect of powderpuff in a series of even more games, including flag football, throughout the week.\"\r\n\r\nAccording to Nagar, ASB looks to continue these spring events in future years.\r\n\r\n\"Hogwarts Week and Sports Fest are both things we hope to continue as Paly traditions,\" Nagar said.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School's first Hogwarts Week ended with a junior victory today when the juniors clinched the lead from the sophomores after Friday's final Quidditch match on Paly's lacrosse field.","date":"2015-05-01 18:59:07","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11201270_1090456807637782_1339450122_o.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","12848":"competition","17499":"FIRST","42206":"gryffindor","42205":"hogwarts week","42209":"hufflepuff","42916":"new event","8953":"paly","42693":"quidditch","42208":"ravenclaw","42207":"slytherin"}},{"id":103094,"title":"Update: Softball looks to finish strong","permalink":"http:\/\/palyvoice.com\/2015\/05\/01\/update-softball-looks-to-finish-strong\/","content":"[caption id=\"attachment_103189\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MG_3507.jpg\"><img class=\"size-full wp-image-103189\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MG_3507.jpg\" alt=\"Softball convenes in between innings against Santa Clara on 3\/20\/15.\" width=\"800\" height=\"533\" \/><\/a> The Paly softball team converses during a 6-1 loss to Santa Clara High School on March 20. The Vikings are currently sitting in fourth place in the El Camino League standings with five regular season games left to play. Photo by George Lu.[\/caption]\r\n\r\nMidway through the season, the Palo Alto High School softball team (14-8, 4-4) is looking to finish the rest of the season on a high note after a mostly successful start.\r\n\r\nSenior captain Casey Glassford is satisfied with how the season has gone up until this point.\r\n\r\n\"The season [has] been going well,\" Glassford said. \"Our record is good and we've been playing really well. Our offense is great right now.\"\r\n\r\nFreshman Sophie Frick agreed with Glassford's assessment and attributes much of the success to teamwork.\r\n\r\n\"In every game, we have never given up and we give it all until the last pitch,\" Frick said. \"We work extremely well as a team and it has definitely paid off this season.\"\r\n\r\nWhile there have been numerous positives surrounding girls' softball this season, Glassford and Frick both agreed that there is always room for improvement.\r\n\r\n\"For the rest of the season, we just need to keep tightening up our defense,\" Glassford said.\r\n\r\n\"Working on the little details can make a big difference when you play such as focusing on the ball before anything else, and footwork on batting\/fielding,\" Frick added.\r\n\r\nThe girls' next game is at 4 p.m. today at Monta Vista High School.","excerpt":"Players from Palo Alto High School's softball team reflect on how the season has been going and comment on the areas where they can improve.","date":"2015-05-01 14:34:14","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/MG_3507.jpg","categories":["Sports"],"tags":[]},{"id":103129,"title":"Speech member triumphs at State tournament","permalink":"http:\/\/palyvoice.com\/2015\/05\/01\/speech-member-triumphs-at-state-tournament\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_100363\" align=\"alignnone\" width=\"372\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-01-at-10.31.18-PM.png\"><img class=\" wp-image-100363\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-01-at-10.31.18-PM.png\" alt=\"Junior Jenny Xin shows off her trophy won at the Coast Forensic League Satellite tournament last week. Her victory at the tournament makes her first ever Paly student to qualify for states. Photo courtesy of Gabi Rossner.\" width=\"372\" height=\"438\" \/><\/a> Junior Jenny Xin shows off her trophy won at the Coast Forensic League Satellite tournament last month. Her victory at the tournament makes her first ever Paly student to qualify for states. Photo by Gabi Rossner[\/caption]\r\n\r\nA Palo Alto High School Speech and Debate team member is celebrating her successes at the California High School Speech Association State tournament earlier this month.\r\n\r\nJunior Jenny Xin qualified for semifinals in the Original Prose and Poetry event. Out of a pool of over 60 competitors, Xin captured 15th in the State.\r\n\r\n“The amount of talent in each of the rounds I competed in was terrifyingly high, and the reactions of people from different areas to different OPPs varied each time, which was really interesting for me, especially since I have a stand-up comedy kind of piece,\" Xin said.\r\n\r\nSpeech and Debate director Jennie Savage expressed her pride for Xin.\r\n\r\n“Anyone from Paly's Speech team earning a spot at the State Championship hasn't happened in over a decade, so it was extremely exciting for Jenny to win districts and qualify to States and even more gratifying that she placed so high once she got there,” Savage said.\r\n\r\nAccording to Xin, one of the highlights of States was meeting new people.\r\n\r\n“Up until now, I've been competing in tournaments in the local league (Coast Forensics League), but qualifying to states meant that I and six other OPPers from CFL got to meet people from every district in California,” Xin said.\r\n\r\nXin said that attending States was one of the best experiences she has had as a speech member.\r\n\r\n“States was an experience I've never had before,” Xin said. “Just having different audiences and different reactions was fantastic.”\r\n\r\n&nbsp;","excerpt":"A Palo Alto High School Speech and Debate team member is celebrating her successes at the California High School Speech Association State tournament this month.","date":"2015-05-01 14:27:34","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-01-at-1.56.32-PM1.png","categories":["News"],"tags":{"42889":"cfl","8638":"debate","10525":"jennie savage","10195":"Jenny Xin","8944":"palo alto high school","8953":"paly","10196":"speech","33011":"states","9175":"tournament"}},{"id":102017,"title":"&#8220;Ghost Bike&#8221; to premiere tomorrow","permalink":"http:\/\/palyvoice.com\/2015\/04\/30\/ghost-bike-to-premiere-tomorrow\/","content":"The <a href=\"http:\/\/www.teenartscouncil.org\/\">Teen Arts Council<\/a> plans to host its first student-run production, \"Ghost Bike,\" at 7:30 p.m. on Friday and Saturday and 2 p.m. on Sunday at the Palo Alto Children's Theatre.\r\n\r\n<span style=\"color: #1c1c1c;\">TAC is a group of high schools students who meet weekly to plan creative and relaxing events for its community, according to TAC adviser Joy Brooke Fairfield. H<\/span>igh school students completely produced and directed the play, Fairfield said.\r\n\r\n\"The play itself wrestles with the complex reality of death and the hurdles friends overcome in their attempts to stand by each other,\" Fairfield said.\r\n\r\nThe rehearsals took place around three times a week at either the Haymarket Theatre or the Children's Theatre, according to Ido Gal, director and Paly senior. Many of the students play multiple roles; freshman Mia Trubelja joined \"Ghost Bike\" for her first TAC play as Cady, Wellwisher #1 and Ghost #2.\r\n\r\n<span style=\"color: #373e4d;\">\"It's a really great story,\" Trubelja said. \"It's definitely different than anything I've ever read. Everyone is working really hard and everyone in the cast is very talented.\"<\/span>\r\n\r\n[caption id=\"attachment_103056\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/unnamed.jpg\"><img class=\"size-full wp-image-103056\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/unnamed.jpg\" alt=\"Sophomore Zoe Sego plays the lead character Ora. Junior Ophir Sneh holds onto the &quot;ghost bike.&quot; Photo by Ido Gal.\" width=\"400\" height=\"266\" \/><\/a> Sophomore Zoe Sego plays the lead character, Ora, in the student-run play, \"Ghost Bike.\" Junior Ophir Sneh plays Eddie, Sego's best friend in the play. Photo by Hannah Nguyen.[\/caption]\r\n\r\nThis week, the cast and crew had rehearsals for up to five hours each day after school in preparation for opening night.\r\n\r\n<span style=\"color: #373e4d;\">\"When it comes to student-organized productions like our production of 'Ghost Bike', you get out what you put in,\" junior Paul Bleich said. \"If you want to put on a good show, you have to show commitment. There’s no one to force you to put in the work.\"<\/span>\r\n\r\nFairfield looks forward to seeing the teenagers' hard work pay off.\r\n\r\n\"This is one of the biggest projects we've undertaken in a while, and brings together the talents of over 20 different teens,\" Fairfield said.\r\n\r\nTickets can be bought online <a href=\"http:\/\/www.cityofpaloalto.org\/news\/displaynews.asp?NewsID=1543&amp;TargetID=281\">here<\/a> or at the door for $6.","excerpt":"The Teen Arts Council plans to host its first student-run production, \"Ghost Bike,\" at 7:30 p.m. on Friday and Saturday and 2 p.m. on Sunday at the Palo Alto Children's Theatre.\r\n","date":"2015-04-30 22:55:18","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/unnamed.jpg","categories":["A&amp;E Section Spotlight","Entertainment","News"],"tags":{"42684":"ghost bike","19408":"Ido Gal","42686":"mia trubelja","33460":"paul bleich","9132":"students","42685":"tac","9160":"theatre"}}]