[{"id":95787,"title":"Bryant Street Garage Fund to finance teen programs","permalink":"http:\/\/palyvoice.com\/2015\/01\/20\/bryant-street-garage-fund-to-finance-teen-programs\/","content":"The Bryant Street Garage Fund will hold an informational meeting for students interested in starting teen programs at 6 p.m. tomorrow Jan. 21 at the El Palo Alto Room in the Mitchell Park Library &amp; Community Center.\r\n\r\nSponsored by the City of Palo Alto, the fund gives “mini grants” to student-run programs, according to Teen Program Specialist Jose Perez-Sanchez.\r\n\r\n“We would like programs that involve high school students, whether if it’s working together to better the community or for a cause or doing something to benefit other teens in the community,” Perez-Sanchez said.\r\n\r\nAt the meeting, Perez-Sanchez will explain the process for developing a program and receiving funding. If a program is approved, it can receive up to $1,000 per fiscal year, Perez-Sanchez said.\r\n\r\nAccording to Perez-Sanchez, there are many benefits for students who wish to start a program financed by the Bryant Street Garage Fund.\r\n\r\n“They [students] will receive mentorship and support, gain leadership experience,\" Perez-Sanchez said. \"They’ll be able to plan and host events for their community, and it looks great on their resume.\"\r\n\r\nA student must be enrolled in a Palo Alto Unified School District high school to be eligible for funding, according to Perez-Sanchez. He says the BSG Fund sponsors two programs: <a href=\"http:\/\/palyvoice.com\/2014\/04\/26\/paly-students-to-compete-in-app-showcase\/\">ClickPA<\/a>, a website that lists teen activities in Palo Alto, and <a href=\"http:\/\/www.enybody.org\/\">Project Enybody<\/a>, a teen leadership board striving for energy efficiency, according to their respective websites.\r\n\r\nThe BSG Fund money comes from 75 percent of the revenue from a city-owned leased property, formerly the Bryant Street Teen Center.\r\n\r\nPerez-Sanchez is available to contact through email at jose.perezsanchez@cityofpaloalto.org.","excerpt":"The Bryant Street Garage Fund will hold an informational meeting for students interested in starting a teen program at 6 p.m. on Jan 21 at the El Palo Alto Room in the Mitchell Park Library Community Center.","date":"2015-01-20 13:06:25","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo1.jpg","categories":["News"],"tags":{"36628":"bryant street garage fund","36633":"grant","36632":"informational meeting","36631":"mitchell park library community center","36630":"sponsor","36629":"teen program"}},{"id":96174,"title":"Preview: Girls&#8217; soccer to host Mountain View","permalink":"http:\/\/palyvoice.com\/2015\/01\/20\/preview-girls-soccer-to-host-mountain-view\/","content":"The Palo Alto High School girls’ soccer team (8-1-0, 2-1-0) will host Mountain View High School (8-2-0, 3-0-0) at 3:30 p.m. today at Paly after the Vikings' first loss this season against Santa Clara High School (5-2-3, 2-1-1) last Thursday.\r\n\r\nSenior captain and center midfielder Katie Foug says she knows the game will be challenging after the team tied the team 2-2 and later lost 2-1 to Mountain View last year.\r\n\r\n\"Mountain View has always had a good team and will probably be one of our tougher opponents in the league,\" Foug said.\r\n\r\nThe Paly team is looking to improve offensively after its 2-0 loss against Santa Clara.\r\n\r\n\"We hope to improve on finishing our chances on goal and possessing the ball,\" senior defensive midfielder Lena Chang said.\r\n\r\nIn spite of their loss last Thursday, the Vikings have had a strong season so far according to Chang and Foug.\r\n\r\n\"The team has been off to a great start this year,\" Chang said. \"We've been doing really well playing cohesively.\"\r\n\r\nFoug is looking forward to the game as well as the rest of the season.\r\n\r\n\"We've had a great season thus far and definitely expect to continue our strong record,\" Foug said. \"We are hoping to get a win this Tuesday.\"\r\n\r\nChang encourages fans to come out and watch the match.\r\n\r\n\"In the past, Mountain View has always been a tough competitor,\" Chang said. \"So our game on Tuesday will be a fun one to watch.\"","excerpt":"The Palo Alto High School girls’ soccer team (8-1-0, 2-1-0) will host Mountain View High School (8-2-0, 3-0-0) at 3:30 p.m. today at Paly after its first loss this season against Santa Clara High School (5-2-3, 2-1-1) last Thursday.","date":"2015-01-20 12:22:38","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_4545.jpg","categories":["Sports"],"tags":{"10198":"girls soccer","8826":"katie foug","36637":"lena chang","29989":"mountain view","8944":"palo alto high school","9012":"preview","36636":"saba moussavian","10667":"santa clara","9110":"Soccer"}},{"id":96168,"title":"Paly community scholarship deadline is Friday, Jan. 30, turn in to College and Career Center","permalink":"http:\/\/palyvoice.com\/2015\/01\/18\/paly-community-scholarship-deadline-is-friday-jan-30-turn-in-to-college-and-career-center\/","content":"","excerpt":"","date":"2015-01-18 12:07:50","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8636":"deadline","36635":"paly community scholarship"}},{"id":96166,"title":"Cap and gown ordering deadline is Friday, Jan. 30","permalink":"http:\/\/palyvoice.com\/2015\/01\/18\/cap-and-gown-ordering-deadline-is-friday-jan-30\/","content":"","excerpt":"","date":"2015-01-18 11:57:09","author":"Lizzie Chun","categories":["Ticker"],"tags":{"36634":"cap and gown","8636":"deadline"}},{"id":96067,"title":"Student recognized for leadership at State Capitol","permalink":"http:\/\/palyvoice.com\/2015\/01\/17\/student-recognized-for-leadership-at-state-capitol\/","content":"[caption id=\"attachment_96071\" align=\"alignright\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo-11.png\"><img class=\"size-full wp-image-96071\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo-11.png\" alt=\"Senior Claire Liu, the other finalists, and the California Department of Education superintendent met to discuss issues at public schools. “If the opportunity arises, I think students should definitely apply for the program,” Liu said. Photo courtesy of Claire Liu. \" width=\"640\" height=\"427\" \/><\/a> Senior Claire Liu, the other finalists, and the California Department of Education superintendent met to discuss issues at public schools. “If the opportunity arises, I think students should definitely apply for the program,” Liu said. Photo courtesy of Claire Liu.[\/caption]\r\n\r\nA Palo Alto High School senior was recognized as the first alternate for the U.S. Senate Youth Program and met with other finalists and representatives from the Department of Education to discuss school climate at the State Capitol this Wednesday in Sacramento.\r\n\r\nThe recognized senior was the Associated Student Body President and Campanile editor-in-chief, Claire Liu.\r\n\r\nAccording to a December <a href=\"http:\/\/www.cde.ca.gov\/nr\/ne\/yr14\/yr14rel116.asp\">press release<\/a>, students must be nominated by their high school principal to participate in the program. A selection committee later reviews the applicants and selects based on strict criteria.\r\n\r\n“I went to Sacramento and had lunch with the superintendent [of the state], Tom Torlakson, the other finalists and people who worked at the Department of Education to talk about issues at public schools and the changes we can make,” Liu said.\r\n\r\nDuring her visit, Liu learned about the passions of the other finalists.\r\n\r\n“I was so humbled to be selected with three incredible intelligent and conscious young men,” Liu said. “Dahkota Brown [Argonaut High School] works on an Native American issues, Benjamin Beltran [Nevada Union High School] works on the achievement gap and Dustin Chiang [Mission San Jose High School] is the two-term president of the California Distributive Education Clubs of America. I learned a lot and was inspired to sit with people like that.”\r\n\r\nAt the meeting, Liu noticed the advantages that students at Paly have.\r\n\r\n“While we were talking to the superintendent about the college guidance programs, it was so clear the advantage Paly has to other schools in the state and nation,” Liu said.\r\n\r\nAccording to Liu, Paly has more resources that can help students during the college application process.\r\n\r\n“We have a teacher advisor for every 20 to 30 kids, guiding them through high school whereas other schools may only have one advisor for 100 kids,” Liu said.\r\n\r\nAnother advantage Paly has is the ease of access to technology, according to Liu.\r\n\r\n“Dustin’s school didn’t have enough computers to administer a standardized test,” Liu said. “That made me realize we never have a problem like that.”\r\n\r\nLiu said the experience made her appreciate what she has at Paly.\r\n\r\n“Being in the Associated Student Body and journalism, you look for things to change but you forget what’s already around,” Liu said.\r\n\r\nWhile Liu has not decided on a college yet, she has an idea of what she will pursue in the future.\r\n\r\n“I'm interested in maybe studying Economics or Public Policy and going into business with a focus on corporate social responsibility, and maybe further down the road looking into government,” Liu said.","excerpt":"Palo Alto High School senior was recognized as the first alternate for the U.S. Senate Youth Program and met with other finalists and representatives from the Department of Education to discuss school climate at the State Capitol this Wednesday in Sacramento.","date":"2015-01-17 13:49:38","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/photo-1.png","categories":["News","Spotlight"],"tags":{"8496":"ASB","8552":"California","14290":"claire liu","9084":"senate","36605":"youth"}},{"id":96005,"title":"College Declassified: The Interview","permalink":"http:\/\/palyvoice.com\/2015\/01\/15\/college-declassified-the-interview\/","content":"[caption id=\"attachment_96142\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_20150115_0556461.jpg\"><img class=\"size-full wp-image-96142\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_20150115_0556461.jpg\" alt=\"A water bottle and résumé are helpful items to to a college admissions interview. The interview is the only opportunity for applicants to meet with college representatives in person. Photo by Hannah Nguyen.\" width=\"800\" height=\"450\" \/><\/a> A water bottle and résumé are helpful items to bring to a college admissions interview. The interview is the only opportunity for applicants to meet with college representatives in person. Photo by Hannah Nguyen.[\/caption]\r\n\r\nThe applications are in. The big January deadlines have lapsed and the Class of 2015 is beginning to bask in the glory of Second-Semester-Seniority. The burdens of The Common Application, supplements, test scores and recommendations have been lifted. Time to break out the whiffle balls and put this whole “college thing” behind us, right? Well, sort of. One more key component of the application still looms ahead for many seniors: The interview.\r\n\r\nWhile it might not make or break your application, the interview is the only opportunity applicants have to meet with a representative of a college, one-on-one, face-to-face. Forget the test scores, forget the grades. This is your chance to show your college, in person, who you really are, and what kind of student you will be. How easily do you talk to strangers? What gets  you excited? What sense of humor do you have? These are the qualities that can't be organized in lists on the Common App. At the end of the day, the only part of your application that you take with you to college is, well, you.\r\n\r\nAfter having been through the college interview process twice myself, and consulting peers and a Columbia University alumni who has conducted interviews in the past, I have picked up a few pointers on how to walk away from an interview feeling successful. Here are some tips on preparing for your interview, and what you can do to make your interview worthwhile.\r\n\r\n<strong>Before Your Interview:<\/strong>\r\n\r\n1. Get in contact.\r\n\r\nThe process of setting up an interview is different across schools. Some schools give your contact information to alumni, who will then get in touch with you about an interview. Other schools will provide contact information of a nearby alum, and expect you to take the initiative of setting up an interview time. Do this as soon as possible to give them the most flexibility about a time to meet with you. Give them different times that you are available, and emphasize that you can work with their schedule. Exchange phone numbers, so they have an easy way to contact you on the day of the interview.\r\n\r\n2. Do your research.\r\n\r\nYou can almost guarantee that your interviewer will ask something to the extent of “Why _____?” Prepare your answer, and be sure to know which specific qualities of the school you can talk about for a good amount of time – don’t be afraid to make it personal. Do they have an award-winning marching band that you’d love to join? Is it a particular study abroad program that attracts you? Do you just love to be surrounded in nature? Understand why that particular school is good for you goals and interests, and what it is about you that makes you a good fit. Have ideas in your head, but avoid reciting your answer word for word beforehand. There’s a difference between sounding prepared and sounding scripted.\r\n\r\n3. Ask your own questions.\r\n\r\nYour interviewer will also serve as a resource to learn more about the school. Use this as an opportunity to show interest and preparedness by asking specific questions about programs and activities. Don’t waste time by asking things that can be found on the website, like how many clubs the school has. Ask instead why 60 percent of the students are involved Greek life and how that impacts campus culture.\r\n\r\n<strong>On the Day Of Your Interview:<\/strong>\r\n\r\n1. Bring a Résumé.\r\n\r\nA must-have if they ask for one, a bonus if they don’t. An well-organized résumé says that you are prepared and professional. Use your résumé to summarize the skills and experiences that you think are most important, including but not limited to work experience, community servic or athletic achievement. Not only will a résumé give your interview talking points during the interview, but it will also help them remember you later, when they are writing up your evaluation.\r\n\r\n2. Dress appropriately.\r\n\r\nSelf-explanatory. You want them to imagine you as a student on their campus, so dress modestly, and go for a little formality. You're more likely to leave a good impression and show that you value your time with the interviewer if you look polished and presentable. Definitely leave the sweats and tanks at home. If you're the superstitious type, it probably wouldn't hurt to wear something with the school's color.\r\n\r\n3. Bring sustenance.\r\n\r\nIf you are at a café, the nice interviewers will ask if you would like to get something to drink before you start your interview. Saying yes will not make you annoying, it will make you human. Come prepared with a water bottle just in case. Talking for 20 straight minutes will inevitably make you thirsty, and having something to drink could be a game-changer in how articulately you deliver your answers. The interviewer will think nothing less of you if you need to take a sip of water between questions.\r\n\r\n4. Be punctual.\r\n\r\nIf you make your interviewer wait extended amounts of time for you, there’s very little you can say to convince them that you are responsible, organized or deserving of a place at their school. Plan ahead, and if you’re meeting in a public place like a café, arrive before them to secure a table. Shoot them a text to let them know where you are and what color you are wearing, so they don’t have to search the room to determine which 18-year-old is their interviewee.\r\n\r\n5. Relax. You are not on trial.\r\n\r\nTake your time to understand each question, and figure out the best way to answer it. Think about what you are going to say before you say it, so you don’t end up blurting out a nonsensical string of “like's” and \"um's.\" Avoid simple “yes” or “no” responses to keep it conversational.\r\n\r\n6. Be Yourself.\r\n\r\nAt the end of the day, your college interviewer isn’t trying to grill you or intimidate you. They are trying to understand what kind of person you are, and if you are a good fit for their school. Speak passionately about the things that are important to you, and answer honestly about how you have confronted challenges in your life. Say what you truly think, not what you think they want to hear.\r\n\r\n7. Anything else?\r\n\r\nThere will come a point in the interview when the rep will ask if there's anything else that the college should know about you. Don't be shy about this one. You have spent the last 18 or so years of your life doing and thinking things that make you a unique person, and colleges should know why it is you are who you are. Reiterate the points you have already discussed if you deem them significant qualities, and add in anything else about you that is pertinent that hasn't come up yet. Maybe it's that you have a baby sister who has taught you the duties of responsibility. Maybe it's a charming anecdote about an embarrassing moment that taught you a lesson in humility. Maybe it's a statement about how despite all of the strong applications they are receiving, you are the best candidate there is because nobody else in the world can do exactly what you do. Leave them with something to remember.\r\n\r\n<strong>After the interview:<\/strong>\r\n\r\nShow your gratitude.\r\n\r\nBe sure to thank your interviewer after your interview is complete. It probably wouldn’t hurt to send an email as well, to thank them for their time.\r\n\r\n&nbsp;","excerpt":"Your applications may be in, but there's one more missing piece. Check out these pointers to help guide you through your upcoming college interviews.\r\n","date":"2015-01-15 20:53:38","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_20150115_0556461.jpg","categories":["Features","Spotlight"],"tags":{"8604":"college","36406":"college application","36400":"college interview","36407":"college prep","25040":"interview"}},{"id":96116,"title":"Video: Students defeat staff in Winter Rally game","permalink":"http:\/\/palyvoice.com\/2015\/01\/15\/video-students-defeat-staff-in-winter-rally-game\/","content":"During today's Winter Rally, the seniors beat the staff in the Student vs. Staff basketball game 15-8 and the Prom location was announced to be San Francisco City Hall. Watch the highlights of the game.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/79enT4SGzNY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"During today's Winter Rally, the seniors beat the staff in today's staff-student basketball game 15-8 and the Prom location was announced to be San Francisco City Hall. Watch the highlights of the game.","date":"2015-01-15 17:00:22","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_9544.jpg","categories":["Multimedia","Video"],"tags":{"36387":"basketball game","36408":"prom 2015","36609":"student vs. staff","10976":"winter rally"}},{"id":96045,"title":"Game in review: Student-staff basketball game 2015","permalink":"http:\/\/palyvoice.com\/2015\/01\/15\/game-in-review-student-staff-basketball-game-2015\/","content":"At Palo Alto High School's Winter Rally today, the seniors beat the staff in the annual student-staff basketball game by a score of 15-8*.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A0JAtO8hdPnW\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nThe box score statistics are shown below for the student and staff teams. Click on the headers to sort the player statistics.\r\n\r\n<noscript><span>Student-staff winter rally 2015<\/span><span>seniors\/student staff winter rally 2015<\/span><span>The Paly Cheer Team performed to start off this year's Winter Rally. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:24:36 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>The Dance Team followed the Cheer Team's performance. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:26:38 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Walker Ritchie guards teacher Grant Blackburn on the drive. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:28:16 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Teacher Michael Stern prepares to shoot. Stern had two field goal attempts. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:28:32 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Lauren Gargiulo is double teamed as she drives away from the defenders. Gargiulo had two steals. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:29:53 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Teacher John Rowe takes a free throw. He was 1-2 in free throws and 0-5 for field goals. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 800<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:30:54 PM<\/span><span>width<\/span><span> 533<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Teachers Zander Davis and Arne Lim high five during substitutions. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:32:41 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Jose Llanes drives with the ball. Referee Eric Bloom ejected Llanes from the game in the next quarter. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:34:58 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Misha Hindery reaches for the ball from Lim. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:36:00 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Maclean Mansfield calls out to his teammates for the ball. Mansfield made a three pointer. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:37:21 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Teacher Debbie Whitson offers donuts to the student team during halftime. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:41:55 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Associated Student Body Senior Class President Maya Ben-Efraim announces this year's Prom location, San Francisco City Hall. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:42:20 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>ASB President Claire Liu cheers as the Prom location is announced. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:43:06 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>The student team huddles before the third quarter begins. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:44:19 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Bryan Wong closes out on teacher Justin Cronin. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:44:55 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Jasper McEvoy sprints towards the basket. McEvoy went 1-3 in field goals. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:45:02 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Alex Hwang hangs onto the ball as teachers Brett Griffin and Chris Kuszmaul reach for the ball. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:49:40 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Teachers Melinda Mattes and Matt Hall grapple with Wong for the ball. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:50:09 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior James Giaccia drives past Cronin. Giaccia was 0-3 in three pointers. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:53:25 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Staff members and students jump for the rebound. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:54:56 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><span>Senior Harry Halsted flies past teacher Jack Bungarden after Bungarden pump faked. Photo by George Lu.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 533<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 1\/15\/2015 5:55:24 PM<\/span><span>width<\/span><span> 800<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T2i<\/span><\/noscript><iframe src=\"https:\/\/docs.google.com\/spreadsheets\/d\/1GOuF0QXa6X-Xj7qoLX4naJHe3QFXmVJjbjwR4x-K-v0\/pubchart?oid=1066460443&amp;format=interactive\" width=\"614\" height=\"445\" frameborder=\"0\" scrolling=\"no\" seamless=\"\"><\/iframe>\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/spreadsheets\/d\/1GOuF0QXa6X-Xj7qoLX4naJHe3QFXmVJjbjwR4x-K-v0\/pubchart?oid=753568934&amp;format=interactive\" width=\"601\" height=\"315\" frameborder=\"0\" scrolling=\"no\" seamless=\"\"><\/iframe>\r\n\r\n<em>*The scoreboard during the game showed the score to be 14-10, but Mansfield's three pointer was only counted as two points, and two extra points were added to the staff's score.<\/em>\r\n\r\nBonus GIF:\r\n<a href=\"http:\/\/imgur.com\/ikrQT5X\" target=\"_blank\"><img class=\"alignnone\" title=\"source: imgur.com\" src=\"http:\/\/i.imgur.com\/ikrQT5X.gif\" alt=\"\" width=\"600\" height=\"400\" \/><\/a>\r\n\r\nTeacher Grant Blackburn powers through the defense. GIF by George Lu.","excerpt":"At Palo Alto High School's Winter Rally today, the seniors beat the staff in the annual student-staff basketball game by a score of 15-8.","date":"2015-01-15 14:41:48","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/Screen-Shot-2015-01-15-at-2.41.05-PM.png","categories":["Multimedia","Spotlight"],"tags":{"36387":"basketball game","36607":"box score","8944":"palo alto high school","9107":"slideshow","9123":"Staff","36608":"statistics","36386":"student-staff","9132":"students","10976":"winter rally"}},{"id":79652,"title":"Teen Arts Council to host Poetry Jam Friday","permalink":"http:\/\/palyvoice.com\/2015\/01\/15\/teen-arts-council-to-host-poetry-jam-friday\/","content":"Teen Arts Council's first Poetry Jam will be held from 7 to 9 p.m. this Friday, Jan. 16, at the Palo Alto Children's Theater. The aim is to create a forum for teenagers to express themselves through poetry.\r\n\r\n[caption id=\"attachment_79662\" align=\"alignright\" width=\"314\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/10678753_680820555366979_1950178896442132628_n.jpg\"><img class=\"wp-image-79662\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/10678753_680820555366979_1950178896442132628_n.jpg\" alt=\"10678753_680820555366979_1950178896442132628_n\" width=\"314\" height=\"228\" \/><\/a> The cover photo of the Point B: Teen Poetry Jam Facebook group. Photo: Claire Eberhart and Teddie Stewart.[\/caption]\r\n\r\nPalo Alto High School sophomores Teddie Stewart and Claire Eberhart are putting on the event, entitled \"Point B: Teen Poetry Jam,\" where teens can come to listen to or perform poetry with no admission cost.\r\n\r\n\"Come share and listen to poetry at the Teen Arts Council's first Poetry Jam!\" the <a href=\"https:\/\/www.facebook.com\/events\/789655184409227\/?ref_dashboard_filter=upcoming\" target=\"_blank\">Facebook page<\/a> states. \"This nonjudgmental environment is the perfect place for anyone that's a verse novice to a poetry expert.\"\r\n\r\nEberhart and Stewart are hoping to create a \"laid-back, mellow climate\" for the Poetry Jam to encourage a mood of \"acceptance and general happiness,\" according to Eberhart. There will be a mic, mood lighting, beanbag chairs and a café type feel, with coffee, hot chocolate and baked goods for sale.\r\n\r\nThose interested in performing a poem should contact Eberhart or Stewart at teenartscouncil@gmail.com or message them on Facebook and include their name and title of poem if available. There will also be poems provided at the event for anyone who wants to read them. Any type of poetry is welcome, and poems do not have to be memorized.\r\n\r\n\"There are almost no restrictions for the types of poems that can be performed,\" Eberhart said. \"I hope for a wide range of classic, published poems by poetry sages to inspiring, original poems by the students of the Bay Area – anything from haikus to free verse to odes.\"\r\n\r\nThe idea for the event came about when Eberhart and Stewart, who are both passionate about poetry, noticed an absence of a place to express and share a love for poetry.\r\n\r\n\"I've been faced with several people who share the same kind of love for poems that I do,\" Eberhart said. \"I strongly believe that teenagers have the most creative minds and write beautifully, but are often discouraged by the mindset that it's kinda dorky. And for some reason, there had been no real medium besides the paper or the online publisher for sharing poetry. Besides standing idly by, I decided to take action and really make it happen.\"\r\n\r\nThe title of the event, \"Point B: Teen Poetry Jam,\" has special meaning to both Eberhart and Stewart.\r\n\r\n\"Point B is Claire's and my favorite poem by Sarah Kay, who writes slam poetry,\" Stewart said. \"And it's where we connected and found our shared love of poetry. It also means that our poetry jam will hopefully be people's Point B, or a place that they can always go to without hesitation. It's another way of us promoting our idea of a family of poetry lovers, new and old.\"\r\n\r\nEberhart and Stewart hope that there will be many more poetry jams in the future.\r\n\r\n\"We hope to continue Point B throughout our high school years,\" Stewart said. \"And we also hope to host four events a year, kind of like a seasonal thing: one in summer, one in fall, one in winter and one in spring.\"","excerpt":"Teen Arts Council's first Poetry Jam will be held from 7 to 9 p.m. this Friday, Jan. 16, at the Palo Alto Children's Theater. Its aim is to be a forum for teenagers to express themselves through poetry.","date":"2015-01-15 13:49:46","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/10678753_680820555366979_1950178896442132628_n.jpg","categories":["News","Spotlight"],"tags":{"36385":"claire eberhart","30391":"poetry","33599":"point b","33600":"point b teen poetry jam","36384":"teddie stewart","27176":"teen arts council","33598":"teen poetry jam"}},{"id":96020,"title":"Prom 2015 location: SF City Hall","permalink":"http:\/\/palyvoice.com\/2015\/01\/15\/prom-2015-location-sf-city-hall\/","content":"<a href=\"https:\/\/www.youtube.com\/watch?v=bq8vxcz0GxA\">Prom 2015<\/a> will be held at the San Francisco City Hall, according to an announcement made by the Palo Alto High School Associated Student Body today at the Student vs. Staff basketball game.\r\n\r\n\"A few of us from ASB visited it yesterday and when you walk to the entrance it looks like a palace,\" senior President Maya Ben-Efraim said. \"It's just so enormous and grand and everything is beautiful.\"\r\n\r\n[caption id=\"attachment_96029\" align=\"alignright\" width=\"352\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/10931011_907653035920069_8507970456468805690_n.jpg\"><img class=\"wp-image-96029\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/10931011_907653035920069_8507970456468805690_n.jpg\" alt=\"10931011_907653035920069_8507970456468805690_n\" width=\"352\" height=\"162\" \/><\/a> An inside look into the San Francisco City Hall, where Prom 2015 will be held. Photo courtesy of Palo Alto High School ASB.[\/caption]\r\n\r\nASB is renting out the building's Central Rotunda and three wings outside, which will provide more space for dancing than last year, according to Ben-Efraim. There will also be a variety of food stations with tables available to eat at.\r\n\r\n\"I think it will be a really nice location for Prom because it's in the city,\" senior Christine Langston said. \"It looks really pretty on the outside. The pictures online of the inside look elegant, fancy and like an actual ballroom, which will be a more traditional setting compared to last year's.\"\r\n\r\nThe San Francisco City Hall was rebuilt after the 1906 earthquake and is modeled after the Dome des Invalides in Paris where Napoleon's tomb is located.\r\n\r\nProm will be held on April 18 and buses will transport students to and from the event. The theme of Prom will be announced at the Winter Dance on Feb. 20, according to Ben-Efraim.","excerpt":"At the Student vs. Staff Basketball game at brunch Thursday, the Palo Alto High School Prom location for 2015 was announced by the Associated Student Body to be held at the San Francisco City Hall.","date":"2015-01-15 13:44:49","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/10931011_907653035920069_8507970456468805690_n.jpg","categories":["News"],"tags":{"9016":"prom","36408":"prom 2015","36409":"prom location"}}]