[{"id":109276,"title":"New program to provide student internship opportunities","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/new-program-to-provide-student-internship-opportunities\/","content":"[caption id=\"attachment_109393\" align=\"alignnone\" width=\"649\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN0437-11.jpg\"><img class=\"wp-image-109393 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN0437-11.jpg\" alt=\"DSCN0437 (1)\" width=\"649\" height=\"487\" \/><\/a> Seniors Jeanette Wong, Allison Zhang, Minyoung Kim, Priya Misner and junior Vivian Wu collaborate with Christina Owen during a Get Involved meeting after school in the library. \"The Get Involved project is a collaboration between Paly students, with me as director, certain offices at the City of Palo Alto and community organizations that support service-learning, career, networking and mentoring,\" Owen said. Photo by Adrienne Kwok.[\/caption]\r\n\r\nThe deadline to apply to the Get Involved Internship Program, an organization that provides Palo Alto Unified School District students with meaningful community service opportunities, is approaching on Oct. 9, according to junior Community Service Project Leader Candace Wang.\r\n\r\nNewly implemented this year, the program aims to expand student experience in the real world by collaborating with outside organizations and compiling internship opportunities, according to Wang.\r\n\r\n“We thought this was the perfect way to integrate not only volunteering, but real life work experience into something enjoyable and beneficial for Paly students,” Wang said. “It's really important that students have interests outside of the academic world.”\r\n\r\nCurrently, there are nine internships focuses available for students, including topics ranging from the environment to marketing and tutoring. Certain positions may take more multiple students.\r\n\r\nStudents will collaborate with the guidance of mentors in the field and will work towards a set goal, such as decreasing plastic litter on school campuses.\r\n\r\nhttps:\/\/youtu.be\/_wD9PgswUVA\r\n\r\n<em>Senior Nicole Chen advertises the Get Involved Internship Program. Applications are due Oct. 9.<span style=\"font-weight: 400;\"> \"Students should sign up for these internships because it will provide them with amazing mentors who can be role <\/span><span style=\"font-weight: 400;\">models<\/span><span style=\"font-weight: 400;\">,<\/span>\" Chen said. \"<span style=\"font-weight: 400;\">It also provides students with the experience of working professionally alongside adults and give them a taste of the workforce.<\/span>\"<\/em>\r\n\r\nCurrently there are no set time commitments and each internship requires a different amount of work, according to Wang. Hours utilized while working on the internships may be counted towards the 15-hour Living Skills graduation requirement, the President’s Community Service Award or general transcript recognition.\r\n\r\nParticipating in extracurriculars such as internships are a great experience for students and provide an opportunity for discovering their interests, according to Wang.\r\n\r\nTo fill out an application, students can obtain application forms from the <a href=\"http:\/\/www.getinvolvedpa.com\/internships.html\">Get Involved Website<\/a> and email the completed forms to getinvolvedpaloalto@gmail.com. Different positions have different required forms.\r\n\r\nAccording to the website, students are advised to sign up soon, as there are a limited number of positions.\r\n\r\nThe program’s core staff is comprised of Palo Alto and Gunn high school students who began working on the structure of the program this summer under the guidance of PAUSD Community Service and Career Adviser Christina Owen.\r\n\r\n“We worked hard over the summer contacting different organizations, brainstorming ideas and planning out the program to make this all possible,” committee member and junior Vivian Wu said. “We want to provide students with a source of opportunity and we’re hoping for a good student turnout.”\r\n\r\nVisit the <a href=\"getinvolvedpa.com\">Get Involved website<\/a> and contact Christina Owen at getinvolvedpaloalto@gmail.com for more information.","excerpt":"The deadline to apply to the Get Involved Internship Program, an organization dedicated to providing Palo Alto Unified School District students with meaningful community service opportunities, is approaching Oct. 9.","date":"2015-10-06 20:44:09","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN0437-11.jpg","categories":["News","Spotlight"],"tags":{"59189":"allison","8506":"Award","58206":"candace","58204":"christina","8611":"Community","58208":"get","58207":"getinvolved","58212":"hours","58210":"internships","58209":"involved","59190":"jeanette","44647":"kim","59186":"minyoung","59188":"misner","58211":"opportunities","58205":"owen","8977":"PAUSD","58214":"president's","59187":"priya","9094":"Service","58213":"transcript","59184":"vivian","9223":"Wang","59191":"wong","59185":"wu","9247":"Zhang"}},{"id":109171,"title":"Deceptive flyer distributed, event proceeds as scheduled","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/deceptive-flyer-distributed-event-proceeds-as-scheduled\/","content":"The Palo Alto High School administration is not taking any action in response to the distribution of a deceptive promotional flyer, according to Assistant Principal Jerry Berkson.\r\n\r\nFinancial advising organization <a href=\"intowealth.com\" target=\"_blank\">IntoWealth<\/a> mailed flyers to Palo Alto families recently, promoting its workshop “Slashing College Costs\" to provide insight in applying for financial aid. The company rented a space in the Paly library for the workshop, but the event is not associated with the school, Berkson said.\r\n\r\nThe distributed flyer includes several deceptive components that imply Paly's affiliation to the event, according to Assistant Principal Victoria Kim.\r\n\r\n“First of all, it’s printed on a piece of green paper – the school color,” Kim said. “The return address here [on the top left corner of the flyer] says '@ Paly.' The image on the back says 'Important Parent Meeting.' And then when you open it, it has a picture of our school sign. Then, it says the location is at Palo Alto High School. Obviously, they [the organizer] can’t change that because they’ve rented our facilities, but I think all of those elements in combination make it seem like the flyer was sent from the school.\"\r\n\r\n[caption id=\"attachment_109173\" align=\"aligncenter\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/final-in-text.jpg\"><img class=\" wp-image-109173\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/final-in-text.jpg\" alt=\"A Palo Alto High School student bikes past the Paly sign located at the intersection of Churchill Avenue and Castilleja Avenue before school. The school sign, one that does not have legal trademark according to Assistant Principal Jerry Berkson, was featured on a flyer .. “I think what he [the organizer of the event] did was deceptive in nature and I didn’t like it,” Assistant Principal Vicki Kim said. Photo by Jeanette Wong.\" width=\"615\" height=\"394\" \/><\/a> A Palo Alto High School student bikes past the Paly sign located at the intersection of Churchill Avenue and Castilleja Avenue before school today. The school sign, which is not trademarked, according to Assistant Principal Jerry Berkson, was featured on a flyer for an event that isn't affiliated with Paly. “I think what he [the organizer of the event] did was deceptive in nature and I didn’t like it,” Assistant Principal Victoria Kim said. Photo by Jeanette Wong.[\/caption]IntoWealth College Planning Specialist and \"Slashing College Costs\" co-organizer Wynn Yin says the implications were not intended.\r\n\r\n\"It was never our intention to imply that it [the workshop] was in any way Paly-sponsored or Paly-endorsed,\" Yin said. \"Having reviewed the flyer, we noticed that it is quite understandable that, simply by nature of the event being held at Paly, recipients might come to the aforementioned conclusion.\"\r\n\r\nAccording to Berkson, the initial chief concern of the incident was how the organizer retrieved personal information of Paly students. Berkson added that there are companies that have mailing lists of households of certain demographics, which is how the organizer was able to mail the flyers out.\r\n\r\n“Legally, the Paly sign or logo isn’t trademarked or anything,” Berkson said. “He [the organizer] didn’t do anything illegal. But whether it’s unethical or not? If you ask 10 different people, you’ll get 10 different opinions. I look at it from a more business perspective.\"\r\n\r\nAfter the flyer caught the attention of Paly administration, Berkson and IntoWealth resolved the issue over the phone.\r\n\r\n\"We have discussed with Mr. Berkson, and have agreed that in the future, should we do this again, we will minimize any potential confusion by not using a likeness of the school sign and adding a disclaimer that the workshop is not endorsed or sponsored by Paly,\" Yin said.\r\n\r\n[caption id=\"attachment_109271\" align=\"alignright\" width=\"338\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG.jpg\"><img class=\" wp-image-109271\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG.jpg\" alt=\"cvlkmxlvkdf \" width=\"338\" height=\"439\" \/><\/a> Palo Alto families received this flyer for a college workshop at Paly. Some believe aspects of the flyer imply Paly affiliation or endorsement, prompting an email from the Paly guidance department to upperclassmen. \"We are sorry to see that this flyer was  sent out and made to look like it came from the school,\" the email states. \"[We] want to be clear that we do not support the workshop.\" Flyer by IntoWealth.[\/caption]Because the organizer is legally not at fault, the administration is not inflicting any consequences to the organizer for distributing the flyers, Berkson said.\r\n\r\nUpon discovering the flyer, the guidance department sent an email to junior and senior families, clarifying that “Slashing College Costs” is not a Paly sponsored event.\r\n\r\n“We are writing to inform you that this workshop is not affiliated or endorsed by Palo Alto High School,” the email states. “We are sorry to see that this flyer was sent out and made to look like it came from the school but want to be clear that we do not support the workshop.”\r\n\r\nThe college-help workshop, held at 7 p.m. on Tuesday, achieved its desired result, according to Yin.\r\n\r\n\"The workshop turnout was very good and in our opinion a success,\" Yin said. \"The spirit and mission behind the workshop at Paly was that it was intended as a community outreach initiative. ... We received some great verbal feedback and many people stayed afterwards to ask questions.\"\r\n\r\nAccording to Yin, this was the first time IntoWealth has hosted a workshop at Paly, but the company generally conducts workshops all over the Bay Area, including the lecture hall at its main office, other high school campuses and test preparation centers.\r\n\r\nIncidentally, the Palo Alto Unified School District has recently implemented a policy which states PAUSD will no longer rent school campuses to for-profit organizations for college counseling and standardized testing preparation. According to Berkson, the new policy came into effect before the controversy surrounding the flyer, but after the organizer's contract was signed. PAUSD's decision was made independent of this incident. However, this coincidence prompted concern from some people, Berkson said.\r\n\r\n“We [the administration] received a phone call from a parent about the workshop saying, 'Hey I thought you didn’t do this [host events by for-profit organizations on campus] anymore,'” Berkson said. “I had to explain to them that the organizer's contract was signed before this whole thing.\"","excerpt":"Following a college-help organization's distribution of a deceptive promotional flyer, which included the Palo Alto High School sign for a non-school-affiliated event, the administration is not taking any action.","date":"2015-10-06 20:23:23","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/final-featured-image.jpg","categories":["News","Spotlight"],"tags":{"22666":"admin","9683":"college help","58202":"college workshop","58201":"deceitful","58200":"deceptive","58203":"financial aid","58198":"flyer","58199":"fraudulous flyer","9954":"jerry berkson","8944":"palo alto high school","9067":"scandal","9207":"victoria kim"}},{"id":108670,"title":"Alumnus composes music for fall production","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/alumnus-composes-music-for-fall-production\/","content":"Professional actor, composer and Palo Alto High School alumnus Jonathan Shue, Class of 2001, is collaborating with students to create original music for the theater department's fall show, \"The Odyssey\".\r\n\r\nStudents are working with the framework of previous music composed for a production of the Odyssey at Monta Vista High School to create a contemporary musical accompaniment, according to Shue.\r\n\r\n“When I compose music for plays like this, where we have actors who aren't necessarily trained musicians, it's important to me that the music comes from their heart and soul and that they have a hand in the creative process,” Shue said.\r\n\r\n[caption id=\"attachment_109398\" align=\"alignright\" width=\"468\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/12092197_914983975244358_742084578_n.jpg\"><img class=\"wp-image-109398\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/12092197_914983975244358_742084578_n.jpg\" alt=\"12092197_914983975244358_742084578_n\" width=\"468\" height=\"351\" \/><\/a> Actors rehearse for the Odyssey, Paly Theater's fall production, outside the Haymarket. \"The Odyssey\" will begin showing at the Haymarket Theatre August 25-27. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\nAccording to Shue, music is central to \"The Odyssey,\" but the author of the play, Mary Zimmerman, doesn't specify in what way. This means every production is extremely different, and each musical director can add his or her own creative spin to tell the story.\r\n\r\n“We're creating music that's completely unique to this production, and comes directly from the talent in the room,” Shue said.\r\n\r\nThe musical composition incorporates an assortment of different instruments, including piano, violin, saxophone and bajo sexto, a Mexican twelve-stringed instrument, as well as singing.\r\n\r\n“The music for this production doesn't fit nicely into a genre because it uses anything and everything to tell the story,” Shue said.\r\n\r\nJunior Music Director Edward Park is incorporating Shue’s compositions into the sound design and overseeing how the music fits together.\r\n\r\n“I'm taking Jonathan [Shue's] music and transcribing it and arranging it to suit the needs of the show,\" Park said. \"I'm not doing this on my own, but I have the most contact with Jonathan [Shue] at this point.”\r\n\r\nThe process takes place over email and text because Shue is working long distance, according to theater teacher and director Kathleen Woods.\r\n\r\n“It’s a very cooperative process,” Woods said.\r\n\r\nAccording to Park, on a day-to-day basis, he observes the show, takes notes on what cues are needed and sees how each musical piece will fit into each scene.\r\n\r\n“I'll adapt what music we have and potentially write a couple of lines to suit the scene,” Park said.\r\n\r\nShue grew up doing theater and music in Palo Alto and was involved in Paly theater for all four years of high school.\r\n\r\nHe now works as a professional actor and composer in Seattle, Washington. Shue recently finished a production of \"<a href=\"http:\/\/www.soundtheatrecompany.org\/2015-sound-theatre-seattle-season-now-showing\/indian-ink\/\">Indian Ink,<\/a>\" a unique drama which follows an English poet though her adventure in India, written by Tom Stoppard. The company that he performed the show with was started by Paly graduates as well, according to Shue.\r\n\r\nShue currently plays the drums for \"<a href=\"http:\/\/www.thehorseinmotion.org\/upcoming\/\">Brecht Fest in Pikes Place Market<\/a>\" in Seattle.\r\n\r\nNext, he will work on a project with the University of Washington for its Drama School’s 75th Anniversary.\r\n\r\n“I'm humbled to be part of it,” Shue said.","excerpt":"Professional actor, composer and Palo Alto High School alumnus Jonathan Shue ('01) is collaborating with students to create original music for the theater department's fall show, \"The Odyssey\".","date":"2015-10-06 19:50:27","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/12092197_914983975244358_742084578_n.jpg","categories":["Features","Spotlight"],"tags":{"12341":"alum","56569":"compose","56565":"Edward Park","8693":"Fall","56570":"fall show","8758":"haymarket","56564":"Jonathan Shue","56566":"Kimberly Woods","56568":"Mary Zimmerman","8906":"music","56567":"Odyssey","29646":"paly theater","40135":"production","9159":"theater"}},{"id":109253,"title":"Tuesday Tunes: Russell Star-Lack","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/tuesday-tunes-russell-star-lack\/","content":"[caption id=\"attachment_109309\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/FullSizeRender-1.jpg\"><img class=\"wp-image-109309\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/FullSizeRender-1.jpg\" alt=\"\" width=\"650\" height=\"488\" \/><\/a> Senior Russell Star-Lack sat down with The Paly Voice to discuss his passion for music. Not only is Star-Lack a devoted listener, he also a skilled guitar player and singer. Photo by Nika Woodfill.[\/caption]\r\n\r\nIn this week's edition of Tuesday Tunes, The Paly Voice sat down with accomplished guitarist and RAJ band member senior Russell Star-Lack to ask how music has impacted his life.\r\n\r\nAccording to Star-Lack, who primarily plays guitar and sings, music helps him relieve the stress that comes with being a student.\r\n\r\n“I listen to it [music] constantly, I play it constantly, I write it constantly,” Star-Lack said. “It is the best way for me to deal with stress. If I have an issue, I might write a song about it or find one I can relate to, and it will help me deal with stuff.\"\r\n\r\nStar-Lack grew up around music and fell in love with it at an early age.\r\n\r\n“My dad played guitar, and I thought that was really cool,” Star-Lack said. “When I was six, I was in the car with my mom and [Eric Clapton's] 'Layla' came on the radio and I thought, ‘Oh my God, this is awesome. I want to do that.’ And that's  really what got me started playing music.”\r\n\r\nStar-Lack loves to find his inspiration from classic blues and rock legends.\r\n\r\n“My favorites are Eric Clapton and all the great guitar guys — Hendrix, the Allman brothers and Jimmy Page with Led Zeppelin,” Star-Lack said. “For blues, Muddy Waters, Robert Johnson, Howlin’ Wolf, BB King, Albert King, Freddie King, Stevie Ray Vaughan and Gary Clark Jr. All these guys are great and not appreciated enough.”\r\n\r\nStar-Lack in particular loves blues for the raw emotion in its lyricism.\r\n\r\n“Blues is really where it's at for me,” Star-Lack said. “There’s just something about the emotion in blues. It's oftentimes not as technically as advanced, but there's just this raw feeling in the lyrics that really show what was going on in the singer's mind at the time.”\r\n\r\nIn his free time, Star-Lack likes to perform with his band RAJ, which are the initials of the other band members, including seniors Arjun Vasudevan and Jeremy Samos.\r\n\r\n“I don’t take a lot of risks in my life, and I think that performing is how I get that feeling,\" Star-Lack said. \"It’s addictive. I feel like I can express myself a lot better when I’m performing in front of my friends, people who know or don’t know me, than if I’m just talking. I’m very introverted, and it’s kind of fun to be the exact opposite, to play guitar behind your head and sing really loud and just be crazy and have fun.”\r\n\r\nAccording to Star-Lack, it’s important for people to expand their horizons and discover the world that music has to offer.\r\n\r\n“I encourage people to at least try, or listen to different kinds of music,” Star-Lack said. “I consider myself a listener of music even more than I am a player of it. So even just listening to stuff you don’t normally listen to and challenging yourself can really help broaden perspectives and maybe even help learn more about the world.”\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3A1216334347%3Aplaylist%3A7As6tRWJbyWOptsYhbTR6j\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"In this week's edition of Tuesday Tunes, The Paly Voice sat down with accomplished guitarist and RAJ band member senior Russell Star-Lack to ask how music has impacted his life.\r\n","date":"2015-10-06 11:36:33","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/FullSizeRender-1.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":{"58192":"Arjun Vasudevan","58195":"Blues","58197":"Guitar","58193":"Jeremy Samos","8906":"music","58194":"RAJ","58196":"Rock","58191":"Russell Star-Lack","42416":"Tuesday Tunes"}},{"id":108780,"title":"News in Review: August &#038; September 2015","permalink":"http:\/\/palyvoice.com\/2015\/10\/05\/news-in-review-august-september-2015\/","content":"<iframe src=\"\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1FNFcQEsWmEDaCZqBq3LeuBMS1Y52MrdCRSn3nAs8ZSM&amp;font=Bitter-Raleway&amp;lang=en&amp;initial_zoom=2&amp;height=730\" width=\"100%\" height=\"730\" frameborder=\"0\"><\/iframe>","excerpt":"A timeline of the most important news stories and events from the start of the school year.","date":"2015-10-05 16:04:24","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Screen-Shot-2015-10-01-at-7.35.33-PM.png","categories":["News","Spotlight"],"tags":{"19460":"2015","47570":"august","10012":"emily hwang","40814":"jeanette wong","9765":"multimedia","8916":"news","58130":"news editor","58129":"news editors","38267":"news in review","8939":"palo alto","8944":"palo alto high school","8953":"paly","8977":"PAUSD","8985":"photo","29303":"september","29797":"timeline","11060":"tutorial","29808":"twitter","9208":"video"}},{"id":109186,"title":"Football takes down Saratoga in league opener","permalink":"http:\/\/palyvoice.com\/2015\/10\/04\/football-takes-down-saratoga-in-league-opener\/","content":"[caption id=\"attachment_109232\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/PaulJIII.jpg\"><img class=\"wp-image-109232\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/PaulJIII.jpg\" alt=\"PaulJIII\" width=\"650\" height=\"488\" \/><\/a> Sophomore running back Paul Jackson III runs the ball down the field late in the fourth quarter. Paly would go on to win the game in double overtime 45-32, much to the credit of Jackson's running. \"It feels great going into leagues with this first win,\" Jackson said. \"It meant a lot to the team because we've lost three games in a row.\" Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\nThe Palo Alto High School football team (2-3, 1-0) triumphed over the Saratoga Falcons (1-3, 0-1) in its first De Anza league game of the season on Friday at home in double overtime with a final score of 42-35.\r\n\r\nAccording to Head Coach Jake Halas, the win came from the consistent hard work of the players and their ability to unify as a team.\r\n\r\n“This just really justifies all the work we put in, that’s what it [the win] did,” Halas said. “We kick their butt in practice all day long, and that’s why they were able to finish here in double overtime. They came together when it mattered.”\r\n\r\nThe Vikings were tied at the end of regulation play, with a notable comeback from Paly in the last minute and a half of the 4th quarter. Junior center Peter Snodgrass intercepted a pass from Saratoga junior quarterback Will Liddle and set up a drive that ended on the 1-yard line after a last second pass to Givens was just short of the touchdown.\r\n\r\n“It [the interception] definitely helped us turn the momentum of the game,” Snodgrass said. “It was a team effort, though. We had [junior center] Alec Cohen-Schisler fill in for me [while out with a calf cramp], and he played awesome in that drive. He totally led our offensive line.”\r\n\r\nRunning a balanced offense helped the Vikings open up the field and find success, according to senior wide receiver Riley Schoeben.\r\n\r\n“We finally got to run the ball,” Schoeben said. “That really opens up the pass game for Eli [Givens] and I, and [senior] Justin [Hull] got us the ball.”\r\n\r\nSaratoga head coach Tim Lugo accepted the loss graciously, but saw the game as something to build off of for the future.\r\n\r\n“It was a good high school football game by two pretty good football teams and, you know, hats off to Palo Alto,” Lugo said. “We’re going to be okay, we just have some things to fix.”\r\n\r\nAccording to Paly senior captain and running back Takeru Nishi, focusing on cleaning up the defense will be a main goal for the Vikings in upcoming weeks, but remains confident in the team’s abilities.\r\n\r\n“We need to work on not letting big plays past us, which is what happened tonight,” Nishi said. “If we can work on our defense and work on cleaning that up, I think we have a good chance of beating anyone.”\r\n\r\nPaly is set to take on the Milpitas Trojans (3-2, 1-0) at 7 p.m. on Friday, Oct. 9, for their first De Anza league away game.","excerpt":"Palo Alto High School football (2-3, 1-0) triumphed over the Saratoga Falcons (1-3, 0-1) in the first De Anza league game of the season on Friday at home in double overtime by a final score of 42-35.","date":"2015-10-04 20:35:17","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/PaulJIII.jpg","categories":["Football","Sports","Sports Recap","Spotlight"],"tags":{"19460":"2015","9656":"eli givens","8692":"falcons","8714":"football","25417":"halas","58189":"lugo","58188":"overtime","8944":"palo alto high school","8953":"paly","49545":"peter snodgrass","56300":"riley schoeben","10752":"saratoga high school","58030":"takeru nishi","9210":"vikings"}},{"id":109166,"title":"&#8220;Shrek the Musical Jr.&#8221; is monstrous fun","permalink":"http:\/\/palyvoice.com\/2015\/10\/03\/shrek-the-musical-jr-is-monstrous-fun\/","content":"\"Shrek\" is a title that many young people would recognize — who isn’t familiar with that misunderstood, lovable green ogre? After all, it is a 2001 DreamWorks film that captured the hearts of young and old alike and spawned three successful sequels. The Palo Alto High School stage production \"Shrek the Musical Jr.,\" aimed toward children, maintains the charm of familiar characters from <em>Shrek<\/em> with the addition of an entertaining musical element.\r\n\r\nDirected by Paly parent Tony Kienitz, the musical follows a truncated but similar storyline to the movie: Shrek, an ogre, reluctantly embarks on a journey with an enthusiastic Donkey to save Princess Fiona so she can marry Lord Farquaad. After Shrek completes this task, he can have his swamp back.\r\n\r\n[caption id=\"attachment_109216\" align=\"alignright\" width=\"435\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/45612_full.jpg\"><img class=\"wp-image-109216\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/45612_full.jpg\" alt=\"shrek\" width=\"435\" height=\"316\" \/><\/a> Junior Declan Flanders, freshman Gil Weissman, junior Alia Cuadros-Contreras and freshman Robert Vetter star as Shrek, Donkey, Princess Fiona and Lord Farquaad in \"Shrek the Musical Jr.,\" a show tailored to kids. The production features singing, dancing and silly jokes. Photo by Kristina Vetter.[\/caption]\r\n\r\nThe show is full of musical numbers, dancing and eclectic characters. The jokes in the musical are obviously directed at a kid's sense of humor—there is a variety of the classic name-calling, fart jokes and other general goofy and hilarious dialogue.\r\n\r\nEach cast member of the musical does a wonderful job at appealing to a younger audience. Freshman Gil Weissman as Donkey strikes the ideal balance between annoying and humorous. Lord Farquaad, played by freshman Robert Vetter, is one of the most well-casted characters of the production and has the most creative costume in the show. <em>Shrek<\/em> (junior Declan Flanders) is as grumpy as ever and Princess Fiona (junior Alia Cuadros-Contreras) is a more complex character than one would initially expect from a narcissistic princess.\r\n\r\nThe musical aspect of the production is satisfying. Two standout songs from the production are \"Story of My Life\" and \"Finale,\" because they both feature the cast's eclectic mix of characters. The set and costumes both work well within the show. Many characters wear fake stomachs and noses, and Shrek's costume is extremely reminiscent of the film version. Face paint is used to color the faces of several fairytale characters.\r\n\r\nDuring a showing on Thursday with an elementary school audience, everyone seemed to be laughing and having a good time though the young audience’s attention ebbed and flowed. In the middle of the play, it was easy to tell that the kids were getting restless. At the conclusion of the show, however, the children erupted in roaring applause, with some even offering a standing ovation.\r\n\r\nSome technical difficulties during the show inhibit enjoyment. The microphones didn’t work throughout almost the whole show, making the singing and funny lyrics hard to hear.\r\n\r\n\"Shrek the Musical Jr.\" is a show that delivers lighthearted entertainment that is perfect for children but also appropriate for those who have already graduated elementary school. The characters will take you back to memories from the original \"Shrek\"<em> <\/em>movie and the tunes will be stuck in your head for hours.\r\n\r\nThe show lasts a little over one hour and 10 minutes. Shrek the Musical, Jr. premiered on Oct. 2, and there will be two showings on Sunday, Oct. 4 at 2 p.m. and 7 p.m. Tickets are available at the door and <a href=\"https:\/\/search.seatyourself.biz\/webstore\/webstore.html?event=.&amp;domain=palytheatre\" target=\"_blank\">online<\/a> and cost $5 for students and children and $10 for adults.","excerpt":"The fall production of Shrek the Musical Jr. is a show that maintains the charm of familiar characters from Shrek but also adds an entertaining musical element.","date":"2015-10-03 10:03:36","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/45612_full.jpg","categories":["Entertainment","Spotlight"],"tags":{"58187":"dancing","19628":"musical","8953":"paly","40135":"production","29648":"show","58186":"shrek","38610":"singing","9159":"theater","9160":"theatre","42304":"tickets"}},{"id":109132,"title":"Volleyball team defeats Homestead Mustangs","permalink":"http:\/\/palyvoice.com\/2015\/10\/02\/volleyball-team-defeats-homestead-mustangs\/","content":"[caption id=\"attachment_109134\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_3515.jpg\"><img class=\"wp-image-109134\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_3515.jpg\" alt=\"IMG_3515\" width=\"600\" height=\"407\" \/><\/a> Sophomore outside hitter Chelsea Fan serves the ball during Palo Alto High School's game Thursday against the Homestead Mustangs. According to Fan, the team played cohesively, but had trouble with serving. \"We really worked well as a team and played well together, but we definitely missed too many serves,\" Fan said. Photo by Jackson Doerr.[\/caption]\r\n\r\nPalo Alto High School volleyball (13-7, 2-1) swept the Homestead Mustang’s (2-11, 1-3) in three sets on Thursday at Gunn High School, Paly’s temporary home gym.\r\n\r\nPaly’s performance overall was strong, winning every set of the game, although the team struggled with serving.\r\n\r\n“We really meshed well as a team tonight and had great chemistry,” junior libero Trisha Wittenbrink said. “We obviously need to work on serving, and serve-receive can always improve. We need to be able to execute our individual jobs so that we can build off each other.”\r\n\r\nAccording to Vikings’ head coach Jekara Wilson, Paly played well as a team and overall performance was solid, though there are always areas to improve.\r\n\r\n“I thought that the team performed really well,” Wilson said. “We will be working on serving and passing a lot more.”\r\n\r\nThe Vikings’ offense was led by sophomore hitter Chelsea Fan and junior setter Jessica Lee, according to Wilson.\r\n\r\n“I think that we really came together as a team and played super well together,” Lee said. “I played pretty well and helped out the hitters a lot.”\r\n\r\nPaly’s defense highlighted strong and consistent performance by senior Claire Dennis and Wittenbrink, according to Wilson. However, Wittenbrink still sees aspects to improve on.\r\n\r\n“I think my performance was okay,” Wittenbrink said. “I need to work on mental toughness. If I can get that down, my entire game will improve drastically.”\r\n\r\nHomestead’s head coach, Gary Carroll, was disappointed with the Mustangs’ lack of discipline on the court.\r\n\r\n“We need to take back deliberate discipline,” Carroll said. “Deliberate discipline in our defense, deliberate discipline in our lives.”\r\n\r\nThe Vikings’ next game is set for 6:45 p.m. Tuesday, Oct. 6, at Saratoga High School.","excerpt":"Palo Alto High School volleyball (13-7, 2-1) swept the Homestead Mustang’s (2-11, 1-3) in three sets Thursday at Gunn High School, Paly’s temporary home gym.","date":"2015-10-02 10:00:10","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_3515.jpg","categories":["Sports","Sports Recap","Spotlight","Volleyball"],"tags":{"19460":"2015","52186":"Chelsea Fan","8586":"claire dennis","52185":"Jekara Wilson","8809":"jessica lee","8944":"palo alto high school","8953":"paly","9120":"sports","58131":"trisha wittenbrink","9200":"varsity","56580":"vball","9216":"volleyball"}},{"id":109144,"title":"Construction projects remain on schedule","permalink":"http:\/\/palyvoice.com\/2015\/10\/01\/construction-projects-remain-on-schedule\/","content":"Palo Alto High School's construction projects remain on schedule and will proceed throughout the school year. Click on the link to view inside pictures on the construction progress.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/jyo9QvrNYf\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Palo Alto High School's construction projects remain on schedule and will proceed throughout the school year. Click on the link to view inside pictures on the construction progress.","date":"2015-10-01 23:26:28","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/construction1.png","categories":["Multimedia","Spotlight"],"tags":{"31768":"2016","58133":"2017","43374":"april","8616":"construction","8753":"gym","58134":"January","8848":"Library","8953":"paly","32593":"spring","9129":"student","58132":"studentcenter","9160":"theatre"}},{"id":108767,"title":"Six tips for killer Spirit Week cheers","permalink":"http:\/\/palyvoice.com\/2015\/10\/01\/six-tips-for-killer-spirit-week-cheers\/","content":"[caption id=\"attachment_77052\" align=\"aligncenter\" width=\"629\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6262.jpg\"><img class=\"wp-image-77052\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6262.jpg\" alt=\"The juniors cheer during Spirit Week 2013.  Photo by Molly Fogarty and Cathy Rong.\" width=\"629\" height=\"419\" \/><\/a> The junior Class of 2015 cheers during Paly's 2013 Spirit Week theme day. Students gather in the bleachers and shout pre-arranged cheers that supported class unity and expressed school spirit.  Photo by Molly Fogarty and Cathy Rong.[\/caption]\r\n\r\nAs September draws to a close, many Palo Alto High School students look forward to one exciting event amid all their tests, projects and deadlines — Spirit Week.\r\n\r\nWith only three weeks until one of the liveliest weeks of the school year, it's time to start getting pumped. Although it might be a little too early to dig those costumes out, there are a number of ways to start getting involved in your grade’s preparation. You could provide your artistic ability in the float or t-shirt designing, contribute your dancing skills (or lack thereof) to your grade’s spirit dance or write a cheer for the lunchtime rallies.\r\n\r\nFor the freshmen or new kids out there, one of the most exciting aspects of Spirit Week is the daily cheers. During every lunchtime of Spirit Week, each grade presents short cheers corresponding with the daily dress-up theme, the activity or the class as a whole. These cheers are normally submitted in the grade’s Spirit Week Facebook group and picked by Associated Student Body leaders based on popular choice and effectiveness.\r\n\r\nWant to contribute a cheer to your grade but don’t know how to get started? We’ve compiled a list of the top six tips for writing a killer cheer.\r\n\r\n<b>Rhyming cheers work the best:<\/b>\r\n\r\n“I think what has typically worked well in the past are cheers that are easy to say as a big group and cheers that rhyme well,” senior ASB Secretary Joseph Kao said. “It sounds more fluent and united that way.”\r\n\r\nRhyming is one of the most important parts in creating a cheer. The end of each line should rhyme with the next down to the exact syllable to create a flowing, powerful cheer. When a cheer does not rhyme exactly, the class is usually unable to chant it correctly and ends up stumbling over the words. To get the most points for the cheers, you need to perfect its delivery. One of the best feelings during Spirit Week is when your class is able to perfectly deliver a cheer without any prior experience.\r\n\r\n<b>Seven syllables, seven syllables:<\/b>\r\n\r\nAccording to junior class President Noa Ben-Efraim and junior ASB Vice President Anmol Nagar, the best structural choice for a smooth-flowing, easy Spirit Week cheer is a two-lined cheer with seven syllables in each. Too many syllables can sound clunky and is often difficult for a grade to repeat back with ease. So when coming up with those cheers, clap out those seven syllables and if necessary, bust out a thesaurus to help find a word that could fit the requirement.\r\n\r\nHere's a few cheers used in the past that follow the seven syllable rule:\r\n\r\nThe Class of 2017 produced a cheer with seven syllables in each line for the gym rally's three-point basketball competition:\r\n<p style=\"text-align: left;\">             Upperclassmen might have keys,                                                                                                                                                                                                                                                                                                                                                                                        but at least we sink our three's<\/p>\r\n<p style=\"text-align: left;\">The Class of 2015 used the seven syllable rule in creating a cheer regarding their class theme (The Great Gatsby):<\/p>\r\n<p style=\"text-align: left;\">             NYC around the bend,                                                                                                                                                                                                                                                                                                                                                                                                          Gatsby's party never ends<\/p>\r\n<p style=\"text-align: left;\"><b>Be appropriate:<\/b><\/p>\r\nMaking cheers that are appropriate is key. Paly's Spirit Week is a school event, so don't use any words or phrases that you wouldn't normally say in class. Stick only to cheers that judges will approve because points are deducted for inappropriate cheers. Boos and profanity decrease scores (as well as throwing objects or disrupting competitions in any way). In the end, Spirit Week is meant to be a fun and stress-free event, so make sure to be appropriate and create a safe space for all fellow Paly students who simply want to show off their school spirit.\r\n\r\n\"I would make sure the cheers are appropriate because different judges judge things differently,\" Ben-Efraim said.\r\n\r\n<b>Focus on supporting your grade, not attacking others:<\/b>\r\n\r\nTry to avoid too many of those zinger cheers that put down other grades. Although they might be fun to come up with, try to keep it positive. According to Ben-Efraim, this will boost scoring for your grade and means you can reuse your cheers.\r\n\r\n“I suggest that the grade focus more on their individual grades instead of being sassy and cheeky towards other grades,” Ben-Efraim said. “You'll get more points and you can have cooler cheers that can last the entire week.”\r\n\r\nFurthermore, the judges will take off points for sportsmanship if any grade gets too nasty towards another. Although this hasn’t happened in a few years, the judges will take off 50 points from a grade’s total for “any negative or inappropriate cheers, if anyone uses noise makers other than their own clapping and cheering, or if anyone is violent towards another student,\" according to <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">ASB's website.<\/a>\r\n\r\nFifty points can completely offset a victory in a lunchtime activity or bring a cheer's first place score down to third place.\r\n\r\n<b>Show your school spirit:<\/b>\r\n\r\nSpirit Week's main purpose is to unify Paly's student body. Even though each class joins in a strong competition against each other, the judges still look for students who work together, no matter the grade. Classes that create cheers to show support for all Paly students show off their school spirit stronger than others. Judges love Paly-unity cheers and will think highly of each class that cares about the school as a whole.\r\n\r\nAdditionally, teaming up with other classes to show off your school spirit allows the cheers to be louder and therefore more powerful. The judges love when they see two grades working together for cheers. So get together with another class ahead of time and prepare a few cheers that you can both do together at one of the lunch or after-school rallies.\r\n\r\n<b>Be loud and have fun:<\/b>\r\n\r\nAt the end of the day, no matter how clever or inclusive your cheer is, it won’t make a difference if no one can hear it. According to junior class Vice President Natalie Maloney, being loud is the most important part of a successful cheer.\r\n\r\n“Being loud is mostly what we are judged on,” Maloney said. “So that will earn the most points.”\r\n\r\nMake sure as many members of your grade come to the daily lunch rallies, and make sure you participate as much as possible. So bring all your friends and be prepared to be lose your voice by the end of the week from all the shouting you’ll do. (Don’t worry, everyone else will have lost theirs too.)\r\n\r\nFinally, make sure not to get too hung up on winning or losing points. Yes, getting in the competitive spirit is a key component of Spirit Week, but make sure you enjoy dressing up crazy and shouting along with all your classmates.\r\n\r\nHere are a few examples of Spirit Week cheers that have been used in the past. These are not all representatives of an ideal cheer, but demonstrate a class's unity in creating and\/or delivering one:\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/N8XqxpcbAIY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Want to contribute a cheer to your grade but don’t know how to get started? We’ve compiled a list of the top six tips for writing a killer cheer.\r\n","date":"2015-10-01 19:22:55","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/DSC_0177.jpg","categories":["Features","Spirit Week 2015","Spotlight"],"tags":{"33420":"advice","40634":"anmol nagar","56679":"cheers","14293":"joseph kao","40935":"noa ben-efraim","8953":"paly","9764":"spirit","9119":"Spirit Week","14866":"tips","56680":"writing"}}]