[{"id":96225,"title":"From a #SSS: To ED or not to ED?","permalink":"http:\/\/palyvoice.com\/2015\/04\/14\/from-a-sss-to-ed-or-not-to-ed\/","content":"It's a transitioning time of the year. Seniors are winding down their college process as the May 1 deadline approaches, which leaves it to juniors to start their own college search.\r\n\r\nAs two seniors who've both completed applying to colleges, we thought that we might pass along some advice to those looking ahead.\r\n\r\nThere are multiple different ways to apply to college. We will be focusing on Early Decision (ED), but students also apply using other paths like Regular Decision (RD) or Early Action (EA). ED is a big decision to make since it is a binding contract that typically requires a signed agreement that if the college or university accepts, you will attend.\r\n\r\n<strong>Pros: <\/strong><em>Written by Liana who applied ED.<\/em>\r\n\r\n[caption id=\"attachment_96455\" align=\"alignright\" width=\"293\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0117.jpg\"><img class=\"wp-image-96455\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0117.jpg\" alt=\"DSC_0117\" width=\"293\" height=\"441\" \/><\/a> The pros are written by Liana who chose to apply Early Decision. Photo by Maddy Jones.[\/caption]\r\n\r\n<strong>1. Higher acceptance rates<\/strong>\r\n\r\nMany selective schools have much higher acceptance rates during the ED round. According to a New York Times <a href=\"http:\/\/www.nytimes.com\/interactive\/2013\/04\/15\/education\/thechoice-2013-acceptance-rates.html\">article<\/a>, in 2013, many schools like Brown and Johns Hopkins had around double the acceptance rates in their early rounds. Brown accepted 18.54 percent of early applicants while only accepting 8.07 percent of regular applicants. Likewise, Johns Hopkins accepted 36.68 percent during the early round and 15.28 percent during the regular round. Duke’s acceptance rate was almost three times as high during its ED round, and Amherst took 39 percent of its early applicants but only 11.5 percent of its regular applicants. The higher acceptance rates are one of the most attractive qualities of early decision, and was a main factor in my choice to apply early.\r\n\r\n<em>Note: Part of the reason that the ED acceptance rate is higher is that recruited athletes are included in the ED round.<\/em>\r\n\r\n<strong>2. Done early<\/strong>\r\n\r\nResults from Early Decision are typically released in mid-December, and if you are accepted to your dream school, prepare for the best winter break of your high school years. With no homework or applications, you can thoroughly enjoy a well-deserved break. Even if you aren’t accepted Early Decision, you will have your Common App done and potentially some supplements you can recycle for other applications, meaning less work over break. Although I personally didn’t have all my other applications written, I’ve heard of some Early Decision applicants finishing all their applications by the early deadline, so it is possible to have no work over break no matter what your Early Decision result is. Early Decision forces you to start the process earlier, and I personally started writing my Common App in June. This made me less stressed because I was not rushed and had time to edit and change my mind about essay topics.\r\n\r\n<strong>3. More time for transition to college\r\n<\/strong>\r\n\r\nCollege is a big transition, and committing to a college earlier on gives you more time to prepare for the college you will be attending. You will have more time to research special programs, majors and activities so you enter college well-informed. Early Decision also gives you an advantage in the dorm search and roommate search over regular applicants because you can start dorm research earlier and start connecting with other admitted students via Facebook. I have already gotten together with other students from the Bay Area who were also accepted, and I’m also planning to visit in the spring to get a better feel for the campus. Early Decision allows me to focus in the spring on the college I’m attending rather than worrying about figuring out where I will attend.\r\n\r\n<strong>4. Decision sooner<\/strong>\r\n\r\nIf you are impatient, the turn-around time of the decision is a major incentive to apply early. The six-week wait from Nov. 1 to Dec. 5 was long enough. I can't even imagine waiting from early January to the end of March or early April. Even if I had been rejected, I would have liked to know so that I could move on with other applications. If you are not accepted, early decision gives you time to do more research and find another college you would like equally.\r\n\r\n<strong>5. Demonstrated interest<\/strong>\r\n\r\nEveryone who applies Early Decision has the advantage of demonstrated interest. Colleges really like that you are committing to them by applying Early Decision. By applying early, you tell the colleges,\"There's no other school I'd rather be at than yours,\" which means a lot. Colleges like admitting students who are excited to attend their schools and are not applying just because they didn’t get accepted somewhere else. Many schools, including the one I applied to, have been taking an increasing percent of their classes Early Decision, making Regular Decision increasingly competitive.\r\n\r\n<strong>CONS: <\/strong><i>Written by Maddy, who didn't apply ED.<\/i>\r\n\r\n[caption id=\"attachment_96454\" align=\"alignright\" width=\"305\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0125.jpg\"><img class=\"wp-image-96454\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/DSC_0125.jpg\" alt=\"DSC_0125\" width=\"305\" height=\"458\" \/><\/a> The cons are written by Maddy who decided not to apply Early Decision. Photo by Liana Pickrell.[\/caption]\r\n\r\n<strong>1. People change<\/strong>\r\n\r\nHave you ever looked back through old photos or statuses and cringed at what you looked like or said? People change a lot, especially in high school. We’re all growing up and figuring out who we want to be and what we like. Choosing a college is one of the first major life decisions that people make. What you may like now may not be what you’ll like at the end of the year when you’re heading off to college. I have personally changed my mind multiple times throughout my senior year about aspects such as whether I want a small college versus a large college or go to a college near a city versus in a rural area. Be prepared for change.\r\n\r\n<strong>2. Not just one great fit<\/strong>\r\n\r\nThere will be many colleges that will be a great fit. I’ve found that even my top colleges often have a couple of points that aren’t ideal in terms of what I’m looking for, but overall I like that college. Colleges, like us, aren’t perfect. Setting your heart on just one of those colleges could be detrimental if you don’t get in, but be assured that there is no <i>one <\/i>perfect school. There will be a multitude of colleges and universities where you will be able to flourish and explore. This is one of the reasons that for many, like myself, Early Action is a better path because you don't have to set your mind on a college, but you still get the comfort of hearing back sooner.\r\n\r\n<strong>3. Buyer’s remorse<\/strong>\r\n\r\nLet’s imagine that you get in to the school to which you apply ED. You’re thrilled, and rightly so. But then April comes around, and your friends and classmates are getting back all their decisions and weighing their options. These conversations may get to you, and you may find yourself with buyer's remorse. As you change over the year, you may start to pick apart your college and have doubts that it's not the perfect place for you. You'll second guess your choice in the absence of options. Personally, I am an indecisive person, and I know that the time in April spent weighing options is going to be important to my college process.\r\n\r\n<strong>4. No senior grades<\/strong>\r\n\r\nOne of the most important aspects of your application that any college counselor or admissions officer will tell you about is your transcript. Colleges want to see that you've challenged yourself and that you did well. If you didn’t do well earlier in high school, it may be advantageous to wait to apply Regular Decision so that you can show an upward trend with your first semester senior year grades. Personally, I had a better transcript in my first semester senior year, so it worked out in my favor to wait.\r\n\r\n<strong>5. Less time to write essays<\/strong>\r\n\r\nWith an earlier application due date for Early Decision, there will be more of a crunch to get all of your essays done. Essays are just one component of your application, but they provide a chance for you to talk personally and directly to the admissions directors about the school that you’re applying to. It’s the one aspect of your application process that you have the most control over, so you'll want to make them the best they can be. Many colleges have complex prompts, which from experience I can tell you take longer than you may anticipate. Colleges are looking for thoughtful and well-edited essays, so it may pay off to spend the extra time over winter break on these supplements.\r\n\r\n[caption id=\"attachment_96493\" align=\"alignleft\" width=\"259\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/ED.jpg\"><img class=\"wp-image-96493\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/ED.jpg\" alt=\"Photo by George Lu.\" width=\"259\" height=\"163\" \/><\/a> Maddy and Liana contemplate ED. Photo by <a href=\"http:\/\/palyvoice.com\/author\/gelu15\/\">George Lu<\/a>.[\/caption]\r\n\r\n<strong>Summary:<\/strong>\r\n\r\nOverall, Early Decision is a personal decision that is right for some and not for others. If you feel confident you’ve found your dream school and that it offers an option to apply Early Decision, then it may be right for you to apply ED. However, if you’re on the fence about your school, then it may make sense to weigh the pros from someone who ended up applying ED and the cons from someone who didn’t.\r\n\r\n&nbsp;","excerpt":"As two seniors who've both completed applying to colleges, we, Maddy and Liana, thought that we might pass along some advice to those looking ahead at the college process regarding Early Decision. ","date":"2015-04-14 13:37:30","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/sss.jpg","categories":["Opinion","Spotlight"],"tags":{"33420":"advice","8604":"college","37382":"ea","37381":"early action","36776":"early decision","36773":"ed","8927":"opinion"}},{"id":101930,"title":"PAUSD distributing surveys on world languages, course alignment","permalink":"http:\/\/palyvoice.com\/2015\/04\/14\/pausd-distributing-surveys-on-world-languages-course-alignment\/","content":"The Palo Alto Unified School District is conducting surveys to incorporate best practices to adopt into world language programs and course alignment policies.\r\n\r\nAccording to Associate Supt. Charles Young, the district hired Hanover Research, a global informational services firm, to coordinate two separate studies — one on world languages and the other on course alignment. After collecting the surveys, the firm will give the district a list of recommendations and strategies involving curriculum.\r\n\r\n“They [Hanover Research] will put together a report for us with a summary of the findings and some potential meaning behind the survey information,” Young said. “We’ll have conversations with the board and staff and see what kind of goals and actions we think that we might want to set in relation to that data to inform our practices next year.”\r\n\r\n[caption id=\"attachment_101936\" align=\"aligncenter\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-01-at-8.21.42-PM1.png\"><img class=\"wp-image-101936\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-01-at-8.21.42-PM1.png\" alt=\"Screen Shot 2015-04-01 at 8.21.42 PM\" width=\"500\" height=\"274\" \/><\/a> A question on the World Language survey asks students who are taking or have taken language courses to report their current level of fluency. According to Associate Supt. Charles Young, the survey will be used to make informed decisions about programs the district has already implemented and possibly create new programs. Screenshot by Emily Hwang.[\/caption]\r\n\r\nIn a letter to parents, Supt. Max McGee informed the community about the intent of the surveys.\r\n\r\n\"Working with Hanover Research will better enable us to maintain a high degree of accountability to ourselves, our students, and our community, while continuing to offer a rich and challenging academic environment for all students,\" McGee said.\r\n\r\nThe world language survey is being taken by students, staff and parents. The student survey focuses on the experiences that high school students have had with language classes throughout their years in the district, including elementary and middle school immersion programs.\r\n\r\nThe district is also looking to see if it should further expand its world language programs, especially at the elementary school level, according to Young.\r\n\r\nThe course alignment survey is only administered to students and teachers. The survey inquires about alignment in the four core subject areas: math, English, history and science. According to Young, the goal of this study is to understand students’ experiences in their classes around course expectations, assessments and homework.\r\n\r\nAlthough Young says that students with different teachers should have varied experiences within a given course, the district hopes to create a unified experience in the four core classes by outlining the best practices of each course.\r\n\r\n“We would never want or expect every teacher to do everything exactly the same thing on every given day,” Young said. “We know that’s not good teaching.”\r\n\r\nAccording to Young, the intent of the surveys is not to criticize staff or students. Rather, the surveys have been developed to continue to reflect on district policies.\r\n\r\n“The question of alignment experience for students has been an interest that’s been shared in the community for a while,” Young said. “It’s not about being evaluative or punitive.”\r\n\r\nYoung said that the surveys will surface many strengths that the current curriculum has to offer and also inform the district on how to improve certain policies.\r\n\r\n“It’s all about how we continue to do our work and make it the best experience for our students,” Young said.","excerpt":"The Palo Alto Unified School District is conducting surveys on the world language programs and core subject alignment policies at both Palo Alto High School and Gunn High School.\r\n","date":"2015-04-14 13:04:34","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-03-31-at-8.36.56-PM.png","categories":["News","Spotlight"],"tags":{"41519":"alignment","41522":"associate superintendent","41523":"charles young","41541":"core","29316":"curriculum","41524":"emilia diaz magaloni","10012":"emily hwang","8674":"english","8752":"gunn high school","41521":"hanover","41528":"hanover research","11617":"history","8771":"homework","41520":"hw","8871":"math","8944":"palo alto high school","8950":"Palo Alto Unified School District","8953":"paly","8972":"parents","8977":"PAUSD","41526":"programs","39964":"research","9072":"science","9111":"social studies","9123":"Staff","9132":"students","11646":"survey","41525":"world language"}},{"id":101737,"title":"Prom checklist: Guys and Girls","permalink":"http:\/\/palyvoice.com\/2015\/04\/12\/prom-checklist-guys-and-girls\/","content":"[caption id=\"attachment_101978\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Prom-checklist-collage1.jpg\"><img class=\"size-full wp-image-101978\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Prom-checklist-collage1.jpg\" alt=\"Many prom attendees fret about how to prepare for the big dance. The Paly Voice has compiled a list to help have a successful experience. Photos by Christian Leong and Liana Pickrell\" width=\"800\" height=\"800\" \/><\/a> Many Prom attendees fret about how to prepare for the big dance. In this checklist, The Paly Voice includes advice on all things attire, food, hygiene and accessories - everything you need for a night to be remembered. Photos by Christian Leong and Liana Pickrell.[\/caption]\r\n\r\nAs Prom quickly approaches, many wonder how to successfully prepare for the big night. The Paly Voice has compiled a checklist to ensure that each and every one of you has an outstanding prom experience.\r\n\r\n<strong>For Guys<\/strong>\r\n\r\n1. Buy a ticket and bring your student ID — Your Prom experience will be severely limited without one of these.\r\n\r\n2. Hygiene — You don’t want any residue from last week’s party stopping you from getting into Prom. Good hygiene also comes with other perks such as friends who won't be repulsed if your breath smells like the Cheesehouse sandwich that you ate for lunch three days ago.\r\n\r\n3. Get a date — Going stag is cool, but it's kind of hard to slow dance by yourself.\r\n\r\n4. Rent or buy a tux — Good news: Nobody is going to kill you if you are wearing a similar tux as another guy. Bad news: It can’t be your dad’s from 30 years ago. Rent or buy your own, and get it professionally fitted.\r\n\r\n5. Pick up your date’s corsage — This is mandatory – your date will love flowers.\r\n\r\n6. Get a haircut — Don’t go to Prom with bedhead. Your date will notice the difference after spending so many hours perfecting their own hair.\r\n\r\n7. Eat a good breakfast — Every good day starts with a killer breakfast. This is a good day, and by the transitive property, you need a good breakfast.\r\n\r\n8. Have fun — This is a once or twice in a lifetime event for most – live in the moment and let loose. Enjoy having a blast with your friends, your class and your date. Prom is just as much as you make of it.\r\n\r\n<strong>For Girls<\/strong>\r\n\r\n1. Buy a ticket — Buy your own. It isn't the 1920s anymore.\r\n\r\n2. Bring an ID — Or else you won’t be allowed on the bus. So really don’t forget your ID.\r\n\r\n3. Use alcohol free mouthwash —Don’t be that person who doesn’t pass the breathalyzer test.\r\n\r\n4. Get your dress hemmed and properly tailored— Unless you are blessed with perfect, model-esque proportions, you will need to get your dress hemmed and tailored. You don’t want to be tripping over your dress at Prom. Also, book early so the tailor can ensure it will be done by Prom.\r\n\r\n5. Buy a boutonniere — Boutonnieres really sharpen up your guy’s tux. Reserve a boutonniere that you can pick up the day of Prom so it is nice and fresh – you don’t want the petals to fall off.\r\n\r\n6. Bring flats or prepare to go barefoot — Heels hurt. I thought I got “comfortable” heels last year. The lesson I learned: There are no such things as comfortable heels after three hours of dancing.\r\n\r\n7. Eat something before you go — The bus ride takes a while. Don’t starve yourself the day before thinking you will look better in your dress. You will be really tired and won’t enjoy the night as much.\r\n\r\n8. Have fun — This is the most important one. Prom is a blast, whether you’re going with your a date or stag. Enjoy everything from getting your hair done to picking shoes to taking photos and relishing the night itself.","excerpt":"Sports editor Liana Pickrell and staffer Christian Leong have created a Prom guide for guys and girls on how to successfully prepare leading up to the big dance. ","date":"2015-04-12 12:28:11","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/photo-11.jpg","categories":["Features","Spotlight"],"tags":{"41286":"checklist","41285":"girl","41284":"guys","8944":"palo alto high school","9016":"prom","41283":"prom guide","30842":"suggestions","14866":"tips"}},{"id":101484,"title":"News in Review: March 2015","permalink":"http:\/\/palyvoice.com\/2015\/04\/06\/news-in-review-march-2015\/","content":"<em>This is the third installment of the News in Review series, in which the month’s news will be summarized. The news is split into two sections: “Stories you need to know,” which highlights the news that had a wider impact on the Palo Alto High School student body and Palo Alto community, and “Accomplishments and accolades,” which highlights news stories that had an impact on a smaller group but are still worthy of recognition.<\/em>\r\n\r\n[caption id=\"attachment_101719\" align=\"aligncenter\" width=\"602\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/march-news-in-review.jpg\"><img class=\"wp-image-101719\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/march-news-in-review.jpg\" alt=\"march news in review\" width=\"602\" height=\"404\" \/><\/a> A collage representing campus and community news for March. Photos by Emma Chiu, Amy Leung, Jeanette Wong, William Zhou, Horace Meng, Vivian Wu, Anna Lu and Alex Merkle-Raymond.[\/caption]\r\n\r\n<span style=\"text-decoration: underline;\"><b>Stories you need to know<\/b><\/span>\r\n\r\n<strong>Community support in response to student death<\/strong>\r\n\r\nThe Paly administration and Palo Alto community provided <a href=\"http:\/\/palyvoice.com\/2015\/03\/12\/community-mourns-unifies-following-student-death\/\">wide-ranging support options<\/a> for students following the suicide of a student on March 9. Such action was taken on March 11 when service dogs were on campus and Unity Club created a safe zone during Lunch that week. One new support system introduced was the email communication system that allows students to email their concerns about themselves or their friends to <a href=\"mailto:palysupport@pausd.org\" target=\"_blank\">palysupport@pausd.org<\/a>. Additionally, the smartphone application <a href=\"http:\/\/palyvoice.com\/2015\/03\/19\/appetite-blog-7-cups-of-tea\/\" target=\"_blank\">7 Cups of Tea<\/a> supports students by offering an anonymous community to offer emotional support. The Board of Education held an open forum on March 10 regarding academic climate and a meeting on March 24 to discuss<a href=\"http:\/\/palyvoice.com\/2015\/03\/24\/school-board-looks-to-improve-academic-culture-support-services\/\" target=\"_blank\"> student safety and health and a variety of counseling services<\/a>. The <a href=\"http:\/\/palyvoice.com\/2015\/03\/26\/in-this-together-teen-forum-to-discuss-mental-health-on-friday\/\" target=\"_blank\">discussion about students’ wellbeing<\/a> continued with a <a href=\"http:\/\/palyvoice.com\/2015\/03\/29\/teen-forum-sparks-mental-health-discussion-in-community\/\" target=\"_blank\">teen forum<\/a> at the Mitchell Park Library, which brought together teens and adult facilitators. On April 1, students were invited to attend a forum held in the Student Activities Office during lunch, which was attended by the school board and Superintendent Max McGee.\r\n<blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 658px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-version=\"4\">\r\n<div style=\"padding: 8px;\">\r\n<div style=\"background: #F8F8F8; line-height: 0; margin-top: 40px; padding: 50% 0; text-align: center; width: 100%;\">\r\n<p style=\"margin: 8px 0 0 0; padding: 0 4px;\"><a style=\"color: #000; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none; word-wrap: break-word;\" href=\"https:\/\/instagram.com\/p\/0ETTx3sUL-\/\" target=\"_top\">The Paly Voice staff is human, too. Today, the staff had a picnic on the Quad and wrote what we appreciate about each staffer. Even in the midst of our busy lives, we all need to remember to take some time to care for ourselves and those around us.<\/a><\/p>\r\n<p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\">A photo posted by The Paly Voice (@thepalyvoice) on <time style=\"font-family: Arial,sans-serif; font-size: 14px; line-height: 17px;\" datetime=\"2015-03-11T00:25:12+00:00\">Mar 10, 2015 at 5:25pm PDT<\/time><\/p>\r\n\r\n\r\n<\/blockquote>\r\n<script src=\"\/\/platform.instagram.com\/en_US\/embeds.js\" async=\"\" defer=\"defer\"><\/script>\r\n\r\n<blockquote class=\"twitter-tweet\" lang=\"en\">\r\nCommunity writes 'love notes' to <a href=\"https:\/\/twitter.com\/hashtag\/PaloAlto?src=hash\">#PaloAlto<\/a> youth: <a href=\"http:\/\/t.co\/fxVoKa1mdp\">http:\/\/t.co\/fxVoKa1mdp<\/a> <a href=\"http:\/\/t.co\/lzBAUoR7MO\">pic.twitter.com\/lzBAUoR7MO<\/a>\r\n\r\n— Palo Alto Weekly (@paloaltoweekly) <a href=\"https:\/\/twitter.com\/paloaltoweekly\/status\/577875429916303360\">March 17, 2015<\/a>\r\n<\/blockquote>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n<strong>Buena Vista efforts continue with rally and support <\/strong>\r\n\r\nCommunity members spoke out this month to voice their opinion that the Buena Vista Mobile Home Park should stay open. The future of the park lies in limbo, with many trying to figure out how to preserve affordable housing units. A <a href=\"http:\/\/palyvoice.com\/2015\/03\/12\/buena-vista-supporters-rally-at-city-hall\/\" target=\"_blank\">rally held on March 9 <\/a>of roughly 250 people spoke out in support of keeping Buena Vista open. As the month continued, more efforts were made to <a href=\"http:\/\/paloaltoonline.com\/news\/2015\/03\/24\/state-federal-funds-sought-to-save-buena-vista]\" target=\"_blank\">support Buena Vista.<\/a> For example, Sen. Jerry Hill and state Assemblyman Rich Gordon co-signed a letter to investigate potential funding sources to preserve Buena Vista. The fight to keep Buena Vista open will continue on into April, with a City Council hearing set.\r\n<blockquote class=\"twitter-tweet\" lang=\"en\">A \"Save Buena Vista\" rally is currently taking place outside Palo Alto City Hall. <a href=\"http:\/\/t.co\/Yl0sbTF3mx\">pic.twitter.com\/Yl0sbTF3mx<\/a> — The Paly Voice (@thepalyvoice) <a href=\"https:\/\/twitter.com\/thepalyvoice\/status\/575093008716165120\">March 10, 2015<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 658px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-version=\"4\">\r\n<div style=\"padding: 8px;\">\r\n<div style=\"background: #F8F8F8; line-height: 0; margin-top: 40px; padding: 50% 0; text-align: center; width: 100%;\">\r\n<p style=\"margin: 8px 0 0 0; padding: 0 4px;\"><a style=\"color: #000; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none; word-wrap: break-word;\" href=\"https:\/\/instagram.com\/p\/0CESwMvvZK\/\" target=\"_top\">Buena Vista Mobile Home Park rally, 5:45 Monday, March 9, City Hall, Palo Alto To read more about Buena Vista go to: http:\/\/verdemagazine.com\/letter-from-buena-vista #buenavista #rally #paloalto #iphonephotography #verdemagazine #paly #paloaltohighschool #cityhall @anasofia_aw<\/a><\/p>\r\n<p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\">A photo posted by Verde Magazine (@verdemag) on <time style=\"font-family: Arial,sans-serif; font-size: 14px; line-height: 17px;\" datetime=\"2015-03-10T03:35:31+00:00\">Mar 9, 2015 at 8:35pm PDT<\/time><\/p>\r\n\r\n\r\n<\/blockquote>\r\n<strong>March break madness<\/strong>\r\n\r\nMarch featured some awkward scheduling, with an unofficial mid-March break for most students. With local holiday on Friday, March 13 and two days off on March 17 and 18 for those who did not take the CAHSEE, the situation created an <a href=\"http:\/\/palyvoice.com\/2015\/03\/12\/what-theyre-saying-mid-march-break\/\" target=\"_blank\">almost-six-day weekend that was broken up by a school day on Monday<\/a>. Controversy surrounded whether there would be a higher number of absences for that Monday.\r\n\r\n<strong>March Career Month features range of speakers<\/strong>\r\n\r\n[caption id=\"attachment_101723\" align=\"alignright\" width=\"343\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-02-26-at-1.05.27-PM.png\"><img class=\"wp-image-101723\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-02-26-at-1.05.27-PM.png\" alt=\"Screen-Shot-2015-02-26-at-1.05.27-PM\" width=\"343\" height=\"269\" \/><\/a> Seventeen speakers presented during Career Month, covering a range of topics. Photo by Jeanette Wong.[\/caption]\r\n\r\nMarch was Career Month, with the first two weeks featuring the annual <a href=\"http:\/\/palyvoice.com\/2015\/03\/03\/career-month-speaker-series-kicks-off\/\" target=\"_blank\">speaker series<\/a>. Unlike in past years, a student leadership team helped organize the event, which took four months to plan. Some speakers brought along supplementary items to their career talks, one of which was a <a href=\"http:\/\/palyvoice.com\/2015\/03\/15\/driverless-or-dangerous\/\" target=\"_blank\">Google driverless car<\/a>.\r\n\r\n<b><span style=\"text-decoration: underline;\">Accomplishments and accolades<\/span><\/b>\r\n\r\n<strong>ASB holds elections<\/strong>\r\n\r\nAs the Paly campus was covered in Associated Student Body campaign posters throughout March, so were students’ newsfeeds. Voting for each grades’ President and Vice President and ASB’s President, Vice President, Secretary and Treasurer was <a href=\"http:\/\/palyvoice.com\/2015\/03\/24\/vote-for-me-whos-running-for-asb\/\" target=\"_blank\">held from March 25 to 27.<\/a> The candidates' speeches reached a larger audience this year through the broadcasting on InFocus and the <a href=\"http:\/\/palyvoice.com\/2015\/03\/24\/video-asb-presidential-town-hall-qa\/\" target=\"_blank\">town hall Q&amp;A held on March 24<\/a>. The Paly Voice’s own William Zhou, voted ASB Student Body President, also reached out by commenting on his <a href=\"http:\/\/palyvoice.com\/2015\/03\/09\/opinion-why-you-should-run-for-asb\/\" target=\"_blank\">personal experience of the benefits <\/a>of being a part of an organization like ASB. <a href=\"http:\/\/palyvoice.com\/2015\/03\/27\/asb-election-results-2015-16\/\" target=\"_blank\">Election results<\/a> were announced on March 27.\r\n\r\n<b>SciOly wins at regionals, moves onto States<\/b>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/03\/20\/science-olympiad-wins-at-santa-clara-regionals-advances-to-states\/\" target=\"_blank\">Paly’s Science Olympiad team placed first<\/a> out of 25 teams at the Santa Clara Regional Science Olympiad competition on March 14. The team had been <a href=\"http:\/\/palyvoice.com\/2015\/03\/07\/science-olympiad-heads-to-regionals\/\" target=\"_blank\">preparing for regionals<\/a> since October. With this win, the team qualified to attend the State competition on April 18 in Turlock, Calif.\r\n\r\n[caption id=\"attachment_101726\" align=\"alignleft\" width=\"287\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11059646_10205104634192735_5356398396971996938_n.jpg\"><img class=\"wp-image-101726\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11059646_10205104634192735_5356398396971996938_n.jpg\" alt=\"11059646_10205104634192735_5356398396971996938_n\" width=\"287\" height=\"191\" \/><\/a> The Palo Alto High School Science Olympiad team members pose with their medals as they celebrate their win at the Santa Clara Regionals. Photo by Horace Meng.[\/caption]\r\n\r\n<b>Robotics wins Entrepreneurship Award at regional competition<\/b>\r\n\r\nPaly’s Robotics Team was surprised at the Central Valley Regionals competition earlier in March when they received <a href=\"http:\/\/palyvoice.com\/2015\/03\/17\/robotics-team-wins-entrepreneurship-award-at-regional-competition\/\" target=\"_blank\">the Entrepreneurship Award<\/a>. The team’s 30-page business plan won them the award. Robotics’ last competition of the season will be at the Silicon Valley Regionals, which are held from April 1 to 4.\r\n\r\n<b>Debate competes at national qualifying tourney, wins National Championships<\/b>\r\n\r\nThe speech and debate team continues to impress, <a href=\"http:\/\/palyvoice.com\/2015\/03\/20\/debate-wins-tournament-to-compete-in-national-qualifiers\/\" target=\"_blank\">winning the Western Novice National Championships<\/a> for the third consecutive year. Freshman Tanay Krishna deserves a shoutout for winning the novice devision of the competition. In addition, four team members were selected to compete in the National Qualifying tournament at the end of March.\r\n\r\n<b>Spring musical \"Drowsy Chaperone\" was a hit<\/b>\r\n\r\nPaly theatre’s <a href=\"[[http:\/\/palyvoice.com\/2015\/03\/09\/review-the-drowsy-chaperone-is-anything-but-drowsy\/\" target=\"_blank\">comical spring show, “The Drowsy Chaperone,”<\/a> was a hit when it opened on March 6. The Paly Voice’s own Adele Bloch played the Drowsy Chaperone, who offered comic relief and played off the humorous cast. As its last major performance, the Theatre Department deserves a massive round of applause for its big finale.\r\n\r\n<b>Second annual Battle of the Bands held at Paly<\/b>\r\n\r\nThe second annual <a href=\"http:\/\/palyvoice.com\/2015\/03\/23\/boys-and-girls-club-to-host-annual-battle-of-the-bands\/\" target=\"_blank\">Battle of the Bands<\/a> competition was held on March 27 in the Haymarket Theatre. The event — which featured six Bay Area bands, including Paly student bands like Paper Islands and Koitus — helped raise funds for the Boys and Girls Club of the Peninsula’s art and music programs.\r\n\r\n<b>New program Global Glimpse plans study abroad summer trip<\/b>\r\n\r\n[caption id=\"attachment_101728\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11051015_803181706441324_1325225690_n.jpg\"><img class=\"wp-image-101728\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11051015_803181706441324_1325225690_n.jpg\" alt=\"11051015_803181706441324_1325225690_n\" width=\"400\" height=\"225\" \/><\/a> Juniors Rebecca Sunnerås Jonsson, Claire Krugler and Eli Craveiro Frankel set up a bake sale in downtown Palo Alto as a part of the Global Glimpse program. Global Glimpse attendees are expected to fundraise in preparation for their trips to Latin American countries. Photo courtesy of Minyoung Kim.[\/caption]\r\n\r\nAs a new program introduced this year, Paly’s Global Glimpse chapter began planning for a <a href=\"http:\/\/palyvoice.com\/2015\/03\/12\/students-pilot-study-abroad-program\/\">study abroad trip<\/a>. Social studies teachers nominated students they thought would be good fits, and 20 were ultimately selected for the program, which entails experiencing life and engaging in a variety of community service activities in a rural community in Latin America this summer.\r\n\r\n<b>Theater students compete at statewide competition in Southern California<\/b>\r\n\r\nSix Paly theater students deserve a shoutout for participating in a 20-person group from various parts of California that <a href=\"http:\/\/palyvoice.com\/2015\/03\/07\/students-to-perform-in-state-wide-musical\/\">performed “Hello! My Baby”<\/a> in Southern California late in March. This statewide performance, a part of the 2015 California State Thespian Festival, required the students to audition last April and to spend three weekends in Los Angeles to rehearse for 14-hour days.\r\n\r\n<strong>Youth Speaks Out art exhibit debuts<\/strong>\r\n\r\nThe fourth annual <a href=\"http:\/\/palyvoice.com\/2015\/03\/21\/slideshow-youth-speaks-out-anonymous-art-exhibit-grand-opening\/\">Youth Speaks Out art exhibition<\/a> debuted on March 20 and will run until April 14. A variety of media is displayed, ranging from photography to painting to sculptures, all which are presented anonymously.\r\n\r\n[caption id=\"attachment_101731\" align=\"alignleft\" width=\"319\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/5.jpg\"><img class=\"wp-image-101731\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/5.jpg\" alt=\"5\" width=\"319\" height=\"216\" \/><\/a> Gunn freshman Lily Liu plays the guzheng in the Palo Alto Art Center courtyard as attendees file into the gallery at the Youth Speaks Out gallery. Photo by Jeanette Wong.[\/caption]\r\n\r\n<b>Paly Choirs releases album<\/b>\r\n\r\nPaly Choirs fundraised to release its third full-length album throughout the month of March (the <a href=\"https:\/\/www.kickstarter.com\/projects\/56469681\/a-day-in-the-life-paly-high-choirs-third-studio-al\">kickstarter is open through April!<\/a>). <a href=\"http:\/\/palyvoice.com\/2015\/03\/10\/a-day-in-the-life-paly-choirs-to-release-album\/\">Entitled “A Day in the Life,”<\/a> the album includes a track of songs previously performed by Madrigal Choir, Concert Choir and select a cappella groups in concert.\r\n\r\n<strong>InFocus attends Student Television Network convention<\/strong>\r\n\r\nInFocus traveled down to Southern California at the end of the month to attend the <a href=\"http:\/\/palyvoice.com\/2015\/03\/31\/infocus-travels-to-socal\/\">Student Television Network convention for the first time<\/a>. Students will compete there to show their ability to produce a variety of video types, which allows InFocus to try out their new equipment.","excerpt":"This is the third installment of the News in Review series, in which the month’s news will be summarized. The news is split into two sections: the must reads and the \"accolades and accomplishments.\"","date":"2015-04-06 11:12:48","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/march-news-in-review.jpg","categories":["News","Spotlight"],"tags":{"41288":"march 2015","40971":"new in review","8916":"news","8944":"palo alto high school","8953":"paly","9032":"recap"}},{"id":101671,"title":"Choir prevails at Anaheim performance festival","permalink":"http:\/\/palyvoice.com\/2015\/04\/05\/choir-prevails-at-anaheim-performance-festival\/","content":"[caption id=\"attachment_101672\" align=\"alignnone\" width=\"526\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/10349067_1395550220763806_5719902598166072784_n.jpg\"><img class=\"wp-image-101672\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/10349067_1395550220763806_5719902598166072784_n.jpg\" alt=\"10349067_1395550220763806_5719902598166072784_n\" width=\"526\" height=\"394\" \/><\/a> Paly choir poses for a picture after garnering three gold awards at a performance festival in Anaheim. The group also attended a workshop and spent a day relaxing at Disneyland. Photo courtesy of Anisha Patwardhan.[\/caption]\r\n\r\nPalo Alto High School’s Concert Choir, Madrigal Singers and Spectrum Singers earned three gold awards this weekend at the annual WorldStrides’ Heritage Festival in Anaheim, Calif.\r\n\r\n\"<span style=\"color: #222222;\">I am super proud of the group,\" choir teacher Michael Najar said. \"Even if they had not won an award, they would have 'won' in my opinion. They performed at their highest level.\"<\/span>\r\n\r\nIn addition to the three gold awards, the Concert Choir and Women's Choir won first place overall. Paly was also awarded the Overall Choral Sweepstakes Award, granted to the choir with the highest average scores. According to the festival's <a href=\"http:\/\/hp.educationaltravel.com\/choral-directors\/\">website<\/a>, scores are determined by a panel of three adjudicators who oversee and offer advice to each choir after their performance.\r\n\r\n\"The pieces we sang, Bach and Mozart, are very difficult, high-level pieces,\" choir student and junior Michelle Chen said. \"The fact that we not only pulled it off but also received such good scores for our performance evaluation is a huge achievement.\"\r\n\r\nAccording to choir student and sophomore Anisha Patwardhan, practice was key to success at the festival.\r\n\r\n\"We tried to be extremely nitpicky in the last few weeks, and it paid off,\" Patwardhan said.\r\n\r\nIn addition to performing in the festival, the choirs attended a workshop at the University of California, Irvine, and spent a day relaxing at Disneyland.","excerpt":"Palo Alto High School’s Concert Choir, Madrigal Singers and Spectrum Singers triumphed this weekend at WorldStrides’ Heritage Festival in Anaheim, Calif., earning three gold awards at the annual competition.","date":"2015-04-05 22:38:38","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/10349067_1395550220763806_5719902598166072784_n.jpg","categories":["News","Spotlight"],"tags":{"41241":"anaheim","8583":"choir","41244":"concert choir","41242":"disneyland","41243":"gold award","41239":"madrigal singers","30526":"najar","8944":"palo alto high school","8953":"paly","30527":"paly choirs","41246":"performance festival","41240":"spectrum singers","41245":"world strides heritage festival"}},{"id":101714,"title":"Record voter turnout for ASB elections","permalink":"http:\/\/palyvoice.com\/2015\/04\/03\/record-voter-turnout-for-asb-elections-2\/","content":"[caption id=\"attachment_101716\" align=\"alignnone\" width=\"625\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-02-at-1.04.19-PM.png\"><img class=\"size-full wp-image-101716\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-02-at-1.04.19-PM.png\" alt=\"Newly elected ASB President and Junior William Zhou speaks at the ASB Town-hall debate session for his ASB presidential campaign. Palo Alto High School’s ASB elections reached a record voter turnout of 67 percent. Photo by George Lu. \" width=\"625\" height=\"417\" \/><\/a> Newly elected ASB President and Junior William Zhou speaks at the ASB Town-hall debate session for his ASB presidential campaign. Palo Alto High School’s ASB elections reaches a record voter turnout of 67 percent for the first time. Photo by George Lu.[\/caption]\r\n\r\nPalo Alto High School’s Associated Student Body elections for the 2015-16 school year reached a record voter turnout of 67 percent.\r\n\r\nAccording to sophomore class president Noa Ben-Efraim, over the past few years, ASB’s voter turnout has been increasing, and this year it reached around a 67 percent voter turnout — 20 percent more than last year.\r\n\r\n“ASB’s reputation on campus is continuously growing and I think that is reflected when four students are running for a class vice-president,” Ben-Efraim said. “When more people are getting involved in elections it attracts a greater percentage of all students.”\r\n\r\nBen-Efraim said ASB started the Town hall debates for the ASB Vice President and President positions this year.\r\n\r\n“The Town-hall debates were a great way for students to hear each candidate’s point of view, and hear them answer questions that students personally asked via a Google site,” Ben-Efraim said. “Even though the number of debate attendees wasn’t a great turnout, we believe it has great potential to be a big part of elections and next year we are hoping to expand the event in order reach more students.”\r\n\r\nAccording to junior and ASB secretary Joseph Kao, Paly journalism publications did a good job of capturing footage and publishing it online for students to see.\r\n\r\n“In Focus also did a really good job showing the speeches and giving people an allotted time to take out their phones and vote,” Kao said.\r\n\r\nBen-Efraim attributes the greater turnout in votes to the hard work put into increasing publicity for events, which drew students' attentions to the elections.\r\n\r\n“I think for elections this year, our publicity efforts through social media, on campus voting, and the candidates campaigns got the students interested and curious about the elections and therefore translated into a greater voter turnout.”","excerpt":"Palo Alto High School’s Associated Student Body elections for the 2015-16 school year reached a record voter turnout of 67 percent for the first time. ","date":"2015-04-03 12:13:29","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-02-at-1.04.19-PM.png","categories":["News"],"tags":{"41258":"67%","8496":"ASB","8497":"ASB elections","41256":"asb elections 2015-2016","8785":"In-Focus","14293":"joseph kao","41257":"noa ben-efriam"}},{"id":101631,"title":"Liveblog: Baseball vs. Saratoga","permalink":"http:\/\/palyvoice.com\/2015\/04\/02\/liveblog-baseball-vs-saratoga\/","content":"Check back here at 4 p.m. on Friday, April 3 for the first live coverage of this season's Palo Alto High School baseball team (9-4, 5-2) as they host the Saratoga Falcons (7-7, 2-5) and hope to rebound from this past Wednesday's 6-5 loss at Saratoga.\r\n\r\n[liveblog]","excerpt":"Check back here at 4 p.m. on Friday, April 3 for the first live coverage of this season's Palo Alto High School baseball team (9-4, 5-2) as they host the Saratoga Falcons (7-7, 2-5) and hope to rebound from this past Wednesday's 6-5 loss at Saratoga. \r\n","date":"2015-04-02 23:37:22","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_3178.jpg","categories":["Sports"],"tags":{"8410":"Baseball","8855":"liveblog","9063":"saratoga"}},{"id":101677,"title":"Investigation underway, teacher recovering after science class mishap","permalink":"http:\/\/palyvoice.com\/2015\/04\/02\/investigation-underway-teacher-recovering-after-science-class-mishap\/","content":"The Palo Alto Fire Department and Palo Alto High School administration are investigating why a classroom fire alarm failed to go off after a chemistry demonstration yesterday ignited a fire that injured a teacher.\r\n\r\n[caption id=\"attachment_101755\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_22931.jpg\"><img class=\"wp-image-101755\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_22931.jpg\" alt=\"Paly admin and the Palo Alto Fire Department are looking into the classroom fire that occurred yesterday. Photo by Dhara Yu.\" width=\"300\" height=\"203\" \/><\/a> Paly admin and the Palo Alto Fire Department are looking into the classroom fire that occurred yesterday. Photo by Dhara Yu.[\/caption]\r\n\r\nChemistry teacher Silja Paymer, who conducted the demonstration, received superficial first- and second-degree burns but was released from an emergency burn unit shortly after being transported to the hospital. She told The Paly Voice in an email last evening that she is now resting at home and will return to teaching after spring break.\r\n\r\nAccording to witness sophomore Jessica Wong, an explosion occurred during 3rd Period while Paymer was finishing up a gas law property demonstration with flammable liquid methane. Some backpacks and papers were damaged, but no students were hospitalized after the fire.\r\n\r\nPAFD Battalion Chief Kevin McNally said that though PAFD is in the process of investigating the matter, there may not have been enough smoke in the room to trigger the fire alarm.\r\n\r\n\"It was not a sustained fire,\" McNally said. \"I can speculate that the alarm didn't go off because most of them are smoke detectors, not flame detectors. Unless there's enough smoke produced to actually set the alarm off, it won't go off.\"\r\n\r\nWong noted her concern about the apparent fire alarm malfunction.\r\n\r\n\"I was pretty shocked that there had been a literal fiery explosion and the alarm didn’t even go off,\" Wong said. \"There was definitely smoke in the room.\"\r\n\r\nAccording to Wong, Paymer immediately used the emergency shower, a feature that is installed in every science classroom, to put out the flames on her body, and students poured water onto burning items in the room.\r\n\r\n\"It [the fire extinguisher] didn’t get used,\" Wong said. \"I think it’s because all the fires were so small and spread out.\"\r\n\r\nSophomore Jordan Quigley, who was also in the classroom at the time of the fire, said that Paymer told a group of students to get help from science teacher Ron Bowditch in the room next door. Bowditch then called the paramedics and school personnel.\r\n\r\n\"Paymer was pretty calm for what had happened,\" Quigley said.\r\n\r\nAccording to sophomore Aman Mittal, another witness to the explosion, the methane used in the experiment was supposed to spark a flame to propel a plastic container backward. Mittal noted that the experiment failed multiple times and suddenly erupted into flames on the final attempt.\r\n\r\n\"She [Paymer] was working with methane in an empty milk carton to make a reaction happen, but it wouldn't work,\" Mittal said. \"So she kept trying, and I guess all the methane from the previous tries reacted, as in caught fire, and the entire front of the room burst into flames for a split second.\"\r\n\r\nWong said that the students were grateful that Paymer reacted quickly to the incident.\r\n\r\n\"We’re so lucky that it [the whole classroom] didn't catch on fire and [that] no one else got hurt – not even people sitting in the front row,\" Wong said.","excerpt":"The Palo Alto Fire Department and Palo Alto High School administration are investigating why a classroom fire alarm failed to go off after a chemistry demonstration yesterday ignited a fire that injured a teacher.","date":"2015-04-02 18:24:55","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_22931.jpg","categories":["News","Spotlight"],"tags":{"8453":"accident","41255":"aman mittal","41249":"burn","41250":"chem","11624":"chemistry","41252":"experiment","33669":"fire","10447":"fire alarm","41531":"fire department","41253":"jessica wong","41254":"jordan quigley","41529":"kevin mcnally","41530":"pafd","8944":"palo alto high school","8953":"paly","41251":"recovery","41287":"silja paymer","9150":"Teacher"}},{"id":101643,"title":"InFocus travels to SoCal","permalink":"http:\/\/palyvoice.com\/2015\/03\/31\/infocus-travels-to-socal\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_75011\" align=\"alignright\" width=\"563\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_55571.jpg\"><img class=\"wp-image-75011\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_55571.jpg\" alt=\"INfocus Network and Viking Magazine adviser Paul Hoeprich gives students tips on how to take great videos. Photo by George Lu. \" width=\"563\" height=\"375\" \/><\/a> InFocus Network and Viking Magazine adviser Paul Hoeprich gives students tips on how to take great videos. Photo by George Lu.[\/caption]\r\n\r\nPalo Alto High School’s broadcast journalism publication InFocus is traveling to San Diego today to attend the Student Television Network convention.\r\n\r\nAccording to executive producer Emma Hammerson, this is the first year that InFocus is attending the convention.\r\n\r\n“It features thousands of other film students from around the country and we compete in different events,” Hammerson said.\r\n\r\nThe convention has a series of events where students compete to show their ability to produce different kinds of video.\r\n\r\n\"It's pretty much a bunch of competitions, ranging from producing music videos to making a live news show with just two people, to public service announcements,\"Anchor Jacqueline Furrier said.\r\n\r\nAccording to Hammerson, the STN convention will last from Thursday to Saturday.\r\n\r\nThe InFocus staff is excited to try out its new equipment and has high hopes for the competition.\r\n\r\n“We also just got all new equipment this year, so we have the opportunity to do really well and hopefully win some awards,” Furrier said.\r\n\r\nThis year InFocus has a new adviser Paul <span style=\"color: #373e4d;\">Hoeprich <\/span>who has attended STN before which the team hopes will give them an advantage, according to Furrier. The staff is excited for the competition.\r\n\r\n“We have a new  teacher, who is very experienced and motivated to win,” Furrier said. \"Everyone is pretty excited.\"\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s broadcast journalism publication Infocus is traveling to San Diego today to attend the Student Television Network convention.","date":"2015-03-31 19:11:15","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_55571.jpg","categories":["News","Spotlight"],"tags":{"14174":"broadcast journalism","9427":"infocus","8944":"palo alto high school","8953":"paly","41211":"STN"}},{"id":101574,"title":"Teen forum sparks mental health discussion in community","permalink":"http:\/\/palyvoice.com\/2015\/03\/29\/teen-forum-sparks-mental-health-discussion-in-community\/","content":"A growing need for emotional well-being within Palo Alto has sparked the creation of a variety of forums and conferences that aim to discuss and seek to improve issues within our community. On Friday at the Mitchell Park Community Center, Palo Alto teens and adults came together for a youth forum to encourage teenagers to have open discussion in a safe environment.\r\n\r\nTeen-selected adult facilitators and students from the <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/recreation\/teens\/leadership.aspand\">Teen Advisory Board<\/a> and <a href=\"https:\/\/paloaltoyouthcouncil.wordpress.com\/\">Palo Alto Youth Council<\/a> led the event, officially titled “In This Together: A Place to Share, A Place to Support, A Place to Heal.” The two teen groups seek to improve the community by linking teens with the general public through the implementation of programs that encourage student involvement.\r\n\r\n“[The] teen voice is really important,” TAB and PAYC member Elinor Aspegren said. “Teens are often told that their opinions don’t matter or that they’re too young to know what they’re talking about. … And right now, we’ve given them a space to talk about what they’re feeling.”\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A4LAdZsnM7_z\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nThe event kicked off with a few introductory remarks from Aspegren, Gunn High School junior and master of ceremonies; Rob de Geus, Palo Alto director of community services; and Amal Aziz, youth and teen services director of The City of Palo Alto.\r\n\r\n“We must be intentional [and] authentic and show resolve in our discussion with teens as we go forward,” de Geus said.\r\n\r\nAfterwards, students and adults split into their respective sessions: teen discussion circles and an adult support workshop. Students engaged in three rounds of 25-minute dialogue circles, which covered the topics of “Social Academic Pressure,” “Grieving, Coping and Dealing with Loss,” “Dealing with Stress,” “Defeating Stigma,” “Dealing with Depression” and “Inclusion, Acceptance and Friendship.” The dialogue circles prompted students to reflect on their own lives in order to offer suggestions for how to improve the community in the future.\r\n\r\n“It [the forum] gets the conversation going, and that doesn’t happen very much in other circumstances,” Gunn junior Rachel Gates said.\r\n\r\nStudent facilitator and Palo Alto High School senior Emma Chiu and adult facilitator and Gunn Oracle adviser Kristy Blackburn led the “Social Academic Pressure” dialogue circle. Students discussed where academic pressure stems from and how students and adults can change the definition of social academic pressure within Palo Alto. Ideas ranged from not limiting the number of Advanced Placement classes a student can take to counting a smaller achievement, such as winning a video game, as a success.\r\n\r\nThe “Dealing with Stress” group led by adult facilitator Eric Bloom, Paly Social Studies and school climate teacher, discussed the causes of stress, how it feels and ways to alleviate it. Some members of the group reported that tests, relationships and the future often make them feel hot, tense and filled with nervous energy.\r\n\r\nThe dialogue circles gave students chances to be heard and to hear others, according to de Geus.\r\n\r\n“To listen and to understand can be a very powerful thing,” de Geus said.\r\n\r\nAfter each dialogue session was complete, students and adults met during \"Empathy Hour\" to allow facilitators to summarize their discussions with the rest of the forum attendees.\r\n\r\n“I’m hoping that when we come back and talk about all the things said in the circles, parents and administrators will … start to realize what teens and adults want,” Aspegren said.\r\n\r\nGates enjoyed the experience to both share and listen to the teen attendee's ideas.\r\n\r\n“It was a nice to see a lot of different people engaging with each other and hearing different perspectives from people of different parts of the community,” Gates said.\r\n\r\nAccording to Aspegren, the \"In This Together\" forum is just one of many discussions that will begin to make a strong connection between adults and teens in the community.\r\n\r\n“Some say teenagers are too young … to make decisions, but I think teenagers have the power to change the world,” Gunn sophomore and TAB member Shannon Yang said.","excerpt":"Both teens and adults came together to discuss how to improve community wellbeing and mental health in the City of Palo Alto at a youth forum on Friday at the Mitchell Park Community Center.","date":"2015-03-29 20:34:35","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_8770.jpg","categories":["News","Spotlight"],"tags":{"8611":"Community","41053":"elinor aspegren","11240":"emma chiu","11236":"eric bloom","18368":"forum","8751":"gunn","41054":"kristy blackburn","37655":"mental health","27709":"mitchell park","8939":"palo alto","8944":"palo alto high school","41052":"palo alto youth council","8953":"paly","28786":"payc","41056":"rachel gates","41057":"rob de geus","41055":"shannon yang","9107":"slideshow","9129":"student","39961":"student forum","41051":"tab","27177":"teen","33698":"teen advisory board","40993":"teen forum"}}]