[{"id":99491,"title":"Summer opportunities fair at 7 p.m. on Feb. 25 at the Gunn High School library","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/summer-opportunities-fair-at-7-p-m-on-feb-25-at-the-gunn-high-school-library\/","content":"","excerpt":"","date":"2015-02-22 17:41:59","author":"Lizzie Chun","categories":["Ticker"],"tags":{"15095":"fair","8751":"gunn","39364":"summer opportunities"}},{"id":99183,"title":"Review: &#8220;American Sniper&#8221; – a personal look into war","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-american-sniper-a-personal-look-into-war\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_99219\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/American-Sniper-2014.jpg\"><img class=\"size-full wp-image-99219\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/American-Sniper-2014.jpg\" alt=\"Clint Eastwood directs the true story of Chris Kyle, an American SEAL who does [[[completes?]]] four tours in Iraq after the devastating events of 9\/11. Photo by Warner Bros.\" width=\"600\" height=\"374\" \/><\/a> Clint Eastwood directs the true story of Chris Kyle, an American SEAL who does four tours in Iraq after the devastating events of 9\/11. Photo courtesy of Warner Bros.[\/caption]The title of the movie says it all: war, patriotism and of course, snipers. This war movie not only includes numerous fighting scenes, but also flashes of the life a soldier experiences and how far some soldiers are willing to go for a country they love. \"American Sniper\" tells the story through a unique perspective by taking a deep look into one soldier's experiences. However, while the movie reaches the expectations for a great action movie and realistic war movie, it does not quite reach the goal of being the perfectly thought-out biography.\r\n\r\n“American Sniper” is a true story based on Chris Kyle’s autobiography as a Navy SEAL in Iraq after the United States declared war on terrorism. Kyle (Bradley Cooper) is a Texan cowboy who grew up with a father who taught him to classify people as wolves, sheep and sheepdogs that protect the innocent. The childhood lesson resurfaces in Kyle’s life when he joins the SEALs, after he decides it’s time he did something more with his life. Kyle meets his future wife Taya (Sienna Miller) in a surprisingly lighthearted scene, and after some playful bantering and courtship, they marry before Kyle leaves for Iraq. The movie then proceeds to follows him through his four tours, over a hundred kills, his struggle to stay in touch with his wife and through his assimilation into society after losing friends along the way.\r\n\r\nDirector Clint Eastwood attempts to portray the reasoning behind the violence war requires by emphasizing the themes of vengeance against terrorism and the price good men pay in the fight against evil through Kyle’s story. However, while there is a strong focus on Kyle’s beliefs on the war and his duty, the lens Eastwood uses primarily provides justification for the war instead of focusing more on troubling consequences and opposing views.\r\n\r\n[caption id=\"attachment_99197\" align=\"alignnone\" width=\"643\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/americansniper26.jpg\"><img class=\"size-full wp-image-99197\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/americansniper26.jpg\" alt=\"As a sniper, Chris Kyle (Bradley Cooper) protects the American soldiers moving through the Iraqi streets. He eventually becomes the most efficient sniper in U.S. history. Photo by Warner Bros. \" width=\"643\" height=\"359\" \/><\/a> As a sniper, Chris Kyle (Bradley Cooper) protects the American soldiers moving through the Iraqi streets. He eventually becomes the most efficient sniper in U.S. history. Photo courtesy of Warner Bros.[\/caption]\r\n\r\nThe action scenes are beautifully done with interesting camera angles and none of the overly loud and unnecessary music that can be distracting in a serious war movie. There are also scenes flashing between Kyle’s perspective and his wife’s perspective during phone conversations that add strength and realism to their relationship, which could have otherwise been easily overlooked. Bradley Cooper’s transformation into a bulky, Texan soldier is not only amazing physically, but it also remained unwaveringly realistic throughout the movie in a showcase of dedicated acting. As Taya, Sienna Miller's emotions seem authentic, and her performance as the worried wife helps the audience connect to the couple's struggles.\r\n\r\n“American Sniper” provides a direct look into the lives of soldiers and a moving snapshot of their dedication to protect their country. The movie is not afraid to illustrate not only the struggles of the soldiers, but also the terrifying experiences of affected Iraqi citizens. As an action movie, it meets all standards. As a drama, it paints a gritty but also touching look into one man’s life. Still, while it is a good and sometimes even thematically deep war movie, “American Sniper” does not explore enough of the varying aspects of war issues to be considered one of the best war movies of all time.\r\n\r\n<strong>\"American Sniper\"<\/strong>\r\n\r\n<strong>2 hours, 14 minutes<\/strong>\r\n\r\n<strong>Rated R for for strong and disturbing war violence, and language throughout, including some sexual references<\/strong>\r\n\r\n<strong>Directed by Clint Eastwood<\/strong>\r\n\r\n<strong>With Bradley Cooper, Sienna Miller, Kyle Gallner<\/strong>\r\n\r\n<strong>Oscar Nominations: Best Picture, Actor in a Leading Role (Bradley Cooper), Adapted Screenplay, Film Editing, Sound Editing and Sound Mixing<\/strong>","excerpt":"The title of the movie says it all: war, patriotism and of course, snipers. This war movie not only includes numerous fighting scenes, but also flashes of the life a soldier experiences and how far a person is willing to go for a country they love. ","date":"2015-02-22 17:40:45","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/americansniper26.jpg","categories":["Uncategorized"],"tags":{"14287":"action","39021":"american sniper","39023":"bradley cooper","39022":"clint eastwood","8654":"drama","8900":"movie review","8930":"oscars","10815":"war"}},{"id":99484,"title":"Liveblog: Oscars 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/liveblog-oscars-2015\/","content":"[caption id=\"attachment_99494\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars1.jpg\"><img class=\" wp-image-99494\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars1.jpg\" alt=\"The 87th Annual Academy Awards begin at 5:30 p.m. Photo courtesy of Forbes. \" width=\"600\" height=\"331\" \/><\/a> The 87th Annual Academy Awards begin at 5:30 p.m. Photo courtesy of Forbes.[\/caption]\r\n\r\n<em>The Paly Voice presents live coverage of the 87th Academy Awards. Be sure to check out The Voice's <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/liveblog-oscars-red-carpet-2015\/\">coverage of the Red Carpet <\/a>and <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-oscars-2015-best-picture-nominees\/\">reviews of the Best Picture nominees<\/a>.<\/em>\r\n\r\n<em>Editor's Note: The opinions expressed in this article are those of the authors alone and not necessarily of the staff of The Paly Voice as a whole.<\/em>\r\n\r\n[liveblog]","excerpt":"The Paly Voice presents live coverage of the 87th Academy Awards. Tune in at 5:30 p.m. for live updates and commentary.","date":"2015-02-22 17:33:36","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars1.jpg","categories":["Entertainment","Spotlight"],"tags":{"19460":"2015","8450":"academy","11967":"academy awards","39366":"awards","39365":"oscar","8930":"oscars"}},{"id":99269,"title":"Review: &#8220;The Imitation Game&#8221; is a hidden gem","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-imitation-game-is-a-hidden-gem\/","content":"[caption id=\"attachment_99277\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/ig2_0.jpg\"><img class=\"size-full wp-image-99277\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/ig2_0.jpg\" alt=\"The Enigma team works feverishly to figure out if &quot;Christopher&quot; the &quot;universal machine&quot; can solve the difficult coding system. Photo by StudioCanal.\" width=\"400\" height=\"266\" \/><\/a> The Enigma team works feverishly to figure out if \"Christopher,\" the \"universal machine,\" can solve the difficult coding system. Photo courtesy of StudioCanal.[\/caption]\r\n\r\nIf you walk down the street and ask someone \"Who is Alan Turing?\" they probably would give you a blank stare or a puzzled expression. After watching \"The Imitation Game,\" viewers everywhere will know about Alan Turing and his life-changing position in helping to end World War II. \"The Imitation Game\" is an intense film set in the 1940s that depicts the turmoil of the time and within Turing's life while still having all the necessary parts of a film, including humor, romance and high stakes.\r\n\r\nAlan Turing (Benedict Cumberbatch) is part of an elite group searching for the key to Enigma, the coding system the Germans utilized during World War II. Turing is a genius but is socially awkward as he cannot comprehend jokes or sarcasm, which often causes difficulties between him and the other workers.\r\n\r\nThe humor in \"The Imitation Game\" is often very subtle and can be found in Turing's actions or in snarky comments from his team that completely pass over his head.\r\n\r\n\"The Imitation Game\" has three distinct plot lines, which give a more complete idea of Turing's life. The main plot line is Turing working on Enigma and creating \"Christopher,\" a machine that should solve Enigma and become a \"universal machine.\" The name \"Christopher\" has meaning to the audience because of the second plot line that focuses on his intimate friendship with his only friend Christopher Morcom (Jack Bannon) during high school. Everything gets tied together in the final plot line in which Turing is exposed, not as a Soviet spy, but as a gay man, which was a crime in the United Kingdom until 1967.\r\n\r\nA British film would not be complete without Keira Knightley. Knightley plays Joan Clarke, who outdoes many of the men on the Enigma team and is Turing's closest confidant. Knightley is practically the only female character, but she is strong and refreshing. In order to keep Clarke on the Enigma team, Turing often goes above and beyond by lying to her parents about her \"secretarial job\" and even proposing to her, so she still fits stereotypical women's roles during the time period.\r\n\r\n[caption id=\"attachment_99279\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/cdn.indiewire.jpg\"><img class=\"size-full wp-image-99279\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/cdn.indiewire.jpg\" alt=\"Keira Knightley and Benedict Cumberpatch star in &quot;The Imitation Game.&quot; Knightley is the only star female character and outshines many of the other Enigma team members. \" width=\"400\" height=\"281\" \/><\/a> Keira Knightley and Benedict Cumberbatch star in \"The Imitation Game.\" Knightley is the only star female character and outshines many of the other Enigma team members. Photo courtesy of StudioCanal[\/caption]\r\n\r\nNot only is the film set in an incredibly tenuous time period, but Turing's sexual orientation also causes himself to be a target. Throughout the movie, the idea of his feelings toward Morcom build, and his homosexuality becomes a greater topic as the storyline escalates. The film itself is not about homophobia, but this definitely adds a more contemporary importance to the film.\r\n\r\nThe costumes seem very well done and enhance the setting of the time period. Cumberbatch's performance was amazing, as the audience both loved him for his ideas but felt removed from him with his awkwardness. Even though the film is about a dark time in history, it has plenty of happy and adorable moments. After Cumberbatch understands a clue of how to crack Enigma, the urge to stand up and cheer is undeniable.\r\n\r\n\"The Imitation Game\" is up for eight Oscar nominations. Best Picture, Actor in Leading Role and Actress in Supporting Role are just a few of the possible awards that we can expect from this film.\r\n\r\n<strong>\"The Imitation Game\"<\/strong>\r\n\r\n<strong>1 hour, 54 minutes<\/strong>\r\n\r\n<strong>Rated PG-13 for sexual references and mature thematic material<\/strong>\r\n\r\n<strong>Directed by Morten Tyldum <\/strong>\r\n\r\n<strong>With Benedict Cumberbatch, Keira Knightley and Matthew Goode<\/strong>","excerpt":"Oscar nominee \"The Imitation Game\" features Benedict Cumberbatch as Alan Turing in a biopic about solving Enigma during World War II and preventing further violence.","date":"2015-02-22 17:27:30","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/ig2_0.jpg","categories":["Uncategorized"],"tags":{"39034":"benedict cumberbatch","39031":"best film","39033":"keira knightley","8900":"movie review","8930":"oscars","39032":"the imitation game"}},{"id":99270,"title":"Review: &#8220;Boyhood&#8221; captures audience and time","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-boyhood-captures-audience-and-time\/","content":"[caption id=\"attachment_99358\" align=\"alignnone\" width=\"612\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/image.jpg\"><img class=\"wp-image-99358 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/image.jpg\" alt=\"boyhood image \" width=\"612\" height=\"380\" \/><\/a> Ellar Coltrane portrays the protagonist, Mason, in \"Boyhood.\" Coltrane started shooting for the film at age 7 and finished acting in the final scene 12 years later. Photo courtesy of IFC Films.[\/caption]\r\n\r\nRichard Linklater's \"Boyhood\" is the coming of age story of a young man named Mason (Ellar Coltrane) from ages 5 to 18. The film was shot over 12 years of filming beginning in 2002. It is through this groundbreaking technique we experience Mason's transcendence into adulthood, as he matures and leaves for college, and simultaneously experience the cast and actor Coltrane maturing and growing with him.\r\n\r\nThe feat this film has accomplished is extraordinary and its message universal. It's extraordinary in the sense that the plot is very limited and consists of a series of snapshots of a life, a life that could be anyone's, and yet it is for this reason of simplicity that the audience is drawn in. We empathize with Mason and we see his life reflected in our own. The film's focus is on the passing of time, and as the story progresses we come to see how each character is affected by time, and how they overcome, or fail to overcome its unstoppable progression. Time has been spotlighted in other Richard Linklater's films, such as \"Before Sunrise\", \"Before Sunset\" and \"Before Midnight\". The three films follow a couple as they meet throughout the years and then are forced in each film to say goodbye, time never seeming to stand still for either of them.\r\n\r\nBoyhood does this on a larger scale. The film centers around Mason's family, mainly his father (Ethan Hawke) who left the family when Mason was young, his mother (Patricia Arquette) who left school to support her kids, his sister Samantha (Lorelei Linklater-the directors daughter) a bratty hyperactive elementary schooler and finally Mason, a thoughtful young boy who quietly observes the world around him. The film takes you through Mason's childhood, his parents divorce and then through his mother's failing relationships which force the family to start anew time and time again. From one home to the next, we watch how each new experience affects and changes the family members, and how time helps them recover and grow. Both Hawke and Arquette are remarkable in this film; their performance is raw and truthful. Likewise, Coltrane is able portray Mason with such dreamlike and wistful vulnerability that at the end of the film we are left praying and aching for Mason, hoping that everything will turn out okay for him. You grow to understand and love the characters wholly, and you leave the movie a little different than when you came in, with maybe a slight hint at an understanding of this unstoppable whirlwind called life.\r\n\r\n\"Boyhood\" is nominated for the following six academy awards: Best Picture, Best Supporting Actor, Best Supporting Actress, Best Director, Best Original Screenplay and Best Film Editing. I believe \"Boyhood\" deserves to win best Supporting Actress, Best Picture and Best Director.\r\n\r\n<strong>\"Boyhood\"<\/strong>\r\n\r\n<strong>2 hours, 45 minutes<\/strong>\r\n\r\n<strong>Rated R for language including sexual references, and for teen drug and alcohol use<\/strong>\r\n\r\n<strong>Directed by Richard Linklater<\/strong>\r\n\r\n<strong>Staring Ellar Coltrane, Patricia Arquette, Ethan Hawke and Lorelei Linklater<\/strong>","excerpt":"Richard Linklater's \"Boyhood\" is the coming of age story of a young man named Mason (Ellar Coltrane) from ages 5 to 18. The film was shot over 12 years of filming beginning in 2002.","date":"2015-02-22 17:26:32","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/image.jpg","categories":["Uncategorized"],"tags":{"11967":"academy awards","39045":"Best Director","39018":"best picture","39039":"Boyhood","39040":"Ellar Coltrane","39042":"Ethan Hawke","39043":"Lorelei Linklater","8930":"oscars","39041":"Patricia Arquette","39044":"Richard Linklater"}},{"id":99376,"title":"Review: “Whiplash” provides drama and entertainment","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-whiplash-provides-drama-and-entertainment\/","content":"[caption id=\"attachment_99384\" align=\"alignnone\" width=\"519\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/WHIPLASH.png\"><img class=\"wp-image-99384\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/WHIPLASH.png\" alt=\"WHIPLASH\" width=\"519\" height=\"365\" \/><\/a> \"Whiplash\" stars Miles Teller as Andrew Neiman, a jazz drummer determined to win the approval of his abusive band teacher. It is nominated for five Academy Awards including Best Picture. Photo by Sony Pictures.[\/caption]\r\n\r\nDamien Chazelle’s film “Whiplash” captivates audiences with its talented cast, superb script and intriguing mood, garnering five Academy Award nominations. Despite this deserved success, the film falls slightly flat in terms of character development and realistic plotline.\r\n\r\n“Whiplash” stars  Andrew Neiman (Miles Teller), an ambitious jazz drummer enrolled in a prestigious New York music school. Neiman, initially accepted into the school band as an alternate drummer, is eventually promoted to the jazz band’s core drummer. Conductor Terence Fletcher (J.K. Simmons), however, is abusive to his students, regularly ridiculing and mocking them during rehearsals. Teller’s hopes of gaining Fletcher’s approval soon turn into an obsession which rapidly spirals out of control.\r\n\r\nThe film serves as great entertainment and is captivating throughout. The cast of “Whiplash,” namely J.K. Simmons, effortlessly slide into character and evoke various emotions in the audience. Viewers easily connect with the protagonist and are engrossed by Teller’s arduous journey as he struggles against Fletcher’s harsh classroom rule. Teller’s character traits continuously evolve in the film, allowing for a dynamic and sophisticated plot.\r\n\r\n\"Whiplash\" succeeds in other aspects as well. The movie’s moderate length will not bore most audiences, and the entire film is well-edited as each scene flows on to the next. The script is well written and provides intricate plot twists which will no doubt surprise most viewers. Furthermore, a vague yet constant suspenseful tone combined with as a fast-paced soundtrack created an interesting mood throughout with a positive result.\r\n\r\nAlthough “Whiplash” has a large number of charming qualities, the film still faces a few problems as well. Character development is generally lacking in Simmons’ character and viewers may be disappointed to find how little he has evolved at the end of the film. The plot can also be at times irritatingly unrealistic, forcing the audience to question Teller’s motives throughout.\r\n\r\nDespite the negative aspects of the film, “Whiplash” proved to be an exciting and dramatic film with a colorful cast, alluring plot and intriguing tone which will do little to displease any audience.\r\n\r\n\"Whiplash\" is nominated for the Academy Awards for Best Picture, Best Supporting Actor, Best Adapted Screenplay, Best Film Editing and Best Sound Mixing. Although \"Whiplash\" is unlikely to win Best Picture, it has a chance to take home the awards for Best Supporting Actor, Best Adapted Screenplay and Best Sound Mixing.\r\n\r\n<b>\"Whiplash\"<\/b>\r\n\r\n<b>1 hour, 46 minutes<\/b>\r\n\r\n<b>Rated R for <\/b><b>for strong language including some sexual references<\/b>\r\n\r\n<b>Directed by Damien Chazelle<\/b>\r\n\r\n<b>Starring Miles Teller, J.K. Simmons, Paul Reiser, Melissa Benoist<\/b>\r\n\r\n&nbsp;","excerpt":"Damien Chazelle’s film “Whiplash” captivates audiences with its talented cast, superb script and intriguing mood.","date":"2015-02-22 16:38:37","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/WHIPLASH.png","categories":["Uncategorized"],"tags":{"39053":"academy award","39018":"best picture","39052":"oscars 2015","39051":"whiplash film"}},{"id":99420,"title":"Review: The Oscars 2015 Best Picture Nominees","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-oscars-2015-best-picture-nominees\/","content":"<em>The Academy of Motion Picture Arts and Sciences will host its 87th Academy Awards ceremony at 5:30 p.m. tonight. The Paly Voice reviewed the nominations for Best Picture. Read up on each film before the event.<\/em>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-american-sniper-a-personal-look-into-war\/\">American Sniper<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-birdman-provides-entertainment-and-food-for-thought\/\" target=\"_blank\">Birdman or (The Unexpected Virtue of Ignorance)<\/a>\r\n\r\n<a title=\"Review: &quot;Boyhood&quot; captures audience and time\" href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-boyhood-captures-audience-and-time\/\" target=\"_blank\">Boyhood<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/the-grand-budapest-hotel-is-a-complex-hit\/\" target=\"_blank\">The Grand Budapest Hotel<\/a>\r\n\r\n<a title=\"Review: &quot;The Imitation Game&quot; is a hidden gem\" href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-imitation-game-is-a-hidden-gem\/\" target=\"_blank\">The Imitation Game<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-selma-bridges-past-and-present-with-promise-of-mlks-legacy\/\" target=\"_blank\">Selma<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/the-theory-of-everything-is-beautifully-bittersweet\/\" target=\"_blank\">The Theory of Everything<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-whiplash-provides-drama-and-entertainment\/\" target=\"_blank\">Whiplash<\/a>\r\n\r\n&nbsp;","excerpt":"The Academy of Motion Picture Arts and Sciences will host its 87th Academy Awards ceremony at 5:30 p.m. tonight. The Paly Voice reviewed the nominations for Best Picture. Read up on each film before the event tonight.","date":"2015-02-22 16:30:23","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars.jpg","categories":["Entertainment","Reviews","Spotlight"],"tags":{"11967":"academy awards","39367":"movie reviews","39052":"oscars 2015","37729":"reviews"}},{"id":99426,"title":"Liveblog: Oscars Red Carpet 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/liveblog-oscars-red-carpet-2015\/","content":"[caption id=\"attachment_99448\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/GTY_emma_watson_jef_140303_mn_16x9_9921.jpg\"><img class=\"size-full wp-image-99448\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/GTY_emma_watson_jef_140303_mn_16x9_9921.jpg\" alt=\"Emma Watson poses on the red carpet at the 86th annual Oscars ceremony on March 2, 2014. Photo courtesy of ABC News.\" width=\"600\" height=\"338\" \/><\/a> Emma Watson poses on the red carpet at the 86th annual Oscars ceremony on March 2, 2014. Photo courtesy of ABC News.[\/caption]\r\n\r\n<em>Coming to you from (our sofas) the Red Carpet, The Paly Voice gives live coverage of the Oscars Red Carpet as actors arrive elegantly dressed.\r\n<\/em>\r\n\r\n<em>Editor's Note: The opinions expressed in this article are solely those of the authors alone and are not necessarily those of the The Paly Voice staff. <\/em>\r\n\r\n[liveblog]","excerpt":"Coming to you from (our sofas) the red carpet, The Paly Voice gives live coverage of the Oscars Red Carpet as actors arrive elegantly dressed.","date":"2015-02-22 16:01:49","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/GTY_emma_watson_jef_140303_mn_16x9_9921.jpg","categories":["Uncategorized"],"tags":{"9699":"actors","39084":"actresses","39083":"celebrities","8901":"movies","39052":"oscars 2015","9034":"red carpet"}},{"id":98105,"title":"Review: &#8220;Birdman&#8221; provides entertainment and food for thought","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-birdman-provides-entertainment-and-food-for-thought\/","content":"It’s likely that you’ve heard of Alejandro G. Iñárritu’s “Birdman” as a drama with stellar acting and widespread critical acclaim, but it’s unlikely that you’ve realized what the heck this admittedly strange film is about: a heartwarming, tumultuous and entertaining journey of self-discovery. Riggan Thomson (Michael Keaton) is an actor who once played a character called Birdman in a series of famous superhero movies. He is prominent for playing this role, but being the guy in the bird costume is not what he wants to be remembered for. In an attempt to revive his fading career, middle-aged Riggan develops a Broadway play that adapts a Raymond Carver novel to stage. With this play, he hopes to finally be recognized among true artists and leave behind the ghosts of his past.\r\n\r\nIt is an understatement to say that Riggan’s play is having a hard time getting its feet off the ground. In order to help it become the success he envisions, Riggan replaces one of his lead actors with the eccentric Mike Shiner (Edward Norton), an actor whom theater critics love and is usually at least half naked. Riggan's problems are compounded as he deals with his highly aggressive daughter, Sam (Emma Stone), a recovering drug addict fresh from rehab who also acts as her dad’s assistant.\r\n\r\n[caption id=\"attachment_99278\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-19-at-11.23.40-PM.png\"><img class=\"wp-image-99278\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-19-at-11.23.40-PM.png\" alt=\"Riggan Thomson (Michael Keaton) being closely followed by his alter-ego, Birdman. &quot;Birdman&quot; has been nominated for nine Academy Awards, including Best Picture. Photo courtesy of © 2014 - Fox Searchlight\" width=\"400\" height=\"267\" \/><\/a> Riggan Thomson (Michael Keaton) being closely followed by his alter-ego, Birdman. \"Birdman\" has been nominated for nine Academy Awards, including Best Picture. Photo courtesy of © 2014 - Fox Searchlight[\/caption]\r\n\r\nRiggan’s utter desperation to turn his play into a bona fide work of art bleeds through the barrier of the screen and creeps into your seat. Keaton does a phenomenal job of navigating audience members through the thoughts of Riggan's deeply dysfunctional mind. In an especially memorable set of scenes, Riggan is visited by the hallucination of Birdman, his former self who mocks Riggan's current path and reminds him of his lost glory. (It is interesting to note that much like his character, Keaton has starred in two Batman movies.) These journeys through Riggan’s mind are often accompanied by the idiosyncratic rhythms of percussive instruments, resulting in a jarring, surreal effect.\r\n\r\nThe characters in this film are seriously messed up, so naturally they deliver a ton of great lines. I’ve never listened to so much profundity by insane people using obscene language. Edward Norton doles out some pretty thought-provoking stuff as Mike, and whenever Sam speaks something hilariously cynical is bound to come out. The humor keeps the film running at a pleasant, digestible pace.\r\n\r\nIñárritu expertly takes the audience through the complexities of each and every one of the characters and lets the actors in this film shine. Every performance is raw, passionate and believable. Every detail on set is meticulously accounted for and perfectly blends in against the urban backdrop of New York City.\r\n\r\nThe camera work in this film has been highly recognized for following Riggan’s movements in a way that it seems like everything was shot in one take. It must have taken a ridiculous amount of work and planning to ensure that each scene blends into the next, giving a unique and somewhat dizzying effect to the film.\r\n\r\n“Birdman” has been nominated for nine Academy Awards — Best Picture, Best Actor, Best Supporting Actor, Best Supporting Actress, Best Director, Best Screenplay, Best Sound Mixing and Best Sound Editing. Keaton and Norton are favorites for their respective categories, and the film is a serious contender for Best Screenplay. For Best Director, most critics' decisions are split between Iñárritu and Richard Linklater, the director of \"Boyhood.\"\r\n\r\nSome might say that “Birdman” isn’t for everyone, but I wholeheartedly disagree. Cinephiles will surely appreciate this film’s technical achievements, while more everyday moviegoers will laugh at the dialogue, smile at the characters’ successes and perhaps even tear up at times when things go south. If you care at all about family, the differences between perception and truth or the importance of dignity then there is a high probability you will find some sort of meaning in this groundbreaking film.\r\n\r\n<b>“Birdman”<\/b>\r\n\r\n<b>1 hour, 59 minutes<\/b>\r\n\r\n<b>Rated: R for language throughout, some sexual content and brief violence<\/b>\r\n\r\n<b>Directed by Alejandro G. Iñárritu<\/b>\r\n<p class=\"p1\"><b>Starring: Michael Keaton, Emma Stone, Edward Norton<\/b><\/p>","excerpt":"Nominated for nine Academy Awards, \"Birdman\" is a technical masterpiece that features incredible acting and a quirky plot line.","date":"2015-02-22 15:51:45","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-19-at-11.23.40-PM.png","categories":["Uncategorized"],"tags":{"11967":"academy awards","39018":"best picture","39015":"birdman","39017":"edward norton","11885":"emma stone","8706":"film","39016":"michael keaton","8899":"movie","8930":"oscars","9045":"review"}},{"id":99369,"title":"Review: &#8220;The Theory of Everything&#8221; is beautifully bittersweet","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/the-theory-of-everything-is-beautifully-bittersweet\/","content":"A touching story about one of the world’s most brilliant scientist’s battle with a motor neuron disease, “The Theory of Everything” is a movie about the beauty and tragedy of love and science.\r\n\r\nThe storyline, based on Jane Wilde's memoir \"Traveling to Infinity: My Life with Stephen,\" spans four decades of Stephen Hawking’s life, from his time as a Cambridge student to the publication of his book “A Brief History of Time” and separation from Wilde, his first wife. The story begins as Hawking (Eddie Redmayne) falls in love with Wilde (Felicity Jones) at a New Year’s party at Cambridge. However shortly after their relationship begins, he is diagnosed with Lou Gehrig’s disease, also known as amyotrophic lateral sclerosis, or ALS, and is given two years to live. Wilde's decision to continue their relationship results in an imperfect love story filled with hope, despair, confusion and inspiring perseverance.\r\n\r\nRedmayne delivers a stunning performance, conveying a host of emotions solely through facial expression for the second half of the movie, staying true to the physical limitations of Hawking’s disability. Jones’ portrayal of Wilde is brilliantly imperfect; it preserves the authenticity of the story by not biasing the audience toward her character. The fact that both Stephen Hawking and Jane Wilde approve of this interpretation is a credit to the direction by James Marsh, who has successfully pursued realistic interpretations before with his direction of “Man on a Wire,” which won an Academy Award for Best Documentary Feature in 2008.\r\n\r\n[caption id=\"attachment_99371\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/x900.jpg\"><img class=\"size-full wp-image-99371\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/x900.jpg\" alt=\"Felicity Jones and Eddie Redmayne star in &quot;The Theory of Everything&quot;. Their chemistry and talented performances result in a movie truly worthy of its Best Picture nomination.\" width=\"600\" height=\"399\" \/><\/a> Felicity Jones and Eddie Redmayne star in \"The Theory of Everything.\" Their chemistry and talented performances result in a movie truly worthy of its Best Picture nomination. Photo courtesy of Focus Features.[\/caption]\r\n\r\nOther notable performances include Charlie Cox's portrayal of the character of Jonathan Hellyer Jones, family friend of the Hawkings and Wilde's eventual love interest, and David Thewlis's portrayal of Dennis Sciama, professor and mentor to Stephen, both of whom managed to steal the screen with their unique perspectives.\r\n\r\nThe costumes, setting and cinematography all do a great job of contributing to the story while not distracting the audience from it. Sequences of the film seem to be shot in a bluish filter, which compliment the cool palette seen in Wilde’s blue dresses and Hawking's suits, and ties into Wilde's description of Hawking wearing a blue jacket on the night they met. The beautiful English landscapes and scenes from Cambridge successfully transport the audience to the era of each scene, and the revisiting of certain locations like Wilde’s church and Hawking’s parents’ house help show each character’s transition throughout the movie.\r\n\r\nThe choice to end the poignant film by having Hawking revisit all of his memories traveling back to his first kiss with Wilde reestablishes the sentimentality of Hawking's journey and leaves the audience feeling the irony of the fact that the man without enough time was the first one to explain time to the rest of the world.\r\n\r\n“The Theory of Everything” has been nominated for Best Picture, Best Original Music Score and Best Writing Adapted Screenplay. The movie definitely deserves Best Picture and Best Writing Adapted Screenplay wins, but it may be a little undeserving of the Best Original Music Score because nearly the entire soundtrack is classical piano, and more versatility would have been appreciated. Redmayne and Jones have each been nominated for Best Actor and Actress for their performances.\r\n\r\n<span style=\"color: #000000;\">Stephen Hawking’s story is one that ought to be watched by anyone who has ever doubted the resilience of man or believed that heroes come without flaws; \"The Theory of Everything\" shows that both Hawking and Wilde are such heroes. Though the reality of the Hawking's experience is often brushed over for the sake of the story and deep exploration of Hawking's motivations for ending his relationship with Wilde is lacking, this movie achieves what it sets out to do: tell a poignant story of the strength of two people who, faced with seemingly unsurmountable challenges, rely on their passion and love of life to survive. Bitter for its reality, sweet for its message, \"The Theory of Everything\" is one of the greatest biopics of the year.<\/span>\r\n\r\n<b>\"The Theory of Everything\"<\/b>\r\n\r\n<b>2 hours, 3 minutes<\/b>\r\n\r\n<b> Release Date: Nov. 21, 2014<\/b>\r\n\r\n<b>Rated: PG-13 for some thematic elements and suggestive material<\/b>\r\n\r\n<b>Directed by James Marsh<\/b>\r\n\r\n<b>Starring: Eddie Redmayne, <\/b><b>Felicity Jones<\/b><b>, Charlie Cox, Emily Watson, Simon McBurney, David Thewlis<\/b>","excerpt":"A touching story about one of the world’s most brilliant scientist’s battle with a motor neuron disease, “The Theory of Everything” is a movie about the beauty and tragedy of love and science.","date":"2015-02-22 15:50:16","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/x900.jpg","categories":["Uncategorized"],"tags":{"39049":"eddie redmayne","39048":"felicity jones","39047":"james marsh","39052":"oscars 2015","39050":"stephen hawking","39046":"the theory of everything"}}]