[{"id":103664,"title":"Season update: Boys&#8217; and girls&#8217; swimming optimistic for league championships","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/season-update-boys-and-girls-swimming-optimistic-for-league-championships\/","content":"[caption id=\"attachment_103288\" align=\"alignnone\" width=\"626\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-02-at-2.41.45-AM.png\"><img class=\"size-full wp-image-103288\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-02-at-2.41.45-AM.png\" alt=\"Senior and boys captain, Ryan Drover, swims butterfly during practice. The boys' and girls' swim teams have been training hard and will compete at league championships this week. Photo by George Lu.\" width=\"626\" height=\"419\" \/><\/a> Senior and boys' captain, Ryan Drover, swims butterfly during practice. The boys' and girls' swim teams have been training hard and will compete at league championships this week. Photo by George Lu.[\/caption]\r\n\r\nAs the swim season comes to a strong close, the Palo Alto High School boys' (5-1) and girls' swim team (6-0) will compete at Santa Clara Valley Athletic League Championships this week.\r\n\r\nThe boys' swim team expects to be league champions for the fifth year in a row.\r\n\r\nSenior boys’ captain Ryan Drover is satisfied with how the season has gone up to this point.\r\n\r\n“After our first league dual meet against Gunn being a loss, we finished the remainder of the season strongly, ending our dual meet season on Thursday with a record of 5-1,” Drover said. “We've really just been having a great season as a team, both in and out of the water, and as cliché as it is, I think that that's really created a great environment on the team this year.”\r\n\r\nAccording to Drover, there has been a lot of improvement across the entire team. The boys have become a much deeper team, which bodes well for their championship meets.\r\n\r\n“Some of our guys to watch for in the next weeks are sophomores Ethan Bundy and Alex Liang, juniors Andrew Cho, Matthew Liang, Robert Cheng and Daniel Sing and seniors Oliver Tucher, William Shin, Winston Wang and Ryan Drover,” Drover said.\r\n\r\nIn addition, senior and captain for girls' swimming, Sarah Putulin, is proud that the girls' are going into league championships undefeated.\r\n\r\n“I'm so proud of the girls for what they've accomplished and I can't wait to see them swim really fast at at Leagues [Championships] and CCS [Central Coast Sectionals],” Putulin said.\r\n\r\nAs many girls on the swim team have begun tapering, Putulin is excited for the time drops that are likely to come with it.\r\n\r\n“I'm very confident that we'll win Leagues [Championships] and that we'll place top 5 at CCS, \" Putulin said. “We have the talent and the depth to pull through. In addition, we have a fast and young team and I know we'll do great.”\r\n\r\nLeague Championships will take place at 4 p.m on Wednesday, May 6 for the girls and Thursday, May 7 for the boys at Saratoga High School.","excerpt":"As the swim season comes to a strong close, the Palo Alto High School boys' and girls' swim team will compete at SCVAL Championships this week.\r\n","date":"2015-05-06 19:23:38","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-02-at-2.41.45-AM.png","categories":["Sports","Spotlight"],"tags":{"8568":"CCS","15411":"leagues","8944":"palo alto high school","8953":"paly","40102":"ryan drover","40100":"sarah putulin","9143":"Swimming"}},{"id":103687,"title":"Liveblog: Boys&#8217; lacrosse takes Mountain View tonight for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/liveblog-boys-lacrosse-takes-mountain-view-tonight-for-senior-night\/","content":"<span style=\"color: #000000;\">The Palo Alto High School boys’ lacrosse team (15-9-1, 4-6) will take on the Mountain View High School Spartans (15-11, 5-3) at 7 p.m. tonight at the Paly lacrosse field. The stakes are high, as this game determines the No. 2 seed versus the No. 3 seed in the upcoming playoffs.<\/span>\r\n\r\n<span style=\"color: #000000;\">As the last league and home game, there will be a Senior Night celebration before the game at 6:45 p.m. The 11 seniors on the team will be lauded for their high school lacrosse achievements, and their future plans will be announced.<\/span>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School boys’ lacrosse team (15-9-1, 4-6) will take on the Mountain View High School Spartans (15-11, 5-3) at 7 p.m. tonight <a href=\"http:\/\/palyvoice.com\/2015\/05\/06\/liveblog-boys-lacrosse-takes-mountain-view-tonight-for-senior-night\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-06 18:53:41","author":"Chloe Fishman","categories":["Uncategorized"],"tags":[]},{"id":103646,"title":"Slideshow: Students participate in 93rd May Fête parade","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/slideshow-students-participate-in-93rd-may-fete-parade-2\/","content":"On Saturday, members of the Palo Alto community gathered downtown for the 93rd Annual <a href=\"http:\/\/pamayfetefair.com\/\">City of Palo Alto May Fête Children's Parade<\/a>. The event brought together several community groups and organizations to celebrate this year's theme, \"No Space to Alienate.\" Among the marchers in the parade were representatives of the Palo Alto High School community, including Key Club, the Robotics team, the Pep Band and the cheerleading team.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A0AAQj8OEJoE\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Several student groups joined the Palo Alto community downtown during the 93rd Annual City of Palo Alto May Fête Children's Parade last Saturday.","date":"2015-05-06 17:25:00","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DSC_0280.jpg","categories":["Multimedia","News","Slideshow"],"tags":{"29374":"andrew lu","43603":"august soderberg","43598":"cheerleading","43601":"children's parade","43602":"joelle dong","43597":"key club","43592":"may fete parade","43604":"paly pep band","29485":"paly robotics","15094":"parade"}},{"id":103673,"title":"Preview: Boys&#8217; lacrosse to play Mountain View for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/06\/preview-boys-lacrosse-to-play-mountain-view-for-senior-night\/","content":"The Palo Alto High School boys' lacrosse team (15-9-1, 4-6) will take on the Mountain View High School Spartans (15-11, 5-3) at 7 p.m. tonight at the Paly lacrosse field. The stakes are high, as this game determines the No. 2 seed versus the No. 3 seed in the upcoming playoffs.\n\nAlthough there is not a major rivalry between the two teams, senior team captain Zach Levitan is excited for a rematch after losing to Mountain View earlier this season.\n\n\"We only had four starters due to either injury or other conflicts,\" Levitan said.&nbsp;\"They [Mountain View] have been in our league since the beginning, and we always look forward to playing them.\"\n\nTo add to the already competitive nature of the game, current Paly coach DJ Shelton was previously an assistant coach at Mountain View.\n\nAs the last league and home game, there will be a Senior Night celebration before the game at 6:45 p.m. The 11 seniors on the team will be lauded for their high school lacrosse achievements, and their future plans will be announced.\n\nLevitan highlighted the gravity of playing on Senior Night.\n\n\"To play your final game at home under the lights is a big deal,\" Levitan said. \"Senior Night's&nbsp;always a fun time, especially when we win.\"\n\nThe Vikings are looking forward to the league playoffs. In addition to the benefit of winning No. 2 seed, the winner of the game will gain home field advantage for the semi-finals, according to Levitan.\n\nThe Viking senior boys who are graduating are Jon Rogers, Ethan Jorasch, Zach Levitan, Maclean Mansfield, Jack Stephenson, Michael Beisheim, Scott Andrews, Owen Staiger, Eric Whitson, Josh Torres and Ricardo Huerta.","excerpt":"The Paly boys' lacrosse team will take on the Mountain View High School Spartans at 7 p.m. tonight at the Paly lacrosse field. The stakes are high, as this game determines the No. 2 seed versus the No. 3 seed in the upcoming playoffs.","date":"2015-05-06 15:55:25","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0145.jpg","categories":["Sports"],"tags":{"43605":"boys varsity lacrosse","19371":"DJ Shelton","8836":"Lacrosse","29989":"mountain view","9087":"Senior Night","12052":"zach levitan"}},{"id":103636,"title":"Girls&#8217; lacrosse triumphs over Mountain View on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/05\/girls-lacrosse-triumphs-over-mountain-view-on-senior-night\/","content":"The Palo Alto High School girls' lacrosse team (16-1, 12-0) dominated Mountain View High School (7-13, 5-9), 16-2, tonight in the Vikings' last league game at home this season.\r\n\r\nThe Vikings were unstoppable in the first half, scoring a total of 10 goals by junior Maya Benatar and seniors Liana Pickrell, Lisa Rogge, Claire Chevallier, Allie Peery and Paige Bara.\r\n\r\n\"I think we played well,\" Bara said. \"We were happy to get a shutout in the first half and just get some goals off.\"\r\n\r\nWith this being the final league game of their high school careers at home, all the seniors were thrust into the spotlight and put into scoring positions.\r\n\r\n\"I think it was good to see all the seniors participating, playing different positions, getting a lot of playing time and getting together,\" Bara said.\r\n\r\nAccording to senior defender Paige Anderson, it was not just the seniors who played a strong game, but the whole team.\r\n\r\n\"We handled the ball well and kept possession well,\" Anderson said. \"I think overall it was really good, especially on attack.\"\r\n\r\nHead coach Jamie Nesbitt echoed Anderson's sentiments.\r\n\r\n\"They played very well,\" Nesbitt said. \"I think senior nights can be tough sometimes emotionally, but we came out hard from the start which was awesome.\"\r\n\r\nMountain View player Hannah Robinson explained that the competition turned out enjoyable.\r\n\r\n\"I think we [Mountain View] definitely played pretty well as a team,\" Robinson said. \"Paly’s a great team, so we were up for some pretty tough competition but [Paly] did great and so I had a lot of fun, and I think everyone else did too.\"\r\n\r\nThe Vikings are heading into the Santa Clara Valley Athletic League playoffs with strong leadership, according to Bara, and are hopeful that this will carry them far.\r\n\r\n\"I think we’re really excited just to kind of prove ourselves as a team,\" Bara said. \"Since we have so many seniors I think we have a lot of leadership, and so I think that really shows and so that’ll show in the playoffs.\"\r\n\r\nComing off of an undefeated league season, Nesbitt believes Paly can find success in the playoffs postseason.\r\n\r\n\"I think for us it’s [success is] keeping the momentum going up and not just finishing out,\" Nesbitt said. \"I know we’re going in favored, but it’s actually finishing how we want and making sure the outcome at the end of the game is really what we wanted.\"\r\n\r\nAccording to Anderson, the team is on the right track for ultimate success.\r\n\r\n\"I am looking forward to being pumped up and outworking them [the other teams], because I think we already have the skill, \" Anderson said. \"It’s just a matter of working hard.\"","excerpt":"The Palo Alto High School girls' lacrosse team (16-1, 12-0) dominated Mountain View High School (7-13, 5-9), 16-2, tonight in the Vikings' last league game at home this season.","date":"2015-05-05 23:21:55","author":"Molly Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/390.jpg","categories":["Sports","Spotlight"],"tags":{"43599":"allie peery","8736":"girls' lacrosse","8802":"jamie nesbitt","8836":"Lacrosse","12016":"lax","29989":"mountain view","41721":"paige anderson","43600":"paige bara","9120":"sports","38315":"undefeated","31305":"victory"}},{"id":103061,"title":"Voice of the Week: Oskar Soderberg","permalink":"http:\/\/palyvoice.com\/2015\/05\/05\/voice-of-the-week-oskar-soderberg\/","content":"<em>This week, The Paly Voice sat down with senior Oskar Soderberg, fondly known by his friends as \"The SharkSlayer,\" to talk about Twitter, the drought and dogs with Facebooks. <\/em>\r\n\r\n<em>Editor's Note: The following is an abridged interview.<\/em>\r\n\r\n[caption id=\"attachment_103357\" align=\"aligncenter\" width=\"580\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/20150501_153331.jpg\"><img class=\"wp-image-103357\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/20150501_153331.jpg\" alt=\"Senior Oskar Soderberg, also known as &quot;SharkSlayer&quot; looks through his &quot;'nocs.&quot; Photo by Hannah Nguyen\" width=\"580\" height=\"327\" \/><\/a> Senior Oskar Soderberg looks through his binoculars, or as he prefers to call them, 'nocs. Photo by Hannah Nguyen.[\/caption]\r\n\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41057\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41056\" class=\"yiv8050331174\">\r\n\r\nOskar Soderberg: Before we start, and I want this part published, I want full approval over this. Okay? I want full creative approval.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41073\" class=\"yiv8050331174\">\r\n\r\nThe Paly Voice: Sounds good. We'll make that happen for you.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41074\" class=\"yiv8050331174\">\r\n\r\nOS: OK, alright.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41075\" class=\"yiv8050331174\">\r\n\r\nPV: Rumor has it you store your apps by color. Is this true?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41076\" class=\"yiv8050331174\">\r\n\r\nOS: No, that's a malicious lie. My apps are alphabetically sorted.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41077\" class=\"yiv8050331174\">\r\n\r\nPV: Do you have enemies that you think fabricated that rumor?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41078\" class=\"yiv8050331174\">\r\n\r\nOS: You know, I do. And there are people I could name right now. And I could blast their name on the Internet. But, where does that get any of us, you know? I don't know who it was that said it, George Washington Carver maybe, \"an eye for an eye makes the whole world blind.\"\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41146\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41145\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41147\" class=\"yiv8050331174\">\r\n\r\nPV: So you were the star of \"The Drowsy Chaperone.\" Did you decide on a name for the Man in Chair, and what is it?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41148\" class=\"yiv8050331174\">\r\n\r\nOS: Wow, gotcha, journalism at its finest. So for those who don't know, \"The Drowsy Chaperone\" was the musical here at Paly, and the Man in the Chair was my role, and the character wasn't named. So, I did come up with a name. But you know, I think that's something I'd like to keep private. Okay, here's a life lesson. We live in this age of new everything, and sometimes you have to keep a few things for yourself. You have to say, \"this is mine.\" What happened to the art of preservation? Somebody riddle me that.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41150\" class=\"yiv8050331174\">\r\n\r\nPV: We hear you're directing a One Act written by Guive Assadi, starring your Twitter nemesis <a id=\"yiv8050331174yui_3_16_0_1_1430719751519_41149\" class=\"yiv8050331174\" style=\"color: #196ad4;\" href=\"https:\/\/twitter.com\/CaptainGenovia\" target=\"_blank\" rel=\"nofollow\">@CaptainGenovia<\/a> also known as<a class=\"yiv8050331174\" style=\"color: #196ad4;\" href=\"http:\/\/palyvoice.com\/2014\/10\/07\/voice-of-the-week-zoe-limbrick\/\" target=\"_blank\" rel=\"nofollow\"> Zoë Limbrick<\/a>. How's that going? Can you describe the process for us?\r\n<div class=\"yiv8050331174\">\r\n\r\nOS: Well there's a lot to talk about there. I mean the One Acts are going great. I don't want to say too much. Twitter nemesis is the phrase you used. Yeah, I agree. I think that's an apt assessment of that relationship. I think all I can say there is come see it.*\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41105\" class=\"yiv8050331174\">\r\n\r\nPV: So you obviously have a <a class=\"yiv8050331174\" style=\"color: #196ad4;\" href=\"https:\/\/twitter.com\/oskarsod\" target=\"_blank\" rel=\"nofollow\">historic Twitter feed<\/a> as well, but a lot of us want to know, what's your beef with NASA on Twitter?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41106\" class=\"yiv8050331174\">\r\n\r\nOS: Wow, what a lowball question. You know, my Twitter, it's not what it used to be, I'll say that. I think my Twitter peaked last year. And you know, the NASA thing, my problem is if you don't understand it,then you don't understand it and it's not meant for you. OK? You either get it or you don't.\r\n\r\nPV: What's your opinion on the California drought?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41143\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41055\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41054\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41127\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41128\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41053\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41106\" class=\"yiv8050331174\">\r\n<div id=\"yui_3_16_0_1_1430719751519_61720\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41144\" class=\"yiv8050331174\">\r\n\r\nOS: The drought. Oh god. I don't know. The children. It's beyond words. If I had to boil down my thoughts into a nice little concise paragraph fit for this publication, it would be this: There's a finite amount of water on this planet, and 97% of that water is the ocean. About 2% of it is frozen, and less than 1% of it is available for our drinking water and other uses, and I think the fact there's not enough of it is criminal.\r\n<div id=\"yui_3_16_0_1_1430719751519_61737\" class=\"yiv8050331174\">\r\n\r\nPV: Where does your nickname, the \"SharkSlayer,\" originate from?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41079\" class=\"yiv8050331174\">\r\n\r\nOS: SharkSlayer? I think freshman year. I was in English class, and this kid came up to me, I'll leave his name out of this, he said to me, \"Oskar the Shark Slayer.\" And I was like \"what?\" but this continued for several months. I adopted that nickname. I looked it up though, because I was like, \"where did he come up with that?\" and there was actually an animated film made, \"Shark Tale.\" The protagonist of the film — a fish — is named Oscar and he becomes known as Oscar the Shark Slayer, I believe.**\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41107\" class=\"yiv8050331174\">\r\n\r\nPV: So according to our sources, you didn't spend freshman year at Paly. Where were you?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41108\" class=\"yiv8050331174\">\r\n\r\nOS: I don't like to talk about. Oh, that's wrong, I do like to talk about it. I'm from Minneapolis, Minnesota.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41109\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41080\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41081\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41082\" class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41110\" class=\"yiv8050331174\">\r\n\r\nPV: OK then. Describe your aesthetic in one word.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41084\" class=\"yiv8050331174\">\r\n\r\nOS: I feel like this is a loaded question, because there is one word that describes it, and that word is bounded on the end by two t's — that's right. Tourist.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41083\" class=\"yiv8050331174\">\r\n\r\nPV: Tell us about your history with binoculars and the tourist look.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41049\" class=\"yiv8050331174\">\r\n\r\nOS: Well I purchased my first pair — first of all I just want to correct you said, you called them binoculars, the technical term is 'nocs. Spelled apostrophe-n-o-c-s. I want that on the record. I think the tourist aesthetic spawned as a result of the 'nocs, not vice versa. It wasn't the tourist aesthetic that was aided by 'nocs, it was 'nocs that were aided by the tourist aesthetic. Yeah, I know it's not cool to employ a tourist aesthetic, I know that's not what you guys call cool. But I do. That's me, that's Oskar, that's my identity.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41050\" class=\"yiv8050331174\">\r\n\r\nPV: I'd argue that employing a tourist aesthetic is cool.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41051\" class=\"yiv8050331174\">\r\n\r\nOS: Oh, I appreciate that. I do.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41170\" class=\"yiv8050331174\">\r\n\r\nPV: What's your opinion on dogs with Facebooks?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41052\" class=\"yiv8050331174\">\r\n\r\nOS: [Face palms]. I think if Charles Darwin was here today, and he saw what the dog evolved to, I don't think he'd be happy.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41048\" class=\"yiv8050331174\">\r\n\r\nPV: Is that all?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41043\" class=\"yiv8050331174\">\r\n\r\nOS: Oh no, I have more to say. It's a gross misuse of resources. Here are the facts. Humans love dogs. Dogs and humans are friends. And I think that being said, they're not people! They don't need Facebook! They don't have friends! They don't need social networking! They have dog parks for that. I think Facebook is the human dog park, if that's the headline quote, so be it. I think for dogs to come onto the human dog park- Facebook- it's malicious. Salacious. Outrageous.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41044\" class=\"yiv8050331174\">\r\n\r\nPV: What is the last thing you want to say to the Paly community?\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41045\" class=\"yiv8050331174\">\r\n\r\nOS: A key part of who I am is someone who is living in the present. You especially see this in art, people who reject the new and maintain that things from the past are the correct or the true or the ultimate or the best thing. I disagree with that. I think we need to embody the present and learn from the past but also learn from the present.\r\n<div class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41046\" class=\"yiv8050331174\">\r\n\r\n*Paly One Acts 2015 will take place on May 7-9 at 7:30 in the Haymarket Theatre.\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41047\" class=\"yiv8050331174\">\r\n\r\n**\"Shark Tale\" is a 2004 film that did in fact feature a protagonist referred to as Oscar, The Shark Slayer.\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41073\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41074\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41075\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41076\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41077\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41078\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41146\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41145\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41147\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41148\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41150\" class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41105\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41143\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41055\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41054\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41127\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41128\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41053\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41106\" class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41144\" class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41079\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41107\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41108\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41109\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41080\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41081\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41082\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41110\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41084\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41083\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41049\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41050\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41051\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41170\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41052\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41048\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41043\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41044\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41045\" class=\"yiv8050331174\">\r\n<div class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41046\" class=\"yiv8050331174\">\r\n<div id=\"yiv8050331174yui_3_16_0_1_1430719751519_41047\" class=\"yiv8050331174\">\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"This week, The Paly Voice sat down with senior Oskar Soderberg to talk about Twitter, the drought and dogs with Facebooks.\r\n","date":"2015-05-05 21:51:25","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/20150501_153331.jpg","categories":["Features","Spotlight","Voice of the Week"],"tags":{"42895":"'nocs","42892":"blogspot","42893":"california drought","42891":"california person","42903":"dogs with facebook","29490":"drought","42906":"human dog park","42905":"minneapolis","42904":"minnesota","17503":"NASA","42890":"oskar soderberg","42894":"shark slayer","42901":"tourist aesthetic","29808":"twitter","29690":"zoe limbrick"}},{"id":103225,"title":"Timeline: April 2015 News in Review","permalink":"http:\/\/palyvoice.com\/2015\/05\/05\/timeline-april-2015-news-in-review\/","content":"<em>This is the fourth installment of the News in Review series, which summarizes the most important news stories and events from the month of April in a timeline format.<\/em>\r\n\r\n<iframe src=\"http:\/\/cdn.knightlab.com\/libs\/timeline\/latest\/embed\/index.html?source=0AmmgLOliFmExdFlNd3ZmUGFLWUI4V0JFbVE1eXJRa3c&amp;font=Bevan-PotanoSans&amp;maptype=watercolor&amp;lang=en&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This is the fourth installment of the News in Review series, which summarizes the most important news stories and events from the month of April in a timeline format.","date":"2015-05-05 19:19:59","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-04-at-10.04.00-PM.png","categories":["Multimedia","Spotlight"],"tags":{"19460":"2015","43374":"april","10012":"emily hwang","40814":"jeanette wong","9765":"multimedia","8916":"news","38267":"news in review","43373":"stories","29797":"timeline"}},{"id":103535,"title":"Liveblog: Girls&#8217; lacrosse plays Mountain View for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/05\/liveblog-girls-lacrosse-plays-mountain-view-for-senior-night\/","content":"<span style=\"color: #000000;\">The Palo Alto High School girls’ lacrosse team (15-1, 11-0) is playing the Mountain View High School Spartans (7-12, 5-8) tonight at 7 p.m. at the Paly lacrosse field. T<\/span><span style=\"color: #000000;\">here is very little at stake here for the Vikings who are playoff-bound.<\/span>\r\n\r\n<span style=\"color: #000000;\">As the last home game of the season, there is a Senior Night celebration preceding the game at 6:45 p.m. The senior players are being honored for their hard work on the team throughout the years. <\/span>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School girls’ lacrosse team (15-1, 11-0) is playing the Mountain View High School Spartans (7-12, 5-8) tonight at 7 p.m. at <a href=\"http:\/\/palyvoice.com\/2015\/05\/05\/liveblog-girls-lacrosse-plays-mountain-view-for-senior-night\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-05 18:48:50","author":"Molly Fogarty","categories":["Uncategorized"],"tags":[]},{"id":103542,"title":"Kathi Bowers to replace Jason Fung as athletic director","permalink":"http:\/\/palyvoice.com\/2015\/05\/05\/kathi-bowers-to-replace-jason-fung-as-athletic-director\/","content":"Palo Alto High School math teacher Kathi Bowers will replace Jason Fung as the athletic director beginning in the 2015-16 school year, according to a statement released by Principal Kimberly Diorio to staff this morning.\r\n\r\nFung is not leaving Paly — he will continue to be a Physical Education teacher and coach for the track and football teams. He says he decided to step down from the athletic director position because he wants to focus on instructing.\r\n\r\n“At my job [as athletic director], I don’t get to see the students,” Fung said. “I’m going back to teaching, going back to what I enjoy doing [coaching].”\r\n\r\n[caption id=\"attachment_103544\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11186372_679132575547270_1565870167_n.jpg\"><img class=\"wp-image-103544\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11186372_679132575547270_1565870167_n.jpg\" alt=\"Bowers teaching an Introduction to Analysis and Calculus Class about limits. Bowers will replace Fung as Athletic Director next year, though she will still teach one math class.\" width=\"350\" height=\"304\" \/><\/a> Math teacher Kathi Bowers teaches an Introduction to Analysis and Calculus Class about limits. Bowers will replace Jason Fung as Athletic Director next year, though she will still teach one math class. Photo by Josh Yuen.[\/caption]\r\n\r\nAlthough Bowers has been a math teacher at Paly for a total of 27 years, she says becoming an athletic director was her intended career path after graduating from college.\r\n\r\n“It was actually what I thought I was going to do,” Bowers said. “But then I got derailed, and then I started teaching — because you have to have a teaching credential to do it [be an athletic director] in a high school. … I’m looking for a change.”\r\n\r\nAs athletic director, Bowers will be responsible for running the entire after-school athletic program.\r\n\r\n“It comes down to making sure that everything runs smoothly,” Bowers said. “[I will] check eligibility, transfers, student grades, transportation, schedules and evaluate coaches.”\r\n\r\nHer main focus of the year, however, will be the management of the gym construction project, which is set to begin this summer. According to Bowers, Paly will not have gyms or pools during the construction process.\r\n\r\n“For 18 months we’re going to have to find practice space for every indoor team and our aquatic teams,” Bowers said. “That means you have to find [space\/facilities] and get to practice everyday and find a place to play. … All of that stuff will be an added challenge.”\r\n\r\nIn addition, Bowers has several other goals which she will be addressing in the next school year.\r\n\r\n“I’m also looking to increase student involvement [in athletics] a little bit more,” she said. “Not necessarily [just] with athletes but in other roles. I’d like the Sports Careers class to get involved in things like [becoming] information directors, announcers or working with trainers — looking for places for kids who aren’t on sports teams to still be involved in the program in a variety of ways.”\r\n\r\nBowers also says she wants to bridge the gap between the athletic and educational aspects of school.\r\n\r\n“My other goal is to strengthen the partnership between athletics and academics,” Bowers said. “I think sometimes they exist in parallel universes and I’d like to see more overlap between them.”\r\n\r\nAfter the construction project is concluded, Bowers hopes to improve communication between the athletic department and the rest of the school.\r\n\r\n\"I believe we could just really tap into their [students'] strengths or to improve the communication between sports, the publication, the newspaper, the teachers on campus, everything,\" Bowers said.\r\n\r\nAccording to Bowers, her experience as a math teacher and sports team coach will help her achieve these goals.\r\n\r\nBowers will teach one math class next year, but will budget 80 percent of her time for her responsibilities as athletic director. She says one of her concerns is the transition to spending significantly less time teaching.\r\n\r\n“My biggest worry about the job is that I’m going to miss the classroom because I’ve been doing it for 27 years,” Bowers said. “That’s partially why I wanted to teach at least one class because I don’t want to leave that connection behind.”","excerpt":"Palo Alto High School math teacher Kathi Bowers will replace Jason Fung as the new athletic director beginning in the 2015-16 school year.","date":"2015-05-05 17:48:17","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11186372_679132575547270_1565870167_n.jpg","categories":["News","Spotlight"],"tags":{"12357":"athletic director","43484":"athletics","43482":"bowers","43483":"fung","23905":"goals","8753":"gym","43552":"jason","43481":"kathi","8871":"math","8944":"palo alto high school","8953":"paly","9120":"sports"}},{"id":102903,"title":"Palo Alto opens nation&#8217;s first all-inclusive park","permalink":"http:\/\/palyvoice.com\/2015\/05\/04\/palo-alto-opens-nations-first-all-inclusive-park\/","content":"As children, most people don't thinks twice about their abilities to run around on play structures or glide through the air on swings. Nevertheless, for children with disabilities, this is often an impossibility.  An ideal summer full of seesaws and slides is a far-fetched and an impractical dream.\r\n\r\n[caption id=\"attachment_102942\" align=\"alignright\" width=\"319\"]<img class=\"wp-image-102942\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11128435_840577942684962_475924628_n1.jpg\" alt=\"11128435_840577942684962_475924628_n\" width=\"319\" height=\"239\" \/> The entrance to the Magical Bridge playground \"where everyone can play!\" The playground opened April 18 at Mitchell Park in Palo Alto, drawing in a hundreds of people. Photo by Emilia Diaz-Magaloni.[\/caption]\r\n\r\nHowever, this month, Palo Alto introduced a revolutionary new park completely inclusive to all individuals. The Magical Bridge Playground drew a large crowd during its grand opening on April 18 at Mitchell Park and included performances by differently abled children on the community stage.\r\n\r\nAccording to Jill Asher, co-creator of the playground, outdoor play is an essential way for young children to develop gross motor skills and to form friendships.\r\n\r\nThe idea began when Olenka Villarreal, a Palo Alto mom, could not take her child with special needs to any of the 34 parks in Palo Alto. Instead, Villarreal was forced to spend $150 an hour on a round-trip to San Jose so that her daughter could simply swing on a special swing set, Asher said.\r\n\r\nDespite Villarreal's complaints to the City of Palo Alto regarding the lack of inclusivity in the city parks, all city parks were compliant with the requirements of the <a href=\"http:\/\/www.ada.gov\/\">Americans with Disabilities Act.<\/a> An ADA-compliant park gives differently abled children the ability to enter the park, but not necessarily the ability to play in it. Villarreal soon decided to make matters into her own hands.\r\n\r\nAfter six years of extensive planning and nine months of building, Villarreal utilized $4 million raised through fundraising and the $300,000 given by the City of Palo Alto to finally turn her dream into a reality.\r\n\r\n“It truly is a playground for everybody regardless of physical and cognitive disabilities or abilities,” Asher said.\r\n\r\nAccording to Nick Peterson, head contractor of the project, the park is separated into seven different zones: the kindness corner, picnic\/playhouse zone, slide zone, music zone, swinging\/sway zone, spinning zone and tot zone.\r\n\r\nAccording to Peterson, the inclusion experts and contractors have been working hard to make sure every structure and surface is inclusive to all cognitive and physical disabilities. For example, every inch of the park is covered in a special surface that is wheelchair-friendly, making it easier for all children to get around the park.\r\n\r\n[caption id=\"attachment_102943\" align=\"alignright\" width=\"215\"]<img class=\"wp-image-102943\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11185441_840578059351617_467290310_n.jpg\" alt=\"11185441_840578059351617_467290310_n\" width=\"215\" height=\"287\" \/> This is one of the 'magical bridges' in the Magical Bridge park. These bridges help children with physical disabilities reach elevated heights in the park. Photo by Emilia Diaz-Magaloni[\/caption]\r\n\r\nBoth audio and visual tools are integrated into all seven zones alongside the different slides and structures to help children with disabilities.\r\n\r\n“Its important to include a lot of audio and visual for all the abilities and disabilities that kids have,” Peterson said.\r\n\r\nCo-founder Asher hopes that everyone, from children to teens, will enjoy the Magical Bridge Playground.\r\n\r\n“We hope that teenagers from Palo Alto High School will come and have discussions about being kind and compassionate and a good friend,” Asher said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Magical-Bridge-Park-1.m4a\"][\/audio]\r\n\r\n<em>Audio: Children perform \"part of your world\" during the grand opening of the Magical Bridge Playground<\/em>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Untitled-Infographic-3.jpeg\"><img class=\"alignnone  wp-image-103421\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Untitled-Infographic-3.jpeg\" alt=\"Magical Bridge tour \" width=\"1215\" height=\"2111\" \/><\/a>","excerpt":"As children, most people don&#8217;t thinks twice about their abilities to run around on play structures or glide through the air on swings. Nevertheless, for children <a href=\"http:\/\/palyvoice.com\/2015\/05\/04\/palo-alto-opens-nations-first-all-inclusive-park\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-04 15:36:08","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/2x4w8K9D_WGksIHBlL86BSmgGRcAUcUd5DdYw5VEr_0.png","categories":["News","Spotlight"],"tags":{"42424":"All inclusive","42425":"disability","42423":"Magical bridge park","8939":"palo alto","33857":"park"}}]