[{"id":109360,"title":"Contests provide students opportunity to voice political opinions","permalink":"http:\/\/palyvoice.com\/2015\/11\/03\/contests-provide-students-opportunity-to-voice-political-opinions\/","content":"[caption id=\"attachment_111315\" align=\"alignnone\" width=\"557\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/voting.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/voting.jpg\" alt=\"The cartoon contest will give students a chance to express their political beliefs. Illustration by Portia Barrientos.\" width=\"557\" height=\"557\" class=\"size-full wp-image-111315\" \/><\/a> \r\nThe cartoon contest will give students a chance to express their political beliefs. Illustration by Portia Barrientos.[\/caption]\r\n\r\nIn an effort to get more high schoolers to participate in politics, a civic education project is offering an essay and a cartoon contest from which students can win prizes. \r\n\r\nLegischool, a civic education project that is working with California State University, Sacramento on this project, will award a round trip to Sacramento to meet and talk with state legislators to the winner of the essay contest and prize money to the winner of the cartoon contest.  According to LegiSchool Project Director Terre Thorne, the contests' goal is to get more teens involved with government policies.\r\n\r\n\"LegiSchool’s mission is to engage high school students in matters of public policy and state government,\" Thorne said. \"One of the ways we hope to achieve that goal is through our contests, which we created to get students thinking critically about important issues. Our hope is that participation in our contests will make government relevant to young people and inspire an interest in civic life.\"\r\n\r\nAccording to the LegiSchool Project website, the <a href=\"http:\/\/www.csus.edu\/calst\/LegiSchool_contests\/2015EssayFlyer.pdf\" target=\"_blank\">essay contest<\/a> requires students to write about their opinions on issues regarding low voter turnout among youth. The competition is available to all juniors and seniors in California.\r\n\r\nThe top 10 students will win a trip to Sacramento and get the chance to meet state legislators and share their ideas with them. \r\n\r\nAccording to Thorne, participants in the <a href=\"http:\/\/www.csus.edu\/calst\/LegiSchool_contests\/2015_Art_Contest.pdf\" target=\"_blank\">cartoon contest<\/a> must write an original political cartoon about a current political issue. All high schoolers can participate and students can only write one cartoon. The student who draws the most creative cartoon will win $150 and the next four runner-ups will win $100 each. The top five cartoons will also be showcased on <a href=\"http:\/\/www.kqed.org\/\" target=\"_blank\">KQED.org<\/a>.\r\n\r\nThe deadline for the essay competition is Nov. 18 and the deadline for the cartoon contest is Dec. 4.\r\n\r\n&nbsp;\r\n\r\n\r\n&nbsp;","excerpt":"In an effort to get more high schoolers to participate in politics,  a civic education project is offering an essay and a cartoon contest from which students can win prizes. ","date":"2015-11-03 19:34:25","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/voting.jpg","categories":["News"],"tags":["Barrientos","cartoon","contest","essay","Legischool","Politics","youth"]},{"id":111304,"title":"Liveblog: Girls’ volleyball plays Los Gatos on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/11\/03\/liveblog-girls-volleyball-plays-los-gatos-on-senior-night\/","content":"Check back at 6:45 p.m. for live coverage as Palo Alto High School girls’ volleyball team takes on Los Gatos High School on its Senior Night.\r\n\r\n[liveblog]","excerpt":"Check back at 6:45 p.m. for live coverage as Palo Alto High School girls’ volleyball team takes on Los Gatos High School on its Senior Night.","date":"2015-11-03 10:56:03","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Volleyball.png","categories":["Sports","Spotlight","Volleyball"],"tags":["girls volleyball","los gatos","paly","sports","VIKES"]},{"id":111279,"title":"The Great Minds at Campus welcomes John Markoff","permalink":"http:\/\/palyvoice.com\/2015\/11\/03\/the-great-minds-at-campus-welcomes-john-markoff\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_98085\" align=\"aligncenter\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/mac.jpg\"><img class=\"wp-image-98085\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/mac.jpg\" alt=\"John Markoff will be the first speaker of The Great Mind at Campus Speaker Series in November. The event takes place in Paly's Media Arts Center and encourages students to learn more about working towards great achievements and goals. Photo by William Zhou\" width=\"599\" height=\"449\" \/><\/a> John Markoff will be the first speaker of The Great Mind at Campus Speaker Series in November. The event takes place in Paly's Media Arts Center and encourages students to learn more about working towards great achievements and goals. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Great Minds at Campus Speaker Series will welcome current New York Times writer John Markoff at 7 p.m. on Nov. 3 in the Palo Alto High School Media Arts Center. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The  Speaker Series is a way to show students what they can accomplish in the future through a variety of speakers who were locally educated and have had success in the fields they have a passion for.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Markoff is a Paly alumnus of the Class of 1967. Today, Markoff is a senior writer for the New York Times working mainly in the science section.<\/span>\r\n\r\n\"I hope to give the audience a sense of some of the significant changes and trends in Silicon Valley,\" Markoff told the Paly Voice in an email.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" data-reactid=\".15x.1:$mid=11446532344729=2ad8a1eab1b1ba6ba82\">\r\n<div class=\"_3ry4\" data-reactid=\".15x.1:$mid=11446532344729=2ad8a1eab1b1ba6ba82.2:1\">\r\n\r\n In 2013, Markoff and his team won the Pulitzer Prize, a highly regarded achievement in journalism, for <a href=\"http:\/\/www.pulitzer.org\/works\/2013-Explanatory-Reporting\" target=\"_blank\">explanatory reporting<\/a> by documenting business practices by Apple and other technology companies.\r\n\r\n<span style=\"font-weight: 400;\">According to journalism teacher and event planner Esther Wojcicki, Markoff will speak about his new book, “Machines of Loving Grace: the Quest for Common Ground Between Humans and Gobots.” The book is based on humans’ evolving relationship with robots as well as a possible upcoming “technological revolution,” which Markoff says will change lives.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> According to journalism teacher and event planner Esther Wojcicki, Markoff has spoken to classes at Paly in the past. “However, this is the first time he [is] speaking to the community at large,\" Wojcicki said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The event will also feature a question-and-answer session for students and adults hoping to learn more about the book and Markoff's success.<\/span>\r\n\r\nPaly senior Leyla Gokcek is one of the many looking forward to hearing Markoff's presentation.\r\n\r\n<span style=\"font-weight: 400;\"> “John Markoff's presentation will be a great opportunity for students, especially in technology-rich Silicon Valley,” Gokcek said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Event tickets are limited and can be purchased <\/span><a href=\"https:\/\/www.eventbrite.com\/e\/john-markoff-ny-times-discusses-his-new-book-machines-of-loving-grace-tickets-18924405406?aff=es2\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.  Tickets are $11 for adults and $6 for students.\r\n<\/span>\r\n\r\n\r\n","excerpt":"The Great Minds at Campus Speaker Series will welcome current New York Times writer John Markoff at 7 p.m. on Nov. 3 in the Palo Alto High School Media Arts Center.","date":"2015-11-03 10:53:27","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/mac.jpg","categories":["News","Spotlight"],"tags":["book","esther wojcicki","green jelly","john markoff","leyla gokcek","mac","media arts center","palo alto high school","paly","technology"]},{"id":111288,"title":"Veterans Day is on Wednesday, Nov. 11 (no classes)","permalink":"http:\/\/palyvoice.com\/2015\/11\/02\/veterans-day-is-on-wednesday-nov-11-no-classes\/","content":"","excerpt":"","date":"2015-11-02 21:25:14","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":110978,"title":"City plans improvements to Alma-Churchill intersection","permalink":"http:\/\/palyvoice.com\/2015\/11\/02\/city-plans-improvements-to-alma-churchill-intersection\/","content":"<dl id=\"attachment_110987\" class=\"wp-caption alignnone\" style=\"width: 349px;\"><dt class=\"wp-caption-dt\"><\/dt><\/dl>\r\n\r\n[caption id=\"attachment_111075\" align=\"alignnone\" width=\"618\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN2300.jpg\"><img class=\"wp-image-111075\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN2300.jpg\" alt=\"DSCN2300\" width=\"618\" height=\"464\" \/><\/a> Students bicyclists wait to cross the Alma and Churchill intersection on their way to school. \"The Churchill and Alma crossing is super dangerous and I've had more near death experiences there than the number of years I've gone to Paly,\" senior Emma Goldsmith said. \"I think that the lights are timed badly and both drivers and bicyclists bend the law a bit there especially in regard to running lights.\" Photo by Adrienne Kwok.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Frustrated by early morning and afternoon traffic? Afraid of hitting bikers or getting run over? The City of Palo Alto plans to implement improvements to its city roads, some of which will affect Palo Alto High School student commuters.<\/span>\r\n\r\nIn a community meeting on October 22, Palo Alto's transportation committee discussed<span style=\"font-weight: 400;\"> multiple changes in an effort to help Paly students have better access to the school campus from the west, east and south side, according to Joshuah Mello, the Palo Alto Chief Transportation Official.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">There are two concept plans to this project. Phase One Concept Plan involves El Camino Real and the Caltrain crossing on Churchill Avenue, while the Phase Two Concept Plan focuses on Churchill Avenue between Bryant Street and the Caltrain tracks. City Council approved Phase One Concept Plans earlier this year while the second phase is still being developed, according to Mello. <\/span>\r\n\r\n“We hope to conclude the concept planning stage for Phase Two quickly, so it can join Phase One in the final design stage,” Mello said. “Our goal is to begin construction within the next two years.”\r\n\r\n[caption id=\"attachment_111267\" align=\"alignleft\" width=\"344\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-02-at-5.11.05-PM.png\"><img class=\"wp-image-111267\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-02-at-5.11.05-PM.png\" alt=\"Screen Shot 2015-11-02 at 5.11.05 PM\" width=\"344\" height=\"222\" \/><\/a> An extended bike path and new plants are approved additions to the Madrono and Castilleja sidewalk and bike path. Image courtesy of the City of Palo Alto website.[\/caption]\r\n\r\nPhase One aims to improve commuters' safety. According to Mello, some of the changes that will soon be implemented include an extension of the multi-use path to El Camino Real and Stanford Perimeter Trail, an addition to a new westbound right-turn lane, El Camino Real signal improvements, a new crosswalk on the north leg, lighting improvements and a new rapid flashing beacon. The adopted concept plan also includes a raised crosswalk on Churchill Avenue at both Madrono Avenue and Castilleja Avenue.\r\n\r\n“Raised crosswalks slow motorists as they approach and encourage them to yield to crossing pedestrians at a higher rate,” Mello said. “They offer tremendous safety benefits for pedestrians crossing the street at uncontrolled locations.”\r\n\r\nFollowing the implementation of Phase One Concept plans, Phase Two's proposed changes at the Alma Street and Churchill Avenue intersection include widening crosswalks, replacing the crossing surface with concrete and installing new lighting, according to Senior Transportation Planner Sarah Syed.\r\n\r\n[caption id=\"attachment_111259\" align=\"alignright\" width=\"386\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-02-at-4.59.27-PM.png\"><img class=\"wp-image-111259\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Screen-Shot-2015-11-02-at-4.59.27-PM.png\" alt=\"Screen Shot 2015-11-02 at 4.59.27 PM\" width=\"386\" height=\"216\" \/><\/a> The Churchill and Alma intersection is a popular crossing for many Paly students. Approximately 350 student bicyclists cross the intersection each morning, according to Senior Transportation Planner Sarah Syed. Image courtesy of the City of Palo Alto website.[\/caption]\r\n\r\nPhase Two seeks to accommodate the approximate 350 student bicyclists and 50 pedestrians who pass the Alma and Churchill intersection between the peak morning hours of 7:30 a.m. to 9:30 a.m., as well as the after school rush.\r\n\r\n“We have, in a one-hour period, 300 to 400 students traveling westbound on Churchill to get to school,” Syed said. “In concentrated high volume demand, the afternoon situation is more challenging.”\r\n\r\n<span style=\"font-weight: 400;\">Students who commute through the intersection expressed concern about their safety and voiced their support for changes.<\/span>\r\n\r\n\"When you're in the front, it's not unusual to feel a little wary of the cars whizzing by you and the mob of packed students right behind you,\" junior Jerry Hong said. \"I'm glad to see that the city is trying to solve the issue and that it cares about the well-being of the students as we commute to and from school.\"\r\n\r\nThese projects originated with the adoption of the \"Palo Alto Bicycle &amp; Pedestrian Transportation Plan\" by the City Council in 2012, according to Mello. The initial plan’s goal was to expand bicycle and pedestrian commuting trips and to promote healthy lifestyles by creating bicycle-friendly infrastructure, according to the <a href=\"http:\/\/www.cityofpaloalto.org\/news\/displaynews.asp?NewsID=499&amp;TargetID=107\">City of Palo Alto Website<\/a>. These recent plans are an extension of the 2012 plan.\r\n\r\nImplementing these plans are not easy and will create some complications, according to Mello.\r\n\r\n“Some challenges that we are facing is preserving as much of the improved landscaping on the Paly property as possible, working effectively with Caltrain and the California Public Utilities Commission on the railroad crossing improvements and reaching consensus with the community on any proposed modifications to on-street parking or travel lane width,” Mello said.\r\n\r\nMello encourages any students who are interested in helping develop the concept plans to contact him at <a href=\"mailto:Joshuah.Mello@cityofpaloalto.org\">Joshuah.Mello@cityofpaloalto.org<\/a>.\r\n\r\n“We will be more than happy to review the initial concept plans with any interested students and incorporate their feedback into the design,” Mello said. “I also hope that students will help get the word out and notify anyone that they know who may be interested in this project, including their parents or neighbors. The more we hear from the public, the better the final design will be.”","excerpt":"Frustrated by early morning traffic? Afraid of hitting bikers or getting run over? The City of Palo Alto plans to implement improvements to its city roads, some of which will affect Palo Alto High School student commuters.","date":"2015-11-02 19:20:28","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN2300.jpg","categories":["Features","Spotlight"],"tags":["alma","bicycle","caltrain","castilleja","churchill","city","crosswalk","el camino","el camino real","elevated","Improvement","infrastructure","intersection","joshuah","Madrono","mello","pedestrian","Sarah","sidewalk","stoplight","syed"]},{"id":111236,"title":"&#8220;The Odyssey&#8221; play performances are from Friday, Nov. 7 through Sunday, Nov. 9","permalink":"http:\/\/palyvoice.com\/2015\/11\/01\/the-odyssey-play-performances-are-from-friday-nov-7-through-sunday-nov-9\/","content":"","excerpt":"","date":"2015-11-01 13:37:49","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":111234,"title":"Advisory this week is for freshmen with individual meetings","permalink":"http:\/\/palyvoice.com\/2015\/11\/01\/advisory-this-week-is-for-freshmen-with-individual-meetings\/","content":"","excerpt":"","date":"2015-11-01 13:36:06","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":111191,"title":"Football clinches playoff spot, defeats Homestead for Senior Night victory","permalink":"http:\/\/palyvoice.com\/2015\/11\/01\/football-clinches-playoff-spot-defeats-homestead-for-senior-night-victory\/","content":"[caption id=\"attachment_111004\" align=\"alignnone\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P8242.jpg\"><img class=\"alignnone size-full wp-image-111207\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P8242.jpg\" alt=\"_I9P8242\" width=\"581\" height=\"387\" \/><\/a> Sophomore running back Paul Jackson III evades his defenders and runs downfield. Jackson III contributed heavily to the Palo Alto High School football team's running game on Friday Oct. 30, the Vikings' Senior Night. \"We all worked hard, we all fought, we played a great game today,\" Jackson III said. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School football team (4-5, 3-2) blew out the Homestead Mustangs (3-5, 1-3) on Friday for Senior Night, the Vikings last home game of the season, 45-7. With the win, the Vikings clinched a spot in the Central Coast Section playoffs, as the top four teams in the De Anza League are guaranteed a spot.\r\n\r\nAccording to head coach Jake Halas, controlling the ball was the deciding factor in this game.\r\n\r\n“We were able to control the ball, run the rock,” Halas said. “We take our chances. We’ve got Eli [Givens] and we can throw some deep balls to him too.”\r\n\r\nThe game began with a strong kick-off return play, with senior wide receiver Eli Givens running the ball all the way into the end zone for a touchdown for the second consecutive game, the last against Los Gatos High School.\r\n\r\n“I said I was going to take it to the house one more time on the very first play,” Givens said. “They kicked it to me and I was very surprised because I thought they would’ve seen Los Gatos [High School], but I guess they didn’t. I just took it to the house.”\r\n\r\nKick-off return plays and special teams have been a focus for the Vikings in recent weeks, according to Halas.\r\n\r\n“We improved our kick return game,” Halas said. “We’ve actually spent more time on our special teams lately too. The goal of any good team around here is to get better every game.”\r\n\r\nAdditionally, Halas recognized the Vikings’ improvement and the players becoming more comfortable and on point in each job, making the team more cohesive as a whole.\r\n\r\n“We made some adjustments in practices and we got guys in the right spot,” Halas said. “Earlier in the year, we had guys running through the wrong gaps and wide open gaps. We fixed and have been tweaking that.”\r\n\r\nAccording to Homestead head coach Milo Lewis, the Mustangs didn’t exhibit their skills strongly, but still have hopes for advancing to the Central Coast Section playoffs, as the Vikings will most likely do.\r\n\r\n“That’s not our best performance,” Lewis said. “We’re a lot better than we just showed. We’ve got two games left. We’ve got to try to get one of the two, Milpitas [High School] or Los Gatos.”\r\n\r\nThe game opened with the traditional ceremonies of Senior Night, recognizing the team’s seniors and their families. Friday night's win was meaningful, according to Givens, especially given losses on Senior Night in the last two seasons.\r\n\r\n“Watching these games for Senior Night and seeing a loss makes you just feel hopeless,” Givens said. “You come back to the locker room and you see all the seniors crying, but there’s nothing you can really do about it. I’d seen that and I didn’t want that happening to me.”\r\n\r\nThe Vikings have one more game in the regular season against Wilcox (6-2, 2-2). The Vikings will be focusing on recovering and preparing for Wilcox’s physical offensive game, according to Halas.\r\n\r\n“They match up well,” Halas said. “They’re very physical up front. It’s going to be a very good game. [The veer] is their offensive scheme. It’s a hard-hitting, physical style of offense. They run it really well and they’ve been running it for years.”\r\n\r\nThe Vikings’ determination and work rate brings them success, according to senior running back Takeru Nishi.\r\n\r\n“We worked the whole week and it really paid off,” Nishi said. “We didn’t get to the playoffs last year and we just really wanted to get there this year.”\r\n\r\nPaly will take on the Wilcox Chargers at 7 p.m. on Nov. 13 at Wilcox High School, its last game of the regular season. The Vikings will be looking for redemption, as they lost to the Chargers last season with a score of 20-19.","excerpt":"The Palo Alto High School football team blew out the Homestead Mustangs on Friday for Senior Night, clinching a spot in the Central Coast Section playoffs.","date":"2015-11-01 11:48:02","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P8242.jpg","categories":["Football","Sports","Sports Recap","Spotlight"],"tags":["eli givens","football","halas","homestead","palo alto high school","Senior Night","takeru nishi"]},{"id":111082,"title":"Liveblog: Football vs. Homestead for Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/10\/30\/liveblog-football-vs-homestead-for-senior-night\/","content":"[liveblog]","excerpt":"Tune in to the Paly Voice liveblog of the Palo Alto Vikings' last home game of the regular season against Homestead on Senior Night.","date":"2015-10-30 19:25:11","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P6770.jpg","categories":["Uncategorized"],"tags":[]},{"id":110988,"title":"School Board discusses achievement gap solutions","permalink":"http:\/\/palyvoice.com\/2015\/10\/29\/school-board-discusses-achievement-gap-solutions\/","content":"[caption id=\"attachment_111035\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_4144.jpg\"><img class=\"wp-image-111035 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_4144.jpg\" alt=\"Board Meeting 10\/27 Melissa Caswell\" width=\"600\" height=\"400\" \/><\/a> School board president Melissa Caswell speaks at the Palo Alto Board of Education meeting on Oct. 27. The board addressed issues of the achievement gap of historically underrepresented racial group students and Palo Alto demographics of ACT, SAT and Advanced Placement exam scores. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\nThe Palo Alto Unified School District Board of Education plans to take action to improve school climate and decrease the achievement gap of historically underrepresented racial groups within the school district.\r\n\r\nAt the board meeting on Oct. 27, members looked over the High School Measures Report which includes college readiness metrics such as ACT scores, SAT scores and Advanced Placement exam scores. The data points revealed that historically underrepresented racial group students at Palo Alto high schools score significantly lower than those of Caucasian or Asian ethnicity.\r\n\r\n“Increasing achievement for underrepresented minorities is a high priority,” board member Ken Dauber said. “But we need to do more, including improving how well curriculum and teaching meets the needs of all students and examining how well laning is supporting students in increasing achievement.”\r\n\r\nThe Minority Achievement and Talent Development committee, created earlier this year, is working with elementary schools to combat the issues of struggling students as early as kindergarten and first grade. MATD is providing increased access to support resources for students and their parents, according to Judy Argumedo, the PAUSD director of Academic Supports\r\n\r\nIn addition to establishing the MATD committee, the school board members also implemented early literacy and math after school programs for non-native English speakers at the Hoover and Fairmeadow elementary schools in order to help students catch up at an early age.\r\n\r\n“I’ve talked to a lot of historically underrepresented racial group parents whose kids are struggling in math,\" school board president Melissa Caswell said. \"I believe that if you wait until middle school, you’ll never be able to catch up.\"\r\n\r\nThe board members also discussed the necessity of changing the overall climate surrounding Advanced Placement courses. The board emphasized the importance of encouraging all students to take advanced classes and providing them with access to a more rich education through these courses.\r\n\r\n“Some kids in our district may feel intimidated by the APs, thinking that they are only for a select group,” board member Camille Townsend said. “This should become a continual focus that our that kids take at least one AP class, so they gain confidence in themselves.”\r\n\r\nCaswell emphasized that the board will be focusing on improving the quality of education across all the schools within the district.\r\n\r\n“We need to ask [ourselves], ‘Are we providing advanced topics to enough of our kids?’” Caswell said.","excerpt":"The Palo Alto Unified School District Board of Education plans to take action to improve school climate and decrease the achievement gap of historically underrepresented racial groups within the school district.\r\n","date":"2015-10-29 21:44:38","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_4144.jpg","categories":["News","Spotlight"],"tags":["achievement gap","ACT","AP testing","Camille Townsend","ken dauber","Melissa Caswell","sat"]}]