[{"id":107314,"title":"Season preview: Girls&#8217; volleyball looking to prove themselves","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/season-preview-girls-volleyball-looking-to-prove-themselves\/","content":"[caption id=\"attachment_107358\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/LRP_08191.jpg\"><img class=\"wp-image-107358 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/LRP_08191.jpg\" alt=\"LRP_0819\" width=\"600\" height=\"399\" \/><\/a> Junior hitter Katie Passerello hits the ball over Moutain View High School defenders in a game last year. Mountain View won the match on Oct. 14, 2014 in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe Palo Alto High School volleyball team is preparing for its upcoming season with a new head coach as well as the loss of key seniors.\r\n\r\nJekara Wilson, the incoming head coach, has previously worked with the volleyball team as a varsity assistant, junior varsity head coach, and other coaching positions since 1998.\r\n\r\nAlong with the loss of last year’s head coach Daniele Desiderio, the team will be losing seven key seniors, including Anna Dukovic, Gillian Chryst and Jade Schoenberger.\r\n\r\nThese graduated seniors led last year’s team to a 19-12 overall record and a 4-8 record in the De Anza league. The season ended with a tough loss to Homestead High School in the quarterfinals of the <span style=\"color: #000000;\">Central Coast Section<\/span> playoffs.\r\n\r\nWilson, who led last years JV team to a second place finish in league play, said she is excited to take over the team.\r\n\r\n“Being the head coach of this program feels like an honor and a true privilege,” Wilson said. “I have worked so hard to get here and couldn't be more excited about this season.”\r\n\r\nWilson played for Paly volleyball as a teen, and continued to play volleyball in college at West Valley. This internal promotion is the second attempt to fill the void that was left by former volleyball coach Dave Winn, who coached Paly volleyball for eight years and led the team to two state championships.\r\n\r\nAnother challenge the volleyball team will face this year is the lack of a home gym. Because of construction, Paly volleyball and other sports will have to practice and play home games at Gunn High School.\r\n\r\n“Gunn has been wonderful in accommodating us, but there is a time issue when it comes to travel time daily to practice, especially during commuter traffic,” Wilson said.\r\n\r\nMeanwhile, some players feel that the extra hour it takes to travel to and from Gunn takes away from time that could be spent on homework, and adds to the already stressful life of a student athlete.\r\n\r\n“It is very annoying that we have to practice at Gunn,\"  junior Jessica Lee said.  \"Not only is practice two hours long but it also takes about a half hour to and from Gunn so that is another hour wasted by just traveling to Gunn when we could be working on homework or studying.”\r\n\r\nDespite the loss of some pivotal seniors and the lack of a home gym, Wilson said she believes her current team can reestablish the vikings as one of the best team in the league.\r\n\r\n“We have a very strong chance at winning leagues this season,” Wilson said. “Paly went eight consecutive years winning league from 2005 - 2012, I think we can restore that status this season. Overall, I am pleased with our team's progress in practices alone and honestly believe that they can achieve anything they set their minds to.”\r\n\r\nWilson hopes to achieve this “can-do” attitude through the leadership of powerful senior captains Claire Krugler, Claire Dennis, and Clara Chiu. The team starts their season off at 6:15 p.m. Tuesday Sept. 8th at Del Mar High School in San Jose.","excerpt":"The Palo Alto High School volleyball team is preparing for its upcoming season with a new head coach as well as the loss of key seniors.","date":"2015-09-08 18:16:17","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/LRP_08191.jpg","categories":["Sports","Spotlight","Volleyball"],"tags":{"19460":"2015","32530":"anna dukovic","52186":"Chelsea Fan","8586":"claire dennis","52184":"Claire Krugler","49103":"clara chiu","8630":"dave winn","15412":"de anza","32532":"gillian chryst","9880":"jade schoenberger","52185":"Jekara Wilson","8809":"jessica lee","8944":"palo alto high school","8953":"paly","12045":"season preview","52187":"Susana Limb","9210":"vikings","9216":"volleyball"}},{"id":107351,"title":"Club Day is on Monday, Sept. 21 during lunch","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/club-day-is-on-monday-sept-21-during-lunch\/","content":"","excerpt":"","date":"2015-09-08 11:25:21","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":107349,"title":"Photo makeup days are Tuesday Sept. 15 and Wednesday Sept. 16","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/photo-makeup-days-are-tuesday-sept-15-and-wednesday-sept-16\/","content":"","excerpt":"","date":"2015-09-08 11:24:26","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":107159,"title":"Review: Pop Tea Bar is tealicious","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/review-pop-tea-bar-is-tealicious\/","content":"[caption id=\"attachment_107162\" align=\"alignright\" width=\"377\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/storefront.jpg\"><img class=\"wp-image-107162\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/storefront.jpg\" alt=\"storefront\" width=\"377\" height=\"246\" \/><\/a> Customers wait to order at Palo Alto's newest pearl milk tea shop. Pop Tea opened in June and currently serves over 30 types of drinks. Photo by Aidan Maese-Czeropski[\/caption]\r\n\r\nA warm, enticing smell beckons pedestrians through the doors of Pop Tea Bar, a small, olive-colored shop. Tables and chairs fill the outside patio, and customers chatter as they sip their drinks. Visible behind a glass panel, employees are at work brewing tea, adding ice and taking customer requests.  On the wall, a large illuminated sign advertises over 30 teas and drinks, each customizable for optimum enjoyment.\r\n\r\nThis is Palo Alto’s newest pearl milk tea shop. Squeezed between an array of stores at 456 Cambridge Ave, Pop Tea boasts delicious teas and boba at affordable prices.\r\n\r\nOwner Melissa Zheng worked in a hospital for eight years prior to Pop Tea’s opening. Zheng said that the experience was sometimes saddening and decided to open the cafe afterwards.\r\n\r\n“I decided that I would open something that would make people happy,” Zheng said. Soon after, she chose to pursue her interest in food with Pop Tea.\r\n\r\n“I love to eat and drink,”  Zheng said. “I love to cook for my friends, and they really like [the food].”\r\n\r\nWhile several other pearl milk tea shops have recently opened in Palo Alto, Pop Tea offers unique drinks and blends. Most prominently, the store specializes in “popping boba,” or boba with juice that “pops” when one chews it. In addition, tea is made with mainly natural ingredients.\r\n\r\n“Other stores may use types of chemical sugars which are unhealthy,” Zheng said.\r\n\r\nThe cafe only serves drinks with real sugar, as well as toppings which are homemade.\r\n\r\n[caption id=\"attachment_107166\" align=\"alignright\" width=\"266\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/tea1.jpg\"><img class=\"wp-image-107166\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/tea1.jpg\" alt=\"tea1\" width=\"266\" height=\"222\" \/><\/a> Left to right: The Mango Green Milk tea, Peach Fruit Green tea and Classic Black Milk tea. Photo by Aidan Maese-Czeropski[\/caption]\r\n\r\nPop Tea offers a diverse selection of both tea and boba. Pudding, red beans and three types of jelly can be added for 50 cents, while fresh fruit can be added for $1. The cafe also serves nearly 30 choices of drinks, which can be customized in many ways. The store offers a wide selection of milk, including coconut, almond and soy milk. In addition, customers can modify ice and sugar levels to their liking.\r\n\r\nThe Classic Milk Tea ($3.50) is easily the shining star on the menu. A perfect blend between sweet and bitter the tea combines a milky flavor with mint undertones. While people may find this drink too sweet, customers can modify drink sweetness. Overall this drink may be the best pearl milk tea I have ever tasted.\r\n\r\nThe Peach Fruit Green Tea ($3.75) and Strawberry Ice Slushy ($3.95) are also appetizing options. The Peach Fruit Green Tea’s flavor is subtle and contrasts well with the sweet milk for an overall great taste. The strawberry slushy is a perfect summer snack that blends a fruity flavor with an icy texture. While the strawberry flavor is strong, it is not overwhelming and it will easily please fruit lovers.\r\n\r\nThe Mango Green Milk Tea ($3.75) and Lychee Green Tea ($3.75) were somewhat less satisfactory. The mango tea’s texture is unpleasant due to the fruit pulp, making the drink taste more like fruit juice rather than tea. However, the drink’s sourness contrasts well with the sweet milk. While the lychee tea has a perfect level of sweetness, the overall lychee taste is too strong and the drink has an odd aftertaste. In addition, the servers forgot to add the jelly, which was ordered, to the tea.\r\n\r\nPop Tea’s boba greatly varies by drink, but it is generally sweet and chewy. When combined with the Mango Green Milk Tea, however, it tasted bland and it was difficult to chew. The overall price for both the boba and drinks is inexpensive.\r\n\r\nDespite Pop Tea’s lengthy line, service was speedy and friendly. The tea bar offers several outdoor seats and an array of tables and chairs outside. The entire store was extremely clean and appeared to be well-maintained.\r\n\r\nOverall Pop Tea has a delicious selection of tea drinks and toppings at affordable prices. The boba is sweet and chewy, and  the teas are milky and delectable. Pop Tea is a welcome addition to Palo Alto's assortment of pearl milk tea shops.","excerpt":"Palo Alto's newest pearl milk tea shop offers delicious drinks at affordable prices.","date":"2015-09-08 11:18:43","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/tea1.jpg","categories":["Reviews"],"tags":{"29703":"boba","8551":"cafe","52051":"california ave","8939":"palo alto","29705":"pearl milk tea","29704":"pmt","52050":"pop tea","27732":"tea"}},{"id":107289,"title":"Voice of the Week: Caroline Furrier","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/voice-of-the-week-caroline-furrier\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_107293\" align=\"aligncenter\" width=\"627\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1732.jpg\"><img class=\" wp-image-107293\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1732.jpg\" alt=\"hhhh\" width=\"627\" height=\"418\" \/><\/a> Freshman Caroline Furrier discusses her goals regarding Spirit Week and helping ASB  to create a welcoming student environment in her upcoming year as freshman class president. Photo by Nika Woodfill.[\/caption]\r\n\r\nThis week, The Paly Voice sat down with the newly elected Freshman President Caroline Furrier to discuss her goals, thoughts on leadership and love for sports.\r\n\r\nThe Paly Voice: What inspired you to run for class president?\r\n\r\nCaroline Furrier: I really like helping other people, and since I’m the third of four children in my family, I’ve always been kind of stuck in the middle of situations and have had to solve things on my own and with my family. So that’s always kind of motivated me to help other people and just get issues solved.\r\n\r\nPV: What do you like about Associated Student Body?\r\n\r\nCF: I really like ASB so far because everything is very particular. I like how everybody thinks of every possible situation, so then [we] can make the school the best that we can. I really like that because I’m a bit of a perfectionist myself, so I think it’s really awesome that everybody just goes the extra mile just to make a good school community.\r\n\r\nPV: Have you been a part of student government before?\r\n\r\nCF: Last year I was Spirit Leader at Jordan.\r\n\r\nPV: Has anything from middle school carried over in terms of student government?\r\n\r\nCF: Not nearly as much as what Paly does obviously, because Paly spirit is so much more of a big deal, but we used to do a lot of spirit activities. I learned how to plan really well, get feedback from people and communicate with people, asking [for] their opinions a lot.\r\n\r\nPV: How is Paly different than middle school?\r\n\r\nCF: I would say that I really like Paly a lot more than middle school because I feel like you get a chance to meet a lot of new people and you also have a lot more freedom. The teachers seem to trust you a lot more, which I like, because it makes you feel like you kind of matter more and I think that’s really awesome. It’s a really open place to be.\r\n\r\nPV: How do you plan to help make your class successful in Spirit Week?\r\n\r\nCF: I really think that communication is key. So far, we’ve been trying to get it [information about Spirit Week] out to the freshmen, although nobody really knows what they’re doing yet. It’s a really big deal here at Paly and I think what we have to do is just get everybody to know that it’s okay to just go all out. I plan to just let everybody know and just be as organized as I can to get everybody really pumped to be spirited.\r\n\r\nPV: How do you think communication issues, especially the lack of Facebook use among freshmen, is going to affect Spirit Week?\r\n\r\nCF: I actually came across that problem a lot so far because the older grades use Facebook way more than we do. Nobody really had Facebook before going into high school, and they usually only made it for like Trivia Crack or some game or something. What we’ve been doing is been posting on Instagram or Snapchat. In a way it’s kind of good because you can communicate face-to-face a little bit more and get to know more people. I’ve been going around trying to advertise meetings and tell them what’s going on. To some random people that I know are freshmen, but I don’t know very well. I can introduce myself, which is nice because I meet new people, but it’s a little bit of a problem when you can’t get it out to everybody because you can’t find everybody by face-to-face. It’s not as quick, of course.\r\n\r\nPV: What are your interests outside of school?\r\n\r\nCF: I play soccer all the time. Every day I’m playing soccer, so that’s probably the biggest part of my life right now. I really like to read, so I’m a little bit of a book nerd, but I also do like just doodling and art. It’s something that I really enjoy.\r\n\r\nPV: What lessons have you learned from soccer that you think will help you as a member of ASB?\r\n\r\nCF: I actually think soccer contributes a lot to being a leader. If you’re on the soccer field, and you don’t know how to demand things and communicate with your teammates, you probably wouldn’t be able to play soccer for that long in your life. It’s a huge thing on the field. You have to be able to just tell people what you want. The whole part about being a teammate and working together is really important. Being in ASB is a lot about doing that. You have to communicate really well and understand what people want and need.\r\n\r\nPV: Anything else you want our readers to know about?\r\n\r\nCF: I want people to know that a main reason I also wanted to run for ASB is that I really care about helping other people... I want people to know that I’m always here no matter what, even if you don’t know me, know who I am, have never talked to me [or] never seen me even. I always want people to know that I represent them and I really care about helping them. If it’s anything at all, I’m always here to help.","excerpt":"This week The Paly Voice sat down with the newly elected Freshman President Caroline Furrier to discuss her goals,  thoughts on leadership and love for sports.","date":"2015-09-08 11:18:15","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1732.jpg","categories":["Features","Spotlight"],"tags":{"8496":"ASB","49926":"caroline furrier","23934":"class president","9795":"freshman","52182":"palyasb","10258":"voice of the week"}},{"id":107282,"title":"Senior parent night is Wednesday, Sept. 9 in Haymarket Theater","permalink":"http:\/\/palyvoice.com\/2015\/09\/07\/senior-parent-night-is-wednesday-sept-9-in-haymarket-theater\/","content":"","excerpt":"","date":"2015-09-07 13:31:52","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":107280,"title":"Advisory this week is for all juniors and select freshmen","permalink":"http:\/\/palyvoice.com\/2015\/09\/07\/advisory-this-week-is-for-all-juniors-and-select-freshmen\/","content":"","excerpt":"","date":"2015-09-07 13:28:32","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":106810,"title":"Slideshow: Football defeats Sequoia in home opener","permalink":"http:\/\/palyvoice.com\/2015\/09\/07\/slideshow-football-defeats-sequoia-in-home-opener\/","content":"The Palo Alto High School Vikings football team (1-0, 0-0) kicked the season off by defeating the Sequoia High School Cherokees (0-1, 0-0), 54-28, on Friday in the first regular game of the year.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AwCAe3s5pvqo\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School Vikings played the Sequoia High School Cherokees on friday in the first regular game of the season. The Vikings defeated the Cherokees, 54-28, setting the season off to a good start.","date":"2015-09-07 12:40:23","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSC_0280.jpg","categories":["Football","Slideshow"],"tags":{"51440":"cherokees","10618":"first game","52041":"football game","30021":"friday","29126":"home opener","8944":"palo alto high school","8953":"paly","25428":"sequoia","9107":"slideshow"}},{"id":107214,"title":"James Franco to teach film course in MAC","permalink":"http:\/\/palyvoice.com\/2015\/09\/07\/james-franco-to-teach-film-course-in-mac\/","content":"[caption id=\"attachment_107229\" align=\"alignnone\" width=\"441\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/james-franco-and-woj.jpg\"><img class=\"wp-image-107229\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/james-franco-and-woj.jpg\" alt=\"\" width=\"441\" height=\"294\" \/><\/a> James Franco poses for a photo with journalism teacher Esther Wojcicki at Paly in October. Franco visited the campus to paint two murals. \"He [Franco] is very committed to Palo Alto High and to education,\" Wojcicki said. Photo by Adele Bloch[\/caption]Renowned actor, director, filmmaker and Palo Alto High School alumnus James Franco will teach an eight-part film class for high school students, according to posts on his social media accounts on Sept. 4.\r\n\r\nFranco, a Paly graduate of 1996, urged students through Facebook, Twitter and Instagram to sign up for his class.\r\n\r\n[caption id=\"attachment_107220\" align=\"alignright\" width=\"252\"]<img class=\"wp-image-107220\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-shot-2015-09-06-at-5.44.31-PM.png\" alt=\"Screen shot 2015-09-06 at 5.44.31 PM\" width=\"252\" height=\"342\" \/> James Franco announced via social media his intention of teaching a film class for high school students. Screenshot by Adrienne Kwok.[\/caption]\r\n\r\nThe workshop is set to take place starting on Sept. 13. 24 students will work in groups of three to ultimately produce their own film, which may be screened at a film festival, according to the application page.\r\n\r\nWhile Franco's class will be taught at Paly, students will not receive credit for signing up.\r\n\r\n“He [Franco] is a professional in the industry and has directed some notable films,” senior Sophia Anderson said. “It [being a part of the class] would be a beneficial experience.”\r\n\r\nAccording to journalism teacher Esther Wojcicki, Franco has taught several other film classes in the past.\r\n\r\n“He has taught this class at the University of California Los Angeles and New York University for a few years and it [the class] has been very popular and highly successful,” Wojcicki said. “I definitely think he is qualified to teach a class at Paly.”\r\n\r\nThe other Franco brothers may also be involved with the class.\r\n\r\n“Tom Franco will also be involved, and Dave may also be there for a few of the workshops,” Wojcicki said. “It isn't clear yet.”\r\n\r\nWhile Franco has never taught at Paly before, he is no stranger to Paly campus. Last year, Franco celebrated the opening of the Media Arts Center at the <a href=\"http:\/\/palyvoice.com\/2014\/08\/23\/slideshow-media-arts-ribbon-cutting-highlights-annual-school-picnic\/\">ribbon-cutting ceremony<\/a>. Two months later, he created <a href=\"http:\/\/palyvoice.com\/2014\/10\/13\/campus-is-canvas-for-celebrity-alum-james-franco\/\">14 paintings and two murals<\/a> for the Paly campus, which can still be seen in the library, in the MAC and on the Student Center.\r\n\r\nStudents who are interested in participating in Franco’s film workshop will need to <a href=\"https:\/\/docs.google.com\/forms\/d\/18ajz3ZCWm_58wLHfnGb3k5zc8x_y5mbxGnVCeR41_d0\/viewform?c=0&amp;w=1&amp;pli=1\">complete an application<\/a> with basic information, a one-minute video introducing themselves and a 200-word essay explaining why they want to be in the class. Applications are due midnight of Sept. 10.\r\n\r\n“More information is hopefully to come,\" junior Nadia Leinhos said. \"I'm definitely going to keep track of this whole thing.\"","excerpt":"Renowned actor, director, filmmaker and Palo Alto High School alumnus James Franco will teach an eight-part film class for high school students, according to posts on his social media accounts on Sept. 4.","date":"2015-09-07 10:06:06","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/james-franco-and-woj.jpg","categories":["News","Spotlight"],"tags":{"12704":"esther wojcicki","52054":"film class","8801":"james franco","40151":"nadia leinhos","8939":"palo alto","8944":"palo alto high school","8953":"paly","52056":"sophia anderson"}},{"id":107127,"title":"Veterans, rookies shine in 54-28 rout of Cherokees","permalink":"http:\/\/palyvoice.com\/2015\/09\/06\/veterans-rookies-shine-in-54-28-rout-of-cherokees\/","content":"The Palo Alto High School football team (1-0, 0-0) rebounded from last year's offensive struggles with a dominating performance in front of its home crowd on Friday night, scoring eight touchdowns in a 54-28 victory over the Sequoia Cherokees (0-1, 0-0).\r\n\r\nIn his first season-opening game as starting quarterback, senior Justin Hull threw for three touchdown passes and rushed for another, leading the offense on six touchdown drives in the second half.\r\n\r\nAfter a disappointing 3-7 season in which Hull and senior Oliver Svirsky shared the quarterback position, Hull now has full control over second-year head coach Jake Halas's offense after Svirsky transferred to Milpitas High School this summer. In addition to Hull's strong performance, a balanced running attack from sophomore Paul Jackson III, and seniors Tony Caballero-Santana and Shaun Pike kept Cherokee defenders off-balance throughout the game.\r\n\r\n[caption id=\"attachment_107196\" align=\"aligncenter\" width=\"653\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/MG_83252.jpg\"><img class=\"wp-image-107196\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/MG_83252.jpg\" alt=\"Senior running back Tony Caballero-Santana makes a cut upfield. Caballero-Santana rushed for a touchdown in the third quarter of Friday's game, as the Vikings defeated the Sequoia Cherokees 54-28. Photo by Cooper Lou.\" width=\"653\" height=\"435\" \/><\/a> Senior running back Tony Caballero-Santana makes a cut upfield. Caballero-Santana rushed for a touchdown in the third quarter of Friday's game, as the Vikings defeated the Sequoia Cherokees 54-28. Photo by Cooper Lou.[\/caption]\r\n\r\nMidway through the third quarter with the Cherokees still within one score, Jackson III broke free for a 63-yard touchdown run, the first of his varsity career.\r\n\r\n“I felt like it was a great first game, one of my best games, especially coming out of junior varsity last year,” Jackson said. “It feels great. A lot of nerves come with it, but I think I’m making adjustments to my game.”\r\n\r\nThe Vikings started quickly when Hull hit senior wideout Eli Givens on a vertical rout on the team’s second drive of the game. Hull attributed consistent drives throughout the game to his offensive line, led by senior captain Mikey Grandy.\r\n\r\n“The offensive line made my job really easy,” Hull said. “When we run the ball like that, I don't have to do much, but it could be better. It can always be better, but it was all right for the first game.”\r\n\r\nThe Cherokees were paced by a multitude of athletes including senior fullback Faave Brown and senior tailback Aya Brown. They briefly took a 20-14 lead early in the second half when junior quarterback Nick Demarco connected with Aya Brown on a slant touchdown pass, but were ultimately outperformed by the speed of the Vikings’ offense.\r\n\r\n“They were getting the ball moving, they were doing a great job with that,” Sequoia head coach Robert Poulos said. “We started fatigued defensively, which allowed them to use the same concept which we’re trying for, which is [to] start getting some seams you can exploit.”\r\n\r\nOn the Vikings’ side, Hull was able to connect with senior wide receiver Riley Schoeben twice in the end zone, the second providing the team with a comfortable lead late in the third quarter.\r\n\r\nCoach Halas expressed his confidence in the Vikings' play after the game.\r\n\r\n“I felt we were going to be able to run the ball, but if you had asked me about [scoring] 54 I would have said no,” Halas said. “We got stronger and they got winded.”\r\n\r\nThe Vikings next game is set for 7:30 p.m. next Friday, Sept. 11 at home against San Benito High School (1-0, 0-0).","excerpt":"The Palo Alto High School football team (1-0, 0-0) rebounded from last year's offensive struggles with a dominating performance in front of its home crowd on Friday night, scoring eight touchdowns in a 54-28 victory over the Sequoia Cherokees (0-1, 0-0). ","date":"2015-09-06 13:59:45","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/MG_83252.jpg","categories":["Sports","Sports Recap"],"tags":{"51440":"cherokees","8714":"football","25417":"halas","29126":"home opener","51444":"hull","51445":"jackson III","51443":"rookies","51441":"rout","11721":"schoeben","51442":"veterans"}}]