[{"id":100669,"title":"Opinion: Why you should run for ASB","permalink":"http:\/\/palyvoice.com\/2015\/03\/09\/opinion-why-you-should-run-for-asb\/","content":"When students walk around the Palo Alto High School campus, they may notice the yellow posters that read \"Become an 'ASBbae'\" and think, \"What is ASB? Why should I care? Why should I run?\"\r\n\r\nThis year is my first on ASB as junior class president, and as election season approaches, I've begun reflecting on my year on ASB and have realized that more students should try to experience ASB.\r\n\r\nThe Associated Student Body is a group of around 20 elected and appointed student officers who are responsible for representing the student body and putting on events like Spirit Week, dances and movie nights.\r\n\r\n[caption id=\"attachment_100666\" align=\"alignright\" width=\"388\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/photo-2.jpg\"><img class=\"wp-image-100666\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/photo-2.jpg\" alt=\"photo-2\" width=\"388\" height=\"291\" \/><\/a> ASB members meet during the third period class Student Government to plan events. Photo by William Zhou.[\/caption]\r\n\r\nFrom an outside perspective, ASB may seem suitable to only certain types of students: Those who love dances, who are exceptionally social and who are the most spirited.\r\n\r\nHowever, I am none of the above.\r\n\r\nWhile those students will certainly be comfortable, they’re not the only ones who will be able to thrive in ASB.\r\n\r\nI’m personally not extremely sociable nor spirited, nor have I ever been to a school dance until this year when I was on ASB and helped organize one. Yet I still feel welcome and have since found my place within ASB because of the wide range of topics and events that ASB covers.\r\n\r\nI especially enjoyed the events and projects, which varied from meeting with Principal Kim Diorio to discuss stress, to voting on parking costs, to discussing the morality of a Sadie's dance and to planning lunch-time activities.\r\n\r\n\"If they [students] want to contribute to this school in a tangible way, there's no other organization on campus that's as involved [as ASB],\" Student Activities Director, and Adviser for ASB, Matthew Hall told me.\r\n\r\nIn addition, there’s freedom to pursue your own passions. People will oftentimes bring their ideas to class, and the rest of the group will help execute them. This year, I wanted to increase communication between ASB and the student body with suggestions boxes, so I brought the idea to the class. Thus, \"Advice for ASB\" was born.\r\n\r\nEvery perspective, that of an athlete, that of someone with a part-time job or that of someone who likes math, and every skill, whether it be a special talent or an ability to make flyers and videos, is valued. For example, even though I wasn't able to contribute much in the yelling portion of Spirit Week, I worked behind the scenes, organizing practices and creating publicity videos. Since ASB is involved in such a diverse activities, there’s going to be at least one activity you’re uncomfortable with; however, uneasiness often brings new opportunities for growth. For me, that was Spirit Week since I hadn't really been involved prior to this year. Going through the processes, I discovered that I had learned how to work with others better, plan more efficiently, become more confident in myself and meet both students and adults that I otherwise would never have met.\r\n\r\nThe worst thing that can happen from running for a position is a loss and a couple days of being upset.\r\n\r\n\"The only regret I have regarding ASB is waiting until senior year to be a part of it,\" Senior Class Vice President Olivia Scola said. \"I love being apart of ASB and strongly advise people to run. If I could re-do high school, I would have run every year.\"\r\n\r\nThe potentials to make a difference and to grow as a person certainly outweigh the negatives of running for a position.\r\n\r\n\"Before I ran, I was unsure and hesitant of running,\" Senior Class President Maya Ben Efraim said. \"Consider this your push to run, its been the best experience.\"\r\n\r\nElection application forms can be<a href=\"https:\/\/sites.google.com\/site\/pahsasb\/\"> found online<\/a> or at the <a href=\"http:\/\/palyvoice.com\/2015\/02\/27\/asb-releases-election-packets\/\">SAO and are due on March 11. <\/a>While forms for appointed positions will be posted later.\r\n\r\n&nbsp;","excerpt":"When students walk around the Palo Alto High School campus, they may notice the yellow posters that read \"Become an 'ASBbae'\" and think, \"What is ASB? Why should I care? Why should I run?\" Staff writer Will Zhou gives his two cents on being an ASB officer and why someone should run.","date":"2015-03-09 19:55:26","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/photo-2.jpg","categories":["Opinion","Spotlight"],"tags":{"8496":"ASB","8499":"Associated Student Body","8667":"elections","8927":"opinion","8944":"palo alto high school","40133":"run","40134":"why"}},{"id":100536,"title":"Season preview: Boys&#8217; and girls&#8217; swimming looks to rebuild","permalink":"http:\/\/palyvoice.com\/2015\/03\/08\/season-preview-boys-and-girls-swimming-looks-to-rebuild\/","content":"[caption id=\"attachment_100752\" align=\"alignnone\" width=\"444\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-05-at-2.58.38-PM.png\"><img class=\" wp-image-100752\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-05-at-2.58.38-PM.png\" alt=\"The Palo Alto High School girls' swimming team poses for a group picture outside in the quad last year. The team hopes to place third at Central Coast Selection and win leagues\" width=\"444\" height=\"269\" \/><\/a> The Palo Alto High School girls' swimming team poses for a group picture outside in the Quad last year. The team hopes to place third at Central Coast Section and win Leagues this season. Photo by Phoebe So.[\/caption]\r\n\r\nDespite the major loss of key swimmers, the Palo Alto High School swimming team looks to rebuild this season starting with its first league meet next week against Gunn High School.\r\n\r\nNotable losses include graduated seniors Scott Powell, Omri Newman, Andrew Liang and Willy Lee for the boys, and graduated seniors Karina Goot, Caroline Moeser, Jayna Wittenbrink and junior Brittany Nguyen for the girls.\r\n\r\nIn addition, according to senior boys' swimming captain Ryan Drover, this year, Palo Alto Stanford Aquatics swimmers were asked to choose between swimming for Paly or for club. As a result, juniors Andrew Cho, Daniel Sing and sophomore Alex Liang chose to swim with PASA instead.\r\n\r\n<span style=\"color: #373e4d;\">\"I've been swimming for PASA for nine years now and if I had to choose Paly or club, PASA would always be my first commitment,\" Liang said. \"PASA has made me the swimmer I am today.\"<\/span>\r\n\r\nDrover said that the last season was great for Paly boys' swimming, as no other team in several decades came as close to beating Bellarmine for the Central Coast Section title.\r\n\r\n“Due to the PASA conflict, the boys’ swimming’s primary goal this year has been changed ... from a CCS title to now focusing on defending our league title and maintaining our streak,” Drover said.\r\n\r\nAccording to Drover, key swimmers to look out for this season will be seniors Winston Wang, Winston Wang (there are two), junior Robert Cheng, senior William Shin and senior Ryan Drover.\r\n\r\nDrover said that even though the team lost a lot of its top swimmers and does not have much depth as last year, the team will make it up by training hard and having the boys step up.\r\n\r\n<span style=\"color: #373e4d;\">The meet at Gunn next week will be by far one of the hardest meets of the season, as Gunn has the swimmers who have a good shot against Paly in dual meet scoring, according to Drover.<\/span>\r\n\r\n<span style=\"color: #373e4d;\">\"I believe that it will be a good and close meet,\" Drover said. <\/span>\r\n\r\nAlthough the boys’ team will suffer from major losses due to the PASA conflict, the girls’ team remains undeterred and hopes to do better this season.\r\n\r\nWith only one senior this year, girl's captain Sarah Putulin, and key swimmers freshmen Zoe Lusk, Peyton Wang, sophomores Haley Chalmers, Grace Zhao, and juniors Kayleigh Svensson, Katie Francis, the team hopes to place and win in both Leagues and CCS.\r\n\r\n<span style=\"color: #373e4d;\">According to Putulin, the team did very well last year, placing eighth at CCS and second at Leagues.<\/span>\r\n\r\n“Our goals for the team this year are to win Leagues and place in top three at CCS,” Putulin said. “ I have no doubt that we'll kick butt at the dual meets.”\r\n\r\nPutulin said that so far everyone on the team has great energy, even during \"crazy\" hardcore practices.\r\n\r\n“I'm super excited for this young, fast team,” Putulin said. “Being the only senior girl is a bit intimidating, but it's all good.”\r\n\r\nThe boys’ and girl’s team’s first league meet will be at 3:45 p.m. Thursday, March 12, at Gunn High School.\r\n\r\n&nbsp;","excerpt":"Despite the major loss of key swimmers, the Palo Alto High School swimming team looks to rebuild this new season starting with its first league meet next week against Gunn High School.","date":"2015-03-08 22:22:17","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-05-at-2.58.38-PM.png","categories":["Sports","Spotlight"],"tags":{"40108":"alex liang","15680":"andrew cho","11364":"andrew liang","8518":"Bellarmine","40106":"brittany nguyen","40104":"caroline moeser","8568":"CCS","40109":"daniel sing","40114":"grace zhao","8752":"gunn high school","40113":"haley chalmers","40107":"jayna wittenbrink","32733":"Junior varsity","40105":"karina goot","29696":"Katie Francis","40101":"kayleigh svensson","15411":"leagues","8944":"palo alto high school","40116":"palo alto high school swimming","8953":"paly","15610":"paly swimming","40115":"pasa","40111":"peyton wang","40118":"robert cheng","40102":"ryan drover","40100":"sarah putulin","9982":"scott powell","10017":"varisty","40110":"varisty swimming","40103":"william shin","15681":"willy lee","40117":"winston wang","40112":"zoe lusk"}},{"id":100083,"title":"Science Olympiad heads to regionals","permalink":"http:\/\/palyvoice.com\/2015\/03\/07\/science-olympiad-heads-to-regionals\/","content":"Palo Alto High School’s Science Olympiad team will be competing at the regional Science Olympiad competition on March 14 at San Jose City College.\r\n\r\n[caption id=\"attachment_100664\" align=\"alignright\" width=\"338\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11015708_10205025921064956_871277614_o.jpg\"><img class=\"wp-image-100664\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11015708_10205025921064956_871277614_o.jpg\" alt=\"11015708_10205025921064956_871277614_o\" width=\"338\" height=\"225\" \/><\/a> The Science Olympiad team is practicing for regionals on March 14. The competition structure consists of Regionals, which is open registration; States, which takes the top two to four teams from each region; and Nationals, which takes the top one to two teams from each state, according to Lu. Photo by Alex Lu.[\/caption]\r\n\r\nAccording to president of the logistics team senior Alex Lu, Science Olympiad covers a wide range of science topics.\r\n\r\n“Science Olympiad is a competition in which teams of 15 students compete in 23 different events in groups of two to three,” Lu said. “These events can be classified as study, lab or engineering events.<span style=\"color: #222222;\"> In study events, we study based on certain guidelines and then take a test on the day of the competition. Lab events involve  understanding whatever material is encompassed in the guidelines, but also being familiar with lab procedures. Engineering events are events in which we build certain devices or objects, according to the rules of each event, that must accomplish a certain task on the day of the competition.\" <\/span>\r\n\r\nThe team has been practicing since October, according to Lu.\r\n\r\n“We hold weekly meetings at one of our houses for the entire team so that we can study and prepare together,” Lu said. “Most of our preparation occurs outside of school, except for a few lab events. We're getting into the final stages of preparation.”\r\n\r\nThe team has historically done well at regionals.\r\n\r\n“Paly actually has two teams: Green Team and White Team,” Lu said. “Green Team is generally the more competitive of the two and for the last several years has taken first in the region and first or second at States.”\r\n\r\nThis year, the team hopes to qualify for Nationals.\r\n\r\n“We're hoping to not only maintain our performance in Regionals, but also perform better at the Norcal State competition, where we placed <a href=\"adam.stern*acterra.org\t•%20Executive Director\t650-962-9876 x303 Alex Von Feldt alexv*acterra.org\t• Stewardship Program Director\t650-962-9876 x315 Amber De Buizer amberd*acterra.org\t• Development Director\t650-962-9876 x308 Ariane Erickson acterrabea*gmail.com\t• Business Environmental Awards Program Director\t650-561-4711 Avi Starr-Glass avi.starrglass*acterra.org\t• Stewardship Project Manager\t  Claire Elliott clairee*acterra.org\t• Stewardship Program Senior Ecologist\t650-962-9876 x311 Deanna Giuliano nursery*acterra.org\t• Native Plant Nursery Manager and Botanical Consultant\t650-949-3158 Erin Banks Rusby erin.rusby*acterra.org\t• Stewardship Program Restoration Specialist\t  Jade Burr jade.burr*acterra.org\t• Watershed Steward Project Member\t  Jeremy Merckling jeremy.merckling*acterra.org\t• Watershed Steward Project Member\t  Jessica Sanchez jessica.sanchez*acterra.org\t• Stewardship Program Project Manager\t650-962-9876 x305 Joanne McFarlin joannem*acterra.org\t• Stewardship Program Senior Ecologist\t  Judi Eichler judie*acterra.org\t• Communications and Creative Director\t  Junko Bryant junkob*acterra.org\t• Stewardship Program Watershed Program Manager\t650-962-9876 x347 Kristen Williams kristen.williams*acterra.org\t• Stewardship Program Restoration Specialist\t  Lucia Moser lucia.moser*acterra.org\t• Development Coordinator\t650-962-9876 x346 Michael Viramontes michael.viramontes*acterra.org\t• Stewardship Program Restoration Specialist\t  Missy Pinney missyp*acterra.org\t• Stewardship Program Project Director\t  Pat Martin patm*acterra.org\t• Information Services and Technical Support Specialist — Environmental Library\t650-962-9876 x306 Paul Heiple paulh*acterra.org\t• Stewardship Program Staff Botanist\t650-854-7125 Peter Neal nursery*acterra.org\t• Stewardship Program Nursery Associate\t650-949-3158 Sara Witt saraw*acterra.org\t• Stewardship Program Project Director\t650-962-9876 x354 Talia Kirschner taliak*acterra.org\t• Stewardship Program Project Director\t650-962-9876 x310 Vida Rohani vidar*acterra.org\t• Business Manager\t650-962-9876 x307 Zach Miller zach.miller*acterra.org\">second last year<\/a>,” Lu said. “In 2013, we placed <a href=\"http:\/\/palyvoice.com\/2013\/02\/25\/science-olympiad-team-to-compete-in-states\/\">first over Mira Loma<\/a> by one point at the State competition and became the first team from the Bay Area to qualify to Nationals, so we're hoping to do that again.”\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s Science Olympiad team will be competing at the regional Science Olympiad competition on March 14 at San Jose City College.","date":"2015-03-07 18:17:18","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11015708_10205025921064956_871277614_o.jpg","categories":["News"],"tags":{"9689":"#norcal","39735":"alex lu","8944":"palo alto high school","14166":"paly scioly","39734":"regional","9074":"science olympiad","10045":"scioly"}},{"id":100168,"title":"Students to perform in state-wide musical","permalink":"http:\/\/palyvoice.com\/2015\/03\/07\/students-to-perform-in-state-wide-musical\/","content":"Six Palo Alto High School students are set to perform in a state-wide production of \"Hello! My Baby<i>\"<\/i> as part of a state thespian festival later this month in Southern California.\r\n\r\n[caption id=\"attachment_100814\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_74931.jpeg\"><img class=\"wp-image-100814\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_74931.jpeg\" alt=\"Sophomores Johnny Rohrbach and Nadia Leinhos and junior Lana Graves rehearse for an Paly production. They will be performing at the 2015 California State Thespian Festival later this month.\" width=\"300\" height=\"225\" \/><\/a> Sophomores Johnny Rohrbach and Nadia Leinhos and junior Lana Graves rehearse for an upcoming Paly production. They will be performing at the 2015 California State Thespian Festival later this month. Photo by Emilia Diaz-Magaloni.[\/caption]\r\n\r\nPaly junior Lana Graves and sophomores Alia Cuadros-Contreras, Nadia Leinhos, Jason Pollak, Johnny Rohrbach and Zoe Sego auditioned at Paly to be a part of the musical last April and were chosen a few weeks after auditioning. The students had to prepare a song and read scenes for the audition, Leinhos says. Twenty students in total from various parts of California were selected for the production, which is a part of the 2015 California State Thespian Festival.\r\n\r\nThe musical, set in New York City during the 1910s, follows two young couples involved in the developing pop music industry, according to Rohrbach. The show features music composed by George Gershwin, Irving Berlin and Jerome Kern.\r\n\r\n\"It [the plot] is an interesting web that gets spun,” Rohrbach said.\r\n\r\nThe student performers must travel to Los Angeles to rehearse for three weekends in total. According to sophomore Jason Pollak, the rehearsals last about 14 hours each day. While a production would typically be rehearsed in two- to three-hour intervals, the producers of this show have condensed the rehearsal time because so much travel is required to rehearse.\r\n\r\n“The show is turning out pretty well so far, although a lot of work has been squeezed into maybe five total days of rehearsal since the beginning of the project,” Leinhos said.\r\n\r\nAccording to Pollak, the cast has one more rehearsal before performing and is now focused on making sure the show runs smoothly.\r\n\r\nRohrbach encourages anyone who will be in the Southern California area to come watch the play.\r\n\r\n“I think it’ll turn out really well,\" Rohrbach said. \"It’ll be well worth it in the end.”\r\n\r\nThe show was created and written by Cheri Steinkellner, a Tony-nominated and Emmy-winning playwright who also wrote the popular musical \"Sister Act.\"\r\n\r\nLeinhos says she wanted to be a part of the show because of Steinkellner's mindset.\r\n\r\n“She [Steinkellner] wants our generation to learn and enjoy the songs that gave kids hope and joy so long ago, and I think with us bringing the show to State Festival, we're on our way to helping achieve that goal for her,” Leinhos said.\r\n\r\nCalifornia Thespians, a chapter of the Educational Theatre Association, is sponsoring the production, according to Rohrbach.","excerpt":"Six Palo Alto High School students are set to perform in a state-wide production of \"Hello! My Baby\" as part of the 2015 California State Thespian Festival. \r\n\r\n\r\n","date":"2015-03-07 17:56:16","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_74931.jpeg","categories":["A&amp;E Section Spotlight","Entertainment","Spotlight"],"tags":{"9699":"actors","40152":"alia cuadros contreras","40071":"hello my baby","40150":"jason pollak","34226":"johnny rohrbach","40149":"lana graves","8906":"music","19628":"musical","40151":"nadia leinhos","8944":"palo alto high school","8953":"paly","8996":"play","40135":"production","40072":"state thespian festival","40073":"steinkellner","9159":"theater","9160":"theatre","40148":"zoe sego"}},{"id":100807,"title":"SatireDay Cartoon 2","permalink":"http:\/\/palyvoice.com\/2015\/03\/07\/satireday-cartoon-2\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\"><img class=\"aligncenter wp-image-100808 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\" alt=\"SDC2\" width=\"600\" height=\"589\" \/><\/a>","excerpt":"Check out the weekly cartoon.","date":"2015-03-07 11:50:49","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg","categories":["Entertainment","Uncategorized"],"tags":{"39025":"cartoon","40209":"humor","40208":"satireday","39024":"satireday cartoon"}},{"id":100692,"title":"Season preview: Girls&#8217; lacrosse starts strong","permalink":"http:\/\/palyvoice.com\/2015\/03\/07\/season-preview-girls-lacrosse-starts-strong\/","content":"[caption id=\"attachment_71990\" align=\"alignnone\" width=\"417\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg\"><img class=\" wp-image-71990\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg\" alt=\"The Palo Alto High School girls' lacrosse team poses for a post-victory picture. The Vikings triumphed over the Lancers, 10-9, and will face Saratoga in the finals on Saturday. Photo by Molly Fogarty.\" width=\"417\" height=\"313\" \/><\/a> The Palo Alto High School girls' lacrosse team poses for a post-victory picture after beating the Lancers last season. The Vikings won the SCVAL championship last year.  Photo by Molly Fogarty.[\/caption]\r\n\r\nThe Palo Alto High School girls’ lacrosse team, with a non-league record of 1-0 and a league  is coming off a 12-2 win against Burlingame High School and looking to defend the Santa Clara Valley Athletic League championship title this coming season.\r\n\r\n\"To accomplish this [winning SCVAL] I teach the girls we need measurable goals that will get us there,\"Viking coach Jamie Nesbitt said. \"Holding opponents to under eight goals is always top of the list, along with winning more than 50 percent of the draws.\"\r\n\r\nThe team finished last year with an overall record of 13-4 and league score record of 12-1. The team only lost six seniors and has most of the starters returning.\r\n\r\n“We have a great team this year and a couple new really talented underclassmen,\" junior midfielder Maya Benatar said. \"I'm excited to see how they add to the team.\"\r\n\r\nThe Vikings also hope to beat cross-town rival Gunn High School twice this year after going 1-1 last season.\r\n\r\n“Gunn beat us once last year and I do think they will be the most difficult to beat,\" Benatar said. \"We are really hoping to come out on top against them.”\r\n\r\nThe Vikings will play their first league game against Menlo-Atherton High School at 1 p.m. on Saturday at Menlo-Atherton.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ lacrosse team is coming off a win against Burlingame 12-2 and looks to defend the SCVAL championship title.","date":"2015-03-07 00:17:07","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg","categories":["Sports"],"tags":{"8734":"girls","8836":"Lacrosse","8953":"paly","9012":"preview","40144":"seasonpreview","9120":"sports"}},{"id":100757,"title":"Preview: Girls&#8217; soccer to face off against Mountain View in CCS finals","permalink":"http:\/\/palyvoice.com\/2015\/03\/06\/preview-girls-soccer-to-face-off-against-mountain-view-in-ccs-finals\/","content":"In its first appearance in the Central Coast Section finals <a href=\"%20http:\/\/palyvoice.com\/2009\/02\/28\/node-20900\/\" target=\"_blank\">since 2009<\/a>, the Palo Alto High School girls’ soccer team (17-2-1,9-2-1) will take on Mountain View High School (17-3-1,10-1-1) in a final battle for dominance Saturday.\r\n\r\n[caption id=\"attachment_100786\" align=\"alignright\" width=\"398\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_3002.jpg\"><img class=\"wp-image-100786 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_3002.jpg\" alt=\"Junior Jacey Pederson drives forward with the ball in the CCS quarterfinals game against Menlo-Atherton (1-0). Pederson scored the only goal of the game in a skillful solo effort. Photo by George Liu.\" width=\"398\" height=\"265\" \/><\/a> Junior Jacey Pederson drives forward with the ball in the CCS quarterfinals game, Saturday Feb. 28 at Paly, against Menlo-Atherton. Pederson scored the only goal of the game in a skillful solo effort, resulting in a 1-0 win. Photo by George Liu.[\/caption]\r\n\r\nPaly came in second in the De Anza League to Mountain View this year, beating the team once, 2-0, and losing once, 2-1. Senior goalie Sarah Lim said the team is looking forward to the match-up.\r\n\r\n“They [The Spartans] are a very skilled team, and we know what we are up against,” Lim said. “I think our team is stoked for the game and will leave everything we've got on the field. It should be a good game. We've been looking to win CCS for a long time now. Paly hasn't won since 1982, I believe, and this weekend we have a chance to change that.”\r\n\r\nThe Vikings approach the title-determining game with high hopes after their triumphant win of 5-0 last Wednesday over Santa Teresa High School (15-7,10-4), which the Vikings lost to last year in the semifinals. Junior defender and midfielder Jacey Pederson said the team played well against Santa Teresa.\r\n\r\n“We played awesome in our <a href=\"http:\/\/palyvoice.com\/2015\/03\/03\/liveblog-girls-soccer-ccs-semifinals-vs-santa-teresa\/\" target=\"_blank\">last game <\/a>– probably the best we've played together all season,” Pederson said. \"We were really just vibing and all on the same page.”\r\n\r\nLim agreed with Pederson and said the Vikings beat their opponents players to the ball, connected their passes and finished their its chances.\r\n\r\n“We definitely want to continue playing the way we have been recently,” Lim said.\r\n\r\nWin or lose, CCS is the highest the Vikings can climb – girls' soccer does not have a state championship tournament.\r\n\r\nThe Vikings will take on Mountain View in the CCS finals at 10 a.m. on Saturday at Valley Christian High School.","excerpt":"In its first appearance in the Central Coast Section finals since 2009, the Palo Alto High School girls’ soccer team (17-2-1,9-2-1) will take on Mountain View High School (17-3-1,10-1-1) in a final battle for dominance this Saturday.","date":"2015-03-06 19:04:38","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_3002.jpg","categories":["Sports","Spotlight"],"tags":{"8568":"CCS","40198":"ccs finals","10198":"girls soccer","40200":"girls soccer ccs","25078":"jacey pederson","29989":"mountain view","8944":"palo alto high school","10312":"paly soccer","40201":"santa teresa","40197":"sarah lim","9110":"Soccer","40199":"soccer ccs"}},{"id":100067,"title":"Pros and cons of new suicide prevention feature on Facebook","permalink":"http:\/\/palyvoice.com\/2015\/03\/06\/pros-and-cons-of-new-suicide-prevention-feature-on-facebook\/","content":"Facebook users now have the opportunity to report a friend's post as \"hurtful, threatening or suicidal\" by utilizing a new feature that shares online resources and support for suicidal individuals on Facebook.\r\n\r\nAccording to the <a href=\"http:\/\/www.washington.edu\/news\/2015\/02\/25\/forefront-and-facebook-launch-suicide-prevention-effort\/\">University of Washington<\/a>, Facebook has partnered with <a href=\"http:\/\/www.nowmattersnow.org\/\">Now Matters Now<\/a>, the <a href=\"www.suicidepreventionlifeline.org\/\">National Suicide Prevention Lifeline<\/a>, <a href=\"http:\/\/www.save.org\/index.cfm?\">Save.org<\/a> and mental health experts at <a href=\"http:\/\/www.intheforefront.org\/\">Forefront: Innovations in Suicide Prevention<\/a> to give users the ability to draw attention to posts from distressed individuals.\r\n\r\nUsers who flag posts will arrive at the screen shown below, which allows them to contact another Facebook friend for support, message the suicidal person or connect with trained professionals at suicide helplines. Facebook will also review the flagged post, and if it is deemed a sign of distress, will set up a series of responses that could assist the potentially suicidal individual.\r\n\r\n[caption id=\"attachment_100075\" align=\"alignnone\" width=\"221\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.31.36-PM.png\"><img class=\"wp-image-100075\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.31.36-PM.png\" alt=\"Screen Shot 2015-02-26 at 1.31.36 PM\" width=\"221\" height=\"276\" \/><\/a> The following options appear when a user reports a potentially suicidal post on Facebook. The social media site with over 1.39 billion users introduced this new feature on Feb. 25 to offer support to individuals dealing with depression. Screenshot by Alex Merkle-Raymond.[\/caption]\r\n\r\nIn this article, we discuss both the pros and cons of such a feature.\r\n\r\nPros:\r\n\r\n<em>Student opinion: <\/em>I think it's a good thing, because there are a lot of people who post statuses that I don't feel comfortable commenting on, but I can tell something is going on,\" senior Jack Brook said. \"It's good that you can do this anonymously without feeling awkward.\"\r\n\r\n<strong>1. It's anonymous<\/strong>. Many Facebook users have hundreds of Facebook friends, many of whom may simply be acquaintances. However, the anonymity of this notification allows all Facebook friends to reach out to those who may be in pain, regardless of how close the two individuals are to one another.\r\n\r\n<strong>2. <\/strong><strong>There are options.<\/strong> The new service not only attempts to help the potentially suicidal individual, but it also offers help to the user who reports the post, because, according to Facebook, \"it's important for you to feel supported, too.\" Due to this belief, Facebook presents the user with the ability to reach out to a friend, chat with a trained helper or even find nearby counseling services.\r\n\r\n<strong>3. It shows you care.<\/strong> It is initially a Facebook friend who voices a sign of concern to the potentially suicidal individual. When the suicidal person receives a Facebook notification stating that someone believes they are in distress, the notification has the ability to make the suicidal person feel loved and cared for.\r\n\r\n<strong>4. Difficult situations are placed in the hands of professionals.<\/strong> Often, many friends and family members are simply not equipped to handle a suicidal situation and they may become overwhelmed. The tools Facebook provide, however, aim to direct suicidal individuals to trained resources and facilities that know how to properly handle such a situation.\r\n\r\n<strong>5. Better safe than sorry. <\/strong>Is there really any harm in reaching out to someone who is potentially upset? Often people just want to know that they are not alone and that they have support. This notification service assists in doing so.\r\n\r\nCons:\r\n\r\n<em>Student opinion<\/em>: \"It's a terrible thing,\" sophomore Johnny Rohrbach said. \"It's a complete invasion of privacy. I think you should be able to express yourself freely without people recommending a psychiatrist to you. If you want help, you should be able to seek it out yourself.\"\r\n\r\n<strong>1. It can be abused.<\/strong> Just like any other feature on Facebook, this feature could easily be used as a joke. Any status could theoretically be reviewed, soon turning this feature as a new way to \"poke\" friends. The service could be overwhelmed with false requests, making it easy for researchers to overlook any real inquiries.\r\n\r\n<strong>2. It's an invasion of privacy. <\/strong>Many see Facebook as a personal space for sharing posts, photos and information to friends. Giving users the ability to report a post, even if it is to be reviewed by professionals, is an invasion of privacy for those who want to keep their posts within their friend group. On top of this, a professional who knows nothing about the potentially suicidal individual shouldn't be allowed to deem a Facebook post suicidal if that person has absolutely no background on the individual.\r\n\r\n<b>3. It's limited.<\/b> This feature only works for people who post <em>statuses.<\/em> If someone posts a picture or shares a wall post, this same feature would not be available.\r\n\r\n<strong>4. It is difficult to access. <\/strong>To initially report a status, one must click on \"I don't like this post,\" then \"I think it shouldn't be on Facebook,\" then \"I think they might hurt themselves,\" and finally \"It's hurtful, threatening or suicidal.\" It takes many clicks to report such a post and it can often be difficult to decide which of the multiple choice options is most suitable for the post. The complexity of the reporting process may deter users from reporting potentially harmful posts.\r\n\r\n<b>5. It can make people feel uncomfortable.<\/b> Because some people utilize Facebook as a public journal or blog, there may be Facebook statuses with emotional content. Thus, some Facebook users may report these posts as a cry for help. The report may offend the original Facebook user who simply wanted to record his or her feelings. It may also lead them to change their posting behavior in the future.","excerpt":"This article discusses the pros and cons of a new Facebook feature, which seeks to share online resources for suicidal individuals, by allowing Facebook users to report a friend's post as \"hurtful, threatening or suicidal.\"","date":"2015-03-06 15:21:58","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-26-at-1.31.19-PM.png","categories":["Editor's Pick","Opinion"],"tags":{"40127":"cons","8689":"Facebook","40123":"Facebook feature","40132":"facebook update","10751":"jack brook","34226":"johnny rohrbach","8944":"palo alto high school","8953":"paly","8964":"paly voice","9011":"prevention","40128":"privacy","40126":"pros","40125":"pros and cons","40129":"suicidal","9135":"suicide","9136":"Suicide prevention","40124":"university of washington","38450":"update"}},{"id":100774,"title":"No school on March 13","permalink":"http:\/\/palyvoice.com\/2015\/03\/05\/no-school-on-friday-march-13\/","content":"","excerpt":"","date":"2015-03-05 21:45:31","author":"Lizzie Chun","categories":["Ticker"],"tags":{"40207":"b day","40205":"break","40206":"day off","32534":"holiday","33935":"schedule change"}},{"id":100651,"title":"Robotics team to compete at regional competition","permalink":"http:\/\/palyvoice.com\/2015\/03\/05\/robotics-team-to-compete-at-regional-competition\/","content":"[caption id=\"attachment_100723\" align=\"alignnone\" width=\"378\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11045754_1605464913003074_623212239_o.jpg\"><img class=\" wp-image-100723\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11045754_1605464913003074_623212239_o.jpg\" alt=\"The Palo Alto High School robotics team completed constructing its robot last week. The team spent over 220 hours on building and hopes to win at the Central Valley Regional robotics competition this weekend in Madera. Photo by Lauren Nolen\" width=\"378\" height=\"284\" \/><\/a> The Palo Alto High School robotics team completed constructing its robot last week. The team spent over 220 hours on building and hopes to win at the Central Valley Regional robotics competition this weekend in Madera. Photo by Lauren Nolen.[\/caption]\r\n\r\nAfter hundreds of hours spent in the lab dedicated to robot construction, the Palo Alto High School robotics team will compete this weekend at the Central Valley Regional robotics competition in Madera.\r\n\r\nAccording to sophomore public relations captain Lauren Nolen, each year there is a different game that the robot must be designed to compete in and in this year's competition, the game is called “Recycle Rush,\" with the objective being to pick up and stack as many totes as possible.\r\n\r\n“To accomplish this, we’ve built a robot with two 'arms' that tighten against the sides of the totes,” Nolen said. “Because of the amount of pressure used, the arms can also pick up recycling bins as well.”\r\n\r\nThe team additionally constructed another robot  to get more practice, according to Nolen.\r\n\r\n<span style=\"color: #373e4d;\">\"We’ve also actually built a second, practice robot, that will allow us to get a little more practice in before competitions since we aren’t allowed to use the original until we un-bag it at the competition site,\" Nolen said. <\/span>\r\n\r\nNolen said that the robotic lab was officially open for more than 220 hours over six weeks and believes that the team has a high chance of winning because of the hard work they put in the past couple seasons.\r\n\r\n“Obviously, we want to win or get as close to winning as possible,” Nolen said. “If we win this competition, we get to goto the World Championships in St. Louis, Missouri.”\r\n\r\nAccording to sophomore lab management captain Kenny Cheung, teamwork played a large role in making the robot since everyone has to communicate and make sure everything works when it all comes together.\r\n\r\n“Because the robot is so complex with many different subsystems, teamwork is essential in constructing it — and we definitely have been on a great upward trajectory in every aspect of the team,” Cheung said.\r\n\r\nFollowing the Central Valley Regional competition, which starts on Thursday, March 5, and ends March 8, the team will be able to attend the Silicon Valley Regional competition from April 1 to 4.\r\n\r\nCheung said that after the amount of effort put into constructing the robot, it will be exciting to see the robot on the field competing for the first time.\r\n\r\n“This year's robot turned out really well and we are eager to see it compete against other teams,” Cheung said.\r\n\r\n&nbsp;","excerpt":"After hundreds of hours spent in the lab dedicated to robot construction, the Palo Alto High School robotics team will compete this weekend at the Central Valley Regional robotics competition in Madera.","date":"2015-03-05 13:42:22","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11045754_1605464913003074_623212239_o.jpg","categories":["News","Spotlight"],"tags":{"40131":"central valley regional competition","40130":"kenny cheung","37378":"lauren nolen","8944":"palo alto high school","8953":"paly","9049":"robotics"}}]