[{"id":113388,"title":"Blogger without borders: Refugee stories, Part 1","permalink":"http:\/\/palyvoice.com\/2015\/12\/11\/blogger-without-borders-refugee-stories-part-1\/","content":"<em>The first installment of \"Blogger without borders: Refugee stories,\" where <span class=\"Apple-style-span\">junior Bianca Al-Shamari shares refugees' stories that are translated from Arabic. <\/span><\/em>\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #1<\/strong><\/span>\r\n\r\n<em>This is an interview with a Syrian family from the city of Rek’ka. The father spoke more often than the children present: Jomana, Shaima, Ali and Hammody, who are all less than 11 years old. Jomana, the eldest of the four, is learning German and hopes to enroll into school for 2016.<\/em>\r\n\r\nFather: \"We ran away from ISIS and the bombardment. The children couldn't go to school, and the girls had to constantly wear a Hijab for their safety. The airplanes [Air Forces] bombed everywhere. Our town was controlled by ISIS. They slaughtered people. There was bombardment by the air forces and houses were destroyed. There were no schools, and nowhere to go. They beat people, and they whipped people. Now that we're safe in Austria, we're going to stay here. That is our situation, a tragic situation. Here in Europe, it's better and the kids can go to school.\"\r\n\r\nJomana, age 11: \"We went to the Turkish borders from Syria by a boat, and then we walked our way to Austria through Macedonia, Serbia and Greece.\"\r\n\r\nUpon request of the family, last names, photos and audio files are not available.\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #2<\/strong><\/span>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Arabic-1.m4a\"][\/audio]\r\n\r\n<em>Upon request of the individual, his name is to be kept private but gender pronouns are allowed. This man lost his family in violent attacks throughout Iraq, and ventured to Austria alone. Initially en route to Germany, he decided to stay in Austria upon his arrival in Vienna, in hopes of building a life in the city of Schwechat.<\/em>\r\n\r\n\"The journey took about 20 days. My situation was very bad, and I could not stay in Iraq. I was a normal citizen. I dared to take the risk and move to Austria since it is more secure for me. I swear to God, life is beautiful. I do not have family. I am living alone.\"\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #3<\/strong><\/span>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Arabic-2.m4a\"][\/audio]\r\n\r\n<em>Al-Khalifawi arrived in Austria in late August, leaving his family behind. He plans to bring his family to safety once he secures a life in Austria, but describes the process as \"a paper mess and a constant worry.\" Al-Khalifawi does not know where his family is, yet remains determined and hopeful for a future in which they will be reunited.<\/em>\r\n\r\n\"My name is Erkan Ibrahim Al-Khalifawi and I come from Iraq. My journey to Austria took about 2 weeks. The current situation in my country is really bad and it is getting worse. I feel secure where I am, but my family is at the moment in Iraq. I am really worried about them. I left them at a place that is almost secure, near Kurdistan. Because my family is in an unknown place, life in the upcoming 6 months is unknown for me.\"\r\n\r\n<em>Thank you to Martina Entriken, Noor Al-Shamary, Donnesh Farman, Naram El-shamary, and Hind Hassan Alshamary for written translations. And to Hassan Kathem for spoken translations that assisted in linking two worlds.<\/em>","excerpt":"The first installment of \"Blogger without borders: Refugee stories,\" where junior Bianca Al-Shamari shares the stories of refugees currently situated in Austria.","date":"2015-12-11 14:23:35","author":"Bianca Al-Shamari","categories":["Uncategorized"],"tags":[]},{"id":112053,"title":"Blogger without borders: Refugee stories","permalink":"http:\/\/palyvoice.com\/2015\/12\/11\/blogger-without-borders-refugee-stories\/","content":"<em>The following piece is the third installation of <a href=\"http:\/\/palyvoice.com\/?s=blogger+without+borders\">“Blogger without borders,”<\/a> a blog by junior Bianca Al-Shamari that details her gap semester in Austria from September 2015 to January 2016. Al-Shamari will discuss everything from the refugee crisis in Western Europe to the cultural experience she’s encountering in Vienna. She plans to immerse herself into a new culture and share an international perspective with Palo Alto High School through photos, interviews and travel updates.<\/em>\r\n\r\nWe are in the midst of one of the greatest population migrations in modern history. But given the recent attacks in France, Lebanon, Iraq, Russia and the United States, many have either stopped accepting refugees or enforced border control, which has elevated tensions and created widespread controversy among both citizens and the millions seeking asylum.\r\n\r\nIn late October, I learned of a nearby location in the Vienna District of Austria that housed newly-arrived refugees. In an effort to shed light on the stifled experiences these individuals have gone through on their path to safety, I spoke with some of the refugees who came from Syria, Afghanistan, Iraq and Mongolia.\r\n\r\nI met with a total of 16 individuals who solely spoke Arabic or Farsi. It was my luck to have met Hassan Kathem, an Iraqi refugee who spent some time studying in Ukraine, learning enough Russian for the two of us to speak together. Kathem helped me communicate with some of the refugees on a more personal level by translating the Arabic words of his fellow refugees to Russian.\r\n\r\nMany of these families have lost their homes and loved ones during traumatic events. It is important to keep an open mind and heart as we take a small glance into the world of stories held by those affected during the European refugee crisis. Today, regardless of language barriers, we have the opportunity to hear the real voices of the refugee crisis. I look forward to sharing these stories with you through a three-part installment.\r\n\r\n<span style=\"text-decoration: underline;\"><strong>My translator, a refugee:<\/strong><\/span>\r\n\r\n<em>The first story I would like to share is with my Russian-Arabic translator, Hassan Kathem, who briefly studied in Ukraine before returning to his home in Iraq. Shortly after his return, the national tension and chaos worsened in Iraq and his family told him to flee and leave them behind. With Kathem's help, I was able to speak to refugees without any written translations, providing a link between two worlds.<\/em>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Arabic-3.m4a\"][\/audio]\r\n\r\n\"I'm Hassan Kathem and I come from Iraq. Before the war worsened, I studied in Ukraine for two years, learning Russian, which allows me to speak with some people in [Vienna], like you. The current situation in my country is not good and I am expecting it to get worse over the next 5 years. Now I’m just living, away from the dangers of my home.  My journey was short: it took 8 days once I traveled from Turkey to Vienna. I feel secure. I expect life to be good through this year when I am in Vienna. I have 4 sisters and 4 brothers, but my family is not here, they are back in Iraq. As of now I’m learning German. I can speak, but it's not strong.\"\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/12\/11\/blogger-without-borders-refugee-stories-part-1\/\">Part 1<\/a> - Translated from Arabic\r\n\r\nPart 2 - <em>These installments will be available in the coming days.<\/em>\r\n\r\nPart 3 - <em>These installments will be available in the coming days.<\/em>","excerpt":"An installment of \"Blogger without borders,\" where junior Bianca Al-Shamari shares the stories of refugees currently situated in Austria.","date":"2015-12-11 14:14:22","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-11-at-2.10.14-PM.png","categories":["Blogger without borders","Spotlight"],"tags":["arabic","Austria","bianca","blog","blogger without borders","France","iraq","kathem","lebanon","migrants","refugees","russian","united states","vienna"]},{"id":113150,"title":"Madrigals is fit for royalty","permalink":"http:\/\/palyvoice.com\/2015\/12\/11\/madrigals-is-fit-for-royalty\/","content":"Colorfully clothed choir students gather onstage, donning 16th century gowns and caps. As the lights dim, the students – now transformed into English peasants and princesses – begin to sing. Although the song's words are in Spanish, the rhythm transcends the language barrier and transports the audience to the year 1536.\r\n\r\nThe annual Madrigals Feaste brought medieval life to the stage at Jordan Middle School last weekend. A staple in the Palo Alto High School choirs’ annual concerts, the feast featured creative songs and a comedic plot, highlighting the choirs' talent and creativity.\r\n\r\n<span style=\"font-weight: 400;\">The performance’s plotline revolved around a royal family in medieval England. King Henry VIII (senior Ryan Jamison) has gathered the audience in celebration of his marriage to Queen Jane (senior Lana Graves)  after his previous wife was decapitated for bearing him a daughter instead of a son. Unfortunately for the family (and England’s neighbors), Princess Elizabeth is kidnapped on the day of Henry VIII and Jane’s marriage celebration. Fearing the King’s wrath, Princess Mary (senior Luma Hamade), and Queen Jane search for the princess with the help of two comedic detectives, Lady Olivia (senior Jenny Xin) and Lord Elliot (sophomore Sam Kim) as well as a crier (junior Edward Park). The search includes a series of songs by the servants and royal family.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Madrigals’ plot was amusing and included hilarious allusions to celebrities ranging from Taylor Swift to Donald Trump. (King Henry VIII at one point threatens to “build a wall” around England.) The play was properly spaced so that neither commentary nor songs dominated the Madrigals’ entirety. In addition, a happy (yet unanticipated) ending properly concluded the play.<\/span>\r\n\r\n[caption id=\"attachment_113261\" align=\"alignright\" width=\"576\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12188208_1530006023984891_8385678320505281814_o.jpg\"><img class=\"wp-image-113261\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12188208_1530006023984891_8385678320505281814_o.jpg\" alt=\"12188208_1530006023984891_8385678320505281814_o\" width=\"576\" height=\"384\" \/><\/a> Sophomore Lucia Dong, junior Anisha Patwardhan, junior Soo Kim, junior Kaitlin Chiu and junior Taylor Duncan perform a Christmas song at the Madrigal Feaste. The Feaste featured each choir singer, and included Christmas and Latin music. Photo courtesy of Brian Hwang.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The singing was exceptional and featured every member of Paly choir. Songs varied greatly, from the cheerful Christmas songs by Paly’s acapella groups, to soulful tunes (some in a different language). Some songs that stood out included \"In My Little Picture Frame,\" which featured a shaker and melancholy tunes, \"Esta Noche Nace el Niño,\" led by soloist Graves, and \"Procession.\" In addition, many songs included soloists who guided the choir. The music made up a majority of the Feaste.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert’s food was both plentiful and elegant. A three course meal began with sugary scones, ripe strawberries and water and tea. The main course, cucumber sandwiches, was an appetizing meal with fresh cucumbers and delectable bread. For dessert, various chocolate and candy pieces left me feeling like royalty. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Other aspects of the event were also a success. The set, which included a castle's background and Christmas wreaths, was minimalistic yet appropriate for a song-based play. The characters’ costumes were elaborate and elegant, featuring 1500s trends and stylish caps and gowns. Each costume was unique and colorful, and a large effort appeared to have been put into their design. Tables in the seating area were lavishly decorated, transporting the audience to the 16th century. A jester (Student Activities Director Matthew Hall) also performed entertaining juggling tricks with balls and blocks of wood that left the crowd laughing at his antics.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While the singing was superb and the plot entertaining, Madrigals was longer than necessary (about 2 and a half hours) and it was difficult to concentrate for the duration of the performance. However, the characters consistently mentioned audience members and an auction mid-way through kept everyone engaged.<\/span>","excerpt":"The annual Madrigals Feaste brought medieval life to the stage at Jordan Middle School this past weekend. A staple in the choirs’ annual concerts, Madrigals featured creative songs and a comedic plotline. ","date":"2015-12-11 11:59:13","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12188208_1530006023984891_8385678320505281814_o.jpg","categories":["Entertainment","Reviews","Spotlight"],"tags":["choir","feaste","madrigals","palo alto","palo alto high school","paly","performance","play","review","song"]},{"id":111786,"title":"Review: Adele&#8217;s &#8220;25&#8221; suggests depth beyond &#8220;Hello&#8221;","permalink":"http:\/\/palyvoice.com\/2015\/12\/11\/review-new-adele-album-suggests-depth-beyond-hello\/","content":"[caption id=\"attachment_113222\" align=\"aligncenter\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/x.jpg\"><img class=\"wp-image-113222\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/x.jpg\" alt=\"x\" width=\"617\" height=\"347\" \/><\/a> Adele performs at the 17th NRJ Music Awards last month in Cannes, France. Her performance of \"Hello\" marked the second live performance since her three-year hiatus, following a taped BBC Music special. Photo courtesy of Associated Press.[\/caption]\r\n\r\nA phenomenal singer-songwriter whose accolades extend beyond Grammy Awards, Academy Awards and world records, Adele Adkins is no stranger to success. With her latest record “25” – released Nov. 20 – she creates a springboard to further recognition on the charts, the radio and at award shows around the world.\r\n\r\n“25” is a breath of fresh air. It’s unmistakably Adele, spotlighting her signature soulful sound we’ve grown to love. The familiar high notes heard on past hits \"Rolling in the Deep\" and \"Someone Like You\" are present in many of her latest songs. Yet with a foot in this familiar territory, Adele ventures into styles of music foreign to previous albums. Her third studio album experiments with various electronic elements and dips lightly into folk music. These risks are a result of various influences that Adele experienced while writing \"25.\"\r\n\r\n“I was exposed to a lot of country, rockabilly and bluegrass because I was touring for such a long time,” Adele said in <a href=\"http:\/\/www.thesun.co.uk\/sol\/homepage\/showbiz\/music\/3732379\/Adeles-up-for-some-grass.html\">an interview with The Sun<\/a>. “The melodies and to-the-point lyrics I have found in a lot of American styles of music is definitely something I'm going be pursuing heavily from now on.”\r\n<blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 658px; padding: 0; width: calc(100% - 2px);\" data-instgrm-version=\"6\">\r\n<div style=\"padding: 8px;\">\r\n<div style=\"background: #F8F8F8; line-height: 0; margin-top: 40px; padding: 35.9259259259% 0; text-align: center; width: 100%;\">\r\n<div style=\"background: url(data:image\/png; base64,ivborw0kggoaaaansuheugaaacwaaaascamaaaapwqozaaaagfbmveuiiii9pt0ehh4gib4hibkchbwchbwchbydr+jqaaaachrstlmaba4yhyqsm5jtamwaaadfsurbvdjl7zvbegmhcaqbaf\/\/42xcnbpaqakcm0ftumfaaibe81iqbjds3ls6zs3bipb9wed3yyxfpmhrft8sgyrcp1x8ueuxlmznwelfoycv6mhwwwmzdpekhlhlw7nwjqkhc4uizphavdza2jpzudsbzzinae2s6owh8xpmx8g7zzgkeopuoyhvgz1tbcxmkd3kwnvbu0gkhkx+izilf77iofhry1nyfnb\/lqpb79drwoyjva\/davg9b\/rlb4cc+nqgdz\/tvbbbnr6gbreqn\/nrmdgaqeej7whonozjf+y2i\/fzou\/qaaaaaelftksuqmcc); display: block; height: 44px; margin: 0 auto -44px; position: relative; top: -22px; width: 44px;\">\r\n<p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https:\/\/www.instagram.com\/p\/-PDH4nAfHA\/\" target=\"_blank\">A photo posted by @adele<\/a> on <time style=\"font-family: Arial,sans-serif; font-size: 14px; line-height: 17px;\" datetime=\"2015-11-18T17:49:21+00:00\">Nov 18, 2015 at 9:49am PST<\/time><\/p>\r\n\r\n\r\n\r\n<\/blockquote>\r\n<script src=\"\/\/platform.instagram.com\/en_US\/embeds.js\" async=\"\" defer=\"defer\"><\/script>Touching on topics from nostalgia to motherhood, the songs form a cohesive underlying theme: self-reflection. Each of the 11 tracks tells a distinct story, portraying a different angle of Adele's growth as understood by Adele herself. This deep level of understanding is arguably what makes her songs such huge hits. Because her ability to translate her emotions into song is so powerful, listeners themselves begin to self-reflect too.\r\n\r\nIn <a href=\"https:\/\/twitter.com\/Adele\/status\/656787881349009408\">an open letter<\/a> to her fans, the star shares the background of \"25\" and how she defines this album.\r\n\r\n“My last record was a break-up record and if I had to label this one, I would call it a make-up record,” Adele writes. “I’m making up with myself. Making up for lost time. Making up for everything I ever did and never did. … And I’m sorry it took so long, but you know, life happened.”\r\n\r\nHere is our take on four notable songs of \"25.\"\r\n<iframe width=\"700\" height=\"1228\" frameborder=\"0\" scrolling=\"no\" style=\"overflow-y:hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/9256933-hello\"><\/iframe>\r\n\r\n“25” was met with groundbreaking success, selling 3.38 million copies in the United States in the first week alone. No artist has ever come close to this incredible feat, with the second fastest-selling album at 2.42 million for NSYNC's \"No Strings Attached,\" according to Nielsen SoundScan Tracking. \"25\" soared to No. 1 on the iTunes album chart within seconds after its release, and by the second day, all 11 tracks individually secured spots in the Top 30s of the iTunes singles chart.\r\n\r\nPerhaps this achievement is due in part to Adele withholding \"25\" from music streaming platforms such as Spotify and Apple Music. In an industry where <a href=\"http:\/\/www.billboard.com\/articles\/business\/6627139\/nielsen-2015-half-year-report-detail-taylor-swift-streaming\" target=\"_blank\">music streaming is growing<\/a> and <a href=\"http:\/\/www.forbes.com\/sites\/hughmcintyre\/2014\/08\/30\/us-album-sales-hit-new-all-time-low\/\" target=\"_blank\">album sales are at an all time low<\/a>, this decision may have led casual fans to purchase the album. Adele had also initially withheld her previous album, \"21,\" from Spotify because she wanted to limit the songs to paying subscribers.\r\n\r\n[caption id=\"attachment_113235\" align=\"alignleft\" width=\"324\"]<img class=\"wp-image-113235\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/DSC_6305edit.jpg\" alt=\"DSC_6305edit\" width=\"324\" height=\"216\" \/> \"25\" is Adele's third studio album. According to an interview with British radio DJ Nick Grimshaw, Adele had scrapped an album about motherhood because it was \"too boring.\" \"It took me a long time to focus on how I wanted to write and what I wanted to write about,\" she said. Photo by Jeanette Wong.[\/caption]\r\n\r\nOn Oct. 23, 2015, Adele’s first single in three years, “Hello,” was dropped world-wide and was an instant success. On Vevo, the music video generated the highest number of views in a 24-hour span (27.7 million) and was the fastest video to reach 100 million views. The single entered the Billboard chart at No. 1, with 1,112,000 digital downloads in its first week.\r\n\r\nAdele released her debut album, \"19,\" on Jan. 28, 2008 and it was nominated for numerous accolades including a Mercury Prize and the Grammy Award for Best New Artist. Three years later, Adele dropped her second album, \"21,\" which won the 2012 Grammy Award for Album of the Year and the Brit Award for British Album of the Year.\r\n\r\nWith \"25,\" it should come to no surprise if she racks up another host of awards.","excerpt":"A phenomenal singer-songwriter whose accolades extend beyond Grammy Awards, Academy Awards and world records, Adele Adkins is no stranger to success. With her latest record “25” – released Nov. 20 – she creates a stepping-stone to further recognition on the charts, the radio and at award shows around the world.","date":"2015-12-11 11:58:36","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/x.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Reviews","Spotlight"],"tags":["25","Adele","album","album review","hello","music"]},{"id":113184,"title":"Season Preview: Boys&#8217; basketball welcomes new coach and new goals","permalink":"http:\/\/palyvoice.com\/2015\/12\/10\/season-preview-boys-basketball-welcomes-new-coach-and-new-goals\/","content":"[caption id=\"attachment_113339\" align=\"alignleft\" width=\"309\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12363982_1716894831874746_346671881_o-3.jpg\"><img class=\" wp-image-113339\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12363982_1716894831874746_346671881_o-3.jpg\" alt=\"Physical Education teacher Peter Diepenbrock is returning to his former position as coach of boys' basketball. He previously coached the team in 2005-07 and now has strong expectations for the upcoming season. \" width=\"309\" height=\"464\" \/><\/a> Physical Education teacher Peter Diepenbrock is returning to his former position as coach of boys' basketball. He previously coached the team in 2005-07 and now has strong expectations for the upcoming season. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School boys' basketball team looks to achieve a great season with a former star coach and its group of talented players.\r\n\r\nLast season, Paly (7-5, 17-8) began the year with successful games but ultimately fell in the second round of Central Coast Section playoffs against Santa Teresa high school.\r\n\r\n“They started off very strong and won their first 20 or so games but then they had a little bit of a slide at the end,” new head coach and Physical Education teacher Peter Diepenbrock said.\r\n\r\nDiepenbrock previously coached the boys’ varsity team during the 2005-06 and 2007-08 seasons and is returning to his former position, replacing Adam Sax. Junior guard Jack Simison believes that a new coach may be a big factor in leading the Viking's successful season.\r\n\r\n“I believe with the new coaching staff and a lot of coach-able players, we will do better this year,\" Simison said. \"Once we are able to get the full team together our coaching staff will take us through what I believe will be a great season.”\r\n\r\n[caption id=\"attachment_97467\" align=\"alignright\" width=\"465\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg\"><img class=\" wp-image-97467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg\" alt=\"Sophomore forward Max Dorward boxes out his opponent in a home game against Wilcox High School last season. The team went on to Central Coast Section playoffs, losing against Santa Teresa high school and ending their season. Photo by Josh Yuen. \" width=\"465\" height=\"310\" \/><\/a> Sophomore Viking forward Max Dorward boxes out his opponent in a home game against Wilcox High School last season. The team went on to Central Coast Section playoffs, losing against Santa Teresa high school and ending their season. Photo by Josh Yuen.[\/caption]\r\n\r\nOne of the challenges the team faces this year is the loss of players during initial practices. Seniors Justin Hull and Mikey Grandy and sophomores Paul Jackson, Bryant Jefferson and Max Dorward were completing their football season, as the Vikings continued into the CCS <a href=\"http:\/\/palyvoice.com\/2015\/12\/02\/season-recap-football-falls-in-ccs-semi-final-to-milpitas\/\">semi-finals<\/a> and were unable to practice with the basketball team. However, Simison says this obstacle shouldn’t affect the team too drastically.\r\n\r\n“Those players will cause setbacks, but eventually we will be back to normal or even better than before,” Simison said.\r\n\r\nThe team lost key scorers Kevin Mullin and John Rojahn to graduation, according to Diepenbrock. However, Diepenbrock said he believes this will provide an opportunity for the team to discover new talented players.\r\n\r\n“They both were very good seniors who scored a lot of the points,” Diepenbrock said. “One of our challenges is going to be finding out who are going to be our scorers — that's a big void we are going to have to fill.”\r\n\r\nSimison stated that he thinks this year’s team is filled with great players who can be successful.\r\n\r\n“The team this year is a solid group,\" Simison said. \"I am proud to be playing with the selected players this year.”\r\n\r\nDiepenbrock reiterated this thought and is entering the season hoping for success.\r\n\r\n“They are a very unselfish team and I think we are going to have a strong team chemistry,” Diepenbrock said. “ I think it's a good group and I have very high expectations.”\r\n\r\nThe team will take on Piedmont Hills High School at 5 p.m. tonight in San Jose in its first game of the season.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys' basketball team looks to achieve a great season with a former star coach and its group of talented players.","date":"2015-12-10 14:54:31","author":"Chayenne Greenberg","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12363982_1716894831874746_346671881_o-3.jpg","categories":["Sports"],"tags":["boys basketball","bryant jefferson","Jack Simison","john rojan","justin hull","kevin mullin","max dorward","mikey grandy","palo alto vikings","paul jackson","Peter Diepenbrock","piedmont hills high school"]},{"id":112766,"title":"Wrestling looks to rebuild in new season","permalink":"http:\/\/palyvoice.com\/2015\/12\/10\/wrestling-looks-to-rebuild-in-new-season\/","content":"[caption id=\"attachment_113053\" align=\"alignnone\" width=\"598\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-08-at-8.58.50-AM.png\"><img class=\"wp-image-113053\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-08-at-8.58.50-AM.png\" alt=\"Screen Shot 2015-12-08 at 8.58.50 AM\" width=\"598\" height=\"413\" \/><\/a> Palo Alto high School junior Seth Goyal attacks junior Emilio Bautista of Half Moon Bay High School at the Peninsula Varsity Tournament on Dec. 5. Goyal placed first overall, while senior Eric Oshima took third. Photo courtesy of Seth Goyal.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School wrestling team is looking to rebuild its program this upcoming season with a new coach after placing sixth at the Santa Clara Athletic Valley League Finals last year. <\/span>\r\n\r\n\"This year is mostly about building up the program for next year and having our few studs do well individually,\" junior Seth Goyal said.\r\n\r\n<span style=\"font-weight: 400;\"> The team kicked off its season with a win at the Peninsula Varsity Tournament on Dec. 5. According to the team's website<\/span>, Goyal placed first while senior Eric Oshima took third.\r\n\r\n<span style=\"font-weight: 400;\">“The wins last weekend were a strong start to the season,\" Goyal said. \"It has definitely motivated us for our upcoming tournaments and duals.\"<\/span>\r\n\r\nJonathan Kessler is this season's head coach, taking over for Braumon Creighton, who coached for one season.\r\n\r\n\"Jonathan, our new coach, was the assistant varsity coach at a high school in New York for nine years,\" Goyal said. \"He is experiencing the Palo Alto atmosphere for the first time and is still learning the in and outs of Paly's wrestling program.\"\r\n\r\nAs a new coach, Kessler us striving to establish the framework of the program for many years to come.\r\n\r\n\"The key areas that we are focusing on this season include the ability to score from all positions, conditioning and weight-lifting,\" Kessler said.\r\n\r\nAccording to Goyal, a potential concern this season is the lack of experience on the team.\r\n\r\n<span style=\"font-weight: 400;\">“The only thing that we are lacking is upperclassmen leadership since there are so few of us, but that is negated by the freshmen stepping up and accepting that challenge,” Goyal said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Goyal says the graduation of three seniors will not hinder the team. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The team is mostly freshmen and sophomores, but most people have wrestled at least one year already, and there are a couple of freshmen who have trained since sixth or seventh grade with me,” Goyal said. “Next year we will only be losing one senior so there won't be much of a disturbance again.”<\/span>\r\n\r\nKey players to look out for this season include Goyal, Oshima, junior Sara Aguilar and freshmen Callum Day-Ham and Andrew Wang.\r\n\r\nThe team's first wrestling dual meet will be on Jan. 6 at Monta Vista High School.","excerpt":"The Palo Alto High School wrestling team is looking to rebuild its program this upcoming season with a new coach after placing sixth at the Santa Clara Athletic Valley League Finals last year.\r\n\r\n\r\n","date":"2015-12-10 11:24:14","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-08-at-8.58.50-AM.png","categories":["Sports"],"tags":["andy","callum","day-ham","eric","goyal","jonathan","kessler","oshima","palo alto high school","paly","seth","Wang","wrestling"]},{"id":113287,"title":"Verbatim: Should PAUSD rename Jordan Middle School?","permalink":"http:\/\/palyvoice.com\/2015\/12\/10\/verbatim-should-pausd-rename-jordan-middle-school\/","content":"<span style=\"font-weight: 400;\">The Paly Voice recently asked students what they thought about a petition which urges the Palo Alto School Board to rename David Starr Jordan Middle School. The <a href=\"https:\/\/www.change.org\/p\/palo-alto-unified-school-district-board-of-education-rename-jordan-middle-school-honor-a-role-model-not-a-racist?recruiter=421476350&amp;utm_source=share_petition&amp;utm_medium=copylink\">petition<\/a> labels David Starr Jordan as an advocate of eugenics, an early 20th century movement to breed a “master race” of humans through selective breeding.<\/span>\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/731578668375080962\/1024\/10\/scaletowidth#tl-731578668375080962;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n&nbsp;","excerpt":"The Paly Voice recently asked students what they thought about a petition which urges the Palo Alto School Board to rename David Starr Jordan Middle School. The petition labels David Starr Jordan as an advocate of eugenics, an early 20th century movement to breed a “master race” of humans through selective breeding.","date":"2015-12-10 11:14:30","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Jordan.jpg","categories":["Multimedia"],"tags":["jordan","rename","verbatim"]},{"id":112760,"title":"Music of the month: The must listen albums of November","permalink":"http:\/\/palyvoice.com\/2015\/12\/10\/music-of-the-month-the-must-listen-albums-of-november\/","content":"The Paly Voice rated November's top albums from some of the world's biggest superstars. Read below to see how they fared.\r\n\r\n<strong>Sounds Good Feels Good - 5 Seconds Of Summer<\/strong>\r\n\r\n<strong>Rating: 6.5\/10<\/strong>\r\n<strong>Best song of the album:<\/strong>\r\n\"Jet Black Heart\"\r\n<strong>Worst song of the album:<\/strong>\r\n\"Invisible\"\r\n\r\n[caption id=\"attachment_112762\" align=\"alignright\" width=\"241\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/5_Seconds_of_Summer_-_Sounds_Good_Feels_Good.png\"><img class=\"wp-image-112762\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/5_Seconds_of_Summer_-_Sounds_Good_Feels_Good.png\" alt=\"5 Seconds of Summer is touring across the world after the release of their latest album 'Sounds Good Feels Good'. The Austrailian band made it big last year after the release of their hit singles 'Amnesia' and 'She looks so perfect' released in 2014. \" width=\"241\" height=\"241\" \/><\/a> 5 Seconds of Summer is touring across the world after the release of their latest album 'Sounds Good Feels Good.' The Australian band made it big last year after the release of their hit singles \"Amnesia\" and \"She Looks So Perfect\" in 2014. Image credits 5sos.com.[\/caption]\r\n\r\n5 Seconds of Summer’s 'Sounds Good Feels Good' is the perfect blend between Green Day and One Direction, combining the sounds of punk and pop to appeal to a wide market of listeners. This album is full of teen angst, incorporating catchy chants and simple melodies to make the songs enjoyable to listen to. However, the songs can become quite repetitive after a couple listens. If you’re looking for fun pop-punk album then it’s well worth the buy.\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify:album:3QblxoryrPYjRXFkucv0Sp\" width=\"300\" height=\"80\" frameborder=\"0\"><\/iframe>\r\n\r\n<strong>Made in the A.M. - One Direction<\/strong>\r\n\r\n<strong>Rating: 8.5\/10<\/strong>\r\n<strong>Best songs of the album:<\/strong>\r\n\"What A Feeling,\" \"Drag Me Down,\" \"Infinity\"\r\n<strong>Worst song of the album<\/strong>\r\n\"Olivia\"\r\n\r\nOne Direction’s first album without former member Zayn Malik, and last one before their hiatus, could very well be their best yet. Classic One Direction songs such as \"What A Feeling\" and \"Drag Me Down\" compose the majority of the album, yet don’t sound completely rehashed like some of their previous songs. New styles of sound like \"Temporary Fix,\" which put a punk-pop twist on the typical One Direction sound keep the album fresh and exciting. The album hits very few lows, and even the worst songs are easy to listen to. One Direction is ending their tenure as the #1 pop band in the world on an incredibly high note, and hopefully we will get to see more songs sooner rather than later.\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3A1216334347%3Aplaylist%3A4OkUksyk0jM2wGAyOOhcHl\" width=\"300\" height=\"300\" frameborder=\"0\"><\/iframe>\r\n\r\n<strong>25 - Adele <\/strong>\r\n\r\n<strong>Rating: 10\/10<\/strong>\r\n<strong>Best songs of the album<\/strong>\r\n\"Hello,\" \"I Miss you*,\" \"When We Were Young,*\" \"Remedy*\"\r\n<strong>Worst Song of the album<\/strong>\r\nLet's be honest here, we couldn't pick one if we had to.\r\n\r\n[caption id=\"attachment_112891\" align=\"alignright\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/adele-25-packshot1.jpg\"><img class=\"wp-image-112891 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/adele-25-packshot1.jpg\" alt=\"adele-25-packshot\" width=\"250\" height=\"250\" \/><\/a> \"25\" is breaking records after 3.38 million copies were sold in the first week, despite Adele's decision to not make it available on streaming services. Many believe Adele's third album has exceeded the already lofty expectations that many set after her critically acclaimed first two albums \"19\" and \"25.\" Image credits to Adele.com.[\/caption]\r\n\r\nAdele’s much anticipated '25' is simply beautiful, matching the high bar set by her previous albums '19' and '21' in this 11 song masterpiece. The album has a unique modern sound similar to '21', but still comes across as new and fresh. Powerful ballads such as \"Hello\" and \"I Miss You\" leave you speechless, while upbeat songs such as \"Water Under the Bridge\" and \"Sweetest Devotion\" help balance out the melancholy feel to the album. If there is one flaw, it's that the album is not available on streaming services and instead must be purchased. If you want to get over a breakup, move on from a loved one, or if you’re just looking for some good music to get you through rough times, this album will not disappoint.\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3A1216334347%3Aplaylist%3A0NroRTICZ5pqVQgZdBW0oY\" width=\"300\" height=\"80\" frameborder=\"0\"><\/iframe>\r\n*Not on Spotify\r\n\r\n<strong>Purpose - Justin Bieber<\/strong>\r\n\r\n<strong>Rating: 8\/10<\/strong>\r\n<strong>Best songs of the album:<\/strong>\r\n\"Love Yourself,\" \"Sorry,\" \"What Do You Mean?\"\r\n<strong>Worst songs of the album:<\/strong>\r\n\"Get Used To It\"\r\n\r\nJustin Bieber is back. Breaking away from his teeny-bopper sound, Bieber has made a comeback with many hits such as “Where Are Ü Now,” featuring Skrillex and Diplo, “What Do You Mean”, and “Sorry.” Many of Bieber’s songs include upbeat rhythms with dance-like melodies in the background. “Love Yourself,” co-written with Ed Sheeran, is a slow, soulful song. If you are a long time \"belieber\" or a new fan, you are bound to fall in love with this album.\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3A1216334347%3Aplaylist%3A4Iz3uVuJcaEmlXHTorp1wQ\" width=\"300\" height=\"300\" frameborder=\"0\"><\/iframe>\r\n\r\n<em>Featured Album: Up-and-coming star Alessia Cara<\/em>\r\n\r\n<strong>Know-it-all - Alessia Cara <\/strong>\r\n\r\n<strong>Rating: 8\/10<\/strong>\r\n<strong>Best songs of the album:<\/strong>\r\n\"Scars To Your Beautiful,\" \"Here,\" \"Outlaws,\" \"Wild Things\"\r\n<strong>Worst song of the album:<\/strong>\r\n\"I’m Yours\"\r\n\r\nAlessia Cara’s sultry voice could make any song sound good. This fresh artist from Canada is showing how capable she is following her EP 'Four Pink Walls' with the release of her debut album 'Know-it-all.' Cara has received the most attention for her clever and relatable lyrics in “Here” where she talks about being an “antisocial pessimist” who wants to leave a party. “Know-it-all” has aspects of upbeat songs, catchy verses, and some striped down soulful melodies such as “Here” that go beautifully with Cara’s voice. Alessia Cara may only be 19 years old, but her album embodies maturity in its relatable lyrics, soulful tone and her powerful voice. There is still room for improvement for Cara to find her distinct sound because she has incorporated many different genres into her music, but this debut album deserves applause.\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3A1216334347%3Aplaylist%3A0SnDHgkYEs3kWoGhyu7ngB\" width=\"300\" height=\"300\" frameborder=\"0\"><\/iframe>","excerpt":"The Paly Voice rated November's top albums from some of the world's biggest superstars and bands. ","date":"2015-12-10 11:10:16","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Featuredimg.jpg","categories":["Entertainment","Spotlight"],"tags":["25","5 Seconds of Summer","5sos","Adele","Alessia Cara","Justin Bieber","Know-it-all","Made in the A.M.","music","music of the month","one direction","Purpose"]},{"id":113270,"title":"SatireDay Cartoon 2","permalink":"http:\/\/palyvoice.com\/2015\/12\/10\/satireday-cartoon-2-2\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-10-at-10.34.13-AM.png\"><img class=\"aligncenter size-full wp-image-113271\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-10-at-10.34.13-AM.png\" alt=\"Screen Shot 2015-12-10 at 10.34.13 AM\" width=\"1088\" height=\"822\" \/><\/a>","excerpt":"Check out our latest cartoon. ","date":"2015-12-10 10:48:15","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-10-at-10.34.13-AM.png","categories":["Satire Day","Uncategorized"],"tags":["cartoon","finals","satireday cartoon"]},{"id":112938,"title":"Verbatim: Should gun laws be stricter?","permalink":"http:\/\/palyvoice.com\/2015\/12\/10\/verbatim-should-gun-laws-be-stricter\/","content":"After the a mass shooting that took place in San Bernardino, Calif. on Wednesday, The Paly Voice asked students if they believe gun laws should be stricter.\r\n\r\nHover over the white dots to see what they have to say.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/730668261821120514\/1024\/10\/scaletowidth#tl-730668261821120514;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"After the mass shooting that took place in San Bernardino on Wednesday, The Paly Voice asked students if they believed gun laws are strict enough.","date":"2015-12-10 10:37:48","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/PHOT-31.jpg","categories":["Features","Spotlight"],"tags":["California","gun","Gun Law","guns","law","laws","paly","san bernardino","students","thinglink","verbatim"]}]