[{"id":106066,"title":"Associated Student Body enacts changes to club policy","permalink":"http:\/\/palyvoice.com\/2015\/08\/24\/associated-student-body-enacts-changes-to-club-policy\/","content":"[caption id=\"attachment_68297\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/key-club.jpg\"><img class=\"size-full wp-image-68297\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/key-club.jpg\" alt=\"Senior George Lu dresses up as a penguin, the Key Club mascot at . Key club has already been following the regulations set in place by ASB but advisor Tolentino is supportive of the change.  Photo by Liana Pickrell.\" width=\"600\" height=\"402\" \/><\/a> Palo Alto High School alumnus George Lu dresses up as a penguin, the Key Club mascot at Club Day last year. Key Club has already been following the regulations set in place by ASB, but adviser Marc Tolentino is supportive of the change. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body approved a major change to club policy today, August 24, in hopes of reducing inactivity amongst Paly clubs as Club Day approaches.\r\n\r\nAccording to ASB Vice President Anmol Nagar, the new policy requires clubs to meet at least twice a month and to record minutes of each meeting on a document created by ASB. The minutes will be a short summary of what the club did at the meeting and of the number of the people in the club. The minutes will also have to be signed off by the club adviser.\r\n\r\nAccording to Nagar, ASB implemented the new policy in an attempt to improve Paly clubs.\r\n\r\nThe policy is reformed \"so that ASB can help clubs more effectively and reduce inactive clubs,” Nagar said.\r\n\r\n“[The purpose of this policy] is just so that we can monitor what clubs are doing and how ASB can best help their needs,” Nagar said.\r\n\r\nThe policy will come into effect after Club Day on Sept. 21.\r\n\r\nKey Club has been following the new requirements since its creation, according to Marc Tolentino, Key Club adviser and English teacher\r\n\r\n“The minutes themselves are something that show that the clubs are using their time wisely,” Tolentino said.","excerpt":"The Palo Alto High School Associated Student Body approved a major change to club policy today, August 24, in hopes of reducing inactivity amongst Paly clubs as Club Day approaches.","date":"2015-08-24 19:06:39","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/key-club.jpg","categories":["News","Spotlight"],"tags":{"47586":"anmol","40634":"anmol nagar","8496":"ASB","11711":"club day","11337":"clubs","43597":"key club","47587":"nagar","8939":"palo alto","8953":"paly","9169":"tolentino"}},{"id":105938,"title":"Theater welcomes all to audition for fall plays, &#8220;Shrek&#8221; and &#8220;The Odyssey&#8221;","permalink":"http:\/\/palyvoice.com\/2015\/08\/24\/theater-welcomes-all-to-audition-for-fall-plays-shrek-and-the-odyssey\/","content":"[caption id=\"attachment_105940\" align=\"aligncenter\" width=\"619\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/shrekandodyssey.jpg\"><img class=\"size-full wp-image-105940\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/shrekandodyssey.jpg\" alt=\"The Palo Alto Theatre Department audition sign-ups are available in the Haymarket. Auditions will be Tuesday and Wednesday from 3 p.m. - 5:30 p.m. in the Haymarket Theatre. Photo by Ana Caklovic\" width=\"619\" height=\"350\" \/><\/a> The Palo Alto Theater Department audition sign-ups for the fall plays will be Tuesday and Wednesday from 3 p.m. to 5:30 p.m. in the Haymarket Theatre. According to Woods, the main stage shows chosen this year will have more depth. \"Last year we did two fun and light plays,\" Woods said. \"As far as the main stage, which this year is 'The Odyssey' and in the spring is 'Macbeth,' we want to do something that the students can sink their teeth into.\" Photo by Ana Caklovic.[\/caption]\r\n\r\nThe Palo Alto High School Theater Department  is hosting auditions for its fall plays from 3 p.m. to 5:30 p.m. Tuesday and Wednesday with callbacks on Thursday at the Haymarket Theater.\r\n\r\n“Shrek the Musical Jr.” will be directed by Tony Kienitz and produced by Tanna Herr, while “The Odyssey” will be directed by Kathleen Woods, the head of the Theater Department. According to Herr, there are many available roles and auditioning actors don’t have to be experienced actors.\r\n\r\n“We would like to encourage people outside of the theater department to come and see what it’s like to be a part of it,” Herr said.\r\n\r\nHerr and Kienitz, who both have experience producing children’s shows, chose the play “Shrek the Musical Jr.” because they wished for a show that would appeal to a broad audience.\r\n\r\n“You pick up a show that the high school kids would want to see as well as younger people,” Kienitz said. “It’s a tricky thing to do, to find a show that’s known by high school people, adults, and to the younger kids. That’s what we’re trying to do, we’re going to expand it as far as we can and draw in as many audience members as we can.”\r\n\r\n\"The Odyssey,\" however, was chosen after discovering a flaw with the show the department had originally chosen, according to Woods.\r\n\r\n“That was a whole other interesting journey because originally we were planning on doing ‘Metamorphoses,’ which is a retelling of Greek Myths,” Woods said. “But you need a swimming pool. We realized that we’re in the middle of a drought and that it was probably not the best choice.”\r\n\r\nAccording to Woods, those with musical talent who are not necessarily actors can also audition for “The Odyssey.”\r\n\r\n“I have a Paly graduate, Jonathan Shue, who’s a professional actor and musician, and he’s going to be working with students to compose music as a part of ‘The Odyssey,’” Woods said. “There’s going to be a lot of innovation around the staging piece and the music.”\r\n\r\nThe directors are not the only ones excited about the upcoming fall plays. According to junior Molly Kraus, who will be auditioning for “The Odyssey,” she is most excited for the people.\r\n\r\n“It’s always the people we’re really here for in the end,” Kraus said. “Everyone involved in the production, whether they’re on stage, behind it or watching it.”\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Theater Department is hosting auditions for its fall plays \"Shrek\" and \"The Odyssey\" at 3 p.m. to 5:30 p.m. Tuesday and Wednesday with callbacks on Thursday at the Haymarket Theatre.","date":"2015-08-24 12:03:28","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/shrekandodyssey.jpg","categories":["News","Spotlight"],"tags":{"47574":"auditions","47570":"august","47569":"fall play","47573":"greek mythology","29689":"kathleen woods","13035":"molly kraus","47566":"Shrek the Musical jr","47572":"tanna herr","47567":"the odyssey","9159":"theater","47568":"theatre auditions","47571":"tony kienitz"}},{"id":105975,"title":"First Friday Lunch Rally: A spirited start to the new year","permalink":"http:\/\/palyvoice.com\/2015\/08\/23\/first-friday-lunch-rally-a-spirited-start-to-the-new-year\/","content":"To kick off the new school year, the Palo Alto High School Associated Student Body organized a <a href=\"http:\/\/palyvoice.com\/2015\/08\/20\/first-rally-of-the-year-to-feature-performances-and-relay-race\/\">lunchtime rally on Friday<\/a>, complete with a relay race and performance.\r\n\r\nJunior ASB Spirit Commissioner Cezanne Lane was delighted with the outcome of the rally.\r\n\r\n“Everyone seemed really excited about it,” Lane said. “I kind of think of this rally as a hint to the freshmen, like ‘Hey, we are super into our spirit and we want you to be too!’”\r\n\r\nThe Paly Dance Team performed a dance choreographed by senior captains Melanie Guan and Emma Sternfield. Sternfield participated in the Cheer Team’s routine, which the cheerleaders learned over the summer.\r\n\r\n“I feel like the performance was successful in bringing spirit and good energy to the start of the school year,” Sternfield said.\r\n\r\nOverall, Lane wanted the freshmen to get a feel for Paly's enthusiastic environment.\r\n\r\n“I hope they [freshmen] were able to see from the rally how spirited, but also how strong the Paly community is,” Lane said.\r\n\r\nThe sophomores finished first, and the seniors claimed second place.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AsCAD2ctxBns\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"To kick off the new school year, the Palo Alto High School Associated Student Body organized a lunchtime rally on Friday, complete with a relay race and performance.","date":"2015-08-23 20:52:11","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/I9P8051.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","17807":"back-to-school","29481":"Cezanne lane","23161":"cheer team","47576":"emma sternfield","47575":"first friday lunch rally","8721":"freshmen","47577":"paly dance team"}},{"id":106005,"title":"Freshmen class elections taking place Aug. 24-28","permalink":"http:\/\/palyvoice.com\/2015\/08\/23\/freshmen-class-elections-taking-place-aug-24-28\/","content":"","excerpt":"","date":"2015-08-23 19:45:25","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":106003,"title":"Advisory this week is for freshmen (individual meetings) and sophomores (all)","permalink":"http:\/\/palyvoice.com\/2015\/08\/23\/advisory-this-week-is-for-freshmen-individual-meetings-and-sophomores-all\/","content":"","excerpt":"","date":"2015-08-23 19:41:58","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":105892,"title":"First rally of the year to feature performances and relay race","permalink":"http:\/\/palyvoice.com\/2015\/08\/20\/first-rally-of-the-year-to-feature-performances-and-relay-race\/","content":"[caption id=\"\" align=\"aligncenter\" width=\"561\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2377.jpg\"><img class=\"wp-image-72735\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2377.jpg\" alt=\"The Paly Cheer Team strikes a pose on the Quad during the first rally of the year. Photo by Chloe Fishman. \" width=\"561\" height=\"374\" \/><\/a> The Paly Cheer Team strikes a pose on the Quad during the First Friday Quad rally last year.  Photo by Chloe Fishman.[\/caption]\r\n\r\nThe Associated Student Body is hosting the annual \"First Friday Quad Rally\" this Friday on the Quad at Lunch, showcasing performances from Palo Alto High School's cheer and dance teams.\r\n\r\nAccording to junior<span style=\"color: #000000;\"> Social Commissioner <\/span>Cezanne Lane, a relay race featuring three stations will be available to four students from each grade. The first activity will be a water balloon race. The second activity is called \"Shake It,\" in which students must attempt to shake a ping pong ball out of a box without using their hands. The third is called \"Hunt Hunt Hike\" and entails throwing three rolls of toilet paper through a hula-hoop.\r\n\r\nThis year, <a href=\"https:\/\/www.youtube.com\/watch?feature=youtu.be&amp;v=7-C-_XM2RgQ&amp;app=desktop\">ASB has released a video<\/a> to give students a sneak peek of the activities each grade will perform during the rally and more information about the events, according to Lane.\r\n\r\n\"It gives freshmen a little sneak peek to all the amazing spirit and tradition our school has,\" Lane said.\r\n\r\nASB hopes the video will get everyone excited and ready to show their school spirit in the weeks to come.\r\n\r\n\"The Paly tradition on the first week of school serves to get students pumped up for this year and the events,\" Lane said.","excerpt":"The Associated Student Body is hosting the annual \"First Friday Quad Rally\" this Friday at lunch on the Quad, showcasing performances from Palo Alto High School's cheer and dance teams and a relay race. ","date":"2015-08-20 11:37:32","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/08\/IMG_2377.jpg","categories":["News"],"tags":{"8496":"ASB","8499":"Associated Student Body","46228":"cezanne","29481":"Cezanne lane","31304":"cheer","8626":"dance","17499":"FIRST","30021":"friday","46227":"lane","8953":"paly","9021":"quad","9852":"rally","9038":"relay race","46226":"spirt week"}},{"id":105690,"title":"Paly students&#8217; favorite restaurants 2014-15","permalink":"http:\/\/palyvoice.com\/2015\/08\/17\/paly-students-favorite-restaurants-2014-2015\/","content":"<p style=\"text-align: center;\"><a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/21.jpg\"><img class=\"wp-image-105735 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/21.jpg\" alt=\"2\" width=\"611\" height=\"433\" \/><\/a><\/p>\r\nWith school just starting and friends reuniting, savor the moment by trying some new restaurants.  Japanese? Italian? Whatever you desire, be sure to check out the restaurants that Palo Alto High School students voted* as their favorites of 2015.\r\n\r\n<strong>Categories:<\/strong>\r\n\r\n<a href=\"#anchor\">Best American Restaurant<\/a>\r\n<a href=\"#anchor1\">Best Chinese Restaurant<\/a>\r\n<a href=\"#anchor2\">Best Coffee\/Tea Restaurant<\/a>\r\n<a href=\"#anchor3\">Best Indian Restaurant<\/a>\r\n<a href=\"#anchor4\">Best Israeli\/Mediterranean Restaurant<\/a>\r\n<a href=\"#anchor5\">Best Italian Restaurant<\/a>\r\n<a href=\"#anchor6\">Best Japanese Restaurant<\/a>\r\n<a href=\"#anchor9\">Best Mexican Restaurant<\/a>\r\n<a href=\"#anchor7\">Best Pizza Restaurant<\/a>\r\n<a href=\"#anchor8\">Best Town &amp; Country Restaurant<\/a>\r\n<a name=\"anchor\"><\/a>\r\n<em> <\/em><strong>Best American Restaurant: Peninsula Creamery <\/strong>\r\n\r\nSince 1923, the Peninsula Creamery, now in its third generation of owners, has been serving well-priced and good food, according to owner James Santana.\r\n\r\nWhen asked what he wants people to leave the Peninsula Creamery feeling, Santana succinctly said, “happy and with a full stomach.”\r\n\r\nIn addition to the food, students also enjoy the atmosphere of the creamery.\r\n\r\n“They have a classic homey diner feel, like I’m back in the Midwest,” sophomore Raj Lele said. “My favorite is the turkey lunch. It’s too bad they don’t serve it all day.”\r\n\r\n<a href=\"http:\/\/peninsulacreamery.com\/\">http:\/\/peninsulacreamery.com\/<\/a> 900 High St.\r\n\r\n[caption id=\"attachment_105719\" align=\"aligncenter\" width=\"584\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Cream1.jpg\"><img class=\"wp-image-105719\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Cream1.jpg\" alt=\"Cream\" width=\"584\" height=\"292\" \/><\/a> Best American Restaurant: Peninsula Creamery. Owner James Santana takes a customer's order. \"We love having the students come over,\" Santana said. Photos by William Zhou[\/caption]\r\n\r\n<a name=\"anchor1\"><\/a><strong>Best Chinese Restaurant: Su Hong<\/strong>\r\n\r\nSu Hong provides students with traditional Chinese foods conveniently and quickly.\r\n\r\n“Su Hong serves authentic Chinese food that's on the heavier side in terms of taste,” senior Tiffany Cai said. “There are quite a few dishes in particular that my family and I really like.”\r\n\r\n\"The price is reasonable, and they're relatively fast too,\" junior Ethan Teo added.\r\n\r\n4256 El Camino Real\r\n\r\n[caption id=\"attachment_105708\" align=\"aligncenter\" width=\"523\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/SuHong1.jpg\"><img class=\"wp-image-105708\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/SuHong1.jpg\" alt=\"SuHong\" width=\"523\" height=\"510\" \/><\/a> Best Chinese Restaurant: Su Hong serves a variety of options, pictured above is noodle soup, cooked bamboo, beef stir fry and Chinese pancakes, (top left- bottom right) Photos by William Zhou.[\/caption]\r\n\r\n<strong>Best Coffee\/ Tea Place: T4<\/strong><a name=\"anchor2\"><\/a>\r\n\r\nMany students have wanted a pearl milk tea store in Palo Alto, and the recently opened T4 fills those desires.\r\n\r\n\"T4 is something that Palo Alto has needed for a long time,” sophomore Frances Zhuang said. “The cherry on top is that it's really close to Paly and is a great place to hang out with friends. T4's drinks are also great because of the large variety and customizability of drinks. They also have really good, soft pearls.”\r\n\r\nT4 manager Kevin Oyang believes that people like PMT because of its unique tastes and flavors.\r\n\r\n“We brew every order as they come, so it’s fresh,” Oyang said. “PMT is also more convenient and lighter compared to other drinks like coffee, plus there are so many options.”\r\n\r\n165 University Ave.\r\n\r\n[caption id=\"attachment_105709\" align=\"aligncenter\" width=\"532\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/T41.jpg\"><img class=\"wp-image-105709\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/T41.jpg\" alt=\"T4\" width=\"532\" height=\"428\" \/><\/a> Best Coffee\/Tea: T4. Pictured above is the classic milk tea, costumers, however, can chose from a wide range of flavors ranging from fruits to caramel. Photos by William Zhou.[\/caption]\r\n\r\n<strong>Best Indian Restaurant: TAVA Indian Kitchen <\/strong><a name=\"anchor3\"><\/a>\r\n\r\nWhat makes TAVA stand out from other Indian restaurants is its customizability and speed, according to co-founder Hasnain Zaid. “It’s exciting and an honor to be chosen as a favorite,” Zaid, said. “We started TAVA three and a half years ago and our first supporters were the students. What you chose to eat is a statement of who you are and TAVA’s quick, wholesome and exactly how you want it.”\r\n\r\nFor many students, TAVA also provides an easy window into trying great, unique flavors.\r\n\r\n“The price is good and the food is tasty,” sophomore Andrew Shieh said. “They’re really fast in and out, which is unique, and their flavors are ones that I don’t have too much of at home.”\r\n\r\n<a href=\"http:\/\/www.tavaindian.com\/\">http:\/\/www.tavaindian.com\/<\/a> 855 El Camino Real\r\n\r\n[caption id=\"attachment_105710\" align=\"aligncenter\" width=\"567\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Tava1.jpg\"><img class=\"wp-image-105710\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Tava1.jpg\" alt=\"Tava\" width=\"567\" height=\"340\" \/><\/a> Best Indian Restaurant: TAVA Indian Kitchen. TAVA allows costumers to customize their dishes from ingredients to spice level. “Thank you for birthing it [TAVA],” an excited costumer said to Zaidi (right-middle). Photos by William Zhou.[\/caption]<strong>Best Israeli\/Mediterranean Restaurant: Oren’s Hummus Shop<\/strong><a name=\"anchor4\"><\/a>\r\n\r\nFor hummus lovers, Oren’s Hummus Shop is worth a visit.\r\n\r\n“They have all--natural ingredients,” sophomore Vivian Young said. “It’s a small business, welcoming, has large proportions and they make their own hummus. They also have friendly waiters and are really professional.”\r\n\r\n<a href=\"http:\/\/orenshummus.com\/\">http:\/\/orenshummus.com\/<\/a> 261 University Ave.\r\n\r\n<strong>Best Italian Restaurant: Buca Di Bepo<\/strong><a name=\"anchor5\"><\/a>\r\n\r\nBuca di Bepo aims to capture both the taste of Italian food and friendly atmosphere.\r\n\r\n“We want Buca to be the best at celebratory dinning,” Paisano Partner Anthony Benedetti said.  “People gather, have fun, can be loud, and the pictures help with the feel.\"\r\n\r\nStudents especially enjoy the large and sharable portions.\r\n\r\n“Buca is a really good place for gatherings with friends and family because the atmosphere always feels really comforting and warm,” senior Carissa Zou said. “The food is meant to be shared because the serving sizes are inherently larger, so the general environment is one that really brings people together.”\r\n\r\n<a href=\"http:\/\/www.bucadibeppo.com\/restaurants\/ca\/palo-alto\/\">http:\/\/www.bucadibeppo.com\/restaurants\/ca\/palo-alto\/<\/a> 643 Emerson St.\r\n\r\n[caption id=\"attachment_105704\" align=\"aligncenter\" width=\"520\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Buca1.jpg\"><img class=\"wp-image-105704\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Buca1.jpg\" alt=\"Buca\" width=\"520\" height=\"510\" \/><\/a> Best Italian Restaurant: Buca di Bepo. \"We have large proportions but make things in smaller batches for the taste,” Benedetti said. Photos by William Zhou.[\/caption]\r\n\r\n<strong>Best Japanese Restaurant: Sushi House<\/strong> <a name=\"anchor6\"><\/a>\r\n\r\nWhen Sushi House opened in 1988, the owners looked to incorporate their Japanese heritage into their American costumers.\r\n\r\n“I’m Japanese and live in America,” co-founder Ken Ueki said. “But by introducing Japanese foods to Americans, we can make friends and help each other out. [Sushi House has] good Japanese food, for a reasonable price, and we’re 50% take out, so you don’t have to sit in.”\r\n\r\nEither way, take-out or sit-in, students enjoy what Sushi House has to offer.\r\n\r\n“The fried chicken is just cooked perfectly,” senior Andrew Lee said. “The chicken karaage bento box is definitely the best thing you can get at Town and Country.\"\r\n\r\n<a href=\"http:\/\/www.sushihousepaloalto.com\/\">http:\/\/www.sushihousepaloalto.com\/<\/a> 158 El Camino Real\r\n\r\n[caption id=\"attachment_105732\" align=\"aligncenter\" width=\"489\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Sushi1.jpg\"><img class=\"wp-image-105732\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Sushi1.jpg\" alt=\"Sushi\" width=\"489\" height=\"522\" \/><\/a> Best Japanese Restaurant: Sushi House. According to Ukei, the party platter features a variety of types of sushi and is popular for gatherings. Photo by William Zhou.[\/caption]\r\n\r\n<strong>Best Mexican Restaurant: Sancho’s <\/strong><a name=\"anchor9\"><\/a><a name=\"anchor9\"><\/a>\r\n\r\nSancho's strives to provide its costumers with great tastes and feels.\r\n\r\n“We want costumers to feel good inside,” co-owner Jose Prado said. “We have fresh ingredients, great customer service and friendly atmosphere. I’d recommend the burrito and fish tacos.” Prado's statements are reflected in student opinion.\r\n\r\n“The seasoning is tasty and the tacos have a unique crunch,” sophomore Barry He said. “They have a cool decorated interior and their ingredients are all natural.”\r\n\r\n<a href=\"http:\/\/sanchostaqueria.com\/\">http:\/\/sanchostaqueria.com\/<\/a> 2723 Middlefield Rd. &amp; 491 Lytton Ave.\r\n\r\n[caption id=\"attachment_105706\" align=\"alignnone\" width=\"553\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Sanchos1.jpg\"><img class=\"wp-image-105706\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Sanchos1.jpg\" alt=\"Sanchos\" width=\"553\" height=\"553\" \/><\/a> Best Mexican Restaurant: Sancho's. Pictured above are the azada, apastor, and chicken tacos [left to right]. According to co-owner Jose Prado, with the help of his staff, he has been fulfilling his dream of opening a Mexican restaurant (below). Photos by William Zhou.<br \/><a name=\"anchor7\"><\/a>[\/caption]<strong>Best Pizza Place: Spot Pizza <\/strong>\r\n\r\nWhen it comes to pizza, Spot Pizza] has the flavors, authenticity and speed. “[Spot has] Great pizza, great value,” co-owners Kelly and Peggy Marik said. “We make everything here and try to be involved in the community as much as possible.  It’s a huge honor that students chose us.”\r\n\r\nFor people who aren't able to go to the restaurants, they can always ordr delivery Spot delivers.\r\n\r\n“Spot pizza is the go-to place for delivery pizza in Palo Alto,” senior Griffin Carlson said. “You get delicious pizza to your house fast.”\r\n\r\n<a href=\"http:\/\/www.spotpizza.com\/\">http:\/\/www.spotpizza.com\/<\/a> 115 Hamilton Ave.\r\n\r\n[caption id=\"attachment_105731\" align=\"aligncenter\" width=\"562\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Spot2.jpg\"><img class=\"wp-image-105731\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Spot2.jpg\" alt=\"Spot\" width=\"562\" height=\"330\" \/><\/a> Best Pizza Restaurant: Spot Pizza. Spot pizza has been operating under three generations of Paly grads. Pictured above is the owners' son, Spot employee and Paly sophomore Tyler Marik. Photos by William Zhou.[\/caption]\r\n\r\n<strong>Best Restaurant at Town and Country: Mayfield Bakery and Café<\/strong> <a name=\"anchor8\"><\/a>\r\n\r\nFor many students, Mayfield is a staple when it comes to a place to stop for a snack or lunch.\r\n\r\n“When I go into Mayfield and I’m having a bad day, when their banana bread goes into my mouth, everything is okay,\" sophomore Jaiveer Sandhu said. “They’re really consistent and you can never go wrong with their banana bread.”\r\n\r\nMayfield’s mission statement is for everyone to leave happier than when then they came in, according to restaurant manager Chris Cuneo.\r\n\r\n\"Mayfield is healthy, fresh and local, and we’re part of the community and work to make people happy,\" Cuneo said.\r\n\r\n<a href=\"http:\/\/www.mayfieldbakery.com\/\">http:\/\/www.mayfieldbakery.com\/<\/a> 855 El Camino Real\r\n\r\n[caption id=\"attachment_105705\" align=\"aligncenter\" width=\"548\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/may1.jpg\"><img class=\"wp-image-105705\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/may1.jpg\" alt=\"may\" width=\"548\" height=\"460\" \/><\/a> Best Restaurant at Town &amp; Country: Mayfield Bakery and Café. Mayfield is separated into two sections, a bakery (above) , and a more formal dining area (below). Photos by William Zhou.[\/caption]\r\n\r\n*Voting was conducted in from May 5, 2015 -June 15, 2015 through a survey that was posted on the Voice's social media channels. Students were able to chose restaurants from a list predetermined by the staff or write in their own choices. We received 235 votes from Palo Alto High School students.\r\n\r\n&nbsp;","excerpt":"Japanese? Italian? Whatever you desire, be sure to check out the restaurants that were voted by Palo Alto High School students as their favorites for the 2014-15 school year.\r\n","date":"2015-08-17 17:16:12","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Cover.jpg","categories":["Features","News","Spotlight"],"tags":{"19460":"2015","27738":"best","45035":"best restaurant","45039":"Buca di bepo","45044":"chinese","45048":"creamery","8713":"Food","45042":"indian","45038":"italian","45036":"japanesse","45047":"mayfield","45046":"mexican","8939":"palo alto","37390":"palo alto high shcool","45049":"penninsula creamery","8993":"pizza","29704":"pmt","9044":"restaurant","45045":"sancho's","45041":"spot pizza","45043":"su hong","45040":"Sushi House","31270":"t4","45037":"TAVA","9179":"Town and Country","9214":"voice","9218":"vote"}},{"id":105676,"title":"Student speeches for 2015 Graduation","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/student-speeches-for-2015-graduation\/","content":"[caption id=\"attachment_105678\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-09-at-5.59.22-PM.png\"><img class=\"wp-image-105678 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-09-at-5.59.22-PM.png\" alt=\"Senior Claire\" width=\"603\" height=\"433\" \/><\/a> Associated Student Body President Claire Liu delivers her speech \"Randy\" at Graduation on June 3. Liu was one of three student speakers for the graduating class of 2015. Photo by Ken Ruinard.[\/caption]\r\n\r\nThe Paly Voice acquired the following Graduation speeches from their authors, with the authors consent to publish. Each of these speeches were presented on June 3 for the Palo Alto High School's Class of 2015 Graduation. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/06\/09\/hindsight-bias-by-alex-hwang\/\">\"Hindsight Bias\" by Alex Hwang<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/06\/09\/randy-by-claire-liu\/\">\"Randy\" by Claire Liu<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/06\/09\/the-cosmos-and-us-by-emma-chiu\/\">“The Cosmos and Us” by Emma Chiu<\/a>","excerpt":"The Paly Voice acquired three student Graduation speeches that were presented on June 3 for the Class of 2015 Graduation.","date":"2015-06-09 18:04:33","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-09-at-5.59.22-PM.png","categories":["Spotlight"],"tags":[]},{"id":105669,"title":"&#8220;Hindsight Bias&#8221; by Alex Hwang","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/hindsight-bias-by-alex-hwang\/","content":"<em>The Paly Voice acquired the following Graduation speech from its author, with the authors consent to publish. Student speaker senior Alex Hwang delivered this speech at Graduation on June 3. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n<p style=\"color: #000000;\"><strong>\"Hindsight Bias\" <\/strong>by Alex Hwang<\/p>\r\nAt the beginning of this year, my lovely AP Psychology teacher, Ms. Mattes, walked into the classroom and said “Good Morning!” in her usual cheerful voice. She then curiously proceeded to pass out a bunch of half-sheets of paper to our class. She told us to read what the piece of paper said and follow the instructions on it. Simple enough, right? So once she passed me mine, I read it and, at the top, it said: “People with high self-confidence are more susceptible to flattery than those with low self-confidence.” Makes sense! Then I read the question on the paper: did I agree or disagree with the finding? I agreed. Now the paper asked: please explain why this finding is true. I had no trouble stating that “obviously, people with high self-confidence must have cultivated this attitude by buying in to the flattery they’ve received.” And that was it. I looked up at Ms. Mattes to show that I was done, and soon my whole class did the same.\r\n\r\nMs. Mattes then asked us: “how many of you agree with this finding?” and we <em>all<\/em> raised our hands. “How many of you had no trouble explaining this finding?” she asked. Again, we <em>all <\/em>raised our hands. But here comes the twist. Ms. Mattes asked someone from the other side of the classroom to read their half-sheet out loud: (listen carefully) “People with <em>low<\/em> self-confidence are more susceptible to flattery than those with high self-confidence.” Everyone on my side of the class suddenly groaned. Did <em>you<\/em> catch it? To the other half of the class, Ms. Mattes passed out the <em>exact opposite <\/em>finding, yet we were all <em>equally<\/em> able to agree with and support our own findings. Each one of us in the classroom believed that our own explanations represented simple common sense.\r\n\r\nSo don’t get me wrong, I love Ms. Mattes, but she <em>duped<\/em> us, and she did so with a phenomenon called hindsight bias. According to our beloved AP Psychology textbook, hindsight bias is defined as “the tendency to believe after learning an outcome that one would’ve foreseen it.” You might have also heard of it as the “I-knew-it-all-along effect” or, simply, “hindsight is 20\/20.” Introduced to us as a danger when analyzing experimental studies, hindsight bias can actually be found everywhere around us.\r\n\r\nIn interpreting history — how often have we heard that a victory in a certain battle or election was “inevitable”? In sports — how many times have you heard the announcer declare how obvious it was that the team would win...but only <em>after<\/em> they had won? Even in relationships -- “Oh yeah, I <em>knew<\/em> they would break up.” But most pertinent to us all today is in the way we look at our times at Paly. All of us, at some point, have thought along the lines of “Oh, Of course, I didn’t get into that school because I didn’t have this or that on my resume.” “I shouldn’t have done that activity, I obviously wouldn’t have liked it and I shouldn’t have wasted my time.” Taking a step back, it’s easy to see why these thoughts represent hindsight bias. Did you <em>really<\/em> know such things all along? Probably not. Looking back into the past, we see our lives as easily predictable. Unfortunately, thinking this way encourages the notion that each decision we make has a sense of cold, deterministic certainty.\r\n\r\nIn the same vein, as we all move on to our bright futures, let’s not allow this natural human tendency of hindsight bias to morph into a sort of foresight bias — we shouldn’t be tempted to feel that our future lives can be predicted. Rather, we should <em>dare<\/em> to take a step that leads us down an unpredictable path. We should <em>dare<\/em> to venture boldly into the unknown and have the <em>audacity<\/em> to act with the knowledge that there is no certain path from the present... to the future.\r\n\r\nFour years ago, at my eighth grade graduation, I confidently stated exactly what defined “success” and the way each one of us would achieve it in high school. I talked about how “success is found in how we stick to our beliefs.” I threw out even more cliches. I even used some vague quote about success from a man I didn’t know one thing about. One of my great heroes, Mr. Bungarden, would probably have something to say about this. Mr. Bungarden recently told me that “nothing is scarier than an 18-year-old who has ‘figured out’ life.” And at that moment as a <em>14-year-old <\/em>atop the podium at the end of 8th grade, I certainly thought that I had figured out life. But now I’m a little wiser than I was then, and Mr. Bungarden, you were right. Five, fifteen, or fifty years in the future, let’s look back without hindsight bias, without believing that our lives were predictable. We all have some of the most exciting years and exciting choices of our life to come. Our futures have nothing determined about them. PALY Class of 2015, it’s time to embrace this uncertainty without hindsight bias, without foresight bias, but with every sense of bold possibility. Thank you very much everybody!","excerpt":"The Paly Voice acquired the Graduation speech of senior Alex Hwang, with his consent to publish.","date":"2015-06-09 18:02:16","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105672,"title":"“The Cosmos and Us” by Emma Chiu","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/the-cosmos-and-us-by-emma-chiu\/","content":"<em>The Paly Voice acquired the following Graduation speech from its author, with the authors consent to publish. Student speaker senior Emma Chiu delivered this speech at Graduation on June 3. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n“<strong>The Cosmos and Us<\/strong>” by Emma Chiu\r\n\r\nMuch of my high school career has been defined by flashbulb moments. They include storming the basketball court when the varsity boys beat Gunn on our senior night, and also taking one too many selfies with James Franco. Even though so many of my memories of Paly are overwhelmingly positive, there were also some moments I wish I could forget but just can’t. One that will never leave my memory was the morning when I came to school and a Caltrain sat motionless on the tracks.\r\n\r\nLater that same day, my English teacher showed our class an article titled \"<a href=\"http:\/\/www.nytimes.com\/2008\/11\/02\/education\/edlife\/quoted.html?_r=0\">The Cosmos and You<\/a>,” about a young woman at Dartmouth College who asks her Astronomy professor, “How do you keep from despairing at the immensity of space and the smallness of us?” A shortened version of his reply goes as follows:\r\n\r\n“Johanna, you are most certainly an infinitesimal in the cold, vastness of the cosmos, and your life is barely a mathematical instant in the span of time. But you are also, just as certainly, a miracle: you are a creature capable of thought, of wonder, of awe. You are capable of love, and so need not despair of insignificance. Having said that see you Monday.”\r\n\r\nNow, this response resonated with me so strongly that day, because I think at Paly many of us, including myself, have at some point questioned our self-worth or significance. You don’t need to have studied Astronomy for that thought to come across your mind. But because all of us are here today, each and every one of us had someone in this community who reminded us of our potential and of our importance.\r\n\r\nIn my mind, what defines the Paly experience is going through the highest of highs and lowest of lows, but when confronting those lows, there is always someone who is more than willing to be there for you. Because of what we’ve gone through and how countless other people have been that support for us when we needed it most, I think our class is especially aware of the significance and magnitude that a touch of kindness can have on another person.\r\n\r\nKnowing this, we stand poised and ready to be that potential rock for someone we may barely know. We are prepared to be that light, as others had done for us, when we ourselves slipped into darkness.\r\n\r\nIt is this compassion from others that has allowed us to be here today. It is this compassion that made it so we can truly enjoy those flashbulb moments. And it is this compassion that let us become aware of our significance. I am forever grateful for these people who have allowed me to feel their love, where I feel most alive and most significant. They are the moments where the words of the Dartmouth Astronomy professor ring most true: that we are capable of thought, of wonder, and of awe, and that we are, just as certainly, a miracle.\r\n\r\n&nbsp;","excerpt":"The Paly Voice acquired the Graduation speech of senior Emma Chiu, with her consent to publish.","date":"2015-06-09 18:02:10","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]}]