[{"id":105369,"title":"Badminton sends four members to compete at CCS","permalink":"http:\/\/palyvoice.com\/2015\/05\/29\/badminton-sends-four-members-to-compete-at-ccs\/","content":"[caption id=\"attachment_105426\" align=\"alignnone\" width=\"534\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-2.44.17-PM.png\"><img class=\" wp-image-105426\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-2.44.17-PM.png\" alt=\"Juniors Eric Chiang and James Wang pose with coaches Wesley Hsieh and Len Hill after placing fourth at Central Coast Selection playoffs last year. Chiang and Wang will \" width=\"534\" height=\"426\" \/><\/a> Juniors Eric Chiang and James Wang pose with coaches Wesley Hsieh and Len Hill after placing fourth at Central Coast Selections playoffs last year. Chiang and Wang will compete at CCS this year again, along with freshman Jackie Cai and Promise Lee. Photo courtesy of Eric Chiang.[\/caption]\r\n\r\nThe Palo Alto High School badminton team will be sending four members to compete at the Central Coast Selections playoffs tomorrow.\r\n\r\nJuniors Eric Chiang and James Wang will be playing together in the boys doubles event, while freshman Jackie Cai and senior Promise Lee will be playing in the girls doubles event.\r\n\r\n“Paly's seeding for CCS is pretty high, especially compared to last year,” Chiang said. “James [Wang] and I are seeded third while Promise [Lee] and Jackie [Cai] are seeded fourth.”\r\n\r\nChiang and Wang hope to place in the top three in their event.\r\n\r\n“There's only one pair that's participating in CCS this year from last year that beat us so we've got high hopes for getting top three,” Chiang said.\r\n\r\nMany new players from around the bay area will be competing at CCS, according to Chiang.\r\n\r\n“For both boys doubles and girls doubles, there are new pairs and players from all over the region, which makes it hard to predict how well we'll do this year,” Chiang said.\r\n\r\nCai and Lee also hope to place in the top three; however, they will primarily be focusing on trying to win matches.\r\n\r\n“Honestly, we hope to do the best we can and try to win as many matches as possible,” Cai said.\r\n\r\nThe CCS playoffs will be held from May 29-30 at Independence High School. Both the Paly boys' and girls' doubles will compete tomorrow.","excerpt":"The Palo Alto High School badminton team will be sending four members to compete at the Central Coast Selections playoffs this week.","date":"2015-05-29 12:34:00","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-2.44.17-PM.png","categories":["Sports"],"tags":{"15905":"badminton","8568":"CCS","44915":"eric chiang","44916":"jackie cai","44917":"james wang","8953":"paly","44918":"promise lee"}},{"id":104724,"title":"What to write in someone&#8217;s yearbook","permalink":"http:\/\/palyvoice.com\/2015\/05\/29\/what-to-write-in-someones-yearbook\/","content":"[caption id=\"attachment_105366\" align=\"aligncenter\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9050.jpg\"><img class=\"wp-image-105366\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9050.jpg\" alt=\"Senior staff writer Charles Yu ponders what to write in a yearbook. Photo by Emma Chiu.\" width=\"400\" height=\"300\" \/><\/a> Senior staff writer Charles Yu ponders what to write in a yearbook. Photo by Emma Chiu.[\/caption]\r\n\r\nNot knowing what to write in someone else's yearbook can be stressful and even awkward. If you’re ever caught staring at a blank page, tapping your pen, you are likely to be perceived as an apathetic human being. Even if you truly are indifferent, out of general consideration you should still easily be able to contrive three sentences for someone (and yes, that’s three sentences <i>minimum<\/i>)! If this sounds like a daunting task, here are the solutions for the most common types of people you will have to ponder:\r\n\r\n<b>1. The kid you've talked to once this entire year<\/b>\r\n\r\nWhen someone puts you in this position, it can feel a bit unfair of them and you may think that they don’t deserve your time to write a message. However, chances are that this person is probably experiencing a bit of social anxiety and he or she, more than anyone, could use a nice sign-off. It’s fine to give a generic compliment to this person, as long as you genuinely feel there's truth to in it! Example: “It was super fun having English with you this year. You always have really great things to say! Hope you have a fantastic summer :)”\r\n\r\n<b>2. A friend you used to be a lot closer with than you are now<\/b>\r\n\r\nWhether it was just a regular falling out or a specific awkward event, we have all lost a certain level of closeness with some friends. It’s fine to write about the good times you had with this person, even if they happened a while ago. Mention attributes of his or her character that you admire or accomplishments you know they will achieve in the future. If it’s someone you want to strengthen your friendship with, then <i>express that<\/i>. If it’s not, then <i>don’t<\/i> - the most important thing to remember in this situation is to be both friendly and honest.\r\n\r\n<b>3. A solid homie<\/b>\r\n\r\nEven if you know a person well, you can still find yourself thinking “I don’t know what to say!” How do you make it sound detailed yet not overdone, or funny yet sincere? An easy way to start is to talk about where you first met, and then go off about favorite memories from the past year (or anything from your K-12 history if you’re a senior). Try to throw in an inside joke you guys have shared, and be sure to mention <i>why<\/i> you like being friends with this person anyway. If you can’t think of anything, maybe that tells you something about your friendship.\r\n\r\n<b>4. That person you want to get with ;)<\/b>\r\n\r\nAgain, it’s always good to talk about how you spent time together the past year. Mention how fun he or she is to be around or how much they make you laugh. Although a list of qualities shouldn’t consist of the entire message, compliments are KEY. If you’re feeling adventurous, you can list a bunch of adjectives and slip in the word “pretty” or “attractive\". They’ll definitely get the picture and if they’ve ever been slightly interested in you, their desire to hit you up over the summer will definitely increase. If this risk sounds daunting, keep in mind that the worst that would happen is that the person you like will be flattered but won’t reciprocate feelings. Low risk, high reward!\r\n\r\n<b>5. Your best friend to whom no amount of writing could ever do justice<\/b>\r\n\r\nFor these types of people, you wonder, “Where do I even begin?!” Sometimes it might feel hard because you’ve written the same thing for them over the past 10 years in birthday cards, Christmas cards and let’s not forget old yearbook signings. The thing to remember about this case is that you need to let go of the expectation that this yearbook signing has to be perfect. It doesn’t have to flow well. It doesn’t have to be the deepest thing you’ve ever written to your friend. Feel free to combine all of the advice from the last four points. Just remember that your friend knows how awesome you are and no mediocre yearbook signing is going to change their positive perception of you.","excerpt":"Not knowing what to write in someone else's yearbook can be stressful and even awkward. If you’re ever caught staring at a blank page tapping your pen, you are likely to be perceived as an apathetic human being. Here are some tricks to avoiding this dilemma. ","date":"2015-05-29 06:20:48","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9050.jpg","categories":["Opinion","Spotlight"],"tags":{"44888":"edward chen","44886":"signing","44887":"what to write","23892":"yearbook"}},{"id":105387,"title":"Badminton prevails at SCVALs","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/badminton-prevails-at-scvals\/","content":"[caption id=\"attachment_105373\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-1.10.11-PM.png\"><img class=\" wp-image-105373\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-1.10.11-PM.png\" alt=\"Freshman Jackie Cai, juniors Eric Chiang and James Wang. and senior Promise Lee pose for a picture with their coaches Arne Lim and Justin Halas after competing at Silicon Valley Athletic Leagues. They will be competing at Central Coast Selection playoffs tomorrow. Photo by \" width=\"603\" height=\"456\" \/><\/a> Freshman Jackie Cai, juniors Eric Chiang and James Wang and senior Promise Lee pose for a picture with their coaches Arne Lim and Justin Halas after competing at the Santa Clara Valley Athletic League Championships last weekend. Chiang and Wang placed first in boys' doubles, while Cai and Lee took second place in girls' doubles. Photo courtesy of Eric Chiang.[\/caption]\r\n\r\nMembers of the Palo Alto High School badminton team celebrate their successful performance at the Santa Clara Valley Athletics League Championships last weekend.\r\n\r\nFour standout performances include juniors Eric Chiang and James Wang, who placed first in boys’ doubles, and freshman Jackie Cai and senior Promise Lee, who placed second in girls’ doubles.\r\n\r\nChiang, Cai, Wang and Lee qualified for the Central Coast Selection playoffs.\r\n\r\nOther notable performances include sophomores Ally Zhu and Linus Wang, who got 13th place in mixed doubles. Sophomores Alice Zhang and Ericka Wu placed ninth in girls' doubles and sophomores Justin Yip and Samarth Venkatasubramaniam took 13th place in boys' doubles.\r\n\r\nCai is proud of the team’s performance at SCVALs.\r\n\r\n“Paly did pretty well overall,” Cai said. “The results were predictable and I think our performance reflects our improvement throughout the season.”\r\n\r\nChiang echoed Cai's evaluation of the tournament.\r\n\r\n\"Compared to last year's results with James [Wang] and I getting fourth in boys' doubles and Derek [Young] and Promise [Lee] getting third in mixed doubles, Paly performed a lot better this year,\" Chiang said.\r\n\r\nAccording to Cai, a key factor of her performance is her work ethic with Lee.\r\n\r\n“I think Promise [Lee] and I performed well together,” Cai said. “She sets up for me, and I kill it. I think we have both improved a lot by playing at SCVALs.”","excerpt":"Members of the Palo Alto High School Badminton team celebrate their successful performance at the Santa Clara Valley Athletics League Championship last weekend.","date":"2015-05-28 18:31:47","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-28-at-1.10.11-PM.png","categories":["Sports"],"tags":{"44920":"alice zhang","44921":"ally zhu","15905":"badminton","44915":"eric chiang","44919":"ericka wu","44916":"jackie cai","44917":"james wang","44923":"justin yip","44922":"linus wang","8953":"paly","44918":"promise lee","44924":"samarth venkatasubramaniam","44925":"svcals"}},{"id":105240,"title":"Boys&#8217; and girls&#8217; swimming attend first ever State championship meet","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/boys-and-girls-swimming-attend-first-ever-state-championship-meet\/","content":"[caption id=\"attachment_105244\" align=\"alignnone\" width=\"622\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-27-at-5.10.59-PM.png\"><img class=\" wp-image-105244\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-27-at-5.10.59-PM.png\" alt=\"The Palo Alto High School girls' \" width=\"622\" height=\"490\" \/><\/a> Freshmen Zoe Lusk, Claire Lin, sophomore Grace Zhao and junior Kayleigh Svensson stand on the podium after winning a state championship relay in the 200 yard Freestyle Relay. The girls' and boys' swimming teams both performed well at the first ever California Interscholastic Federation State Swimming and Diving Championships, placing in sixth and eighth, respectively. Photo by Grace Zhao.[\/caption]\r\n\r\nThe Palo Alto High School boys’ and girls’ swimming teams are celebrating their successes this season after competing at the California Interscholastic Federation State Swimming and Diving Championships last weekend.\r\n\r\nAccording to senior captain Ryan Drover, this year was the first time California has held a state championship for swimming.\r\n\r\n“With California being the biggest and fast swimming state, everyone had always asked to see a state championship,” Drover said. “It was one of the fastest high school meets in the country.”\r\n\r\nMany major colleges sent swim coaches to the meet to keep an eye on possible future recruits, according to Drover.\r\n\r\n\"For many sophomores and juniors, there could not be a more valuable meet for college recruiting purposes,” Drover said. “As a meet that will only grow, it will only be more valuable, since coaches can see top swimmers racing in [the] short course yards pool ... and not be overshadowed by elite level swimmers as they will be at the U.S. Olympic Trials next summer.”\r\n\r\nAccording to Drover, the girls' team came away with a sixth place overall finish, highlighted by a winning state championship relay in the 200 Freestyle Relay (freshmen Zoe Lusk, Claire Lin, sophomore Grace Zhao, and junior Kayleigh Svensson). The boys' team finished in eighth overall.\r\n\r\n“Overall, we had a great season,” Drover said. “It's been a great four years, and I couldn't have asked for a better way or a better group of people to end it with.”","excerpt":"The Palo Alto High School boys’ and girls’ swimming teams are celebrating their successes this season after competing at the California Interscholastic Federation State Swimming and Diving Championships last weekend.","date":"2015-05-28 18:31:02","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-Shot-2015-05-27-at-5.10.59-PM.png","categories":["Sports"],"tags":{"40940":"claire lin","40114":"grace zhao","40101":"kayleigh svensson","8944":"palo alto high school","8953":"paly","40102":"ryan drover","33010":"state championships","33011":"states","9143":"Swimming","40112":"zoe lusk"}},{"id":104348,"title":"Paly students channel creativity through blogging","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/paly-students-channel-creativity-through-blogging\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/562242537.jpg\"><img class=\"aligncenter wp-image-104381\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/562242537.jpg\" alt=\"562242537\" width=\"508\" height=\"420\" \/><\/a>\r\n\r\nThe development of technology has given root to new methods for channeling creativity. Blogging is a way for anyone to create their own voice and unique “space” within the vastness of this tangled web we call the Internet. As blogging continues to expand and transform, many students at Palo Alto High School have found it to be a rewarding and creative outlet.\r\n\r\nCheck out some of these student bloggers:\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/jannat-hashmis-fashion-and-photography-blog-to-wear-is-to-love\/\">Jannat Hashmi's fashion and photography blog: To wear is to love<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/belle-dougmans-fashion-blog-frills-and-freckles\/\">Belle Doughman's fashion blog: Frills and freckles<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/karina-chan-and-stephanie-congs-lifestyle-blog-the-adventures-of-k-and-s\/\">Karina Chan and Stephanie Cong's lifestyle blog: The Adventures of K and S<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/serina-nguyens-beauty-blog-serinaland\/\">Serina Nguyen's beauty blog: Serinaland<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/alisha-kumars-travel-blog-by-the-breeze\/\">Alisha Kumar's travel blog: By the Breeze<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/andrew-lus-personal-blog-bronard\/\">Andrew Lu's personal blog: Bronard<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/oskar-soderbergs-comedic-blog-california-person\/\">Oskar Soderberg's comedic blog: California Person <\/a>\r\n\r\n&nbsp;","excerpt":"As blogging continues to expand and transform, many students at Palo Alto High School have found it to be a rewarding and creative outlet. Check out some student bloggers here.","date":"2015-05-28 14:49:25","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/562242537.jpg","categories":["Features"],"tags":[]},{"id":105092,"title":"Track sprints into CCS Finals","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/track-sprints-into-ccs-finals\/","content":"[caption id=\"attachment_105302\" align=\"aligncenter\" width=\"585\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DSC_0107.jpg\"><img class=\"wp-image-105302\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DSC_0107.jpg\" alt=\"DSC_0107\" width=\"585\" height=\"420\" \/><\/a> Junior Dami Bolarinwa starts off the 400-meter dash, followed by junior Charlie Badger. Bolarinwa placed first at 51.72 seconds and Badger placed sixth with a time of 53.90 seconds during this April 23 meet against Los Gatos at Paly. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nMultiple Palo Alto High School track and field team members will compete at the 50th anniversary Central Coast Sectional finals this Friday at San Jose City College.\r\n\r\nBoth the girls and boys 4x400 teams and the girls 4x100 team qualified, along with individual racers seniors Anna Dukovic and Julia Asin and juniors Cat Yu, Dami Bolarinwa and Eli Givens.\r\n\r\n\"Going into this meet we are all hoping to race our best and just have fun because for some of us it might be the last meet of the year,\" senior captain Dukovic said. \"This meet is CCS Finals and there is a lot of tough competition, but it means a lot to get to run in it.\"\r\n\r\nAt CCS semifinals, the boys 4x400 team placed 2nd out of 30 teams, the girls 4x400 team placed 8th out of 29 and the girls 4x100 team placed 8th out of 31.\r\n\r\nLast year, Givens had a strong performance in CCS finals, placing first in the 100-meter dash and third in the 200-meter dash. He is also coming into the meet strong this year, currently standing in second in CCS for both the 100-meter and 200-meter dashes with times of 10.79 and 21.86 respectively. Bolarinwa had a strong showing at this years semifinals, finishing in third place in the 400-meter dash with a time of 50.79.\r\n\r\nThe three girls competing in individual events at this years CCS finals is a bump up from last season when no individual girls competed. Asin, who will go on to run track at Amherst College next year, currently stands at 2nd in the district for the 400-meter dash with a time of 59.24. Dukovic, who competed in the 100-meter dash, 200-meter dash, 4x100 meter relay, high jump and long jump this season, is currently seeded in 6th for SCVALS for both high jump and long jump. Yu, who also competes on the 4x100 team with Asin and Dukovic, currently comes in at 7th for the 300-meter hurdles for CCS.\r\n\r\n\"A handful of individuals normally make it to CCS finals,\" Dukovic said. \"This year I think a few more people made it than the past couple years for individual events.\"\r\n\r\nDukovic will be competing in the long jump, Asin will be competing in the 400-meter dash, Yu will be competing in the 300-meter hurdles, Bolarinwa will be competing in the 400-meter dash and Givens will be competing in the 100-meter dash, 200-meter dash and the long jump.\r\n\r\nBoth Dukovic and Asin are getting ready for this meet like it is their last in high school history. The meet will be conflicting with Friday night's Baccalaureate.\r\n\r\n\"It's kind of sad preparing for my last track meet because I have done this sport for four years and I am really going to miss running with everyone,\" Dukovic said. \"However, it's also fun practicing and spending time with everybody during these last few days.\"\r\n\r\nField events will begin at 4 p.m. and track events start at 6 p.m.\r\n\r\n&nbsp;","excerpt":"Both the girls and boys 4x400 teams and the girls 4x100 team qualified for the CCS 50th Anniversary Finals this Friday at San Jose City College, along with individual racers seniors Anna Dukovic and Julia Asin and juniors Cat Yu, Dami Bolarinwa and Eli Givens.","date":"2015-05-28 14:09:30","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/DSC_0107.jpg","categories":["Sports"],"tags":{"44885":"50th ccs","8568":"CCS","40198":"ccs finals","11390":"field","9181":"track","9183":"track and field"}},{"id":105342,"title":"How Palo Alto’s water restrictions will affect you","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/how-palo-altos-water-restrictions-will-affect-you\/","content":"[caption id=\"attachment_105343\" align=\"alignnone\" width=\"547\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/photo-21.jpg\"><img class=\"wp-image-105343\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/photo-21.jpg\" alt=\"Ornamental uses of water such as lawns will be most affected by Palo Alto’s water restrictions. These restrictions come in response the California’s ongoing drought, with 2014 being the warmest and third driest year on record in California, according to California Water Science Center.  \" width=\"547\" height=\"410\" \/><\/a> Ornamental use of water such as watering lawns will be most affected by Palo Alto’s water restrictions. These restrictions come in response to California’s ongoing drought, with 2014 being the warmest and third driest year on record in California, according to California Water Science Center. Photo by William Zhou.[\/caption]\r\n\r\nIn response to California’s drought and statewide water goals, the City of Palo Alto is taking initiative to cut its water use by enacting water restrictions that will affect all citizens starting June 1.\r\n\r\nThese restrictions will comply with the state’s first mandatory statewide water use reduction act.\r\n\r\n“Palo Alto needs to cut its water use by 24 percent between June 1 and Feb. 28, 2016,” said Catherine Elvert, Palo Alto Utilities Communications Manager. “The results from this year will be compared to that of 2013, the last non-drought year we’ve had.”\r\n\r\nThe following are the restrictions that the city will enact to reduce its water use,<a href=\"www.cityofpaloalto.org\/water\"> according to the city's website: <\/a>\r\n\r\n1) Irrigation of landscapes or turf during and within 48 hours after a measurable rainfall, more than two days per week, or between 10:00 a.m. and 6:00 p.m. is prohibited.\r\n\r\n2) Odd numbered addresses or no address may only irrigate on Mondays and Thursdays; Even numbered addresses may only irrigate on Tuesdays and Fridays.\r\n\r\n3) Broken or defective plumbing and irrigation systems must be repaired or replaced within a reasonable period.\r\n\r\n4) Applying water to driveways and sidewalks is prohibited, except where necessary to address an immediate health and safety need.\r\n\r\n5) Restaurants and other food service operations shall serve water to customers only upon request.\r\n\r\nAmong the several restrictions listed above, residents will most be affected by those that limit “ornamental” water, or water used for purely decorative purposes:\r\n\r\n“We [the city] don’t want to limit people using water for useful purposes like drinking, growing vegetables, maintaining sanitation, and areas for children, sports and pets,” Elvert said. “We want to restrict water that is being used for no viable purpose and saving that water for more important uses. ”\r\n\r\nSome Palo Altans may question how the drought will affect them outside their houses.\r\n\r\n“At our parks and city facilities, we’re going to let unused grass die,” Elvert said. “You can also expect drier landscape conditions during the summer. Palo Alto is slightly cooler than other areas in the state, but the water supply is a finite resource. It's like a fish tank: if it’s being used in one place, it is not in another.”\r\n\r\n\"I think it's a really good idea to restrict water,\" freshman Rebecca Yao said. \"I try to take shorter showers and we recently changed our lawn into desert plants last summer. People don't really use their lawns and the desert plants look really nice and make people aware  of the issue. My friend has a sign that says 'brown is the new green.'\"\r\n\r\nViolations will follow a tiered structure, with repeat offenses having larger consequences, according to the<a href=\"www.cityofpaloalto.org\/water\"> city’s website.<\/a>\r\n\r\n1st violation: Doorhanger\/Email\/Phone call to customer\r\n\r\n2nd violation: Doorhanger\/Email\/Phone call to customer\r\n\r\n3rd violation: Certified letter from the Utility Director notifying customer of violation and potential future fines\r\n\r\n5th violation: Flow restrictors may be installed\r\n\r\nViolations will be enforced through community efforts.\r\n\r\n“We’re planning on bringing a couple more water waste coordinators on board to help with regulation,” Elvert said. \"But it will largely be based on customers contacting us with [their own reports] through the PA 311 app. We’ll go out to reported sites and check in with the neighbors and [home owner].”\r\n\r\nThe city has posted several suggestions on how residents can cut down on water usage today on its <a href=\"www.cityofpaloalto.org\/water\">website<\/a>.\r\n\r\n“The most important message is that, we [Palo Alto Utilities] are here to help,” Elvert said. “We have free services, including surveys, tips, rebates, and we can provide assistance.”","excerpt":"In response to California’s drought and statewide water goals, the City of Palo Alto is taking initiative to cut its water use by enacting water restrictions that will affect all citizens starting on June 1.","date":"2015-05-28 13:42:17","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/photo-21.jpg","categories":["News","Spotlight"],"tags":{"34100":"city","29490":"drought","8939":"palo alto","44908":"sprinkler","44909":"turf","44907":"water restriction"}},{"id":105213,"title":"Alisha Kumar&#8217;s travel blog: By the Breeze","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/alisha-kumars-travel-blog-by-the-breeze\/","content":"&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Alisha-11.jpeg\"><img class=\"alignnone  wp-image-105215\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Alisha-11.jpeg\" alt=\"Alisha (1)\" width=\"707\" height=\"527\" \/><\/a>Travel and Lifestyle blogger, junior Alisha Kumar is the author of<a href=\"http:\/\/bythebreezeblog.com\/\"> By the Breeze<\/a>, a blog featuring stories on travel and food. Since her family takes trips all over the world, she is always inspired to capture the times abroad and share them with others.\r\n\r\nOriginally, Kumar was going to start a food blog, but after after taking a trip to Kaui she was so inspired to capture and share the beauty of the island that it became a lifestyle blog instead. Kumar is not only inspired by food and travel, but also by other bloggers such as <a href=\"http:\/\/galmeetsglam.com\">Julia Engel.<\/a>\r\n\r\n“Every time we travel I try to immerse myself into the culture,\" Kumar said. \"These new places are a constant source of inspiration for me.\"\r\n\r\nAccording to Kumar, her love for eating has influenced a large majority of her blog featuring stories on her food experiences.\r\n\r\n\"I am slightly obsessed with trying new places to eat,\" Kumar said. \"For me, trying new places to eat can be a mini-trip in and of itself as it’s an exposure to other cultures and styles.\"","excerpt":"&nbsp; Travel and Lifestyle blogger, junior Alisha Kumar is the author of By the Breeze, a blog featuring stories on travel and food. Since her family takes <a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/alisha-kumars-travel-blog-by-the-breeze\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-28 13:34:18","author":"Aisha Chabane","categories":["Uncategorized"],"tags":[]},{"id":105149,"title":"Serina Nguyen&#8217;s beauty blog: Serinaland","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/serina-nguyens-beauty-blog-serinaland\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Unknown-6.png\"><img class=\"alignnone size-full wp-image-104352\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Unknown-6.png\" alt=\"Unknown-6\" width=\"800\" height=\"530\" \/><\/a>\r\n\r\nSophomore Serina Nguyen is the author of <a href=\"http:\/\/serinaland.blogspot.com\/\">Serinaland<\/a>, a fashion blog. Inspired by famous Youtubers <a href=\"https:\/\/www.youtube.com\/user\/zoella280390\"><span style=\"color: #000000;\">Zoe Sugg<\/span><\/a> and <a href=\"https:\/\/www.youtube.com\/user\/essiebutton\">Essie Button<\/a>, she began to blog as a fun past-time activity and quickly found a love for blogging.\r\n\r\nNguyen focuses her blog posts on her daily life, writing entries that she describes as “diary like.\" She also uses her passion for makeup and fashion to an advantage.\r\n\r\nHer blog consists of OOTD’s (Outfit of the day) where she posts a picture of her outfit and explains why she likes it as well as where everything is from.\r\n\r\nAccording to Serina, blogging is a great way to express yourself through writing and recommends others to blog as well.\r\n\r\n&nbsp;","excerpt":"Sophomore Serina Nguyen is the author of Serinaland, a fashion blog. Inspired by famous Youtubers Zoe Sugg and Essie Button, she began to blog as a fun past-time activity and <a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/serina-nguyens-beauty-blog-serinaland\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-28 13:34:13","author":"Aisha Chabane","categories":["Uncategorized"],"tags":[]},{"id":105151,"title":"Andrew Lu&#8217;s personal blog: Bronard","permalink":"http:\/\/palyvoice.com\/2015\/05\/28\/andrew-lus-personal-blog-bronard\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Unknown-5.png\"><img class=\"alignnone  wp-image-104354\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Unknown-5.png\" alt=\"Unknown-5\" width=\"718\" height=\"389\" \/><\/a>\r\n\r\n“<a href=\"http:\/\/bronard.com\/\">Bronard”<\/a> is the title of senior Andrew Lu’s blog, which first began as an online portfolio.  Lu feels that as a musician it is incredibly important  to have an online presence in order to get around in the highly competitive music industry. The blog has since evolved and now has a variety of different entries such as diary entries, creative writing and journalistic pieces.\r\n\r\n“My blog is mainly a place where I can write about anything,\" Lu said. \"There is some creative writing on it, but mainly just diary kind of writing; places I’m at, events of the day, shows that I’ve seen.\"\r\n\r\nLu occasionally writes journalistic type articles. His article “<a href=\"http:\/\/bronard.com\/post\/113222032670\/suicide-3-0\">Suicide 3.0<\/a>” on the recent events in Palo Alto regarding teen suicide received a lot of online media attention and views around the nation.\r\n\r\nLu said that although he doesn't have a specific vision for his blog in the future, he sees it as an important creative outlet.\r\n\r\nLu recommends blogging to others as it's not all that time consuming and easily fits around ones schedule.\r\n\r\n“It really doesn't take much time and it doesn't require you to allocate a specific amount of time every day,” Lu said. “You can really post whenever you want.”","excerpt":"“Bronard” is the title of senior Andrew Lu’s blog, which first began as an online portfolio.  Lu feels that as a musician it is incredibly important <a href=\"http:\/\/palyvoice.com\/2015\/05\/28\/andrew-lus-personal-blog-bronard\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-05-28 13:34:08","author":"Aisha Chabane","categories":["Uncategorized"],"tags":[]}]