[{"id":101100,"title":"Liveblog: Varsity girls&#8217; lacrosse takes on Gunn","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/liveblog-varsity-girls-lacrosse-takes-on-gunn\/","content":"The Palo Alto High School varsity girls' lacrosse team is playing Gunn High School on the Paly at tonight at 7p.m. on the Paly lacrosse field.\r\n\r\n[liveblog]\r\n\r\nJunior Maya Benatar scores first goal of the game. Paly is up 1-0.\r\n\r\nJunior Meredith Kinnamon blocks a shot from Gunn, but Gunn is quick to regain possession.\r\n\r\nJunior Maya Benatar scores again. Paly winning 2-0.\r\n\r\nGunn player #6 scores. Paly keeps the lead 2-1.\r\n\r\nSenior Allie Peery bounces the ball into the goal. Paly leads 3-1.\r\n\r\nSenior Paige Bara charges the goal and gets fowled. She makes the goal. Paly leads 5-1.\r\n\r\nGunn Titans score. Paly leads 4-2.\r\n\r\nGunn handles the ball by the goal, but Senior Paige Bara intercepts and runs with it.\r\n\r\nGunn player #5 fowled, and seeks help from trainer. She is able to walk off the field.\r\n\r\nGunn senior Caroline Chou shoots for the goal but is blocked by goalie Meredith Kinnamon.\r\n\r\nThe half ends with Paly leading Gunn 4-2.\r\n\r\n2nd half starts with Gunn possession.\r\n\r\nGunn scores. Vikings keep their slim lead of 4-3.\r\n\r\nSenior Paige Bara shoots and makes the goal, but the referee calls no point. She shoots and makes the 8-meter shot. Paly leads 5-3.\r\n\r\nSenior Caroline Chou intercepts the ball and charges the field. She passes to Gunn player #9 who scores. Vikings lead 5-4.\r\n\r\nSenior Lisa Rogge scores for Paly. Paly is up 6-4.\r\n\r\nSenior Paige Bara scores for the third time. Paly leads 7-4.\r\n\r\nGunn player #11 misses an 8-meter shot. Score remains 7-4, Paly.\r\n\r\nSenior Claire Chevallier scores bring the Vikings up 8-4.\r\n\r\nSenior Caroline Chou makes an 8-meter shot, bringing the Gunn Titans up 8-5.\r\n\r\nMaya Benatar scores with 11 seconds left. Vikings lead 9-5.\r\n\r\nPaly beats Gunn. Final score, 9-5.","excerpt":"The Palo Alto High School varsity girls&#8217; lacrosse team is playing Gunn High School on the Paly at tonight at 7p.m. on the Paly lacrosse <a href=\"http:\/\/palyvoice.com\/2015\/03\/12\/liveblog-varsity-girls-lacrosse-takes-on-gunn\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2015-03-12 19:11:31","author":"Chloe Fishman","categories":["Uncategorized"],"tags":{"8734":"girls","8751":"gunn","8836":"Lacrosse","8953":"paly","9200":"varsity"}},{"id":100895,"title":"Community mourns, unifies following student death","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/community-mourns-unifies-following-student-death\/","content":"The Palo Alto High School administration and community are providing wide-ranging support options following the death by suicide on Monday of a Paly student.\r\n\r\nThese services include several multiple layers of support services and enhanced communication with Paly families. The goal of these efforts is to send a simple message to the entire Paly community: \"We're here for you,\" Principal Kim Diorio said.\r\n\r\nPerhaps the most innovative support tool made available to students is a new email communication service, which Diorio introduced in a letter sent out to the entire Paly community Monday night. Students can use <a href=\"mailto:palysupport@pausd.org\">palysupport@pausd.org<\/a> to refer friends that they think are in need of professional assistance, or to write out their own thoughts and feelings and receive support.\r\n\r\n\"We need our students to tell us when they're concerned about a friend,\" Diorio said. \"When students are able to talk to us or tell us that they're worried about somebody, we can help.\"\r\n\r\nDiorio also emphasized the importance of communication among community members, including parents and students, and encouraged students to seek help from adults and friends when necessary.\r\n\r\n\"Like most families, we unconditionally love each other,\" Diorio wrote in the letter. \"What unites us and makes us a family is our unconditional love of our students.\"\r\n\r\nThe school's immediate response to the events on Monday morning included a crisis response team, which consisted of Paly guidance counselors and counselors from external agencies such as <a href=\"www.kara-grief.org\" target=\"_blank\">Kara<\/a> and <a href=\"www.acs-teens.org\/\" target=\"_blank\">Adolescent Counseling Services<\/a>. These specialists met with over 200 students over the course of the two days following the event.\r\n\r\n\"Those extra providers are also able to talk to students that just come up to the guidance office or are referred through teachers and other students,\" Diorio said.\r\n\r\n[caption id=\"attachment_101071\" align=\"alignleft\" width=\"377\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11063240_10153091859537332_1013323371_n.jpg\"><img class=\" wp-image-101071\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11063240_10153091859537332_1013323371_n.jpg\" alt=\"Several Palo Alto High School faculty members brought &quot;Therapy Dogs&quot; to campus on Tuesday, to help brighten students' spirits following the death by suicide of a Paly student on Monday. Photo by Emma Chiu.\" width=\"377\" height=\"283\" \/><\/a> Several Palo Alto High School faculty members brought \"therapy dogs\" to campus on Tuesday to help brighten students' spirits following the death by suicide of a Paly student on Monday. Photo by Emma Chiu.[\/caption]\r\n\r\nSeveral students are also making an efforts to reach out to their fellow peers and offer support. The Unity Club hosted a \"safe zone\" during Lunch earlier today. Diorio attended the event, along with several other Paly faculty members.\r\n\r\n\"We want to give students a space to talk about what's going because we know suicide is a conversation that is very hard to start,\" junior Unity Club vice president Siggi Bengston said. \"The main message we want to get across to Paly is we need change. There have been too many young lives lost in just this past school year, and it's time for something different.\"\r\n\r\nIn addition to addressing student welfare, Diorio also noted that the administration is making a great effort to reach out and provide support to teachers. Eight substitute teachers were available on Monday and Tuesday to step into class to allow teachers to take a break. A school psychologist assisted the classes in which the deceased student was enrolled, according to Diorio.\r\n\r\n\"We've been keeping our pulse on how the teachers are doing and coping, and making sure they have the support and counseling that they might need,\" Diorio said.\r\n\r\nSeveral Paly parents were also invited to campus this week to engage in conversation with students and remind them of the counseling resources available.\r\n\r\n\"We have parents on campus ... helping suggest that students go talk to adults up in the guidance area or counselors if they need that support,\" Diorio said.\r\n\r\nDiorio hopes to further engage parents in the conversation and plans to host parent events in the future. Among these events include an open house Coffee with Paly administrators earlier this morning, hosted by the Parent Teacher Student Association, where parents were encouraged to come talk in an informal environment.\r\n\r\n\"We know that they [parents] are concerned, want to help out and want to talk,\" Diorio said.\r\n\r\nDiorio reiterated the main message that the community is here to support everyone.\r\n\r\n\"If you need support or help, please talk with any of your teachers, your teacher adviser or any staff member you see wandering about,\" Diorio wrote. \"We're here for you.\"\r\n\r\n&nbsp;\r\n\r\n<em>A list of school and community resources are available on the <a href=\"http:\/\/paly.net\/crisis-resources\" target=\"_blank\">Paly website Crisis Resources page<\/a> and the <a href=\"http:\/\/pausd.org\/parents\/services\/counseling\/\" target=\"_blank\">PAUSD Counseling Services page<\/a>. If you need immediate assistance, the Santa Clara County Suicide and Crisis Hotline is available at 1-855-278-4204 at any time. These numbers are also available on the back of student ID cards. The new <a href=\"mailto:palysupport@pausd.org\">palysupport@pausd.org<\/a> email is accessible to all students if you are concerned about a friend or wish to receive support. If you feel you or someone you know needs immediate support, please call 911.<\/em>","excerpt":"The Palo Alto High School administration and community are providing various support systems following the recent death of a Paly student in order to send a simple message to the entire Paly community: \"We're here for you.\"","date":"2015-03-12 14:58:24","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11063240_10153091859537332_1013323371_n.jpg","categories":["News","Spotlight"],"tags":{"22666":"admin","8458":"administration","40509":"Bengston","28772":"club","8611":"Community","40506":"crisis","8644":"diorio","8694":"family","40505":"help","40507":"hotline","9954":"jerry berkson","8834":"Kim Diorio","8939":"palo alto","8944":"palo alto high school","8953":"paly","40510":"palysupport","23939":"reaction","40508":"Siggi","37653":"student death","9135":"suicide","37654":"support","40512":"systems","40511":"sytem","31762":"unity"}},{"id":100997,"title":"Girls&#8217; basketball ousted in CIF first round; motivated for next season","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/girls-basketball-ousted-in-cif-first-round-motivated-for-next-season\/","content":"The Palo Alto High School girls' basketball team (22-5, 12-0) had its magical season cut short in the first round of the CIF State Girls Basketball Championships on Wednesday night after it suffered a heartbreaking 55-45 loss at home against Oakland High School (23-6, 8-1).\r\n\r\n[caption id=\"attachment_101059\" align=\"aligncenter\" width=\"593\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-12-at-1.35.43-PM.png\"><img class=\"wp-image-101059 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-12-at-1.35.43-PM.png\" alt=\"Vikings head coach Scott Peters challenges his players during a game against Gunn High School on Feb. 7. The girls' team is expected to have all of its players return next season. Photo by Dhara Yu.  Vikings head coach Scott Peters challenges his players during a game against Gunn High School on Feb. 7. The girls' team is expected to have all of its players return next season. Photo by Dhara Yu.\" width=\"593\" height=\"456\" \/><\/a> Vikings head coach Scott Peters challenges his players during a game against Gunn High School on Feb. 7. The girls' team is expected to have all of its players return next season. Photo by Dhara Yu.[\/caption]\r\n\r\nRanked as one of two No. 4 seeds in a field of 30 teams, the Vikings entered the field as favorites against the No. 13 seed Wildcats, who were captained by senior forward Keyanna Bendy, the team's leading scorer.\r\n\r\nDespite winning 22 of its first 24 games on the season, the Vikings lost three straight to conclude their season: during Open Division of the CCS Playoffs against St. Igantius and Scotts Valley, and Wednesday versus Oakland.\r\n\r\nThe Wildcats outscored the Vikings, 22-13, in the fourth quarter after the Vikings rallied in the third to cut the Wildcats' lead down to one, ending the Vikings season after just one CIF game. Oakland will move on and host No. 5 seed Pittsburg at 6 p.m. this Saturday, March 14.\r\n\r\nWhile the early exit is frustrating, sophomore forward Skylar Burris says that the team will come back next year motivated and stronger compared to this year.\r\n\r\n\"Although we didn't go for as long as wanted to in CIF, it's hard to be disappointed with all the accomplishments we acheived,\" Burris said. \"Our team is so close and there really is no offseason [for us]; we're always together and always working to improve our basketball skills.\"\r\n\r\nWith no seniors on the team this year, the Vikings are expected to return next year with all of their current players. Junior guard Maddy Atwater says that the girls are staying positive and are proud about how far they got.\r\n\r\n\"Obviously we are disappointed we lost and our season was cut short, \" Atwater said. \"We know we could have beat [Oakland] but we are proud of how far we got and are staying very positive about it all.\"\r\n\r\nAccording to Atwater, the team is starting its offseason off by beginning a weight lifting program next week. Burris says that building off of a perfect De Anza League season will result in a dominant team next year.\r\n\r\n\"We're ready to kick some major butt next season,\" Burris said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' basketball team (22-5, 12-0) had its magical season cut short in the first round of the CIF State Girls Basketball Championships Presented by Farmers on Wednesday night after it suffered a heartbreaking 55-45 loss at home against Oakland High School (23-6, 8-1). ","date":"2015-03-12 13:39:45","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_15085b15d.jpg","categories":["Sports"],"tags":{"40638":"first round loss","8735":"girls basketball"}},{"id":99921,"title":"Students pilot study-abroad program","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/students-pilot-study-abroad-program\/","content":"[caption id=\"attachment_101003\" align=\"alignnone\" width=\"591\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/unnamed.jpg\"><img class=\" wp-image-101003\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/unnamed.jpg\" alt=\"Global Glimpse participants congregate to discuss preparations for their trip. Photo courtesy of Steve Foug.\" width=\"591\" height=\"443\" \/><\/a> Global Glimpse participants congregate to discuss preparations for their trip. Photo courtesy of Steve Foug.[\/caption]\r\n\r\nThis summer, 20 Palo Alto High School juniors will have the opportunity to immerse themselves in the culture of a foreign country by participating in the school's chapter of <a href=\"https:\/\/www.globalglimpse.org\">Global Glimpse<\/a>, a newly piloted, leadership-oriented program.\r\n\r\nAccording to Paly's Global Glimpse coordinator, social studies teacher Steve Foug, the program, which is in its first year at Paly, is targeted toward students of diverse backgrounds and strives to give participants a way to learn about other regions of the world while helping them develop management and communication skills. Participants will experience life in a rural community in a Latin American country over a three-week period in the summer and will engage in a variety of community service activities.\r\n\r\n\"Students will travel to a small city in Nicaragua, the Dominican Republic or Ecuador and will stay in a hostel for two to three weeks,\" Foug said. \"They'll teach English to the locals in the evenings for free and work on a community action project.\"\r\n\r\nOne of the goals of the program is to expose students to the realities of life in other parts of the world.\r\n\r\n\"They'll spend a day with the [local] families and see what it's like to live on a dollar a day,\" Foug said.\r\n\r\n[caption id=\"attachment_100776\" align=\"alignright\" width=\"397\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11051015_803181706441324_1325225690_n.jpg\"><img class=\"wp-image-100776\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11051015_803181706441324_1325225690_n.jpg\" alt=\"From left: Juniors Rebecca Sunnerås Jonsson, Claire Krugler and Eli Craveiro Frankel, all participants in the Global Glimpse program, set up a bake sale in downtown Palo Alto. Global Glimpse attendees are expected to fundraise in preparation for their trips to Latin American countries. Photo courtesy of Minyoung Kim.\" width=\"397\" height=\"223\" \/><\/a> Juniors Rebecca Sunnerås Jonsson, Claire Krugler and Eli Craveiro Frankel set up a bake sale in downtown Palo Alto as a part of the Global Glimpse program. Global Glimpse attendees are expected to fundraise in preparation for their trips to Latin American countries. Photo courtesy of Minyoung Kim.[\/caption]\r\n\r\nFoug says the program is an excellent opportunity for students to improve collaboration skills, as participants will have to work with students from different schools while abroad.\r\n\r\n\"It'll be a mix of students from all over the Bay Area,\" Foug said.\r\n\r\nIn the beginning of the school year, teachers nominated around 90 students to take part in the program. Those interested in attending submitted an application and were then accepted into the program by the Global Glimpse team.\r\n\r\n\"I asked social studies teachers to nominate students that they thought would be interested in this program or would do well,\" Foug said. \"This is targeted toward people that are interested in the leadership aspect, fundraising or a service-oriented career.\"\r\n\r\nParticipants are required to attend workshops throughout the year to prepare for their trips.\r\n\r\n\"We have a series of workshops and learn about things like culture, globalization, Latin American history, aid and development so that these students will be well equipped wherever they go,\" Foug said.\r\n\r\nFoug believes that the program is appealing because it offers students a wide range of activities and facilitates the development of valuable personal qualities.\r\n\r\n\"It's a program that has so many facets to it and will hopefully give students skills that will be applicable for all types of careers down the road,\" Foug said.\r\n\r\nAnother major drawing point for Global Glimpse is that attendees are not required to speak any Spanish, so even those who have no knowledge of Spanish whatsoever still have an opportunity to travel to Latin America.\r\n\r\n\"I don't speak a lick of Spanish, and neither do some of the Paly students that will be going,\" Foug said.\r\n\r\nJunior Aiva Petriceks, who will be attending the Global Glimpse program in Matagalpa, Nicaragua, said that she is most excited to interact with others and form friendships that will continue even after the trip has ended.\r\n\r\n\"I'm really looking forward to meeting the people there and making lasting connections,\" Petriceks said.\r\n\r\nFoug also emphasized that the objective is not simply to do a transient community project, but rather to implement meaningful change in communities and have attendees develop important interpersonal skills.\r\n\r\n\"It's not just, 'Let's go down to a third-world country and help and feel good about ourselves,'\" Foug said. \"It's more focused on what we can learn – what we can take away from it ourselves.\"","excerpt":"This summer, 20 Palo Alto High School juniors will have the opportunity to immerse themselves in the culture of a foreign country by participating in the school's chapter of Global Glimpse, a newly piloted, leadership-oriented program.","date":"2015-03-12 13:26:35","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/11051015_803181706441324_1325225690_n.jpg","categories":["Features","Spotlight"],"tags":{"30886":"aiva petriceks","40202":"global glimpse","40203":"immersive","38458":"latin america","8944":"palo alto high school","8953":"paly","23598":"steve foug","9137":"summer","9184":"travel","40204":"trip"}},{"id":100948,"title":"Buena Vista supporters rally at City Hall","permalink":"http:\/\/palyvoice.com\/2015\/03\/12\/buena-vista-supporters-rally-at-city-hall\/","content":"[caption id=\"attachment_100911\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0092.jpg\"><img class=\"wp-image-100911\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0092.jpg\" alt=\"A woman and boy hold signs alongside about 50 others to protest the closure of Buena Vista Mobile Homes in front of Palo Alto City Hall. Photo by Amy Leung.\" width=\"620\" height=\"413\" \/><\/a> A woman and her son, residents of Buena Vista Mobile Home Park, hold a sign Monday afternoon in front of Palo Alto City Hall protesting the closure of the park. About 50 people held signs among the crowd of 250. Photo by Amy Leung.[\/caption]\r\n\r\nBuena Vista Mobile Home Park residents and supporters looking to prevent the closure of the community congregated Monday at Palo Alto City Hall to garner more assistance.\r\n\r\nRoughly 50 attendees who faced Hamilton Street held signs that urged for the saving of the park, while another roughly 200 joined them to display their support through the strength of numbers. Many bore bright yellow stickers which read, \"Keep B.V. Residents in P.A.\" to indicate their involvement in the cause.\r\n\r\nAccording to longtime Buena Vista resident Melodie Dawn Cheney, Santa Clara County Supervisor Joe Simitian is leading the effort of raising between $30 million and $40 million through charitable support from the county, city and foundations. According to Palo Alto Online, Simitian proposed <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/01\/20\/county-supervisors-offer-aid-in-preserving-buena-vista\" target=\"_blank\">using $8 million set aside by a Stanford University fund<\/a> to produce and maintain affordable housing within a six-mile radius of the university to help secure the homes of the current Buena Vista residents.\r\n\r\n\"We're trying to find a way for us to buy the park so we can own it, or even another non-profit can own it,” Cheney said. “We’re just trying to see who else we can get on board.”\r\n\r\n[caption id=\"attachment_100910\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0122.jpg\"><img class=\"wp-image-100910\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0122.jpg\" alt=\"Santa Clara County Supervisor Joe Simitian, a large advocate to save Buena Vista Mobile Homes Park, thanks the attendees of the rally for showing their support before entering Palo Alto City Hall to listen to speakers. Photo by Amy Leung.\" width=\"620\" height=\"413\" \/><\/a> Santa Clara County Supervisor Joe Simitian, a significant advocate for Buena Vista Mobile Home Park residents, thanks attendees of the rally for showing their support. Afterward, the attendees moved inside Palo Alto City Hall to listen to speakers talk about saving the park. \"Hopefully by the sheer force of numbers, [we can] communicate that there are residents of every neighborhood in this community and beyond who share those two goals: prevent the eviction of 400 Palo Alto residents [and] save the site for affordable housing and inperpetuity,\" Simitian said to the crowd. Photo by Amy Leung.[\/caption]About two-and-a-half years ago, the owner of Buena Vista wanted to sell the property, but the buyers ended up backing out, according to Cheney. Now, the park hangs in a state of limbo as residents and supporters work to preserve the affordable housing units.\r\n\r\nJennifer Munoz-Theo, an eighth grader at Terman Middle School and a Buena Vista resident, described how the closure of the mobile home park would impact her.\r\n\r\n“I’ve made all my friends here, all my memories here, and it’s just going to tear my friendships apart,” Munoz-Theo said. “It’s going to hurt me a lot and affect us all.”\r\n\r\nWhen commenting on the significance the mobile home park and its residents play in her life, Cheney began tearing up.\r\n\r\n“It [the park] is my second family,” she said.","excerpt":"Buena Vista Mobile Home Park residents and supporters looking to prevent the closure of the community congregated Monday at Palo Alto City Hall to garner more assistance.","date":"2015-03-12 13:16:02","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_0092.jpg","categories":["News"],"tags":{"40606":"buena vista mobile home park","40608":"closure","40609":"jennifer munoz-theo","12351":"joe simitian","40610":"melodie dawn cheney","8939":"palo alto","40607":"palo alto city hall","9852":"rally","37654":"support"}},{"id":100964,"title":"Season recap: Girls&#8217; soccer falls to Mountain View in CCS","permalink":"http:\/\/palyvoice.com\/2015\/03\/11\/season-recap-girls-soccer-falls-to-mountain-view-in-ccs\/","content":"A 3-2 defeat to rival Mountain View High School (18-3-1, 10-1-1) in the Central Coast Section championship game over the weekend ended a strong 2014-15 season for the Palo Alto High School girls' soccer team (16-3-1, 9-2-1), which finished behind Mountain View in both CCS and the De Anza Division of the Santa Clara Valley Athletic League.\r\n\r\n[caption id=\"attachment_101047\" align=\"alignright\" width=\"383\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_24611.jpg\"><img class=\"wp-image-101047 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_24611.jpg\" alt=\"photo of person\" width=\"383\" height=\"257\" \/><\/a> Senior defender Lena Chang escapes the challenge of a Menlo-Atherton midfielder in a 1-0 quarterfinal win. Chang is one of six departing seniors. Photo by George Lu.[\/caption]\r\n\r\nAccording to Viking junior midfielder Alison Lu, the game was evenly matched, and her team was disappointed to lose.\r\n\r\n\"I thought the game was pretty frustrating as we had many chances in front of the goal, but just weren't able to score,\" Lu said. \"We were really focused on scoring, and I think that made us forget that we still had to defend, [which resulted in us] leaving holes in our back line.\"\r\n\r\nSenior goalkeeper Sarah Lim shared similar sentiments.\r\n\r\n“At the end of the game, we were making a comeback, and if the game lasted just a little bit longer, I think we would have gotten the tie,\" Lim said.\r\n\r\nOverall Lim felt that she was proud of the team's performance through the last couple months.\r\n\r\n“Unlike past seasons, we had a strong preseason, and it [that strength] continued into league play and CCS,\" Lim said. \"I'll be graduating this year, but the future looks bright for Paly soccer. There are a lot of talented players in all the grades, and they know how to get back to the CCS finals.\"\r\n\r\nLu noted the potential for success in the young team but added that the loss of key senior players will greatly impact the Vikings next season.\r\n\r\n“The team will still be pretty strong [next season], but since the seniors from this year were a solid part of the team, it may take some time getting used to playing with different people in different positions,\" Lu said.\r\n\r\n&nbsp;","excerpt":"A 3-2 defeat to rival Mountain View High School (18-3-1, 10-1-1) in the Central Coast Section championship game over the weekend ended a strong 2014-15 season for the Palo Alto High School girls' soccer team (16-3-1, 9-2-1), which finished behind Mountain View in both CCS and the De Anza Division of the Santa Clara Valley Athletic League.","date":"2015-03-11 20:43:02","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/MG_24611.jpg","categories":["Sports","Spotlight"],"tags":{"40617":"alison lu","8568":"CCS","8634":"de anza league","10172":"finals","10198":"girls soccer","18382":"loss","8944":"palo alto high school","8953":"paly","9032":"recap","40197":"sarah lim","32750":"season recap","9110":"Soccer"}},{"id":97578,"title":"&#8220;A Day in the Life&#8221;: Paly Choirs to release album","permalink":"http:\/\/palyvoice.com\/2015\/03\/10\/a-day-in-the-life-paly-choirs-to-release-album\/","content":"[caption id=\"attachment_98646\" align=\"alignnone\" width=\"620\"]<img class=\"wp-image-98646\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10984814_1065924916766590_1961063480_n.jpg\" alt=\"Palo Alto High School's all-male accapella group, the Heart Breakers (left to right: sophomore Spencer Wycoff, junior Sean Jawetz, senior Grant Smith, senior Edward Kwiatkowski) perform at the Pops Concert on Feb. 11. This is where they announced that they would be releasing a CD. Photo by Alex Merkle-Raymond. \" width=\"620\" height=\"465\" \/> Palo Alto High School's all-male a cappella group, the Heartbreakers (left to right: sophomore Spencer Wycoff, junior Sean Jawetz, senior Grant Smith and senior Edward Kwiatkowski) perform at the Pops Concert on Feb. 11 in the Haymarket Theater. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nThe Palo Alto High School Choirs are fundraising through a <a href=\"http:\/\/kck.st\/1Bv5Hsd\">Kickstarter campaign<\/a> for the release of an album, titled \"A Day in the Life,\" containing tracks of songs the groups have previously performed in concerts.\r\n\r\nThe Madrigal Choir, Concert Choir and select<em> a cappella<\/em> groups recorded the tracks on Jan. 14, according to junior Sean Jawetz.\r\n\r\n“Paly Choirs chose to record a CD this year to capture the sound of this year’s choir [program] and to give the choristers the unique experience of recording in a professional studio,” Jawetz said.\r\n\r\nSenior Jannat Hashmi likes the importance of the long-lasting effects of recording a CD.\r\n\r\n“A lot of people hear other people rave about really good songs they’ve heard at concerts and they really want to figure out where they can actually get recordings of them,” Hashmi said. “If parents know that their child has a solo and they didn’t get to hear it, that’s another way they can go explore that.”\r\n\r\nJawetz explained that the experience of recording was very different from that of performing.\r\n\r\n“In performance, if something goes wrong, you just keep going knowing that the audience, for the most part, won’t notice it or will otherwise ignore it,” Jawetz said. “In a recording, everything needs to be perfect because your errors will stick with you. We probably sang each song three or four times to ensure mastery.”\r\n\r\nAccording to Jawetz, all the funding will come from the Kickstarter campaign, which will run for 60 days.\r\n\r\nThe album will be available both on iTunes and as a physical copy at the end of the fundraising period, and copies will be distributed to those who donate.","excerpt":"The Palo Alto High School Choirs are fundraising through a Kickstarter for the release of the CD that contains tracks of songs performed in concerts.","date":"2015-03-10 22:32:57","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10984814_1065924916766590_1961063480_n.jpg","categories":["News"],"tags":{"40003":"cd","8583":"choir","40016":"choir program","40006":"itunes","40018":"jannat hashmi","40004":"kickstarter","8944":"palo alto high school","30527":"paly choirs","40005":"recording","40017":"sean jawetz"}},{"id":100899,"title":"Senior recognized as California Journalist of the Year, advances to national competition","permalink":"http:\/\/palyvoice.com\/2015\/03\/10\/senior-recognized-as-california-journalist-of-the-year-advances-to-national-competition\/","content":"[caption id=\"attachment_100928\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_13751.jpg\"><img class=\"wp-image-100928\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_13751.jpg\" alt=\"Journalism adviser Paul Kandell introduces Beatrice Motamedi, California state director for the Journalism Education Association during the ceremony to announce senior Jack Brook's recognition as California Journalist of the Year. The audience included the Verde Magazine staff, faculty and senior Brook's parents. &quot;You’ve really taken us to the edges of what it means to be a journalist in high school,&quot; Kandell said to Brook. &quot;I know you’ve inspired anyone who’s had a chance to work with you, including me.&quot; Photo by Takaaki Sagawa.\" width=\"620\" height=\"395\" \/><\/a> Journalism adviser Paul Kandell introduces Beatrice Motamedi, California state director for the Journalism Education Association during the ceremony to announce senior Jack Brook's recognition as California Journalist of the Year. The audience included the Verde Magazine staff, faculty and one of Brook's parents. \"You’ve really taken us to the edges of what it means to be a journalist in high school,\" Kandell said to Brook. \"I know you’ve inspired anyone who’s had a chance to work with you, including me.\" Photo by Takaaki Sagawa.[\/caption]\r\n\r\nA Palo Alto High School senior is in the running for the title of National Journalist of the Year after being recognized today as the California Journalist of the Year for his excellence in scholastic journalism.\r\n\r\nThe Journalism Education Association in California named Jack Brook, co-editor in chief of Verde Magazine, the California Journalist of the Year today in a small ceremony during 4th Period in the Media Arts Center.\r\n\r\nAccording to the <a href=\"jeanc.org\/journalist-of-the-year\/\" target=\"_blank\">JEANC website<\/a>, the California Journalist of the Year title includes a $500 prize in addition to a travel stipend to attend the JEA\/National Scholastic Press Association spring national convention in Denver.\r\n\r\nBrook's status puts him in the running for the national competition for Journalist of the Year. The results will be announced at the awards ceremony of the JEA\/NSPA spring national convention on April 18, according to <a href=\"http:\/\/jea.org\/home\/awards-honors\/journalist-of-the-year\/\" target=\"_blank\">the JEA website<\/a>.\r\n\r\nJudges chose Brook out of nine total applications after a review process by the panel, according to Beatrice Motamedi, California state director of the Journalism Education Association. The application required <a href=\"https:\/\/jacksonbrook.wordpress.com\/\" target=\"_blank\">a digital portfolio<\/a>, official grade transcripts, three letters of recommendation, a resume, an essay and an action photo, according to the JEANC website.\r\n\r\n“From a <a href=\"http:\/\/verdemagazine.com\/im-a-he-not-a-question-mark\" target=\"_blank\">sensitively told story about Cameron<\/a>, a transgender student whose journey you [Brook] chronicled — including a sensitive pronoun switch from ‘her’ to ‘him’ in midstory — to a <a href=\"https:\/\/vimeo.com\/85411805\" target=\"_blank\">video for the White House Film Festival<\/a> about The Paly Voice drone … you were a consensus pick in an unusually strong competition this year,” Motamedi said.\r\n\r\n[caption id=\"attachment_100900\" align=\"aligncenter\" width=\"560\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Jack-brook-journalist-of-the-year-CA.png\"><img class=\"wp-image-100900\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Jack-brook-journalist-of-the-year-CA.png\" alt=\"Jack brook journalist of the year CA\" width=\"560\" height=\"371\" \/><\/a> Brook accepts his award as California Journalist of the Year, along with a chocolate bar. \"It’s been a great experience working with everybody, and I learned so much from [adviser Paul] Kandell,\" Brook said. Photo by Takaaki Sagawa.[\/caption]Verde Magazine adviser Paul Kandell praised Brook as a multifaceted journalist.\r\n\r\n“When it comes to images, angles and story — regardless of whether they occur in text, photos or videos — Jack has uncommonly outstanding, savant-level perception and abilities,” Kandell said. “He is the most natural multi-platform storyteller I’ve ever known.”\r\n\r\nNoam Shemtov, the co-editor in chief of Verde Magazine last year, commented on Brook’s work ethic and commitment to his stories.\r\n\r\n“He has a rare way of throwing himself right into the thick of whatever he’s working on,” Shemtov said. \"Jack was able to take his stories right up to the edge — both in the reporting and in the way he told them.”\r\n\r\nJunior and news editor of Verde Magazine Siddharth Srinivasan echoed Shemtov's claims as he recounted an experience he had with Brook while working together on <a href=\"http:\/\/2016ss.wix.com\/firstgen\" target=\"_blank\">\"First in Their Families: What it Means to be a First Generation College Student.\"<\/a>\r\n\r\n“Jack convinced me to go to the dry cleaners at 4 a.m. to get a hook for our story,” Srinivasan said. “It was well worth it, and that illustrates his vision for the story as a reporter.”\r\n\r\nAs Brook accepted the award, he acknowledged all who have aided him along his journey as a high school journalist towards state recognition.\r\n\r\n“It takes a village to raise a child; it takes a magazine to raise a journalist,” Brook said. “I really couldn’t have done it without everyone’s help.”","excerpt":"A Palo Alto High School senior is in the running for the title of National Journalist of the Year after being recognized today as the California Journalist of the Year for his excellence in scholastic journalism.","date":"2015-03-10 17:48:02","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/IMG_1375.jpg","categories":["News","Spotlight"],"tags":{"8506":"Award","8552":"California","10751":"jack brook","40604":"jea","29401":"Journalism Education Association of Northern California","40602":"journalist of the year","27736":"national","8944":"palo alto high school","40603":"portfolio"}},{"id":100821,"title":"Review: “The Drowsy Chaperone” is anything but drowsy","permalink":"http:\/\/palyvoice.com\/2015\/03\/09\/review-the-drowsy-chaperone-is-anything-but-drowsy\/","content":"[caption id=\"attachment_100837\" align=\"alignnone\" width=\"530\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_2285-800x534.jpg\"><img class=\"wp-image-100837\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_2285-800x534.jpg\" alt=\"DSC_2285 (800x534)\" width=\"530\" height=\"354\" \/><\/a> The Drowsy Chaperone, played by junior Adele Bloch, stumbles onstage during the musical's introduction on Friday in the Paly theater. \"The Drowsy Chaperone,\" a comedy that had the audience laughing out loud, has upcoming performances this week from Thursday, March 12, to Saturday, March 14. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nThe Palo Alto High School Theatre Department brings song and laughter on stage with a new musical comedy set in the 1920s. “<a href=\"http:\/\/palyvoice.com\/2014\/11\/16\/spring-musical-auditions-not-to-be-slept-through\/\">The Drowsy Chaperone<\/a>,” which premiered Friday, exceeds expectations by causing the audience to laugh out loud throughout the performance, giving the audience members a good run for their money.\r\n\r\nThe story revolves around The Man in the Chair, played by senior Oskar Soderberg, and his bizarre obsession with Broadway musicals. One night, as he plays a record of the musical “The Drowsy Chaperone,” the characters come to life and transform his apartment into a dazzling Broadway stage. As the musical progresses, the Man in the Chair continuously interrupts the performance to give comedic commentary about each scene.\r\n\r\nThe musical stars senior Cara Kienitz as Janet Van de Graaff, an actress engaged to businessman Robert Martin, played by senior Will Kast. On the couple's wedding day, a series of events staged by multiple characters interrupts the proceedings and threatens to prevent the two from marrying. Producer Feldzieg, played by senior Ido Gal, is threatened by gangsters disguised as pastry chefs, played by junior Paul Bleich and senior Lizzy McCole, to prevent the marriage as it will result in the loss of his show's leading lady. While fending off attempts from airhead Kitty, played by sophomore Alia Cuadros-Contreras, to become the leading lady, Feldzieg convinces \"Latin Lover\" Adolpho, played by junior Ophir Sneh, to seduce the bride. However, Aldolpho mistakes Janet for her chaperone and hilarity ensues.\r\n\r\nThe groom is not supposed to see the bride on the wedding day, and so the task falls to the Drowsy Chaperone, played by junior Adele Bloch, with her constant drunkenness and hilarious input, to keep the lovebirds away from each other. The groom, convinced by his best man, George, played by sophomore Jackson Kienitz, that the best way to relax is to meander in roller skates with a blindfold so as not to see his bride on the wedding day, provides comic relief with his roller skating attempts. Each of the individual plots, including a comedic dialogue between the butler, played by sophomore Jason Pollak, and hostess Mrs. Tottendale, played by senior Jamie Garcia, intertwines into an amusing play that is made even more interesting by the Man in the Chair’s input.\r\n\r\n[caption id=\"attachment_100838\" align=\"alignnone\" width=\"509\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_2182-800x534.jpg\"><img class=\"wp-image-100838\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_2182-800x534.jpg\" alt=\"DSC_2182 (800x534)\" width=\"509\" height=\"340\" \/><\/a> Two gangsters disguised as pastry chefs, played by junior Paul Bleich and senior Lizzy McCole, provide the play with drama and comic relief. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n“The Drowsy Chaperone” uses creative props and costumes, both of which establish the extravagant setting and transport the audience to the 1920s. The play employs various set pieces that allow actors to efficiently alternate between the jazz age and present day without confusion. The alternating eras also allow the Man in the Chair to relay amusing critiques about the musical’s faults as well as general opinions about individual actors. This breaking of the fourth wall positively affects the performance as it provides entertainment and helps the audience connect with the Man in the Chair.\r\n\r\nThe music from the Paly Band was on point with all of the character’s actions, and the transitions between pieces were flawless. The music never drowned out the characters’ singing and brought to life the play’s upbeat tone. The mood and plot of the play never faltered, and the play’s hour and a half length did little to bore the audience. The lighting was also well in-tune with the actors’ actions, especially in one scene in which the flashing lights emphasize Janet Van de Graaff’s emotions as she suffers a mental breakdown.\r\n\r\nAll of the actors did a wonderful job of portraying their characters. Bloch’s portrayal of the Drowsy Chaperone was very well acted with her swaying movements and the constant presence of a martini glass. The Chaperone’s cynical, yet funny view on life provided an interesting contrast to the other characters’ optimistic outlooks. Kienitz made a wonderfully glamorous actress, while Gal’s performance of Feldzieg greatly illustrated the desperate producer’s frustrations. The gangsters’ food puns were as amusingly ridiculous as their costumes, and Sneh’s dramatic swishing of his cape and cane during his portrayal of Aldolpho provided a good laugh. Soderberg’s insightful and sometimes moving commentary as the Man in the Chair showed to the audience that the play is wonderful because it is so ridiculous.\r\n\r\nHowever, audience members may need to pay extra attention to some characters with heavier accents. The actors sang skillfully as their voices remained pleasant and in tune. The few dance routines added a flair to the musical aspect of the play, and Will Kast and Jackson Kienitz even broke out tap dancing.\r\n\r\n“The Drowsy Chaperone” invokes a constant stream of laughter from the audience, making it a memorable and lighthearted experience. The absurd, yet lovable cast of characters along with the music and jokes makes the musical a must-see. The play's hilarious script and actors' performances ensure that the audience will be laughing by the end of the night.\r\n\r\n“The Drowsy Chaperone” has three more shows this week on Thursday, March 12; Friday, March 13; and Saturday, March 14. All shows start at 7:30 p.m. in the Haymarket Theater. Tickets are $10 for students and seniors and $15 for adults.","excerpt":"The Palo Alto High School Theater brings singing and laughter onto stage with a new musical comedy set in the 1920s.","date":"2015-03-09 22:18:08","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/DSC_2285-800x534.jpg","categories":["A&amp;E Section Spotlight","Reviews","Spotlight"],"tags":{"40211":"broadway","19628":"musical","8944":"palo alto high school","8953":"paly","18258":"paly theatre","11878":"performance","8996":"play","40229":"spring musical","40210":"the drowsy chaperone","9160":"theatre"}},{"id":100853,"title":"Season preview: Track and field team faces new hurdles","permalink":"http:\/\/palyvoice.com\/2015\/03\/09\/season-preview-track-and-field-team-faces-new-hurdles\/","content":"Despite losing key runners, the Palo Alto High School track and field team is looking to expand on its achievements last year with young potential and a set of new coaches.\r\n\r\nLast year, the Paly boys finished fifth in the De Anza league (2-4), and the Paly girls finished third (4-2). This was a step down from the 2013 season when the Paly boys came in first in the De Anza League and the girls came in second.\r\n\r\nAccording to head coach Kelsey Feeley the team looks to the upcoming season to repair its drop in status.\r\n\r\n\"Our team goal this year is to is improve on what we did last year,\" Feely said.\r\n\r\nJunior sprinter Catherine Yu concurs with Feeley.\r\n\r\n\"Our main goal is to win DAL and SCVAL [Santa Clara Valley Athletic League] for both [the] boys' and girls' teams,\" Yu said. \"We have strong individuals for the boys' sprint group and jumps and an overall strong distance group for varsity boys as well. Girls have a few standouts in both middle distance and distance, but we are still testing the waters for sprints.\"\r\n\r\nThe teams will also suffer from the loss of a number of substantial contributors, including sprinter Nick Sullivan who finished fourth in the 400-meter at the Central Coast Section Championships last year.\r\n\r\n\"Unfortunately, we lost a few people to graduation that had a big impact, but we have a lot of new kids who look like they’re going to do great things,\" Feeley said. \"We’re really missing Nick Sullivan, who was a state meet competitor and one of the leaders of the team.\"\r\n\r\nHowever, the team feels it can fill the void with young runners who show potential, including sophomore Kent Slaney, who excelled in cross country this year and runs middle distance.\r\n\r\nSlaney said he hopes to improve from last season after being out with an injury during most of his freshman year.\r\n\r\n\"I’m hoping to get to States and that the distance and sprinting teams do well,\" Slaney said. \"I’m hoping to get a 4:20 mile and hoping to do well in invitationals. I got injured a lot last season, and I'm hoping to have a solid season this time.\"\r\n\r\nThe team also has two new sprint coaches, Casey Fields and Lewis Hori, who the team hopes will lead Paly to a successful season, according to Feeley.\r\n\r\nThe first meet of the season will take place at 3:15 p.m. tomorrow against Milpitas High School at home.","excerpt":"Despite losing key runners, the Palo Alto High School track and field team is looking to expand on its achievements last year with young potential and a set of new coaches.","date":"2015-03-09 21:32:59","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/04\/track5.jpg","categories":["Sports"],"tags":{"40231":"casey fields","11390":"field","11393":"kelsey feeley","8830":"kent slaney","40232":"lewis hori","11392":"new coaches","11391":"new season","8917":"nick sullivan","8944":"palo alto high school","9012":"preview","12045":"season preview","9181":"track","9183":"track and field"}}]