[{"id":105676,"title":"Student speeches for 2015 Graduation","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/student-speeches-for-2015-graduation\/","content":"[caption id=\"attachment_105678\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-09-at-5.59.22-PM.png\"><img class=\"wp-image-105678 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-09-at-5.59.22-PM.png\" alt=\"Senior Claire\" width=\"603\" height=\"433\" \/><\/a> Associated Student Body President Claire Liu delivers her speech \"Randy\" at Graduation on June 3. Liu was one of three student speakers for the graduating class of 2015. Photo by Ken Ruinard.[\/caption]\r\n\r\nThe Paly Voice acquired the following Graduation speeches from their authors, with the authors consent to publish. Each of these speeches were presented on June 3 for the Palo Alto High School's Class of 2015 Graduation. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/06\/09\/hindsight-bias-by-alex-hwang\/\">\"Hindsight Bias\" by Alex Hwang<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/06\/09\/randy-by-claire-liu\/\">\"Randy\" by Claire Liu<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/06\/09\/the-cosmos-and-us-by-emma-chiu\/\">“The Cosmos and Us” by Emma Chiu<\/a>","excerpt":"The Paly Voice acquired three student Graduation speeches that were presented on June 3 for the Class of 2015 Graduation.","date":"2015-06-09 18:04:33","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-09-at-5.59.22-PM.png","categories":["Spotlight"],"tags":[]},{"id":105669,"title":"&#8220;Hindsight Bias&#8221; by Alex Hwang","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/hindsight-bias-by-alex-hwang\/","content":"<em>The Paly Voice acquired the following Graduation speech from its author, with the authors consent to publish. Student speaker senior Alex Hwang delivered this speech at Graduation on June 3. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n<p style=\"color: #000000;\"><strong>\"Hindsight Bias\" <\/strong>by Alex Hwang<\/p>\r\nAt the beginning of this year, my lovely AP Psychology teacher, Ms. Mattes, walked into the classroom and said “Good Morning!” in her usual cheerful voice. She then curiously proceeded to pass out a bunch of half-sheets of paper to our class. She told us to read what the piece of paper said and follow the instructions on it. Simple enough, right? So once she passed me mine, I read it and, at the top, it said: “People with high self-confidence are more susceptible to flattery than those with low self-confidence.” Makes sense! Then I read the question on the paper: did I agree or disagree with the finding? I agreed. Now the paper asked: please explain why this finding is true. I had no trouble stating that “obviously, people with high self-confidence must have cultivated this attitude by buying in to the flattery they’ve received.” And that was it. I looked up at Ms. Mattes to show that I was done, and soon my whole class did the same.\r\n\r\nMs. Mattes then asked us: “how many of you agree with this finding?” and we <em>all<\/em> raised our hands. “How many of you had no trouble explaining this finding?” she asked. Again, we <em>all <\/em>raised our hands. But here comes the twist. Ms. Mattes asked someone from the other side of the classroom to read their half-sheet out loud: (listen carefully) “People with <em>low<\/em> self-confidence are more susceptible to flattery than those with high self-confidence.” Everyone on my side of the class suddenly groaned. Did <em>you<\/em> catch it? To the other half of the class, Ms. Mattes passed out the <em>exact opposite <\/em>finding, yet we were all <em>equally<\/em> able to agree with and support our own findings. Each one of us in the classroom believed that our own explanations represented simple common sense.\r\n\r\nSo don’t get me wrong, I love Ms. Mattes, but she <em>duped<\/em> us, and she did so with a phenomenon called hindsight bias. According to our beloved AP Psychology textbook, hindsight bias is defined as “the tendency to believe after learning an outcome that one would’ve foreseen it.” You might have also heard of it as the “I-knew-it-all-along effect” or, simply, “hindsight is 20\/20.” Introduced to us as a danger when analyzing experimental studies, hindsight bias can actually be found everywhere around us.\r\n\r\nIn interpreting history — how often have we heard that a victory in a certain battle or election was “inevitable”? In sports — how many times have you heard the announcer declare how obvious it was that the team would win...but only <em>after<\/em> they had won? Even in relationships -- “Oh yeah, I <em>knew<\/em> they would break up.” But most pertinent to us all today is in the way we look at our times at Paly. All of us, at some point, have thought along the lines of “Oh, Of course, I didn’t get into that school because I didn’t have this or that on my resume.” “I shouldn’t have done that activity, I obviously wouldn’t have liked it and I shouldn’t have wasted my time.” Taking a step back, it’s easy to see why these thoughts represent hindsight bias. Did you <em>really<\/em> know such things all along? Probably not. Looking back into the past, we see our lives as easily predictable. Unfortunately, thinking this way encourages the notion that each decision we make has a sense of cold, deterministic certainty.\r\n\r\nIn the same vein, as we all move on to our bright futures, let’s not allow this natural human tendency of hindsight bias to morph into a sort of foresight bias — we shouldn’t be tempted to feel that our future lives can be predicted. Rather, we should <em>dare<\/em> to take a step that leads us down an unpredictable path. We should <em>dare<\/em> to venture boldly into the unknown and have the <em>audacity<\/em> to act with the knowledge that there is no certain path from the present... to the future.\r\n\r\nFour years ago, at my eighth grade graduation, I confidently stated exactly what defined “success” and the way each one of us would achieve it in high school. I talked about how “success is found in how we stick to our beliefs.” I threw out even more cliches. I even used some vague quote about success from a man I didn’t know one thing about. One of my great heroes, Mr. Bungarden, would probably have something to say about this. Mr. Bungarden recently told me that “nothing is scarier than an 18-year-old who has ‘figured out’ life.” And at that moment as a <em>14-year-old <\/em>atop the podium at the end of 8th grade, I certainly thought that I had figured out life. But now I’m a little wiser than I was then, and Mr. Bungarden, you were right. Five, fifteen, or fifty years in the future, let’s look back without hindsight bias, without believing that our lives were predictable. We all have some of the most exciting years and exciting choices of our life to come. Our futures have nothing determined about them. PALY Class of 2015, it’s time to embrace this uncertainty without hindsight bias, without foresight bias, but with every sense of bold possibility. Thank you very much everybody!","excerpt":"The Paly Voice acquired the Graduation speech of senior Alex Hwang, with his consent to publish.","date":"2015-06-09 18:02:16","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105672,"title":"“The Cosmos and Us” by Emma Chiu","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/the-cosmos-and-us-by-emma-chiu\/","content":"<em>The Paly Voice acquired the following Graduation speech from its author, with the authors consent to publish. Student speaker senior Emma Chiu delivered this speech at Graduation on June 3. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n“<strong>The Cosmos and Us<\/strong>” by Emma Chiu\r\n\r\nMuch of my high school career has been defined by flashbulb moments. They include storming the basketball court when the varsity boys beat Gunn on our senior night, and also taking one too many selfies with James Franco. Even though so many of my memories of Paly are overwhelmingly positive, there were also some moments I wish I could forget but just can’t. One that will never leave my memory was the morning when I came to school and a Caltrain sat motionless on the tracks.\r\n\r\nLater that same day, my English teacher showed our class an article titled \"<a href=\"http:\/\/www.nytimes.com\/2008\/11\/02\/education\/edlife\/quoted.html?_r=0\">The Cosmos and You<\/a>,” about a young woman at Dartmouth College who asks her Astronomy professor, “How do you keep from despairing at the immensity of space and the smallness of us?” A shortened version of his reply goes as follows:\r\n\r\n“Johanna, you are most certainly an infinitesimal in the cold, vastness of the cosmos, and your life is barely a mathematical instant in the span of time. But you are also, just as certainly, a miracle: you are a creature capable of thought, of wonder, of awe. You are capable of love, and so need not despair of insignificance. Having said that see you Monday.”\r\n\r\nNow, this response resonated with me so strongly that day, because I think at Paly many of us, including myself, have at some point questioned our self-worth or significance. You don’t need to have studied Astronomy for that thought to come across your mind. But because all of us are here today, each and every one of us had someone in this community who reminded us of our potential and of our importance.\r\n\r\nIn my mind, what defines the Paly experience is going through the highest of highs and lowest of lows, but when confronting those lows, there is always someone who is more than willing to be there for you. Because of what we’ve gone through and how countless other people have been that support for us when we needed it most, I think our class is especially aware of the significance and magnitude that a touch of kindness can have on another person.\r\n\r\nKnowing this, we stand poised and ready to be that potential rock for someone we may barely know. We are prepared to be that light, as others had done for us, when we ourselves slipped into darkness.\r\n\r\nIt is this compassion from others that has allowed us to be here today. It is this compassion that made it so we can truly enjoy those flashbulb moments. And it is this compassion that let us become aware of our significance. I am forever grateful for these people who have allowed me to feel their love, where I feel most alive and most significant. They are the moments where the words of the Dartmouth Astronomy professor ring most true: that we are capable of thought, of wonder, and of awe, and that we are, just as certainly, a miracle.\r\n\r\n&nbsp;","excerpt":"The Paly Voice acquired the Graduation speech of senior Emma Chiu, with her consent to publish.","date":"2015-06-09 18:02:10","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105665,"title":"&#8220;Randy&#8221; by Claire Liu","permalink":"http:\/\/palyvoice.com\/2015\/06\/09\/randy-by-claire-liu\/","content":"<em>The Paly Voice acquired the following Graduation speech from its author, with the authors consent to publish. Associated Student Body President Claire Liu delivered this speech at Graduation on June 3. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n<p style=\"color: #000000;\"><strong>\"Randy\" <\/strong>by Claire Liu<\/p>\r\nA little over a year ago, I sat in the Meyer library studying for my last final of junior year. As some of you may remember, our class, along with members of the Class of 2014, collectively made this Stanford library one of the world’s most unproductive places to study.\r\n\r\n<span style=\"color: #373e4d;\">So, after most of the Paly kids left that evening, I thought to myself, Claire, you have no excuse to procrastinate anymore. You’re sitting alone, a high schooler with no friends, in this corner of a library at a college you do not go to. You have a big test tomorrow and a borderline grade. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">But if you know me well, you know I love to talk. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">So, I spun slowly, casually on the spinny chair I sat in, my eyes glazing over every individual I did not recognize in that dreadful 24-hour study space. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">Yes, I thought to myself, as I glanced at a familiar young man nestled in the sofa by the wall. He made me coffee at Town and Country just a few weeks earlier. This took me a while to realize, and I guess I was staring at him while testing my memory. So he raised his eyebrows at me, as if to say... hello there freaky girl, why are you staring me? I had to explain myself, so, slowly distancing myself even further away from the pile of reading I had yet to begin, I said hi, I know you, you work at Town and Country! And we talked for two hours that evening.<\/span>\r\n\r\n<span style=\"color: #373e4d;\"> I’ve decided to speak about this conversation with this stranger, who we’ll call Randy, so I can further justify how horrifically I did on the test I was supposed to be studying for and share with you some lessons learned during my time with Randy. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">To my surprise, Randy was not the person I assumed he was. He was no quirky Stanford student who enjoyed philosophy, thrift store shopping, and making coffee in his free time. He was a homeless 20 year old from rural Virginia, whose ripped jeans came from the free clothing closet at the local shelter. Randy didn’t study at Stanford -- he slept at Meyer and showered at the Arrillaga gym. He had left home on bad terms with his parents months earlier, and bought a one-way ticket to San Francisco. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">Randy told me about the place he once called home. He described it as a small town, where perspectives were limited, where the local high school offered only 2 APs, where there existed no downtown, no movie theatre, no diversity. It’s the type of place where racial slurs are prevalent, Randy said, and Fox news is trusted. While Randy’s description was perhaps sprinkled with hyperbole, it made me think about this place that I call home. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">To Randy, Palo Alto was unreal. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">In Palo Alto, Randy said, he found what he called a “haven:” a space to think and learn, a place to fail and not be punished, a place to progress and not be held back by ignorance or dogma or nonsensical tradition. Randy asked me what it was like growing up in a community where innovators constantly expanded the limits of what is possible, where students had access to computers and teachers and resources whenever they so needed, where young people were respected and empowered for their creativity and even their most bizarre thought processes. Then I asked Randy about himself. He said he was working various minimum wage jobs, so he could put himself through some Foothill classes. Eventually, he said he’d like to transfer, and sit in on all those Stanford courses as a full time undergrad, and more than just a random drop-in in the back corner. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">Sitting across from me was this guy, who’d trekked halfway across the country, and was living without a roof over his head just to savor a taste of the life we live each and every day. I hate to be cheesy, but Randy’s eyes literally sparkled as he raved about the Bay Area, the weather, the intelligence of the Paly students he made coffee for every day. No conversation had ever made the concepts of privilege and gratitude feel more real for me. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">At about midnight, I packed up my untouched homework and said goodbye to Randy. As I drove home, I did some thinking. There are three things I drew from our conversation that night that still resonate strongly with me today. They are listed as follows. Reach out, remember your roots, and refuse to settle. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">Lesson 1: Reach out. As many of us learned in Ms. Mimi Park’s Humanities class, perception is everything and nothing all at the same time. Every day, I’m proven incorrect about something or another, and I’m reminded of how curiously unpredictable our world is, and how little I really know. Randy was not at all who I pictured him to be. He was a homeless high school drop out, but he had just as much to tell and teach me as probably any of the Stanford students surrounding us in Meyer that night. Continuously question your assumptions of other people. Allow yourself to remain open when things defy your expectations. Talk to people and let them teach you something new or see something differently.<\/span>\r\n\r\n<span style=\"color: #373e4d;\">Lesson 2: Remember your roots. We come from a magnificent place, where opportunities are plentiful, and creativity and innovative progress are the norm. Many of us might be all-too-eager to leave home. “Uhhh I can’t wait to escape the Palo Alto Bubble!” is a statement I sometimes hear and have said myself. But before we move on, I think we should take a moment to recognize that this city and this school have opened countless doors for us, doors that millions of others will have to work for years to break through. We have worked hard, no doubt, but in many ways, we just got really damn lucky. As I’ve grown older, I have learned that if used powerfully, in a way that benefits the lives of those who haven’t had it so easy, this Palo Alto privilege is not something to be ashamed of or feel guilty about. As you begin your post high school journey, don’t forget what you’ve been given, and don’t forget the responsibility you have to do some good with it all. <\/span>\r\n\r\n<span style=\"color: #373e4d;\">and Lesson 3: Refuse to settle. If you’re unhappy with something, change it. If you haven’t yet found the passion, the people, the place that ignite your fire, keep on looking. Sometimes finding what we love means taking risks bigger than any we’ve taken in the past. While I’m not necessarily encouraging everyone to fly to another state and wander about without a place to call home in order to find what they love, I do find a lot of value in what Randy is doing with his life. Our time is short, and while they say that time flies when you’re having fun, I think it flies no matter what. SO HAVE FUN. Live deliberately and seek the rush and the passion that satisfy you. Do what you have to to get to that place, even if it’s terrifying, socially unacceptable, or completely ridiculous. You have limited time to make your one thrilling, wild, meaningful life everything you want it to be. Class of 2015, the clock is ticking, so, in the spirit of Randy, get out there and live your life freely, fully, and exactly how you want to. Thank you.<\/span>","excerpt":"The Paly Voice acquired the Graduation speech of senior Claire Liu, with her consent to publish.","date":"2015-06-09 18:02:05","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105550,"title":"Badminton places at CCS","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/badminton-places-at-ccs\/","content":"[caption id=\"attachment_105621\" align=\"alignnone\" width=\"593\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-04-at-10.46.52-AM.png\"><img class=\" wp-image-105621\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-04-at-10.46.52-AM.png\" alt=\"Juniors Eric Chiang and James Wang play against Evergreen Valley High School’s Mason Jiang and Eric Jiang in boys' doubles. They later on placed second overall at Central Coast Selection. \" width=\"593\" height=\"394\" \/><\/a> Juniors Eric Chiang and James Wang play against Evergreen Valley High School’s Mason Jiang and Eric Jiang in boys' doubles. Chiang and Wang placed second overall at the Central Coast Section tournament. Photo by Chris Do.[\/caption]\r\n\r\nFour members of the Palo Alto High School badminton team are celebrating their successes after an impressive performance at the Central Coast Section playoffs.\r\n\r\nJuniors Eric Chiang and James Wang placed second in boys’ doubles while senior Promise Lee and freshman Jackie Cai took fifth in girls’ doubles.\r\n\r\nIn girls’ doubles, Lee and Cai won their first two matches, but fell short to Silver Creek High School’s Yui Tantiyavarong and Huyen Duong 21-10, 10-21, 22-20 in the third match.\r\n\r\nIn boys’ doubles, Wang and Chiang made it to the final round; however, they fell short to Evergreen Valley High School’s Mason Jiang and Eric Jiang 21-17, 21-11.\r\n\r\n“We were mildly disappointed when we lost our finals game,” Wang said. “Although we came in thinking we had a chance of winning, our opponents were national players and were realistically a lot better than us.”\r\n\r\nWang believed that the Vikings would do well going into CCS.\r\n\r\n“We had a pretty good season, so we were confident that we would place in the top three for doubles in CCS,” Wang said.\r\n\r\nWang attributes the wins to their positive mentality.\r\n\r\n“We [Eric and I] are both cool-headed people who can talk strategy if we're struggling in a game,” Wang said. “Although we can get physically overwhelmed by our opponents, especially since I haven't completely recovered from surgery, we never get mentally overwhelmed.”\r\n\r\n&nbsp;","excerpt":"Four members of the Palo Alto High School badminton team are celebrating their successes after an impressive performance at Central Coast Section playoffs.","date":"2015-06-04 17:31:17","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/Screen-Shot-2015-06-04-at-10.46.52-AM.png","categories":["Sports","Uncategorized"],"tags":{"15905":"badminton","44915":"eric chiang","44916":"jackie cai","44917":"james wang","8953":"paly","44918":"promise lee"}},{"id":105618,"title":"Paly students win international math contest","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/paly-students-win-international-math-contest\/","content":"[caption id=\"attachment_105637\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo.jpg\"><img class=\" wp-image-105637\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo.jpg\" alt=\"Juniors Eric Foster, Andrew Lee, mathematics instructional supervisor Radu Toma, Kathryn Li and Allison Zhang (left to right) pose for a picture after winning the international Mathematical Modeling Challenge contest. The team and Mr. Toma are invited to Hong Kong in July to attend the awards ceremony. Photo by Daniel Li.\" width=\"603\" height=\"453\" \/><\/a> Juniors Eric Foster, Andrew Lee, team advisor Radu Toma, Kathryn Li and Allison Zhang (left to right) pose for a picture. They won the International Mathematical Modeling Challenge contest on Monday, and the team and Toma are invited to Hong Kong in July to attend the awards ceremony. Photo by Daniel Li.[\/caption]\r\n\r\nA team of four juniors in Advanced Placement BC Calculus are invited to Hong Kong in July for their success in the International Mathematical Modeling Challenge on Monday.\r\n\r\nJuniors Allison Zhang, Eric Foster, Kathryn Li and Andrew Lee won the international competition on behalf of Palo Alto High School and the United States. Teams were required to solve a real world problem relating to the field of mathematics. The contest was held during mid-March and ended early-May, and during that time, teams chose five consecutive days to work and collaborate on the assigned problem.\r\n\r\nThis year, teams were asked to design a model for effective filming and production of a motion picture.\r\n\r\n“We modeled movie scheduling, taking into account variables such as actor availability, prop\/set construction time and traveling costs,” Zhang said.\r\n\r\nIn an email to the Palo Alto High School faculty, Toma praised the team for its achievement.\r\n\r\n\"This is the highest award Paly students have ever earned in mathematics,\" Toma said. \"I am absolutely blown away by their accomplishment and humbled both to have had them as students. This award is a tribute both to these students' exceptional talent, work ethic, determination and love of mathematics, and to all their past mathematics teachers who have taught, inspired and mentored these kids over the years.\"\r\n\r\nAccording to Zhang, the team is very excited to hear that they won the international competition on behalf of the United States and Palo Alto High School.\r\n\r\nMembers of the team were shocked when they found out they had won, according to Lee.\r\n\r\n“Honestly, it was a bit of a surprise,” Lee said. “We actually were not 100 percent confident in our paper when we submitted it. Even in the last couple hours, we were rushing to proof-read and complete it.”\r\n\r\nBecause of their accomplishments, the team and Toma are invited to Hong Kong in July to receive an award. In addition, three other high schools from Beijing, Singapore and Shanghai are also invited to this ceremony.\r\n\r\n“The other three team members and I cannot wait to travel to Hong Kong for the awards ceremony,\" Zhang said. \"This contest is especially significant to us because it encourages high school students to solve relevant real world problems through applied mathematics.\r\n\r\n&nbsp;","excerpt":"A team of four juniors in Advanced Placement BC Calculus are invited to Hong Kong in July for their success in the International Mathematical Modeling Challenge contest on Monday. ","date":"2015-06-04 17:30:59","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo.jpg","categories":["Spotlight"],"tags":{"42265":"allison zhang","39379":"andrew lee","42266":"eric foster","42267":"kathryn li","10661":"radu toma"}},{"id":105613,"title":"The speeches that didn’t make it, Class of 2015: Part I","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-i\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech <\/strong>by Jack Brook\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Good evening everyone, I’m honored to be standing up here <span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1182038502\"><span class=\"aQJ\">tonight<\/span><\/span>. Although we’re all still very young, I do feel like there is one very important lesson I’ve learned so far that is worth sharing.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">What I’ve learned is that we need to confront and prepare for the fact that over the course of the next four years (and the rest of our lives) there are going to be people who are critical of us and the things we do. I know that many of us, including myself, have received a lot of support and praise but in college and in the real world, our parents aren’t always going to be there to pat us on the back and say “Great job honey.”<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Now I learned this lesson the hard way one summer at a filmmaking camp.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I came in to the camp intending to learn how to make emotional films and develop as an artist but was told that instead of art, what I had been making before was merely “entertainment.” (A little bit of context: The movie that got me into this camp was about a talking cat; that’s the type of filmmaker I was).<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Here’s the problem though: I really liked making movies about things like talking cats and before this camp other people had also really liked them. But my film camp teachers were not amused by talking cats.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">And the moment I realized that they didn’t like what I did, I tried super hard to win their approval. I watched my peers soar to new creative heights as I stood by helpless, weighted down by doubt and insecurity. I’m not going to lie, the films I did make at the camp were pretty darn bad. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">In four weeks, I went from making quirky comedies to instead attempting to create interpretive filmography about haikus.  <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I languished miserably and it was an absolutely devastating experience. I didn’t make another film for five months afterwards. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I’ll pause my story for just a minute. From my understanding of things, nearly everyone who eventually does something they’re really truly proud of seems to have this moment of crisis. A time where you doubt yourself; where you look around and see other people doing things better than you; where you question whether or not you’re good enough; whether you are worthy.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">I mean, look at Elvis: The first time he performed, he was told he would be better off going back to being a truck driver than a singer. Or J.K. Rowling. She was rejected 12 times before someone agreed to publish Harry Potter. And of course there is Walt Disney, who was fired from his first job because he “lacked imagination and had no good ideas.” The list of successful people who were originally told that what they were doing wasn’t good literally goes on forever.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Anyway, as I was saying, I left pretty devastated from that summer camp. I thought about it for a long time and one day I realized that during the camp all those films that I made were simply constructions of what I thought other people, my teachers, wanted to see. I never made anything that I was passionate about. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">The difference between Elvis and me is that Elvis stuck with his vision and didn’t change it when somebody suggested otherwise. I tailored my vision to what I thought someone else wanted.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">When I finally realized this, it was like a eureka moment. The best way to recover from my months of misery, I figured, was to simply cast it all away and go back to working on things I was passionate about. So then I thought, what is it deep down in my heart of hearts that I want to make? And then it came to me: I’m going to make a movie about a competitive eating prodigy. A young boy striving to become a hot dog eating champion. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Let me tell you something: The most fun I have ever had in my life was making this movie. Dozens and dozens of hot dogs were consumed, pies were swallowed and asparagus was slurped. I was also humbled by the fact that many of my friends and their parents were willing to step in and help me out. After weeks of shooting, I had my movie. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">And you know what the best part was? I was making that movie for nobody but myself.<\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Needless to say, I regained my love of making movies and became a much better filmmaker in the process. Now I know all of us have different interests, whether in theater or STEM or writing or athletics or robotics or something else entirely, but I think we all need to remember that when we’re doing something we love, that we feel passionate about, we can’t look to other people for validation. Instead, we need to look inwards and think: Is what I’m doing going to make me happy? Is it something that I’m doing for me, and not for someone else? <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Don’t try to be somebody that you’re not. Don’t quit at what you like to do. It’s up to you to decide whether or not what you’re doing, or what you want to do, is worthy. And if you haven’t found your passion yet, dare to explore and don’t turn back if someone sneers or makes fun of you. <\/span><\/p>\r\n<p dir=\"ltr\" style=\"color: #222222;\"><span style=\"color: #000000;\">Even if you want to make videos about talking cats and hot dog eating prodigies.<\/span><\/p>","excerpt":"The Paly Voice acquired senior Jack Brook's speech that did not get chosen for Graduation, with his consent to publish.","date":"2015-06-04 12:07:49","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105615,"title":"The speeches that didn&#8217;t make it, Class of 2015: Part II","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-ii\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation but were not selected by a panel of faculty members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech <\/strong>by Oliver Rowles\r\n\r\nGood afternoon everyone, teachers, families, and classmates. I arrived in Palo Alto less than two years ago, moving from New York City, and the place itself has already impacted me way more than I could have ever imagined. I had never had an Asian friend before.(pause) and now some are my best friends. I was welcomed very warmly into the Paly community only a few weeks into school, when half of the Junior and Senior grades came over to my house while my parents were out of town... Sorry Dad. But it was well worth it as I met the people who would become my best friends for the remainder of high school. Paly has recently received a ton of criticism and bad press after the tragedies that occurred over the past year, but we cannot forget what a great place this actually is. Over these past two years I’ve definitely learned a thing or two to take with me after I graduate.\r\n\r\nFirst of all, these 4 years of high school are not going to be the best 4 years of your life, I don’t even wish that upon my worst enemy. If getting on the wheel in Ceramics class is part of the best 4 years of your life there is something seriously wrong. That being said High School is a very unique time, and nothing will ever be like it. As you get older, you mature. You begin to feel less infallible, your desire to be independent is tempered by the reality of actually being independent and all the responsibility that comes with it. You will never have the mindset you had in High School again. I remember telling my parents that when I turned 18 that I would never listen to them again. I am 18 now and have been for nearly 6 months and I cannot even come close to imagining not having them in my life. Everyone going to college next year will come to that realization when you’re actually going to have to wash your own clothes and change your bed sheets more than once a semester. Paly has helped me become the independent person I am today and one that will surely survive without his parents perched on his shoulder for the rest of time.\r\n\r\nI’m sure every student here has a teacher that pushed him or her to succeed and do their best throughout these 4 years. Personally, I don’t think I can single out just one and that’s something that’s extraordinary about this school. Everyone wants you to do well and get to the next level, and that isn’t just teachers, students want to help you too. We have a great community here and I’m going to miss it dearly next year.\r\n\r\nSince my early days at Paly I’ve had the same group of friends by my side, and that is something I wouldn't trade for the world. Even though we fight and argue sometimes, mostly about whether to go to Driftwood or Chipotle during lunch, I couldn’t imagine finishing my high school career with any other guys. When my parents decided to move out west from New York I was devastated. Leaving a place where I have lived for sixteen and a half years just suddenly. I vividly remember bawling my eyes out in front of my mom the night before our flight out as I was convinced that nowhere besides New York would ever be home. But I am more than glad to say I was mistaken, and Palo Alto has definitely become a home to me.\r\n\r\nI wanted to thank my mom, dad, and most of all my brother Will for helping me get to where I am today. My brother has taught me so much and has been my role model throughout my entire life. Even though you thought I was the golden child and that mom and dad liked me more than you, I have always been jealous of how much smarter and talented you are than me at pretty much everything, except for Madden, I could still whoop you any day. I also wanted to thank all my classmates and teachers for an amazing two years here and wish you all the best in the future. ROLL TIDE","excerpt":"The Paly Voice acquired senior Oliver Rowles' speech that did not get chosen for Graduation, with his consent to publish.","date":"2015-06-04 12:07:34","author":"Adele Bloch","categories":["Uncategorized"],"tags":[]},{"id":105611,"title":"The speeches that didn&#8217;t make it, Class of 2015","permalink":"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015\/","content":"[caption id=\"attachment_105631\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo-2.jpg\"><img class=\"wp-image-105631\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo-2.jpg\" alt=\"photo-2\" width=\"613\" height=\"460\" \/><\/a> The graduating class of 2015 toss their caps into the air with the conclusion of their graduation ceremony yesterday afternoon. Photo by Jeanette Wong.[\/caption]\r\n\r\n<em>The Paly Voice<\/em> acquired the following speeches from their authors, with the authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation but were not selected by a panel of faculty members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice<\/em>, nor those of its staff.\r\n<p style=\"color: #000000;\"><a href=\"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-i\/\">Jack Brook<\/a><\/p>\r\n<p style=\"color: #000000;\"><a href=\"http:\/\/palyvoice.com\/2015\/06\/04\/the-speeches-that-didnt-make-it-class-of-2015-part-ii\/\">Oliver Rowles<\/a><\/p>","excerpt":"The Paly Voice acquired the speeches that were not chosen to be delivered at Graduation from their authors, with the authors’ consent to publish.","date":"2015-06-04 12:07:13","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/photo-2.jpg","categories":["Features","Spotlight"],"tags":[]},{"id":105578,"title":"Student pulls fire alarm, disrupts finals","permalink":"http:\/\/palyvoice.com\/2015\/06\/03\/student-pulls-fire-alarm-disrupts-finals\/","content":"[caption width=\"491\" id=\"attachment_105601\" align=\"aligncenter\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11419826_946584855406185_581421127_n.jpg\"><img class=\"wp-image-105601\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/11419826_946584855406185_581421127_n.jpg\" alt=\"\" width=\"491\" height=\"369\"><\/a> Students gather on the field after a student pulled the fire alarm following&nbsp;brunch. Photo by Emily Hwang.[\/caption]A Palo Alto High School student pulled the fire alarm at the end of brunch today, causing a delayed start for 4th Period final exams, according to Assistant Principal Jerry Berkson.\n\nThe students were dismissed from the football field about 10 minutes after the alarm was pulled. In an email to the Paly staff, parents and students, Principal Kim Diorio announced that the school day would be extended 15 minutes to give students the allotted two hour time slot for their final exams.\n\nAccording to Berkson, the alarm originated in the Student Center. The fire alarm control panel can detect where the alarm was triggered and if smoke or a manual trigger set off the alarm. Additionally, the Palo Alto Fire Department is automatically notified when the fire alarm goes off.\n\n\"As soon as I saw that it was pulled, I called them [PAFD] to say that it was a non-emergency,\" Berkson said. \"But they still have to reset everything. We can't just reset it.\"\n\n<span style=\"color: #000000;\">The <a href=\"http:\/\/palyvoice.com\/2014\/12\/04\/can-you-take-the-heat-think-twice-before-pulling-that-fire-alarm\/\">consequences of pulling a fire alarm<\/a> in&nbsp;the absence of a fire can be serious. If caught, there may be a suspension from the school or a citation by the police, Berkson said. According to Berkson,&nbsp;this incident misdirected his time and energy away from managing&nbsp;end-of-year activities such as graduation.<\/span>\n\nFreshman Preston Sterling says he thinks&nbsp;that the person who pulled the alarm did not want to take&nbsp;his or her 4th Period final exam.\n\n\"[I think] the purpose [of pulling the alarm] was to skip the final, but it kind of backfired,\" Sterling said.","excerpt":"A Palo Alto High School student pulled the fire alarm at the end of brunch today, causing a delayed start for 4th Period finals, according to Assistant Principal Jerry Berkson.","date":"2015-06-03 14:55:20","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/06\/IMG_24251.jpg","categories":["News","Spotlight"],"tags":{"44972":"false alarm","10172":"finals","34357":"finals week","10447":"fire alarm","9954":"jerry berkson","8834":"Kim Diorio"}}]