[{"id":102571,"title":"Golf prepares for SCVALs","permalink":"http:\/\/palyvoice.com\/2015\/04\/28\/golf-prepares-for-scvals\/","content":"[caption id=\"attachment_102888\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/golf3.jpg\"><img class=\"wp-image-102888 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/golf3.jpg\" alt=\"golf3\" width=\"600\" height=\"400\" \/><\/a> Junior Henry Gordon lines up a long putt in practice. The upcoming SCVAL tournament will be held at Santa Teresa Golf Course in San Jose. Photo by Alex Hwang.[\/caption]\r\n\r\nAfter a strong league campaign in which the Palo Alto High School boys’ golf team (14-1, 12-0) finished in first place, the team prepares for the upcoming Santa Clara Valley Athletic League tournament with great expectations.\r\n\r\nAccording to senior captain John Knowles, the team is motivated and hitting its stride as the tournament approaches.\r\n\r\n\"The team is doing great,\" Knowles said. \"The passion of the boys is unmatched, and it's just incredible to see a group of guys come together and pursue excellence. We have play-offs coming up and so we need to do well in our league tournament to move on to CCS [Central Coast Section playoffs]. I'm looking forward to throwing up some low scores in the coming weeks.\"\r\n\r\nTwo of the standout stars on the team this season have been freshmen Ahmed Ali and Joonsung Ha, both of whom posted team-best scores of 35 in the recent rivalry match against Gunn High School. According to Ha, despite his individual success this season, his main goal is still to contribute to the team however possible.\r\n\r\n\"The goal for me is to try to get to NorCals [the individual competition for top Northern California players],\" Ha said. \"[However,] I think my role in the team is to just play the best I possibly can. It's a great experience playing on a team because golf is an individual sport. I hope that our team can win the SCVAL  [league] tournament and I hope that I can [consistently] shoot even par.\"\r\n\r\nThe other senior captain, Alex Hwang, added that the team still has an eager eye on the upcoming CCS tournament.\r\n\r\n\"We're doing super well and haven't lost a match yet, but everyone knows our real competition comes at CCS,\" Hwang said. \"Our goal is to advance past CCS, which we haven't done in a long time.\"\r\n\r\nThe first SCVAL tournament match will be played against Los Gatos High School, Saratoga High School, and Gunn at 12:30 p.m. today at Santa Teresa Golf Course in San Jose.","excerpt":"After a strong league campaign in which the Palo Alto High School boys’ golf team finished in first place, the team prepares for the upcoming Santa Clara Valley Athletic League tournament with great expectations.","date":"2015-04-28 15:23:08","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/golf3.jpg","categories":["Golf"],"tags":{"14524":"alex hwang","8738":"Golf","14526":"john knowles","42418":"joonsung ha","42421":"norcals","42420":"norcals golf","14521":"paly golf","9078":"scval","42419":"scval golf"}},{"id":102828,"title":"Tuesday Tunes: Tessa Barry","permalink":"http:\/\/palyvoice.com\/2015\/04\/28\/tuesday-tunes-tessa-barry\/","content":"[caption id=\"attachment_102830\" align=\"aligncenter\" width=\"321\"]<img class=\" wp-image-102830\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11163698_1086355508047912_1189178134_o.jpg\" alt=\"Junior Tessa Barry shares her favorite songs with The Paly Voice. Photo by George Lu. \" width=\"321\" height=\"482\" \/> Junior Tessa Barry shares her favorite songs with The Paly Voice. Photo by George Lu.[\/caption]\r\n\r\nThis week, The Paly Voice sat down with junior Tessa Barry and asked her to compile a list of a few of her favorite songs.\r\n\r\nBarry finds completing tedious tasks to be easier while listening to her music.\r\n\r\n\"Music inspires me to do certain activities,\" Barry said. \"For example, [if] I need to clean my room, I put on a good playlist or album and get pumped to clean my room. Same goes with homework or other mundane activities.\"\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Amcgreebler%3Aplaylist%3A2Ff9n3mMUvSwnRHsWaYo0e\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>\r\n\r\nFrom the Night—Stars\r\n\r\nAll The Places—MADE IN HEIGHTS\r\n\r\nRescue Song- RAC Remix—Mr Little Jeans\r\n\r\nFresh Feelings—Eels\r\n\r\nPraise You—Fatboy Slim\r\n\r\nIf I Ever Feel Better—Phoenix\r\n\r\nNew Theory—Washed Out\r\n\r\nDreams—Fleetwood Mac\r\n\r\nThe Wire—Haim\r\n\r\nHoldin On—Flume","excerpt":"This week, The Paly Voice sat down with junior Tessa Barry and asked her to compile a list of a few of her favorite songs.","date":"2015-04-28 14:35:52","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/FotorCreated.jpg","categories":["A&amp;E Section Spotlight","Spotlight"],"tags":{"8906":"music","8953":"paly","42417":"spotify playlist","9132":"students","42415":"Tessa Barry","42416":"Tuesday Tunes"}},{"id":102807,"title":"Where is everyone? Students opt out of Smarter Balanced test","permalink":"http:\/\/palyvoice.com\/2015\/04\/27\/where-is-everyone-students-opt-out-of-smarter-balanced-test\/","content":"[caption id=\"attachment_102851\" align=\"aligncenter\" width=\"570\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-27-at-4.26.04-PM.png\"><img class=\"wp-image-102851\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-27-at-4.26.04-PM.png\" alt=\"packing up\" width=\"570\" height=\"425\" \/><\/a> Students pack up in Room 856 after taking the Smarter Balanced test this afternoon. Of the 30 juniors scheduled to take the test in the room, only 15 were present. Photo by Jeanette Wong.[\/caption]\r\n\r\nUnder 50 percent of Palo Alto High School juniors took the state-standardized Smarter Balanced test today, according to Dean of Students Adam Paulson.\r\n\r\nAccording to California Education Code §60615, parents are allowed to let their children opt out of California standardized tests, such as the Smarter Balanced test, by simply signing a form. However, Paulson said students who were not previously excused from the test are expected to retake the test at a to-be-determined date.\r\n\r\n“Our participation rate was expected to be somewhere around 50 percent — which is disappointing,” Principal Kim Diorio said. “We were hoping for a larger turnout, but we certainly understand that parents and students have a right to opt out of these kinds of tests. We’re seeing a trend across the nation of parents and students exercising that right.”\r\n\r\nGiven the small number of test takers, the data collected may not accurately reflect the proficiency of the junior class on the subjects that were tested. With less than 50 percent of students taking the Smarter Balanced test, the data is statistically insignificant, which does not accurately give the school benchmark information, Diorio said.\r\n\r\nBecause it is Paly’s first year for implementing the Smarter Balanced test, the school and the school district will not be affected by the scores in any way, according to Diorio. However, Smarter Balanced scores next year will count towards the school’s ‘score,’ which will be a reconstituted version of the Academic Performance Index score, Paulson said. Thus, Paly’s score next year will depend on test participation.\r\n\r\n“Typically, it’s around 95 percent of the students that they [the CA Dept. of Education] want you [the school] to test,” Paulson said. “Obviously, today we didn’t get there. We need most kids to participate so we can get an accurate score.”\r\n\r\nDespite how test participation did not fulfill ideal circumstances, the school benefitted from the test administered today, according to Diorio.\r\n\r\n“It’s a good practice run,” Diorio said. “I think teachers will learn a lot from proctoring it and administering it. Having seen the questions and getting a better sense of what it’s asking students, there’s definitely value in it.”\r\n\r\nThe test is divided into two sections, with a 10-minute break in between the sections. Some changes were made today regarding the scheduled breaks during the test.\r\n\r\nStudents were given two hours to complete around five short answer questions, according to junior Joseph Kao. Kao says many students completed the first section of the test in approximately 15 to 30 minutes. Because the test took a shorter amount of time than anticipated, Diorio and Paulson released students about an hour before their scheduled break time.\r\n\r\n“We did not expect that [the length of the test], which is why we made the executive decision to let you [the students] out,” Diorio said. “I walked around to five or six classrooms and I noticed that everybody was done. I found Mr. Paulson, and we decided to make some adjustments and give the students a break. We don’t want you sitting there with an hour, or hour and a half, with nothing to do. That’s not fair to the kids who did show up.”\r\n\r\nPublic school participation in the Smarter Balanced test is encouraged by the <a href=\"http:\/\/www.cde.ca.gov\/ta\/tg\/sa\/index.asp\">California Department of Education<\/a>, according to Paulson.\r\n\r\n“As a public school, we need to offer the tests, and we encourage full participation,” Diorio said. “I’m very thankful for all the kids that are here. It will help us get some good data.”\r\n\r\nAlthough the Smarter Balanced test <a href=\"http:\/\/palyvoice.com\/2015\/04\/26\/smarter-balanced-scores-to-waive-placement-tests\/\">does not help with admission to college<\/a>, it can potentially save students time by acting as a placement test for colleges in the California State University system and community college system.\r\n\r\nMany students did not show up to take the test because they felt it had no meaningful purpose, according to junior Nick Guardino.\r\n\r\n“I think a lot of people didn’t come because it [the Smarter Balanced test] doesn’t necessarily affect their future,” Guardino said. “They probably didn’t think it was worth their time. … It’s monotonous and seems irrelevant.”","excerpt":"Under 50 percent of Palo Alto High School juniors took the state-standardized Smarter Balanced test today, according to Dean of Students Adam Paulson.","date":"2015-04-27 17:25:44","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Screen-Shot-2015-04-27-at-4.26.04-PM.png","categories":["News","Spotlight"],"tags":{"42410":"boycott","8644":"diorio","9760":"juniors","42414":"participation","42411":"paulson","42413":"show up","42405":"smarter balanced","42412":"standardized","12319":"test"}},{"id":102191,"title":"ASB is Sirius about Hogwarts Week","permalink":"http:\/\/palyvoice.com\/2015\/04\/27\/asb-is-sirius-about-hogwarts-week\/","content":"[caption id=\"attachment_102458\" align=\"aligncenter\" width=\"457\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/799961388_83de46731f_o.jpg\"><img class=\" wp-image-102458\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/799961388_83de46731f_o.jpg\" alt=\"The various Hogwarts houses within the Harry Potter Series. Photo courtesy of Creative Commons. \" width=\"457\" height=\"413\" \/><\/a> The four Hogwarts houses within the popular Harry Potter Series. Seniors, juniors, sophomores and freshman will respectively represent Gryffindor, Slytherin, Ravenclaw and Hufflepuff. Photo courtesy of Creative Commons.[\/caption]\r\n\r\nCalling all Muggles, Half-Bloods, Purebloods, and Squibs!\r\n\r\nPalo Alto High School's Associated Student Body will host the school's first ever \"Paly Hogwarts Week,\" a three-day long event inspired by the Harry Potter series, from April 29 to May 1.\r\n\r\nThe event spans Wednesday through Friday and will feature several school-wide Harry Potter-themed activities, including a Quidditch tournament, trivia games, a Tri-Wizard Tournament and several dress-up days.\r\n\r\n\"I'm a huge Harry Potter fan and while I was the Spirit Commissioner last year, I wanted to start a new spring spirit tradition,\" senior class president Maya Ben-Efraim said. \"I have been dreaming of a Hogwarts Week for a long time now.\"\r\n\r\nASB assigned each grade a \"House\" for the week, and different colors will represent each \"House.\" Seniors will represent Gryffindor with scarlet and gold, juniors will wear emerald and silver to represent Slytherin, the sophomore Ravenclaws will wear blue and bronze and the Hufflepuff freshmen will wear yellow and black.\r\n\r\nOn Wednesday, the first day of Hogwarts Week, students are either encouraged to compete in the Tri-Wizard Tournament or simply represent their House by wearing its colors and other paraphernalia. Two boys and two girls will be randomly selected to participate in the tournament. According the<a href=\"https:\/\/docs.google.com\/document\/d\/1XGMtlJttJWuLnnWkZSDdejYUPRZv9mfXKLFkiKpopSU\/edit\" target=\"_blank\"> ASB Hogwarts week master document<\/a>, the stations in the Tri-Wizard Tournament include a \"Levitating Beach Ball,\" \"Maze Race,\" \"Flying Sponge Race\" and a \"Polyjuice Potion Tarp Race.\"\r\n\r\n\"It [the Tri-Wizard Tournament]<span style=\"color: #222222;\"> will be similar to the Spirit Week relay race where there are multiple sections with different tasks to be completed at each section,\" Ben-Efraim said. <\/span>\r\n\r\nThe Quidditch Tournament will take place on the last two days of the event. The House teams will each consist of 20 randomly selected students. In the semifinal round on Thursday, April 30, the Gryffindor House team will face off against the Hufflepuff House team, and the Slytherin House team will battle the Ravenclaw House team. The two winners of the preliminary rounds will advance to the final round on Friday, May 1. The second day of Hogwarts week will also feature a trivia competition during lunch.\r\n\r\nOn the Friday, the final day of the event, ASB encourages seniors are encouraged to wear college gear, or attire and garments representing post-high school plans.\r\n\r\n\"I am so excited to finally see [Hogwarts Week] happen,\" Ben-Efraim said.","excerpt":"Palo Alto High School's Associated Student Body will host the school's first ever \"Hogwarts Week,\" a three-day long event inspired by the Harry Potter series, from April 29 to May 1.","date":"2015-04-27 14:51:12","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/799961388_83de46731f_o.jpg","categories":["News","Spotlight"],"tags":{"42206":"gryffindor","42203":"harry","42202":"harry potter","42205":"hogwarts week","42209":"hufflepuff","8953":"paly","42204":"potter","42208":"ravenclaw","42207":"slytherin"}},{"id":102709,"title":"Review: &#8220;Unfriended&#8221; falls short of excellence","permalink":"http:\/\/palyvoice.com\/2015\/04\/26\/review-unfriended-falls-short-of-excellence\/","content":"Simultaneously innovative and unengaging, “Unfriended” delivers an adequate performance that serves more as a tacky teenage movie with a message than as a blood-curdling thriller. The film <span style=\"color: #222222;\">— r<\/span>eleased by Blumhouse Productions and the Bazelevs Co. last weekend <span style=\"color: #222222;\">— has its moments but fails to reach the ranks of the many horror films that came before it.<\/span>\r\n\r\n\"Unfriended,\" told entirely within the frame of a teenage girl’s laptop screen, follows a Skype group call between six friends on the anniversary of their friend’s suicide. After a humiliating drunk video of their friend was posted, they anonymously took part in cyberbullying her by posting malicious comments on the video, eventually resulting in her suicide. Their past comes back to haunt them a year later when they receive threatening messages from their friend's account. Unable to disconnect the unknown presence from their group chat, the friends are roped into a night of sadistic games and forced confrontations. If they log out, they die.\r\n\r\n[caption id=\"attachment_102711\" align=\"aligncenter\" width=\"611\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1.jpg\"><img class=\"wp-image-102711\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1.jpg\" alt=\"sdf\" width=\"611\" height=\"344\" \/><\/a> Blaire (Shelley Hennig) screams in fright as she witnesses her friend's murder over Skype. Photo courtesy of MTV.[\/caption]\r\n\r\nThe message the film is trying to convey is clear: Be careful of what you post on the Internet because your digital footprint lasts forever. In an era where social media dominates much of teenagers' lives, this message is essential. Screenwriter Nelson Greaves’s decision to set the entire film on the protagonist’s laptop creates a hauntingly real environment. No longer are the horror movie victims targeted by a possessed porcelain doll or trapped in a haunted house — the horror of “Unfriended” lies directly on the familiar pages of YouTube, Facebook and Instagram.\r\n\r\nViewers literally see the plot unfold through the eyes of the protagonist. Every Facebook or Skype notification she gets, every song she listens to on Spotify, every message she types out but deletes before sending is exposed to the audience. This new, unfamiliar sense of intimacy between the individuals on either sides of the screen is unlike any other.\r\n\r\nDespite its clever concept, the film fails to deliver a satisfying overall experience. The trailer, although brilliantly made, essentially spoils the entire movie. The plot becomes predictable, and as a result, it’s a bit boring at parts. Much like many other thrillers, the storyline isn't particularly complex. However, the frightening aspect of the other movies often counteracts their dull plots, making them enjoyable to watch.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/Q72LWqCx3pc\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<em>Featuring clips from viral YouTube videos, the \"Unfriended\" trailer presents a summary of the movie's plot.<\/em>\r\n\r\nIn this movie, the hinted scariness from the trailer is barely present in the film itself. With the age-old what’s-behind-the-closet-door question replaced with what’s-in-the-jpeg-image-I-just-received and the classic, chilling telephone ring replaced with the feeble ping of an unknown notification, the spook factor of “Unfriended” is minimal at best. There are several jump scares scattered throughout, but don’t count on this to be your new favorite horror movie.\r\n\r\nThat being said, the writing isn’t all bad. The considerably static plot is interlaced with jokes that are sure to make you laugh out loud. The humor is well-suited for high school students, and the dynamic of the on-screen teenagers is much like that of an average friend group. As a whole, the film offers decent entertainment and should not be missed by those who wish to have a good laugh.\r\n\r\nAlthough “Unfriended” may not be one of the best movies of the year, it most certainly deserves to be remembered as a timely snapshot of the 21st century.\r\n\r\n<strong>“Unfriended”<\/strong>\r\n\r\n<strong>1 hour, 23 minutes<\/strong>\r\n\r\n<strong>Rated R for violent content, pervasive language, some sexuality, and drug and alcohol use — all involving teens<\/strong>\r\n\r\n<strong>Directed by Levan Gabriadze<\/strong>\r\n\r\n<strong>Starring Shelley Henning, Moses Jacob Storm, Renee Olstead, Courtney Halverson<\/strong>","excerpt":"Simultaneously innovative and unengaging, “Unfriended” delivers an adequate performance that serves more as a tacky teenage movie with a message than as a blood-curdling thriller.","date":"2015-04-26 17:55:39","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Reviews","Spotlight"],"tags":{"8689":"Facebook","30939":"instagram","8900":"movie review","42389":"scary movie","42388":"skype","30938":"social media","42390":"spotify","42387":"unfriended","11976":"youtube"}},{"id":102771,"title":"Smarter Balanced scores to waive placement tests","permalink":"http:\/\/palyvoice.com\/2015\/04\/26\/smarter-balanced-scores-to-waive-placement-tests\/","content":"Juniors will take their first-ever official state-standardized Smarter Balanced test on Monday and Tuesday at Palo Alto High School. Starting in the 2015-16 school year, students enrolling in certain California colleges may use the Smarter Balanced test scores to determine placement in courses.\r\n\r\nThe Smarter Balanced test is a new state assessment based on the <a href=\"http:\/\/www.corestandards.org\/\">Common Core State Standards<\/a>. The test is administered electronically and it assesses skills in reading, language arts and math.\r\n\r\n[caption id=\"attachment_102788\" align=\"alignright\" width=\"352\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/smarter.jpg\"><img class=\"wp-image-102788 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/smarter.jpg\" alt=\"smarter balanced logo\" width=\"352\" height=\"196\" \/><\/a> Juniors will be taking the Smarter Balanced exam on Monday and Tuesday. Students can use their scores for placement in certain colleges after admission. Screenshot by Emily Hwang.[\/caption]\r\n\r\nAccording to the <a href=\"http:\/\/www.smarterbalanced.org\/news\/close-200-colleges-universities-use-smarter-balanced-scores-part-placement\/\">Smarter Balanced website<\/a>, 101 California schools will be accepting Smarter Balanced scores to waive placement test requirements. However, the scores will solely be used by colleges in the California State University (CSU) system and community college system, not the University of California (UC) system.\r\n\r\nAccording to college counselor Sandra Cernobori, the Smarter Balanced scores are not used for admission into colleges. Rather, they are exclusively utilized by state colleges and universities so that students do not have to take placement tests once they are accepted into a CSU or community college.\r\n\r\n“The Smarter Balanced has nothing to do with getting in [to college],” Cernobori said. “It’s having to do with whether or not they [students] need to take a placement test after they’ve been admitted, or if their scores on either the SAT or ACT or on the Smarter Balanced have waived that requirement.”\r\n\r\nAccording to Cernobori, there is a section on the test where students can indicate whether they want their Smarter Balanced scores to replace traditional placement test scores.\r\n\r\n“There’s a bubble that you fill in on the test sheet that says that you would like these [the test scores] to also be considered for this other purpose [placement in college courses],” Cernobori said.\r\n\r\nCernobori says that allowing colleges to look at Smarter Balanced scores for placement purposes will probably most likely not make much difference to most students. However, according to Cernobori, it would save them time if students end up attending a CSU or community college.\r\n\r\n“It might be an advantage after they’re admitted in terms of waiving the placement test,” Cernobori said. “There’s nothing to lose, there’s not a ton to gain, but there’s a little bit to gain, so might as well bubble it in.”\r\n\r\nThe test is being used so that students can have more variety with placement test scores at colleges.\r\n\r\n“It’s a different kind of test, so sometimes they do better on it [the Smarter Balanced exam],” Cernobori said.\r\n\r\nAccording to Cernobori, this option has existed before, except with a different exam (Standardized Testing and Reporting program, or STAR Test).\r\n\r\nJunior Neta Hart says she might indicate that she wants her scores on the Smarter Balanced to be used for placement. However, she is not concerned about her scores on the test.\r\n\r\n“I focus more on the ACT,” Hart said. “ I know that most colleges will look at the ACT, not the Smarter Balanced test. … I only knew about this test two days ago.”\r\n\r\n&nbsp;","excerpt":"Juniors will take their first-ever official state-standardized Smarter Balanced test on Monday and Tuesday at Palo Alto High School. Starting in the 2015-16 school year, students enrolling in certain California colleges may use the Smarter Balanced test scores to determine placement in courses.\r\n","date":"2015-04-26 17:31:45","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/smarter.jpg","categories":["News","Spotlight"],"tags":{"9680":"ACT","42408":"ap","42407":"assessment","8552":"California","8604":"college","34668":"community college","42409":"csu","42406":"exam","8944":"palo alto high school","29935":"sat","9068":"School","42405":"smarter balanced","9132":"students","12319":"test","29086":"uc"}},{"id":102734,"title":"Slideshow: Not In Our Schools Week","permalink":"http:\/\/palyvoice.com\/2015\/04\/26\/slideshow-not-in-our-schools-week\/","content":"Palo Alto High School Associated Student Body hosted Not In Our Schools Week to recognize and appreciate students of all abilities, races and beliefs. Daily awareness activities and presentations were available to students during brunch and lunch throughout the week.\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AsDA1dMxHrKC\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Palo Alto High School ASB hosted Not In Our Schools Week to recognize and appreciate students of all abilities, races, and beliefs. Daily awareness activities and presentations were available during brunch and lunch all throughout the week.","date":"2015-04-26 15:02:59","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_0099.jpg","categories":["News","Slideshow","Spotlight"],"tags":{"19460":"2015","14280":"nios","14279":"not in our schools week","8953":"paly","42398":"school spirit"}},{"id":102579,"title":"Liveblog: Boys&#8217; lacrosse takes on Los Gatos","permalink":"http:\/\/palyvoice.com\/2015\/04\/24\/liveblog-boys-lacrosse-takes-on-los-gatos\/","content":"<em>Check back here at 7 p.m. for live coverage of the Palo Alto High School boys’ lacrosse team (7<span style=\"color: #000000;\">-5-1, 4-2<\/span>) as they host the De Anza league-leading Los Gatos High School Wildcats (8-5, 8-0) at the El Camino field.<\/em>\r\n\r\n&nbsp;\r\n\r\n[liveblog]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Check back here at 7 p.m. for live coverage of the Palo Alto High School boys’ lacrosse team (7-5-1, 4-2) as they host the De Anza league-leading Los Gatos High School Wildcats (8-5, 8-0) at the El Camino field.","date":"2015-04-24 15:40:14","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2124.jpg","categories":["Sports"],"tags":{"12016":"lax","8855":"liveblog","9914":"los gatos"}},{"id":102523,"title":"ASB Appointed Officers Results 2015-16","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/asb-appointed-officers-results-2015-2016\/","content":"The 2014-2015 Associated Student Body announced its Appointed Officers for the 2015-16 school year. See the results below.\r\n<p style=\"color: #141823;\"><strong>Sports Commissione<\/strong>r: Ariya Momeny<\/p>\r\n\r\n<div class=\"text_exposed_show\" style=\"color: #141823;\">\r\n\r\n<strong>Spirit Commissioners<\/strong>: Cezanne Lane and Reid Walters\r\n\r\n<strong>Social Commissioners<\/strong>: Claire Billman and Maryland Valdez\r\n\r\n<strong>Social Justice &amp; School Culture Commissioner<\/strong>: Mariah Poitier\r\n\r\n<strong>PAUSD Board Representative<\/strong>: Emma Cole\r\n\r\n<strong>Publicity Commissioner &amp; Videographer<\/strong>: Griffin Carlson\r\n\r\n","excerpt":"The ASB Appointed Officers results for the 2015-2016 school year have been announced. ","date":"2015-04-23 19:12:43","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1969134_844366578915382_9183705722491742144_n.jpg","categories":["News"],"tags":{"42301":"appointed officers","8496":"ASB","8499":"Associated Student Body","8944":"palo alto high school","8953":"paly","30978":"results"}},{"id":102614,"title":"Opinion: Zero Period PE policy needs reform","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-pe-policy-needs-reform\/","content":"One main topic of discussion regarding Zero Period PE is the need for sleep. <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/03\/20\/guest-opinion-what-we-can-do-to-reduce-risk-for-our-teens\">Surveys<\/a> show that Palo Alto students sleep an average of six and a half hours — well below the needed eight to ten hours a night, according to the <a href=\"http:\/\/sleepfoundation.org\/sleep-topics\/teens-and-sleep\">Sleep Foundation<\/a>. While Zero Period PE is not responsible for a large percentage of these numbers, running the mile at 7:15 a.m. is sure to drain already sleep-deprived youth and can lead to even greater health risks. According to the <a href=\"http:\/\/www.apa.org\/monitor\/oct01\/sleepteen.aspx\">American Psychological Association<\/a>, research suggests that sleep deprivation puts adolescents at risk for cognitive and emotional difficulties, poor school performance, accidents and psychopathology.\r\n\r\nSleep deprivation can lead to other negative side effects. It can cause aggressive behavior and contribute to illnesses, according to the Sleep Foundation. According to the <a href=\"https:\/\/www.aap.org\/en-us\/about-the-aap\/aap-press-room\/aap-press-room-media-center\/Pages\/Sleepy-Teens.aspx\">American Academy of Pediatrics<\/a>, the risk of depression significantly increased among teens who sleep less than eight hours a night. While one may state that students enrolled in Zero Period PE try to sleep earlier in compensation, no surveys or studies regarding this exist and hordes of Paly students continue to lament their lack of sleep.\r\n\r\nWhile self-identified “morning people” may benefit from Zero Period PE, many sophomores take the class to enroll in as many as eight other academic classes during the school day. Although freshmen are <a href=\"http:\/\/paly.net\/sites\/default\/files\/2015-16_gr9_course_selection_form_front%26back.pdf\">prohibited<\/a> from joining more than seven classes, no limit exists for sophomores and upperclassmen.\r\n\r\n“It forces people who want to take many classes into taking Zero Period [PE] because it [taking many classes] is not an option otherwise,” sophomore Julia Lauer said.\r\n\r\nFurthermore, morning people can still wake up early to complete school assignments, and thus do not need to take an early class to be productive.\r\n\r\nAccording to sophomore Jessica Wu, who signed up for nine classes in first semester, Zero Period PE contributed to an already high stress load.\r\n\r\n“It was a super long day,” she said. “I’d arrive [at school] at seven and go home at five with no break. Then I would have extracurriculars, and that would give me no time to actually get work done until nine.”\r\n\r\nAlthough Zero Period PE may cause less stress than early academic classes, it continues to strain students’ stress and sleep levels. However, supporters maintain that because Zero Period PE is an optional class, it should always be available to those who wish to take it. In order to cooperate with students willing to wake in the early morning in exchange for an afternoon prep, an ideal solution is to limit Zero Period students to a total of seven classes or make students who wish to take more that seven classes sign a waiver. In addition, advisers and counselors should warn against utilizing Zero Period PE as a tool for taking extra classes.","excerpt":"Zero Period Physical Education classes need reform in order to limit student stress and decrease sleep deprivation.\r\n","date":"2015-04-23 14:42:41","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg","categories":["Opinion"],"tags":{"8638":"debate","8751":"gunn","32445":"max mcgee","8927":"opinion","8944":"palo alto high school","8953":"paly","8980":"pe","9106":"sleep","9128":"Stress","42273":"zero period","42382":"zero period pe"}}]