[{"id":108465,"title":"Club Day offers myriad of activities","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/club-day-offers-myriad-of-activities\/","content":"Following the first Club Day of the 2015-16 academic year, Palo Alto High School students are set to start participating in various clubs. Click on the link to view highlights from yesterday's event.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/uyTE7cKuyYc\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Following the first Club Day of the 2015-16 academic year, Palo Alto High School students are set to start participating in various clubs.","date":"2015-09-22 18:58:19","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSC_19621.jpg","categories":["Editor's Pick","Multimedia","News","Spotlight"],"tags":{"44048":"2015-16","56295":"chess club","11711":"club day","11337":"clubs","8683":"events","56296":"extracurriculars","56294":"fashion club","8944":"palo alto high school","56297":"paly club","56298":"untaught history club","56293":"wilderness club"}},{"id":108478,"title":"Annual college fair is on Oct. 12 in the library","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/annual-college-fair-is-on-oct-12\/","content":"","excerpt":"","date":"2015-09-22 18:11:24","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":108476,"title":"Fiery arts sale this Friday Sept. 25 and Saturday Sept. 26","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/fiery-arts-sale-this-friday-sept-25-and-saturday-sept-26\/","content":"","excerpt":"","date":"2015-09-22 18:09:33","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":108390,"title":"Liveblog: Volleyball takes on Mountain View in league opener","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/liveblog-volleyball-takes-on-mountain-view-in-league-opener\/","content":"[caption id=\"attachment_108218\" align=\"alignnone\" width=\"709\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/volleyball3.png\"><img class=\"wp-image-108218 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/volleyball3.png\" alt=\"Volleyball \" width=\"709\" height=\"445\" \/><\/a> The Palo Alto High School Vikings celebrate after sophomore Chelsea Fan wins a point in their game against Woodside High School on Sept. 5. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\nThe Palo Alto High School volleyball team (11-3,0-0) will take on Mountain View (9-0,0-0) at Gunn tonight it their league opener. Check back at 6:45 p.m. for updates.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School volleyball team (11-3,0-0) will take on Mountain View (9-0,0-0) at Gunn tonight in its league opener. Check back at 6:45 p.m. for updates.","date":"2015-09-22 18:02:58","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/volleyball3.png","categories":["Sports","Uncategorized","Volleyball"],"tags":{"52186":"Chelsea Fan","8751":"gunn","56275":"league opener","8855":"liveblog","29989":"mountain view","8939":"palo alto","8944":"palo alto high school","8953":"paly","9210":"vikings","9216":"volleyball"}},{"id":108420,"title":"Library construction to begin in summer","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/library-construction-to-begin-in-summer\/","content":"Palo Alto High School’s library will undergo construction at the start of this summer and is set to finish by winter break in 2017.\r\n\r\nDuring the construction, the library will be moved into the Student Center, according to librarian Sima Thomas.\r\n\r\n“[The relocation to the Student Center] is less than ideal,” Thomas said. “There won’t be as many computers, and we’ll be moving some of our books into storage. The cafeteria will still be there too, but you’ll finally be able to eat in the library.”\r\n\r\nThe library construction project will address some of the library's current issues, according to Thomas.\r\n\r\n[caption id=\"attachment_108422\" align=\"alignright\" width=\"219\"]<img class=\"wp-image-108422\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/I9P0618.jpg\" alt=\"_I9P0618\" width=\"219\" height=\"329\" \/> “Sophomore Izzy Min and her friends work in the library during their 4th Period prep. Starting this summer, the library will undergo construction. \"When it finishes it’ll [the new library will] be two stories, with a mezzanine level, similar to that of the Media Arts Center,” librarian Sima Thomas said. Photo by Cooper Lou.[\/caption]“The library was built a long time ago, it has really high ceilings, gets loud easily, and has bad acoustics,” Thomas said. “People also use it as a cross, through which can be disruptive. The new library will have one door.”\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/11\/21\/paly-library-to-undergo-renovation\/\">In addition to charging lockers and a genius bar,<\/a> the construction plans will include other new features.\r\n\r\n“The new library will have a makerspace,” Thomas said. “It’ll be an open area with white boards, flexible space and possibly a 3-D printer where people can brainstorm and work.”\r\n\r\nUnderclassmen have mixed opinions when it comes to their thoughts on construction.\r\n\r\n“I don’t usually get books from the Paly library, so that won’t be really different,” sophomore Izzy Min said. “Distance-wise, and with it [the library] being in the cafeteria, spacing might be inconvenient. But overall, I think it'll be pretty cool when it's done.”\r\n\r\nWhile the construction may be an inconvenience next year, students and staff are excited to see the results.\r\n\r\n“The new library will be a beautiful space,” Thomas said. “It’ll be the center of the campus, inquiry, discovery and connection.”\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s library will undergo construction at the start of this summer and i s set to finish by winter break in 2017. ","date":"2015-09-22 15:33:25","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo-1.jpg","categories":["News"],"tags":{"8616":"construction","8848":"Library","8912":"new","56276":"thomas"}},{"id":108391,"title":"Girls&#8217; tennis hopeful after tournament win","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/girls-tennis-hopeful-after-tournament-win\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_108459\" align=\"aligncenter\" width=\"679\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2332.jpg\"><img class=\"wp-image-108459\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2332.jpg\" alt=\"IMG_2332\" width=\"679\" height=\"445\" \/><\/a> Senior co-captain Halle Biorn warms up before the match against Homestead High School today. The Vikings are 0-2 in the De Anza League, hoping to improve their record after the Paly Invitational Tennis Tournament victory on Saturday. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nThe Palo Alto High School girls' tennis team (6-4, 0-2) looks to improve upon its league record after winning the Paly Invitational Tennis Tournament on Saturday.\r\n\r\nThe team placed first out of five participating schools, which included Aragon, Castilleja, Notre Dame and Stevenson high schools, according to coach Andy Harader.\r\n\r\nSenior co-captain Halle Biorn is optimistic about the team's future performance, but adds that winning games in league will still be a challenge.\r\n\r\n\"I'm hoping this win will give us more confidence when we go into our next couple games,\" Biorn said. \"They're all going to be close games because our opponents are very good.\"\r\n\r\nSenior co-captain Kelsey Wang echoed Biorn, with hopes to get a spot in the Central Coast Section playoffs.\r\n\r\n\"We're all very excited about this tournament win, especially because Stevenson and Castilleja are strong teams, but we outperformed them,\" Wang said. \"We've played some tough teams so far in the [De Anza] league, so hopefully the win will give us the momentum we need to win more matches in our league. If we continue to work hard and play strategically, I think we have a good shot at making it to CCS.\"\r\n\r\nDespite high hopes, Harader stresses the difficult competition in the De Anza League, which the team moved up to this year.\r\n\r\n\"Our league is the best in NorCal [Northern California] and Central California, loaded with highly ranked players, so [the league is] extremely difficult,\" Harader said. \"We have several ranked players but just not as high.\"\r\n\r\nWang sees room for improvement as the team adjusts to the intense competitiveness of the league.\r\n\r\n\"I think we can still improve in regards to our aggressiveness in match play,\" Wang said. \"Since we moved up from a lower league last year, many of us are still determining how to approach opponents who aren't afraid to attack quickly, but I definitely think we will improve as the team gains more experience\"\r\n\r\nThe Viking's next match is against Homestead High School (3-0, 1-0) at 3:30 p.m. today at home.\r\n\r\n\"I know that our team is hungry for a league win, so we have a good shot at beating Homestead,\" Wang said.","excerpt":"The Palo Alto High School girls' tennis team (0-2, 6-4) looks to improve upon its league record after winning the Paly Invitational Tennis Tournament on Saturday.","date":"2015-09-22 15:32:34","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2332.jpg","categories":["Sports"],"tags":{"56278":"andy","56281":"autumn","56280":"captain","12358":"coach","8693":"Fall","41285":"girl","8734":"girls","56279":"harder","56282":"invitaitonal","56277":"kelsey","8939":"palo alto","9120":"sports","10016":"tennis","9175":"tournament","9223":"Wang"}},{"id":108152,"title":"Hybrid Chemistry class blends regular and Honor courses","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/hybrid-chemistry-class-blends-regular-and-honor-courses\/","content":"[caption id=\"attachment_108446\" align=\"alignleft\" width=\"375\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-17-at-5.17.13-PM2.png\"><img class=\" wp-image-108446\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-17-at-5.17.13-PM2.png\" alt=\"Students in the hybrid Chemistry course experience both Chemistry Honors and normal Chemistry together in the same class. In this class, students have the option of receiving Chemistry Honors credits or regular Chemistry credits. Photo by Ethan Kao.\" width=\"375\" height=\"234\" \/><\/a> Students in the hybrid Chemistry course experience both Chemistry Honors and normal Chemistry together in the same class. In this class, students have the option of receiving Chemistry Honors credits or regular Chemistry credits. Photo by Ethan Kao.[\/caption]\r\n\r\nPalo Alto High School is offering a new hybrid Chemistry class this year, which gives students more options throughout the course.\r\n\r\nThe hybrid class has a mix of students who signed up for either Chemistry Honors or Chemistry. According to Chemistry teacher Ron Bowditch, students get to choose which level of work they want to do.\r\n\r\n“We have honors students and regular students in the same class,\" said Bowditch.\"Honor-level students still do honor-level chemistry work. In fact, the same stuff they do in Honors class. Regular Chemistry students still do the same stuff as regular Chemistry.\"\r\n\r\nAccording to Science Instructional Supervisor Kelli Hagen, the new class offers students the ability to experience Chemistry Honors without fearing its academic rigor.\r\n\r\n“It's our [Hagen and Bowditch] belief that students are afraid to take Honors because they’ve heard that it is really hard and scary,” Hagen said. “Truly there's not a big jump between [Chemistry] Honors and regular Chemistry.\"\r\n\r\nSophomore Nandini Relan said, “I took the hybrid class because I had been in Biology Honors and I wasn't sure which lane I wanted to take. I signed up for Chem but I wasn't sure if I should've or shouldn't have. The hybrid class ended up solving that problem.”\r\n\r\nIf the students decide to stay in the hybrid Chemistry class, they can get credit depending on which work they do, according to Bowditch.\r\n\r\n“We also have quizzes every Wednesday and there is an honors and a regular quiz.” sophomore Nandini Relan said. “you do have to do specific work to get Chem H credit.”\r\n\r\nThe students also have the opportunity to move up into Chemistry Honors or move down into regular Chemistry if they would like. Six students have already taken advantage of this opportunity, according to Hagen.\r\n\r\n“What we were hoping was more students move into the Honors direction and that is what has been happening,” Hagen said. “We are four weeks in and we have six students that want to move up. They … want to move up because they are seeing this [Chemistry Honors work] and they are saying, 'I can do this too.'\"","excerpt":"Palo Alto High School is offering a new hybrid Chemistry class this year, which gives students more options throughout the course.","date":"2015-09-22 15:17:54","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Screen-Shot-2015-09-17-at-5.17.13-PM.png","categories":["News","Spotlight"],"tags":{"54460":"Akella","54458":"Bowditch","11624":"chemistry","54457":"Chemistry Honors","54459":"Hagen","54456":"Honors","54462":"Hybrid","54461":"Kao"}},{"id":108299,"title":"What&#8217;s new at Club Day?","permalink":"http:\/\/palyvoice.com\/2015\/09\/22\/whats-new-at-club-day\/","content":"Looking to be more involved on campus, try something new and unique or just have a little extra fun in the 2015-16 school year? Here are some new clubs to join that debuted at the annual Club Fair at lunch yesterday. For more information on meeting times and contact information, visit the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/clubs\">Palo Alto High School Associated Student Body site<\/a>.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/7993806-new-clubs\" width=\"620\" height=\"3226\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Looking to be more involved on campus, try something new and unique or just have a little extra fun in the 2015-16 school year? Here are some new clubs to join that debuted at the annual Club Fair at lunch yesterday.","date":"2015-09-22 11:09:54","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSC_1917.jpg","categories":["Multimedia","Spotlight"],"tags":{"8476":"android","8484":"annual","11711":"club day","55357":"club fair","11337":"clubs","55365":"drought awareness","55363":"international pen pal","10167":"lunch","55358":"new clubs","55362":"samosa","55360":"tech enthusiast","55364":"untaught history","55359":"wilderness","55361":"you +"}},{"id":108297,"title":"JEANC Regional Journalism Convention is on Saturday, Sept. 26 in the Media Arts Center","permalink":"http:\/\/palyvoice.com\/2015\/09\/20\/jeanc-regional-journalism-convention-is-next-saturday-sept-26-in-the-media-arts-center\/","content":"","excerpt":"","date":"2015-09-20 00:41:36","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":108295,"title":"Advisory this week is for all freshmen and sophomores","permalink":"http:\/\/palyvoice.com\/2015\/09\/20\/advisory-this-week-is-for-all-freshmen-and-sophomores\/","content":"","excerpt":"","date":"2015-09-20 00:39:58","author":"Josh Yuen","categories":["Ticker"],"tags":[]}]