[{"id":109511,"title":"Preview: Vikings&#8217; to face former teammate Svirsky","permalink":"http:\/\/palyvoice.com\/2015\/10\/08\/preview-vikings-to-face-former-teammate-svirsky\/","content":"[caption id=\"attachment_109561\" align=\"alignnone\" width=\"767\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Screen-Shot-2014-10-16-at-6.27.50-PM.png\"><img class=\"size-full wp-image-109561\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Screen-Shot-2014-10-16-at-6.27.50-PM.png\" alt=\"Former Paly quarterback\/wide receiver Oliver Svirsky catches a pass in a game against Wilcox High School last season. Svirsky is currently the starting quarterback at Milpitas High School. Photo by Josh Yuen. \" width=\"767\" height=\"613\" \/><\/a> Former Paly quarterback\/wide receiver Oliver Svirsky catches a pass from quarterback Justin Hull in a game against Wilcox High School last season. Svirsky is currently the starting quarterback at Milpitas High School. Photo by Josh Yuen.[\/caption]\r\n\r\nThe Palo Alto High School football team (2-3, 1-0) will look to earn its second De Anza league win of the season this Friday when it travels to Milpitas High School to take on the Trojans (3-2, 1-0), a team led by a familiar face to the Vikings.\r\n\r\nLast season, the Vikings were led by then-junior quarterback Oliver Svirsky for the first half of their season under head coach Jake Halas. Svirsky was pulled from the position later in the season and moved to wide receiver in favor of teammate Justin Hull, a senior who last week led the Vikings to a <a href=\"http:\/\/palyvoice.com\/2015\/10\/04\/football-takes-down-saratoga-in-league-opener\/\">42-35 double-overtime victory<\/a> over the Saratoga Falcons (1-3, 0-1).\r\n\r\nWhile Svirsky regained the position for the team's final two games when Hull suffered a concussion late last season, he transferred this past summer to Milpitas and earned the starting quarterback role there.\r\n\r\nAlthough Friday's matchup will be the first time Svirsky faces his former teammates, he says he is treating the game like any other.\r\n\r\n\"I'm just taking it as another game just like my teammates and as another chance to go out to war with my brothers here like every week,\" Svirsky said.\r\n\r\nThis season, Svirsky currently has five touchdown passes, five rushing touchdowns and two interceptions, <a href=\"http:\/\/www.maxpreps.com\/high-schools\/milpitas-trojans-(milpitas,ca)\/football\/stats.htm\">according to Maxpreps.com<\/a>. On the flip side, Hull has 14 touchdowns but seven interceptions.\r\n\r\nThe Trojans present an up-tempo offense for the Vikings' defense, paced by a trifecta of running backs each with at least 30 carries on the season: seniors Cros Chavez and Dejaun Crummie and sophomore Tariq Bracy.\r\n\r\nThe Vikings opened up league play strongly last week as Hull accounted for five of the team's six touchdowns.\r\n\r\nAccording to Hull's leading wide receiver Eli Givens, the team will be facing a big challenge in the Trojans' defensive line.\r\n\r\n\"We are going to be facing a very good defensive-line that will try and scare us with their size and will have to overcome that,\" Givens said.\r\n\r\nSvirsky remains confident in his team's ability to stick to it's game plan, even against his old team.\r\n\r\n\"We are focused on playing our game,\" Svirsky said. \"It's not about the opposing team, it's about us and playing our game.\"\r\n\r\nGivens, who grew up as one of Svirsky's close friends, noted that playing his friend will make the game interesting.\r\n\r\n\"I think it will be exciting to play [Svirsky],\" Givens said. \"I have never played against one of my closest friends like this in football and it will be interesting. I think it won't affect the game that much though because we know what we have to do to win and I think we are ready.\"\r\n\r\nThe game will kick off at 7 p.m. tomorrow at Milpitas High School.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School football team (2-3, 1-0) will look to earn it's second De Anza league win when it travels to Milpitas High School this Friday to take on the Trojans (3-2, 1-0), a team led by a familiar face to the Vikings.","date":"2015-10-08 21:31:23","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/PaulJIII.jpg","categories":["Football","Sports","Spotlight"],"tags":["givens","halas","hull","milpitas","Paly football","svirsky"]},{"id":109347,"title":"Model United Nations to participate in intergenerational conference","permalink":"http:\/\/palyvoice.com\/2015\/10\/08\/model-united-nations-to-participate-in-intergenerational-conference\/","content":"Palo Alto High School's Model United Nations club will attend its first conference of the year this weekend at University of California, Berkeley.\r\n\r\nThe Intergenerational Model UN conference is a unique conference in that it gives the opportunity for delegates of any age to participate, according to MUN researcher Tara Madhav.\r\n\r\n“It's not only a high school conference, but for delegates who are adults and even middle schoolers,” Madhav said. “It's really for anyone who is interested in Model UN.”\r\n\r\nMUN is a club intended for students to learn and discuss current world politics and events. For conferences such as the Intergenerational conference, each student will be assigned a committee with a specific topic and a country. Students must then research their country and its position. They will then write a paper and debate with other delegates to find a solution.\r\n\r\nAccording to Madhav, the Intergenerational conference is more educational and slow-paced in comparison to other MUN conferences. However, Madhav hopes the conference will serve to get the veteran delegates accustomed to the process once more, and give the new delegates a feel for MUN conferences.\r\n\r\n[caption id=\"attachment_109348\" align=\"alignright\" width=\"481\"]<img class=\"wp-image-109348\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12076931_825233570926770_1643289003_n.jpg\" alt=\"12076931_825233570926770_1643289003_n\" width=\"481\" height=\"361\" \/> Paly's Model United Nation (MUN) delegates and advisors pose at last year's Intergenerational conference. The intergenerational conferance allows delegates of any age to participate. According to MUN president Eli Craveiro Frankel, last year the conference took place at San Francisco Sate University, but this year it has been moved to the UC Berkeley campus. Photo by Mary McNamara[\/caption]\r\n\r\nAlthough there are no awards for this MUN conference, the committee does recognize specific delegates at the end, according to Madhav.\r\n\r\n“The committee chairs recognize who they felt were the ideal delegates during their speeches,” Madhav said. “It's a pretty great thing to be recognized for.”\r\n\r\nLast year, a collection of Paly students were recognized by the committee, including junior Anmol Nagar and graduate Chris Van Gelder (Class of 2015), according to Madhav.\r\n\r\nThis year MUN has implemented a new position in the club. The newly appointed researchers will compile research binders for the upcoming conference, which will enable MUN members to excel during the events by utilizing the useful sources, according to MUN President Eli Craverio Frankel.\r\n\r\nTo prepare for the event, the club is additionally organizing a Paly student veteran camp to help people refresh for the conference, according to Madhav.\r\n\r\n“We look forward to all the veterans getting back in shape for the year, and in general, an educational experience,” Madhav said.","excerpt":"The Model United Nations (MUN) club will attend its first conference of the year this weekend at University of California, Berkeley.","date":"2015-10-08 11:17:56","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/12076931_825233570926770_1643289003_n.jpg","categories":["News"],"tags":["club","Eli Craveiro Frankel","Intergenerational","model united nations","mun","Tara Madhav"]},{"id":109291,"title":"Voice of the Week: Dave Peters","permalink":"http:\/\/palyvoice.com\/2015\/10\/08\/voice-of-the-week-dave-peters\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_109318\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_2945.jpg\"><img class=\"size-full wp-image-109318\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_2945.jpg\" alt=\"Math teacher Dave Peters presents the inverse trigonometry derivatives his BC Calculus students are learning. This is his first year teaching the BC Calculus lane, having previously taught AB Calculus. Photo by Ana Caklovic. \" width=\"600\" height=\"450\" \/><\/a> Math teacher Dave Peters presents the inverse trigonometry derivatives that his BC Calculus students are learning. This is his first year teaching the BC Calculus lane, having previously taught AB Calculus. Photo by Ana Caklovic.[\/caption]\r\n\r\n<em><span style=\"font-weight: 400;\">This week, The Paly Voice sat down with math teacher Dave Peters to learn about the X Y and Zs of his job, his high school days and his Twitter aesthetic.<\/span><\/em>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice: Tell us about your transition from teaching AB Calculus to BC Calculus.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Dave Peters: When I first started AB a couple years ago, I realized I hadn’t done any calculus specifically since I was in college, so I had to do some preparation just to remind myself of how the theorems worked and whatnot. It’s not only the theorems and all of that, but the homework problems are more complicated so I have to do them all myself so I know what’s going on. If a student asks a question I don’t like to be in the front of the room thinking about it for the first time. I like to be able to say “Oh yeah, there’s this sneaky step here, or a lot of students do this when this works,\" so it’s definitely taken a lot of extra preparation, but I love it. I love teaching BC, and I loved teaching AB. Calculus is fun. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">TPV: Do you prefer teaching seniors or freshmen?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DP: Again, I don’t really have a preference. It’s apples and oranges. All the students are nice. I’m fortunate to be teaching BC and Geo H this year, which are both in the honors lane. When I started out here I was teaching the Geometry regular [class] and sometimes you could get a couple of characters. But everybody’s so nice in the honors lane, even if they’re struggling with the calculus. I just have a really great relationship with my classes, and it’s been that way for a couple years. It’s kind of hard to complain about though, it’s not Los Angeles Unified [School District], there’s no metal detector when you enter the school. But occasionally you’ll have a rambunctious group, depending on the grade and section you’re teaching.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">TPV: Do you have a favorite theorem?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DP: Usually when I go home, I stop thinking about math. Some people who live and breathe math, they might have a favorite theorem, but I’m not that guy.<\/span> I think I’m good at math, and I’m really good at explaining things to people, and I think that’s what makes me a good math teacher. You could be a genius at math and be terrible at explaining things to people and that would make you a bad teacher, and I definitely had a couple of those in college. ... I think I love teaching more than I love math.\r\n\r\n<span style=\"font-weight: 400;\">TPV: How would you describe your Twitter aesthetic?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DP: Sadly, I have not been on Twitter as much as I have been on [it] in the past, because my life is just so busy, but I say that every semester. Last semester I was finishing graduate school, the semester before that I was taking two classes and I had just had a baby. The semester before that I was in the middle of graduate school and my wife was pregnant. I kept looking forward and I thought “Oh, well, once graduate school’s done,” but this semester we moved to a new house, which is bananas, and my wife is pregnant again and we’re going to have another baby in January, and the BC was dropped on me. And so now, where I didn’t think I was going to have a new class this year, it’s not just any class, it’s the BC Calculus where I have to do every problem. I would like to tweet more, but it's just that sometimes I go home and I just need to sit on the couch, you know what I mean?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">I have a separate Twitter account, where I follow people but I don’t really tweet, and I have a public account. When you teach, they say for instance \"Don’t become Facebook friends with your students because there’s this awkward line and you don’t want to cross over it.\" So, I knew if I was going to have a Twitter account I couldn’t \"work blue,\" it would have to be very clean, so if any parent or board member read them they’d have to be okay. I realized some of the comedians I follow are so dirty I don’t even want to be connected with them that way, so my Twitter account is very sanitized ... but I still try to be as humorous as I can with it, and you know, sometimes I just tweet a picture of my daughter because she’s awesome. <\/span>\r\n\r\nTPV: Do you have any tips for relaxation, or managing time, or things that you wish students did that would make their lives easier?\r\n\r\nDP: You know, that’s a really good question. It’s tough because I think it varies so much from person to person. I think we all say this is a stressful environment, but it affects different people in different ways.  If you tell one person you need to do relaxation exercises and yoga, it might be great for them and for other people it might not work at all. And so, it’s hard to just say “Here’s one thing everyone can do” because I don’t think that counts. I don’t think there is a thing like that. But I get it man, I’m really stressed, I always feel like I have a million things going on.\r\n\r\n<span style=\"font-weight: 400;\">TPV: What was your least favorite class in high school?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DP: I would say my least favorite subject was history, but I was still pretty lucky because I still had really great teachers. I had one guy my freshman and junior year for Advanced Placement U.S History. I didn’t do well in APUSH, I didn’t take the exam, but I loved my history teacher. So, even with something that I was not a big fan of, I ended up liking it because of the teacher. I think the teacher can be very make-or-break, I think sometimes you hear students say things like “I hate math,” and maybe it’s not the math. Maybe it’s because in 6th grade they had some teacher who was awful, who just derailed them, and they just assumed it was something with them and not the instruction. But I don’t think I had a least favorite course in high school. I definitely like math a lot because I was good at it and it came naturally to me, but otherwise I was pretty ok with the rest of my courses. There wasn’t anything I hated.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">TPV: If you were to substitute for a class, what class would you substitute for?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DP: I wouldn’t mind substituting – well I guess this is not just a one day babysit a class, say I had to fill in for two weeks – and they couldn’t find anybody and they put me in there for some wacky reason. I guess I wouldn’t mind substituting for an English class if they were working on a novel I found interesting. I remember I enjoyed most of the books I read in high school, so if there was a class reading <\/span><i><span style=\"font-weight: 400;\">1984<\/span><\/i><span style=\"font-weight: 400;\"> or something, I think that would be interesting. I wouldn’t want to grade their essays though. I barely want to grade math tests. <\/span>","excerpt":"This week, The Paly Voice sat down with math teacher Dave Peters to learn about the X, Y and Zs of his job, his high school days and his Twitter aesthetic. ","date":"2015-10-08 11:14:22","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG_2945.jpg","categories":["Voice of the Week"],"tags":["AB","apush","baby","BC","calculus","dave peters","interview","job","math","math teacher","theorem","twitter facebook","voice of the week"]},{"id":109523,"title":"Advisory this week is for juniors, freshmen with individual meetings and seniors","permalink":"http:\/\/palyvoice.com\/2015\/10\/08\/advisory-today-is-for-juniors-freshmen-with-individual-meetings-and-seniors\/","content":"","excerpt":"","date":"2015-10-08 10:44:23","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":109290,"title":"Preview: Volleyball faces off against rival Gunn","permalink":"http:\/\/palyvoice.com\/2015\/10\/07\/preview-volleyball-faces-off-against-rival-gunn\/","content":"The Palo Alto High School volleyball team (15-7, 3-1) will play rival Gunn High School (10-8, 1-3) at 6:45 p.m. tomorrow for a chance to climb to the top of the league standings.\r\n\r\nAfter two strong showings in their last two games, sweeping both Homestead High School (2-13, 1-4) and Saratoga High School (9-8, 0-4), the Vikings are looking to add another win to their record. With a win tomorrow, Paly would join Mountain View High School (17-2, 4-1) at the top of the Santa Clara De Anza League standings.\r\n\r\nThe game is scheduled to take place at Gunn but is considered a home game for the Vikings because of the renovation of the Paly gym.\r\n\r\nLast year, each school won one match out of the two head-to-head matchups, both claiming victory in a 3-0 sweep.\r\n\r\nAccording to junior outside hitter Katie Passarello, the Vikings have a good chance of winning if they can correct their small errors.\r\n\r\n\"Our biggest thing that we need to focus on for our game is our communication,\" Passarello said. \"We have really strong hitters and we have great passers, but we need to be a little more cohesive so that our defensive players are talking to our offensive players so they know where to hit.\"","excerpt":"The Palo Alto High School volleyball team (15-7, 3-1) will play rival Gunn High School (10-7, 1-2) at 6:45 p.m. tomorrow.","date":"2015-10-07 22:04:48","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/Volleyball-14.png","categories":["Sports","Spotlight","Volleyball"],"tags":["gunn","rivalry","sports","volleyball"]},{"id":108870,"title":"Walk &#038; Roll day encourages eco-friendly ways to commute","permalink":"http:\/\/palyvoice.com\/2015\/10\/07\/walk-roll-day-encourages-eco-friendly-ways-to-commute\/","content":"[caption id=\"attachment_108953\" align=\"alignleft\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_41image1.jpg\"><img class=\" wp-image-108953\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_41image1.jpg\" alt=\"Photo by Ethan Kao.\" width=\"587\" height=\"397\" \/><\/a> Paly students walking or biking to school Thursday will receive Hershey's Kisses for participating in the annual Walk &amp; Roll day. Photo by Ethan Kao.[\/caption]\r\n\r\nThe City of Palo Alto is encouraging students to walk or bike to school on Thursday celebrating the annual Walk &amp; Roll day.\r\n\r\nThe city is expecting thousands of students throughout the district to participate in the event, which promotes eco-friendly and physically active methods of commuting to school, according to <a href=\"http:\/\/www.pausd.org\/palo-alto%E2%80%99s-walk-roll-week-safer-streets-healthier-bodies-and-greener-planet\" target=\"_blank\">Palo Alto Unified School District's website<\/a>.\r\n\r\nPaly Campus Supervisor Ernesto Cruz emphasizes the importance of finding different ways to commute to school.\r\n\r\n“Students should try to walk, bike or carpool to show that we care about the environment,” Cruz said. “It's the one time during the year where we can make a difference. It is also good for students to get out and walk rather than driving to school.\"\r\n\r\nA small reward will be given out to students who participate at the school entrances.\r\n\r\n\"We will be handing out Hershey’s Kisses to those [students] who participate,\" Cruz said.\r\n\r\nAccording to junior Derek Schoenberger, helping the environment and receiving free candy is more than enough of an incentive to walk or bike to school.\r\n\r\n“I will definitely be biking to school because I’ve driven almost every day this year,” Schoenberger said. “It's a good chance to switch things up and help the environment ...  and I want a Hershey’s Kiss.\"\r\n\r\n&nbsp;","excerpt":"The City of Palo Alto is encouraging students to walk or bike to school on Thursday celebrating the annual Walk & Roll day.","date":"2015-10-07 17:09:25","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_41image1.jpg","categories":["News","Spotlight"],"tags":["environment","friendly","roll","walk","walk and roll"]},{"id":109276,"title":"New program to provide student internship opportunities","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/new-program-to-provide-student-internship-opportunities\/","content":"[caption id=\"attachment_109393\" align=\"alignnone\" width=\"649\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN0437-11.jpg\"><img class=\"wp-image-109393 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN0437-11.jpg\" alt=\"DSCN0437 (1)\" width=\"649\" height=\"487\" \/><\/a> Seniors Jeanette Wong, Allison Zhang, Minyoung Kim, Priya Misner and junior Vivian Wu collaborate with Christina Owen during a Get Involved meeting after school in the library. \"The Get Involved project is a collaboration between Paly students, with me as director, certain offices at the City of Palo Alto and community organizations that support service-learning, career, networking and mentoring,\" Owen said. Photo by Adrienne Kwok.[\/caption]\r\n\r\nThe deadline to apply to the Get Involved Internship Program, an organization that provides Palo Alto Unified School District students with meaningful community service opportunities, is approaching on Oct. 9, according to junior Community Service Project Leader Candace Wang.\r\n\r\nNewly implemented this year, the program aims to expand student experience in the real world by collaborating with outside organizations and compiling internship opportunities, according to Wang.\r\n\r\n“We thought this was the perfect way to integrate not only volunteering, but real life work experience into something enjoyable and beneficial for Paly students,” Wang said. “It's really important that students have interests outside of the academic world.”\r\n\r\nCurrently, there are nine internships focuses available for students, including topics ranging from the environment to marketing and tutoring. Certain positions may take more multiple students.\r\n\r\nStudents will collaborate with the guidance of mentors in the field and will work towards a set goal, such as decreasing plastic litter on school campuses.\r\n\r\nhttps:\/\/youtu.be\/_wD9PgswUVA\r\n\r\n<em>Senior Nicole Chen advertises the Get Involved Internship Program. Applications are due Oct. 9.<span style=\"font-weight: 400;\"> \"Students should sign up for these internships because it will provide them with amazing mentors who can be role <\/span><span style=\"font-weight: 400;\">models<\/span><span style=\"font-weight: 400;\">,<\/span>\" Chen said. \"<span style=\"font-weight: 400;\">It also provides students with the experience of working professionally alongside adults and give them a taste of the workforce.<\/span>\"<\/em>\r\n\r\nCurrently there are no set time commitments and each internship requires a different amount of work, according to Wang. Hours utilized while working on the internships may be counted towards the 15-hour Living Skills graduation requirement, the President’s Community Service Award or general transcript recognition.\r\n\r\nParticipating in extracurriculars such as internships are a great experience for students and provide an opportunity for discovering their interests, according to Wang.\r\n\r\nTo fill out an application, students can obtain application forms from the <a href=\"http:\/\/www.getinvolvedpa.com\/internships.html\">Get Involved Website<\/a> and email the completed forms to getinvolvedpaloalto@gmail.com. Different positions have different required forms.\r\n\r\nAccording to the website, students are advised to sign up soon, as there are a limited number of positions.\r\n\r\nThe program’s core staff is comprised of Palo Alto and Gunn high school students who began working on the structure of the program this summer under the guidance of PAUSD Community Service and Career Adviser Christina Owen.\r\n\r\n“We worked hard over the summer contacting different organizations, brainstorming ideas and planning out the program to make this all possible,” committee member and junior Vivian Wu said. “We want to provide students with a source of opportunity and we’re hoping for a good student turnout.”\r\n\r\nVisit the <a href=\"getinvolvedpa.com\">Get Involved website<\/a> and contact Christina Owen at getinvolvedpaloalto@gmail.com for more information.","excerpt":"The deadline to apply to the Get Involved Internship Program, an organization dedicated to providing Palo Alto Unified School District students with meaningful community service opportunities, is approaching Oct. 9.","date":"2015-10-06 20:44:09","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSCN0437-11.jpg","categories":["News","Spotlight"],"tags":["allison","Award","candace","christina","Community","get","getinvolved","hours","internships","involved","jeanette","kim","minyoung","misner","opportunities","owen","PAUSD","president's","priya","Service","transcript","vivian","Wang","wong","wu","Zhang"]},{"id":109171,"title":"Deceptive flyer distributed, event proceeds as scheduled","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/deceptive-flyer-distributed-event-proceeds-as-scheduled\/","content":"The Palo Alto High School administration is not taking any action in response to the distribution of a deceptive promotional flyer, according to Assistant Principal Jerry Berkson.\r\n\r\nFinancial advising organization <a href=\"intowealth.com\" target=\"_blank\">IntoWealth<\/a> mailed flyers to Palo Alto families recently, promoting its workshop “Slashing College Costs\" to provide insight in applying for financial aid. The company rented a space in the Paly library for the workshop, but the event is not associated with the school, Berkson said.\r\n\r\nThe distributed flyer includes several deceptive components that imply Paly's affiliation to the event, according to Assistant Principal Victoria Kim.\r\n\r\n“First of all, it’s printed on a piece of green paper – the school color,” Kim said. “The return address here [on the top left corner of the flyer] says '@ Paly.' The image on the back says 'Important Parent Meeting.' And then when you open it, it has a picture of our school sign. Then, it says the location is at Palo Alto High School. Obviously, they [the organizer] can’t change that because they’ve rented our facilities, but I think all of those elements in combination make it seem like the flyer was sent from the school.\"\r\n\r\n[caption id=\"attachment_109173\" align=\"aligncenter\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/final-in-text.jpg\"><img class=\" wp-image-109173\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/final-in-text.jpg\" alt=\"A Palo Alto High School student bikes past the Paly sign located at the intersection of Churchill Avenue and Castilleja Avenue before school. The school sign, one that does not have legal trademark according to Assistant Principal Jerry Berkson, was featured on a flyer .. “I think what he [the organizer of the event] did was deceptive in nature and I didn’t like it,” Assistant Principal Vicki Kim said. Photo by Jeanette Wong.\" width=\"615\" height=\"394\" \/><\/a> A Palo Alto High School student bikes past the Paly sign located at the intersection of Churchill Avenue and Castilleja Avenue before school today. The school sign, which is not trademarked, according to Assistant Principal Jerry Berkson, was featured on a flyer for an event that isn't affiliated with Paly. “I think what he [the organizer of the event] did was deceptive in nature and I didn’t like it,” Assistant Principal Victoria Kim said. Photo by Jeanette Wong.[\/caption]IntoWealth College Planning Specialist and \"Slashing College Costs\" co-organizer Wynn Yin says the implications were not intended.\r\n\r\n\"It was never our intention to imply that it [the workshop] was in any way Paly-sponsored or Paly-endorsed,\" Yin said. \"Having reviewed the flyer, we noticed that it is quite understandable that, simply by nature of the event being held at Paly, recipients might come to the aforementioned conclusion.\"\r\n\r\nAccording to Berkson, the initial chief concern of the incident was how the organizer retrieved personal information of Paly students. Berkson added that there are companies that have mailing lists of households of certain demographics, which is how the organizer was able to mail the flyers out.\r\n\r\n“Legally, the Paly sign or logo isn’t trademarked or anything,” Berkson said. “He [the organizer] didn’t do anything illegal. But whether it’s unethical or not? If you ask 10 different people, you’ll get 10 different opinions. I look at it from a more business perspective.\"\r\n\r\nAfter the flyer caught the attention of Paly administration, Berkson and IntoWealth resolved the issue over the phone.\r\n\r\n\"We have discussed with Mr. Berkson, and have agreed that in the future, should we do this again, we will minimize any potential confusion by not using a likeness of the school sign and adding a disclaimer that the workshop is not endorsed or sponsored by Paly,\" Yin said.\r\n\r\n[caption id=\"attachment_109271\" align=\"alignright\" width=\"338\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG.jpg\"><img class=\" wp-image-109271\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/IMG.jpg\" alt=\"cvlkmxlvkdf \" width=\"338\" height=\"439\" \/><\/a> Palo Alto families received this flyer for a college workshop at Paly. Some believe aspects of the flyer imply Paly affiliation or endorsement, prompting an email from the Paly guidance department to upperclassmen. \"We are sorry to see that this flyer was  sent out and made to look like it came from the school,\" the email states. \"[We] want to be clear that we do not support the workshop.\" Flyer by IntoWealth.[\/caption]Because the organizer is legally not at fault, the administration is not inflicting any consequences to the organizer for distributing the flyers, Berkson said.\r\n\r\nUpon discovering the flyer, the guidance department sent an email to junior and senior families, clarifying that “Slashing College Costs” is not a Paly sponsored event.\r\n\r\n“We are writing to inform you that this workshop is not affiliated or endorsed by Palo Alto High School,” the email states. “We are sorry to see that this flyer was sent out and made to look like it came from the school but want to be clear that we do not support the workshop.”\r\n\r\nThe college-help workshop, held at 7 p.m. on Tuesday, achieved its desired result, according to Yin.\r\n\r\n\"The workshop turnout was very good and in our opinion a success,\" Yin said. \"The spirit and mission behind the workshop at Paly was that it was intended as a community outreach initiative. ... We received some great verbal feedback and many people stayed afterwards to ask questions.\"\r\n\r\nAccording to Yin, this was the first time IntoWealth has hosted a workshop at Paly, but the company generally conducts workshops all over the Bay Area, including the lecture hall at its main office, other high school campuses and test preparation centers.\r\n\r\nIncidentally, the Palo Alto Unified School District has recently implemented a policy which states PAUSD will no longer rent school campuses to for-profit organizations for college counseling and standardized testing preparation. According to Berkson, the new policy came into effect before the controversy surrounding the flyer, but after the organizer's contract was signed. PAUSD's decision was made independent of this incident. However, this coincidence prompted concern from some people, Berkson said.\r\n\r\n“We [the administration] received a phone call from a parent about the workshop saying, 'Hey I thought you didn’t do this [host events by for-profit organizations on campus] anymore,'” Berkson said. “I had to explain to them that the organizer's contract was signed before this whole thing.\"","excerpt":"Following a college-help organization's distribution of a deceptive promotional flyer, which included the Palo Alto High School sign for a non-school-affiliated event, the administration is not taking any action.","date":"2015-10-06 20:23:23","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/final-featured-image.jpg","categories":["News","Spotlight"],"tags":["admin","college help","college workshop","deceitful","deceptive","financial aid","flyer","fraudulous flyer","jerry berkson","palo alto high school","scandal","victoria kim"]},{"id":108670,"title":"Alumnus composes music for fall production","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/alumnus-composes-music-for-fall-production\/","content":"Professional actor, composer and Palo Alto High School alumnus Jonathan Shue, Class of 2001, is collaborating with students to create original music for the theater department's fall show, \"The Odyssey\".\r\n\r\nStudents are working with the framework of previous music composed for a production of the Odyssey at Monta Vista High School to create a contemporary musical accompaniment, according to Shue.\r\n\r\n“When I compose music for plays like this, where we have actors who aren't necessarily trained musicians, it's important to me that the music comes from their heart and soul and that they have a hand in the creative process,” Shue said.\r\n\r\n[caption id=\"attachment_109398\" align=\"alignright\" width=\"468\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/12092197_914983975244358_742084578_n.jpg\"><img class=\"wp-image-109398\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/12092197_914983975244358_742084578_n.jpg\" alt=\"12092197_914983975244358_742084578_n\" width=\"468\" height=\"351\" \/><\/a> Actors rehearse for the Odyssey, Paly Theater's fall production, outside the Haymarket. \"The Odyssey\" will begin showing at the Haymarket Theatre August 25-27. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\nAccording to Shue, music is central to \"The Odyssey,\" but the author of the play, Mary Zimmerman, doesn't specify in what way. This means every production is extremely different, and each musical director can add his or her own creative spin to tell the story.\r\n\r\n“We're creating music that's completely unique to this production, and comes directly from the talent in the room,” Shue said.\r\n\r\nThe musical composition incorporates an assortment of different instruments, including piano, violin, saxophone and bajo sexto, a Mexican twelve-stringed instrument, as well as singing.\r\n\r\n“The music for this production doesn't fit nicely into a genre because it uses anything and everything to tell the story,” Shue said.\r\n\r\nJunior Music Director Edward Park is incorporating Shue’s compositions into the sound design and overseeing how the music fits together.\r\n\r\n“I'm taking Jonathan [Shue's] music and transcribing it and arranging it to suit the needs of the show,\" Park said. \"I'm not doing this on my own, but I have the most contact with Jonathan [Shue] at this point.”\r\n\r\nThe process takes place over email and text because Shue is working long distance, according to theater teacher and director Kathleen Woods.\r\n\r\n“It’s a very cooperative process,” Woods said.\r\n\r\nAccording to Park, on a day-to-day basis, he observes the show, takes notes on what cues are needed and sees how each musical piece will fit into each scene.\r\n\r\n“I'll adapt what music we have and potentially write a couple of lines to suit the scene,” Park said.\r\n\r\nShue grew up doing theater and music in Palo Alto and was involved in Paly theater for all four years of high school.\r\n\r\nHe now works as a professional actor and composer in Seattle, Washington. Shue recently finished a production of \"<a href=\"http:\/\/www.soundtheatrecompany.org\/2015-sound-theatre-seattle-season-now-showing\/indian-ink\/\">Indian Ink,<\/a>\" a unique drama which follows an English poet though her adventure in India, written by Tom Stoppard. The company that he performed the show with was started by Paly graduates as well, according to Shue.\r\n\r\nShue currently plays the drums for \"<a href=\"http:\/\/www.thehorseinmotion.org\/upcoming\/\">Brecht Fest in Pikes Place Market<\/a>\" in Seattle.\r\n\r\nNext, he will work on a project with the University of Washington for its Drama School’s 75th Anniversary.\r\n\r\n“I'm humbled to be part of it,” Shue said.","excerpt":"Professional actor, composer and Palo Alto High School alumnus Jonathan Shue ('01) is collaborating with students to create original music for the theater department's fall show, \"The Odyssey\".","date":"2015-10-06 19:50:27","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/12092197_914983975244358_742084578_n.jpg","categories":["Features","Spotlight"],"tags":["alum","compose","Edward Park","Fall","fall show","haymarket","Jonathan Shue","Kimberly Woods","Mary Zimmerman","music","Odyssey","paly theater","production","theater"]},{"id":109253,"title":"Tuesday Tunes: Russell Star-Lack","permalink":"http:\/\/palyvoice.com\/2015\/10\/06\/tuesday-tunes-russell-star-lack\/","content":"[caption id=\"attachment_109309\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/FullSizeRender-1.jpg\"><img class=\"wp-image-109309\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/FullSizeRender-1.jpg\" alt=\"\" width=\"650\" height=\"488\" \/><\/a> Senior Russell Star-Lack sat down with The Paly Voice to discuss his passion for music. Not only is Star-Lack a devoted listener, he also a skilled guitar player and singer. Photo by Nika Woodfill.[\/caption]\r\n\r\nIn this week's edition of Tuesday Tunes, The Paly Voice sat down with accomplished guitarist and RAJ band member senior Russell Star-Lack to ask how music has impacted his life.\r\n\r\nAccording to Star-Lack, who primarily plays guitar and sings, music helps him relieve the stress that comes with being a student.\r\n\r\n“I listen to it [music] constantly, I play it constantly, I write it constantly,” Star-Lack said. “It is the best way for me to deal with stress. If I have an issue, I might write a song about it or find one I can relate to, and it will help me deal with stuff.\"\r\n\r\nStar-Lack grew up around music and fell in love with it at an early age.\r\n\r\n“My dad played guitar, and I thought that was really cool,” Star-Lack said. “When I was six, I was in the car with my mom and [Eric Clapton's] 'Layla' came on the radio and I thought, ‘Oh my God, this is awesome. I want to do that.’ And that's  really what got me started playing music.”\r\n\r\nStar-Lack loves to find his inspiration from classic blues and rock legends.\r\n\r\n“My favorites are Eric Clapton and all the great guitar guys — Hendrix, the Allman brothers and Jimmy Page with Led Zeppelin,” Star-Lack said. “For blues, Muddy Waters, Robert Johnson, Howlin’ Wolf, BB King, Albert King, Freddie King, Stevie Ray Vaughan and Gary Clark Jr. All these guys are great and not appreciated enough.”\r\n\r\nStar-Lack in particular loves blues for the raw emotion in its lyricism.\r\n\r\n“Blues is really where it's at for me,” Star-Lack said. “There’s just something about the emotion in blues. It's oftentimes not as technically as advanced, but there's just this raw feeling in the lyrics that really show what was going on in the singer's mind at the time.”\r\n\r\nIn his free time, Star-Lack likes to perform with his band RAJ, which are the initials of the other band members, including seniors Arjun Vasudevan and Jeremy Samos.\r\n\r\n“I don’t take a lot of risks in my life, and I think that performing is how I get that feeling,\" Star-Lack said. \"It’s addictive. I feel like I can express myself a lot better when I’m performing in front of my friends, people who know or don’t know me, than if I’m just talking. I’m very introverted, and it’s kind of fun to be the exact opposite, to play guitar behind your head and sing really loud and just be crazy and have fun.”\r\n\r\nAccording to Star-Lack, it’s important for people to expand their horizons and discover the world that music has to offer.\r\n\r\n“I encourage people to at least try, or listen to different kinds of music,” Star-Lack said. “I consider myself a listener of music even more than I am a player of it. So even just listening to stuff you don’t normally listen to and challenging yourself can really help broaden perspectives and maybe even help learn more about the world.”\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3A1216334347%3Aplaylist%3A7As6tRWJbyWOptsYhbTR6j\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"In this week's edition of Tuesday Tunes, The Paly Voice sat down with accomplished guitarist and RAJ band member senior Russell Star-Lack to ask how music has impacted his life.\r\n","date":"2015-10-06 11:36:33","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/FullSizeRender-1.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":["Arjun Vasudevan","Blues","Guitar","Jeremy Samos","music","RAJ","Rock","Russell Star-Lack","Tuesday Tunes"]}]