[{"id":104127,"title":"Liveblog: Boys&#8217; Lacrosse SCVAL semifinals vs Mountain View","permalink":"http:\/\/palyvoice.com\/2015\/05\/13\/liveblog-boys-lacrosse-scval-semifinals-vs-mountain-view\/","content":"<address>The Palo Alto High School boys' lacrosse team <span style=\"font-weight: bold;\"> (<\/span>16-9-1, 5-6) will face Mountain View High School Spartans (15-12<span style=\"font-weight: bold;\"> , <\/span>5-4) in the Santa Clara Valley Athletics League semi finals at 7:30 p.m. on the Paly lacrosse field. Check back here for live coverage. <\/address>[liveblog]","excerpt":"The Palo Alto High School boys' lacrosse team  (16-9-1, 5-6) will face Mountain View High School Spartans (15-12 , 5-4) in the Santa Clara Valley Athletics League semi finals at 4 p.m. on the Paly lacrosse field.","date":"2015-05-13 15:24:04","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_24671.jpg","categories":["lacrosse","Sports"],"tags":{"8537":"Boys","8836":"Lacrosse","9078":"scval","44120":"semifinal"}},{"id":103986,"title":"Preview: Girls&#8217; lacrosse takes on Saratoga in SCVAL semi-finals tomorrow","permalink":"http:\/\/palyvoice.com\/2015\/05\/12\/preview-girls-lacrosse-takes-on-saratoga-in-scval-semi-finals-tomorrow\/","content":"The Palo Alto High School girls' lacrosse team (16-1, 12-0) will play the Saratoga High School Falcons (6-8, 6-6) in the semi-final match of the Santa Clara Valley Athletic League (SCVAL) playoffs at 5:30 p.m. tomorrow at the Paly lacrosse field.\r\n\r\nThe winner of this game will go on to play the winner of the Gunn (13-4, 10-2) versus Leland (10-5, 7-5) semi-final in the final at 11 a.m. on Saturday at Paly.\r\n\r\nAfter beating the Falcons by significant margins in the teams' last two matches, 15-6 and 10-7, junior Meredith Kinnaman looks forward to playing Saratoga again.\r\n\r\n\"It's really hard to beat teams three times in a row, but we did win both previous games against Saratoga,\" Kinnaman said. \"I think it's going to be important to come out hard, because they're going to be gunning for us because of this history.\"\r\n\r\nDespite this competition, Kinnaman stays optimistic.\r\n\r\n\"I feel pretty confident going into the game,\" Kinnaman said. \"I think that if we just work as a team and play our game then we shouldn't have a problem advancing to the finals.\"\r\n\r\nA Viking victory in the upcoming game will be heavily attributed to strong defense, according to Kinnaman.\r\n\r\n\"We've been working on defensive plays this entire season,\" Kinnaman said. \"This should be a good test for what we've learned.\"","excerpt":"The Paly girls' lacrosse team will play Saratoga at 7 p.m. tomorrow at home for the semi-finals of the SCVAL playoffs.","date":"2015-05-12 21:33:29","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030213_0193.jpg","categories":["lacrosse","Sports"],"tags":{"8736":"girls' lacrosse","12016":"lax","43332":"meredith kinnaman","9063":"saratoga","9078":"scval","43957":"varsity girls lax"}},{"id":103935,"title":"Slideshow: Softball falls to Mountain View on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/12\/slideshow-softball-falls-to-mountain-view-on-senior-night\/","content":"The Palo Alto High School girls’ softball team (14-12, 4-7) lost to Mountain View High School (19-7, 11-1) 10-2 in its final <a href=\"http:\/\/palyvoice.com\/2015\/05\/08\/preview-softball-to-host-mountain-view-on-senior-night\/\">home game of the season Friday<\/a>.\r\n\r\nThe Lady Vikes celebrated Senior Night before the game, paying tribute to senior infielder Julianna Heron, senior right fielder Maddy Jones, senior center fielder Kabria Dame and senior left fielder Autumn Macareno.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A0CAFjMtWC4Q\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls’ softball team (14-12, 4-7) lost to Mountain View High School (19-7, 11-1) 10-2 in its final home game of the season Friday.","date":"2015-05-12 20:57:47","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/featuredimage.jpg","categories":["Sports"],"tags":{"8734":"girls","29989":"mountain view","9087":"Senior Night","18372":"softball"}},{"id":103927,"title":"Tuesday Tunes: Edward Kwiatkowski","permalink":"http:\/\/palyvoice.com\/2015\/05\/12\/tuesday-tunes-edward-kwiatkowski-2\/","content":"[caption width=\"300\" id=\"attachment_104090\" align=\"aligncenter\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_5292.jpg\"><img class=\"size-full wp-image-104090\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_5292.jpg\" alt=\"Edward Kwiatkowski sings along with the other Heartbreakers at the Pop Concert. Kwiatkowski started singing in sixth grade. Photo by Alex Merkle-Raymond.\" width=\"300\" height=\"225\"><\/a> Edward Kwiatkowski sings along with the other Heartbreakers at the Pop Concert. Kwiatkowski started singing in sixth grade. Photo by Alex Merkle-Raymond.[\/caption]This week, The Paly Voice talked with senior Edward Kwiatkowski about his favorite music. Kwiatkowski is pursuing a&nbsp;<span style=\"color: #141823;\">bachelor's of music degree in performance guitar at the Los Angeles College of Music.&nbsp;<\/span>\n\n\"I joined choir in sixth grade but I picked up a guitar when I was 13, so the summer of seventh grade. I've been playing for five years now,\" Kwiatkowski said. \"My favorite song to play on the guitar is probably 'Had to Cry Today' by Blind Faith. Music is pretty much most of what I dedicate my time and focus to. There aren't many other things I can think of that come before music for me.\"\n\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Aclairekrugler%3Aplaylist%3A7pw8rGhhybOSH85ZkVkE2l\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>\n\n<span style=\"color: #373e4d;\">Wuthering Heights — Kate Bush <\/span>\n\n<span style=\"color: #373e4d;\">Moonage Daydream — David Bowie <\/span>\n\n<span style=\"color: #373e4d;\">Bang Bang — Monophonics <\/span>\n\n<span style=\"color: #373e4d;\">Lay Lady Lay — The Byrds <\/span>\n\n<span style=\"color: #373e4d;\">Fool Yourself — Little Feat <\/span>\n\n<span style=\"color: #373e4d;\">Red Rain — Peter Gabriel <\/span>\n\n<span style=\"color: #373e4d;\">I Want to Take You Higher — Sly and the Family Stone <\/span>\n\n<span style=\"color: #373e4d;\">Blues Dance Raid — Steel Pulse <\/span>\n\n<span style=\"color: #373e4d;\">Has He Got a Friend for Me — Richard Thompson <\/span>\n\n<span style=\"color: #373e4d;\">Tell Me Something Good — Chaka Khan and Rufus<\/span>","excerpt":"This week, The Paly Voice talked with senior Edward Kwiatkowski about his favorite music. Kwiatkowski is planning get bachelor's of music degree in performance guitar at the Los Angeles College of Music. Read on to hear his ten favorite songs.","date":"2015-05-12 18:40:27","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/IMG_9756.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":{"44054":"bang bang","44062":"blues dance raid","44067":"chaka khan and rufus","44053":"david bowie","43841":"edward kwiatkowski","44064":"has he got a friend for me","44060":"i want to take you higher","44051":"kate bush","44056":"lay lady lay","44055":"monophonics","44052":"moonage daydream","44059":"peter gabriel","44058":"red rain","44065":"richard thompson","44061":"sly and the family stone","44063":"steel pulse","44066":"tell me something good","44057":"the byrds","42416":"Tuesday Tunes","44050":"wuthering heights"}},{"id":104016,"title":"Admin delegates new staff positions for 2015-16","permalink":"http:\/\/palyvoice.com\/2015\/05\/12\/admin-delegates-new-staff-positions-for-2015-16\/","content":"Palo Alto High School will have both new and familiar faces on campus for the 2015-16 school year, according to a <a href=\"https:\/\/drive.google.com\/file\/d\/0B0qxzJ7ofPezdm9IczFCNlZEaDJFY09weHMzYlVJQjJQbnBn\/view?pli=1\">staff position<\/a> announcement at the Site Council meeting yesterday.\r\n\r\nThe changes include math teacher <a title=\"Kathi Bowers to replace Jason Fung as athletic director\" href=\"http:\/\/palyvoice.com\/2015\/05\/05\/kathi-bowers-to-replace-jason-fung-as-athletic-director\/\" target=\"_blank\">Kathi Bowers as athletic director<\/a>; math teacher Suzanne Antink as the PAUSD Teacher on Special Assignment for Math Common Core State Standards; and veteran Physical Education teacher Peter Diepenbrock as head boys’ varsity basketball coach. In addition to assigning new teachers, school administrators have also delegated new counselors and other sports coaches.\r\n\r\nPrincipal Kim Diorio is confident about all the new hires.\r\n\r\n“I think we’ve done an exceptional job just getting real quality people in the right positions,” Diorio said.\r\n\r\nDiorio says Bowers, as the new athletic director, will bring great ideas to the future of athletics at Paly.\r\n\r\n“Ms. Bowers has worn many hats in our community: as a parent, as a coach, as a teacher, as a teacher advisor and as a fan,” Diorio said.\r\n\r\nAntink will be leaving the math department to join the district office. Math Instructional Supervisor Radu Toma said that Antink's departure, along with the significant math course-drop from Bowers, will force the department to make some structural changes.\r\n\r\n“Existing teachers would take on higher loads,\" Toma said. \"We’ve lost some periods so overall we’re not going to hire anybody brand new. … There are part-time people who will take a higher number of courses next year than they did this past year, and there may be a couple of teachers who have been on maternity leave who may be returning for a couple of periods.\"\r\n\r\nToma also noted that Antink's departure will be a huge loss, because as a teacher, she played a large role in designing, improving and refining classes in the department. However, Antink will not completely lose contact with her Paly roots.\r\n\r\n“We hope to still have her around for quite a bit next year because her job at the district is going to be mentoring and assisting math teachers in the district with the implementation of Common Core and alignment and math-related issues,\" Toma said.\r\n\r\n[caption id=\"attachment_97201\" align=\"alignright\" width=\"333\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0472.jpg\"><img class=\" wp-image-97201\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0472.jpg\" alt=\"Paly Principal Kim Diorio stands outside of the Tower Building. Diorio is wearing red and black today in support of Gunn High School. Diorio and ASB worked to create a list of ways to reduce academic stress and improve the school climate. Photo by George Lu.\" width=\"333\" height=\"212\" \/><\/a> Principal Kim Diorio stands outside of the Tower Building. Diorio and other administrators have worked to hire new staff members for the 2015-16 year starting in January. Photo by George Lu.[\/caption]\r\n\r\nThis year, social studies teacher Eric Bloom was a TOSA for School Climate. For the 2015-16 year, the job will be split between him and science teacher Josh Bloom. Eric Bloom will focus on school climate committee, Not In Our Schools week, working with the parent community and Challenge Success. <a href=\"http:\/\/www.challengesuccess.org\/\">Challenge Success<\/a> is an initiative to help parents and schools raise healthy, motivated children beyond the classroom by providing students with practical, research-based tools.\r\n\r\nJosh Bloom will focus on working with mindfulness in the classroom and looking at opportunities to add some social and emotional curriculum into advisory.\r\n\r\n“What we’re doing is also happening across town at Gunn [High School],” Diorio said. “They’re also hiring a social and emotional learning TOSA. We’re making sure that between the two high schools, the structure is very similar, so they can cross collaborate between schools.”\r\n\r\nBrian Wilson, a Michigan high school journalism teacher, will be joining the journalism department.\r\n\r\n“We recruited him from Michigan and he’s super qualified and experienced in journalism,” Diorio said. “I think he’ll fit right in with our world-class journalism program.”\r\n\r\nAccording to Diorio, two special education teachers, Brooke O’Donnell and Ruth Theuri, have also been hired from nearby schools. They are from Carlmont High School and Cupertino High School respectively.\r\n\r\nDiepenbrock will be returning as the boys’ varsity basketball head coach.\r\n\r\n“I’m excited to have Coach Diepenbrock back,\" Diorio said.\"He’s a huge gain for our school.”\r\n\r\nFormer junior varsity volleyball coach Jekara Wilson will become the varsity coach.\r\n\r\nThe hiring process began as early as January this year with Diorio expecting the entire hiring process to conclude either by the end of this week or the beginning of next week.\r\n\r\n“We’ve been really lucky to be able to attract and recruit and hire some really exceptional teachers,” Diorio said. “I hope that the teachers someday become real leaders on this campus.”\r\n\r\nBelow is a list of the new and continuous staff positions for the 2015-2016 school year.\r\n\r\nAthletic Director: Kathi Bowers\r\nInstructional Supervisor (Science): Kelli Hagen\r\nJournalism and Yearbook: Brian Wilson\r\nSpecial Education: Brooke O’Donnell, Ruth Theuri\r\nMental Health Therapist: Jonathan Frecerri\r\nVarsity Boys’ Basketball Coach:­ Peter Diepenbrock\r\nVarsity Volleyball Coach: Jekara Wilson\r\nPAUSD Math CCSS TOSA: Suzanne Antink\r\nTOSA School Climate: Eric Bloom\r\nTOSA Professional Learning Kindel Launer\r\nTOSA WASC\/PCL: Emily Garrison\r\nTOSA Digital Learning: Mindy Steiner\r\nTOSA Technology Specialist: Paul Hoperich\r\nTOSA Social Emotional Learning: Josh Bloom","excerpt":"Palo Alto High School will have both new and familiar faces on campus for the 2015-16 school year, according to a staff position announcement at the Site Council meeting yesterday. The changes include math teacher Kathi Bowers as Athletic Director, math teacher Suzanne Antink as the PAUSD Teacher on Special Assignment for Math Common Core State Standards and Peter Diepenbrock as head boys’ varsity basketball coach.","date":"2015-05-12 16:16:34","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0472.jpg","categories":["News","Spotlight"],"tags":{"44048":"2015-16","8458":"administration","8644":"diorio","44049":"new staff","8944":"palo alto high school","8953":"paly","9123":"Staff","9152":"teachers"}},{"id":103422,"title":"Slideshow: Pet-a-Palooza; Celebrity pugs and dog fashion shows","permalink":"http:\/\/palyvoice.com\/2015\/05\/12\/slideshow-pet-a-palooza-celebrity-pugs-and-dog-fashion-shows\/","content":"Large white tents along the perimeter of Town and Country Village billow in the wind and colorful balloons decorate the entrance. The air is filled with the sound of dogs barking, as dog and owners alike mingle under the hot sun and enjoy the festival's multiple attractions.\r\n\r\nPet-a-palooza, an enormous dog festival, drew in a large crowd of dog lovers and their canine friends to benefit the Friends of the Palo Alto Animal Shelter and have fun doing it on Saturday, April 25 at Town and Country Village.\r\n\r\nThe attractions included a pet sketch artist, pet psychic, pet CPR demonstrations, pet photos and other great pet resources.\r\n\r\nThe main attraction of the day was the \"Strut Your Mutt Spring Fashion Show\". Dogs of all sizes competed in this event, modeling cute accessories and colorful outfits.\r\n\r\nThe winners of the fashion show were two pugs named Matti and Minnie. The owners were excited for the win but this was by no means their first competition, according to Matti’s owner, Jae Chang.  The two pugs have competed together in various fundraising events across the Bay Area and have gained popularity, with Minnie and Matti having close to 900,000 and over 30,000 likes on their Facebook pages respectively.\r\n\r\nThe dogs Matti and Minnie always sport homemade, comfortable garments, often embellished with their names. Chang custom-makes the dresses and outfits for both of the dogs out of fabric and harnesses.\r\n\r\n“People say on Facebook she [Matti] has more clothes than I do,” Chang said.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AgPAKis7MJB7\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Pet-a-palooza, an enormous dog festival, drew in a large crowd of dog lovers and their canine friends to benefit the Friends of the Palo Alto Animal Shelter and have fun doing it, Saturday April 25 at Town and Country Village.","date":"2015-05-12 13:50:36","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11128435_841505152592241_2146685_n.jpg","categories":["News","Uncategorized"],"tags":{"43376":"dogs","8939":"palo alto","37390":"palo alto high shcool","43375":"pet-a-palooza","9107":"slideshow","9179":"Town and Country"}},{"id":103781,"title":"Paper Islands&#8217; second album showcases distinctive electro-indie sound","permalink":"http:\/\/palyvoice.com\/2015\/05\/12\/paper-islands-second-album-showcases-distinctive-electro-indie-sound\/","content":"The Palo Alto High School musical duo, Paper Islands, plans to release its second extended play album entitled \"Polygon Tides EP\" at 8 p.m. today.\r\n\r\nSeniors Fabo Garduño and Sally Wang formed Paper Islands last spring, and have since produced a <a href=\"http:\/\/palyvoice.com\/2014\/09\/25\/listen-to-the-sounds-of-the-sea-with-paper-islands-debut-ep\/\">debut EP album<\/a> entitled \"The Striped Sea EP\" and performed at several live events, including Teen Arts Council Open Mic events and Angelicas, a Redwood City dining and entertainment venue. The duo has gained a fan base both inside the Paly community and out, attracting listeners with its electro-indie sound. Paper Islands' Facebook fanpage has gained more than 400 followers, and several of its songs on Soundcloud, <span style=\"color: #222222;\">an online audio distribution platform, have reached nearly 2,000 plays.<\/span> \"Polygon Tides EP\" features four tracks: \"<span style=\"color: #222222;\">∆\", \"Tetra\", \"Lønely\" and \"Okay.\"<\/span>\r\n\r\n<span style=\"color: #222222;\">According to the duo, \"Polygon Tides EP\" has been in the works since October 2014. Th<\/span>e duo released \"Tetra\" as a single in late April after an extended Facebook publicity campaign using statuses, teaser videos and distorted artwork.\r\n\r\nIn creating \"Polygon Tides EP,\" Paper Islands does not fall short of its high expectations, with innovative electric sounds featured in every track. Each track on the album stands out on its individual merits, but combined together they create an impressive, cohesive style. The overall flow of the tracks provides an interesting blend of electronic music and indie music, giving the songs and style distinct character.\r\n\r\nThe album begins with \"<span style=\"color: #222222;\">∆,\" a minute-and-a-half-long track that features a blend of natural sounds like breathing and water, as well as electric melodies. The track opens the album in an eerie-yet-powerful way, and effectively entices the listener to delve into the rest of the album. <\/span>\r\n\r\nFollowing \"<span style=\"color: #222222;\">∆\" is \"Tetra,\" a single that reached more than 450 listens on <a href=\"https:\/\/soundcloud.com\/paper-islands\/tetra\">Soundcloud<\/a>. Of all the tracks on the album, \"Tetra\" features the most impressive lyrics. The words, delivered with a powerful rhythm and melody, tell the story of a love \"smashed in the ground.\" Wang's vocals blend with a wide variety of synthetic sounds to create a memorable tune that will undoubtedly leave fans humming for several days.<\/span>\r\n\r\n\"Lønely\" is perhaps the most vocally impressive track on the album. The song opens with a soft acoustic guitar, which continues underneath Wang's powerful voice. The track questions what it really means to support another person, asking, \"If I turn into the sea, will you be there with me?\" Wang's vocal tonality beautifully conveys a captivating message of longing and sadness.\r\n\r\nThe name of the final track, \"Okay,\" does not justly describe the song, because it is perhaps the most novel and interesting song on the EP. \"Okay\" opens with a fusion of ambient noises, including indistinguishable voices and what sounds like a game of pool, which then proceeds into heavy electronic beats and sounds with sad vocals about a relationship that is not in fact \"okay.\" This track showcases both strong vocals and instrumental melodies most effectively out of all of the songs on the album, with all elements coalescing to express the melancholic quality of the song. The track ends with the sound of a thunderstorm.\r\n\r\nAccording to Garduño, \"Polygon Tides EP\" will provide fans of the band with a recognizable yet original collection of songs.\r\n\r\n\"I think people can expect a familiar sound that they've heard from our past stuff, with a new twist on it,\" Garduño said. \"We like all of the geometric patterns, so that's where 'Polygons' came from. 'Tides' was because we still really like the ocean.\"\r\n\r\nThe album does indeed feature several water motifs, keeping in line with the group's oceanic themes. \"<span style=\"color: #222222;\">∆\" emphasizes the sound of running water, \"Lønely\" uses lyrics about the sea to allude to a broader message of being lost, and the sound of dripping water can be heard on \"Okay.\"<\/span>\r\n\r\n[caption id=\"attachment_103939\" align=\"alignleft\" width=\"318\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11216301_821755804560248_325488987_n.jpg\"><img class=\"wp-image-103939\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11216301_821755804560248_325488987_n.jpg\" alt=\"The album artwork for &quot;Polygon Tides EP&quot; features geometric distortion set against a forest backdrop. Artwork courtesy of Paper Islands.\" width=\"318\" height=\"318\" \/><\/a> The album artwork for \"Polygon Tides EP\" features geometric distortion set against a forest backdrop. Artwork courtesy of Paper Islands.[\/caption]\r\n\r\nThe album will be available for download on <a href=\"https:\/\/paperislands.bandcamp.com\/album\/polygon-tides-ep\" target=\"_blank\">Paper Islands' bandcamp<\/a>, with a s<span style=\"color: #000000;\">et-your-own price policy, allowing fans to donate to the group. Paper Islands may make its songs available to the public through Spotify, although these plans are uncertain, according to Garduño.<\/span>\r\n\r\nFollowing the release of their second EP, Garduño and Wang also plan to release a music video for a song off the new album. Senior Jack Brook collaborated with Paper Islands to produce the video, which premiered at Teen Arts Council's <a href=\"https:\/\/luminescencefilmfestival.wordpress.com\/2014\/10\/26\/about-luminescence\/\">Luminescence Film Festival<\/a> on April 17.\r\n\r\n\"The goal is to release the music video shortly after the EP, so people are more comfortable with the song that's in the music video,\" Wang said.\r\n\r\nThe duo also plans to throw an EP release party in the near future, but the exact date and time are yet to be determined. According to Garduño, the event may be co-produced by the <a href=\"http:\/\/www.teenartscouncil.org\/\">Teen Arts Council<\/a>, but many difficulties, specifically regarding location, have arisen in planning the event.\r\n\r\n\"It's in the works, and we are going to have a lot of cool surprises,\" Garduño said. \"It will probably be our last show, and we just want to wrap it up and say thanks to everyone who has helped us along the way.\"\r\n\r\nTo download the album, visit the<a href=\"https:\/\/paperislands.bandcamp.com\/album\/polygon-tides-ep\"> Paper Islands' bandcamp<\/a>. To keep up-to-date with news and announcements from<span style=\"color: #000000;\"> Paper Islands check out its  <\/span><a style=\"color: #31318c;\" href=\"https:\/\/www.facebook.com\/paperislands\">Facebook<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"https:\/\/soundcloud.com\/paper-islands\">Soundcloud<\/a><span style=\"color: #000000;\"> and <\/span><a style=\"color: #31318c;\" href=\"https:\/\/www.youtube.com\/user\/paperislands\">Youtube<\/a><span style=\"color: #000000;\">.<\/span>","excerpt":"The Palo Alto High School musical duo, Paper Islands, plans to release its second extended play album entitled \"Polygon Tides EP\" at 8 p.m. today.","date":"2015-05-12 13:49:21","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11169637_841201945968848_4192149422539480849_o.jpg","categories":["Entertainment","Spotlight"],"tags":{"33472":"fabo garduno","43844":"luminescence","43846":"Lønely","43848":"okay","8944":"palo alto high school","8953":"paly","29376":"paper islands","43842":"polygon tides ep","29378":"sally wang","43843":"student band","27176":"teen arts council","43847":"tetra","43845":"∆"}},{"id":103765,"title":"Review: One Acts demonstrate variety, versatility of Theatre department","permalink":"http:\/\/palyvoice.com\/2015\/05\/09\/review-one-acts-demonstrate-variety-versatility-of-theatre-department\/","content":"[caption width=\"581\" id=\"attachment_103888\" align=\"aligncenter\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11204437_707448916068103_6054940195031002152_n.jpg\"><img class=\"wp-image-103888\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11204437_707448916068103_6054940195031002152_n.jpg\" alt=\"A balcony shot of Paly Theatre's adaptation of &quot;No Exit,&quot; directed by Sabrina Sonner. &quot; Photo by Dalia Van Zyll\" width=\"581\" height=\"434\"><\/a> A balcony shot of Paly Theatre's adaptation of \"No Exit,\" directed by Sabrina Sonner, featuring senior Guive Assadi, junior Clara Baker and sophomore Claire Eberhart. \"No Exit\" is the only drama featured in \"One Acts.\" Photo by Dalia Van Zyll.[\/caption]\r\n\r\nAfter two successful performances, the Palo Alto High School Theatre department's \"One Acts\" has its final performance at 7:30 p.m. tonight in the Haymarket Theatre. The showcase highlights versatile student talent in acting, directing and playwriting and the diverse lineup of plays presented make for a fun and engaging evening of theater.\r\n\r\n\"One Acts\" is the theatre department's final showcase of the year, and while it lacks the grandeur of full-length productions, the showcase allows for heavy student involvement, specifically in directing and writing. The night features five one-act plays, all of which are entirely student directed, including a student original, \"The Sphinx,\" written by senior Guive Assadi.\r\n\r\nThe night starts off with \"The Marriage Proposal,\" written by the acclaimed Anton Chekhov and directed by senior Katherine Craig. In it, a man named Ivan, played by freshman Sam Kim, has his marriage proposal to Natalyia, played by senior Riley Cassidy, go horribly wrong due to comical miscommunications. Sophomore Joelle Dong's character acts as both the mother of Natalyia and as the mediator between Natalyia and Ivan. The play features excellent control of difficult language by all three actors, a tribute to the directorial work of Craig, as well as skillful comedic timing by Dong as the mother. While the pace of the play feels a bit rushed at times, the show starts off \"One Acts\" in an exciting fashion.\r\n\r\nThe next play is \"The Auditioners,\" written by Doug Rand, and co-directed by senior Hannah Nguyen and junior Sophie Swezey. The play follows no structured plot. Instead, it features a collection of comical monologues presented to a panel of stern casting directors. The play includes 17&nbsp;actors, by far the largest cast in \"One Acts\", each of whom contribute something unique. Particular standouts include freshman Alexandra Dinu as Auditioner #1, sophomore Chayenne Greenburg as Auditioner #3 and sophomore Jackson Kienitz as Auditioner #10. While the play is well-directed, it feels a bit too long for \"One Acts,\" and could have been easily been trimmed slightly.\r\n\r\nThe next play is an adaptation of \"No Exit,\" written by French playwright Jean-Paul Sartre and directed by senior Sabrina Sonner. The only drama of the night, the plot revolves around three characters: a man named Cradeau, played by Assadi, and two women named Inez and Estelle, played by junior Clara Baker and sophomore Claire Eberhart, respectively. The premise is that their&nbsp;afterlives involve being locked in a room with each other for the rest of eternity. All three actors develop a unique sense of character, and the conflict between Baker and Eberhart's characters is both compelling and effective. While the actors all did a fantastic job, the best aspect of the show is the staging, as it significantly added to the drama of the performance.\r\n\r\n\"The Actor's Nightmare\" is the fourth and final adapted script of the evening, written by Christopher Durang and directed by sophomore Jason Pollak.&nbsp;<span style=\"color: #000000;\"> The protagonist, George, played by sophomore Joey Kellison-Lin, is a man who is unwillingly pushed onto the stage to perform plays such as&nbsp;“Hamlet” and “Private Lives.\" His inexperience leads him to do<\/span><span style=\"color: #000000;\">&nbsp;ridiculous things such as slapping his scene partners, sitting in trash cans, and taking off his pants on the middle of the stage.&nbsp;<\/span>\r\n\r\nThe play leaves a strong impression, as the comedic display is phenomenal. Kellison-Lin's performance as George is both convincing and hilarious and the show as a whole perfectly fits the atmosphere of \"One Acts.\"\r\n\r\nThe last play of the night is \"The Sphinx,\" written by Assadi and directed by senior Oskar Soderberg. A mysterious figure named \"The Sphinx,\" played by junior Zoe Limbrick, comes into a high school student's bedroom and threatens to eat the student's paper unless she completes three tasks. Assadi's comedic writing along with Soderberg's direction helps bring this absurdist tale to life, and effectively ends One Acts on a slightly ridiculous note. While Assadi's script does have a couple jokes that maybe not everybody would understand, the creative original script is the perfect way to end an entertaining evening.\r\n\r\n<span style=\"color: #000000;\">The variety of the plays and the versatility of the Paly Theatre students in \"One Acts\" are impressive and speak to the strength of the department. While \"One Acts\" this year runs fairly long, the various plays are must-sees.<\/span>\r\n\r\n<span style=\"color: #000000;\">\"One Acts\" will play again at 7:30 p.m. tonight in the Haymarket Theater. Tickets cost $5 for students and seniors, and $10 for adults.<\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"After two successful performances, the Palo Alto High School Theatre department's \"One Acts\" has it's final performance tonight at 7:30 p.m. in the Haymarket Theatre. The showcase highlights versatile student talent in acting, directing and playwriting and the diverse lineup of plays presented make for a fun and engaging evening of theater.\r\n","date":"2015-05-09 17:26:10","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/11204437_707448916068103_6054940195031002152_n.jpg","categories":["Entertainment"],"tags":{"43768":"actors nightmare","43766":"auditioners","43767":"no exit","17489":"one acts","8953":"paly","17490":"plays","15393":"showcase","43770":"the marriage proposal","43769":"the sphinx","9159":"theater","9160":"theatre"}},{"id":103866,"title":"SatireDay Cartoon 5","permalink":"http:\/\/palyvoice.com\/2015\/05\/09\/satireday-cartoon-5\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-08-at-8.15.15-PM1.png\"><img class=\"alignright size-full wp-image-103869\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/05\/Screen-shot-2015-05-08-at-8.15.15-PM1.png\" alt=\"Screen shot 2015-05-08 at 8.15.15 PM\" width=\"600\" height=\"425\" \/><\/a>\r\n\r\n<strong>Previous Cartoons<\/strong>\r\n\r\n3\/21\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/21\/satireday-cartoon-4\/\">The Other March Madness<\/a>\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/satireday-cartoon-4.jpg\"><img class=\"aligncenter wp-image-101413 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/satireday-cartoon-4.jpg\" alt=\"satireday cartoon 4\" width=\"600\" height=\"388\" \/><\/a>\r\n\r\n3\/14\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/14\/satireday-cartoon-3\/\">The Tissue Issue<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg\"><img class=\"aligncenter wp-image-101011 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Scan-Feb-19-2015-9_40-PM-page4.jpg\" alt=\"satireday3\" width=\"600\" height=\"388\" \/><\/a>\r\n\r\n3\/7\/15: <a href=\"http:\/\/palyvoice.com\/2015\/03\/07\/satireday-cartoon-2\/\">When WASC Leaves<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\"><img class=\"aligncenter wp-image-100808 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/SDC2.jpg\" alt=\"satireday 2\" width=\"600\" height=\"589\" \/><\/a>\r\n\r\n2\/28\/15: <a href=\"http:\/\/palyvoice.com\/2015\/02\/28\/satireday-cartoon\/\">The No Homework Night<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\"><img class=\"aligncenter wp-image-99225 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/satireday-cartoon.jpg\" alt=\"satireday cartoon\" width=\"600\" height=\"473\" \/><\/a>","excerpt":"Check the latest cartoon.","date":"2015-05-09 11:52:47","author":"Liana Pickrell","categories":["Entertainment"],"tags":{"39025":"cartoon","40209":"humor","8953":"paly","8975":"parking","40208":"satireday"}},{"id":103821,"title":"Preview: Softball to host Mountain View on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/05\/08\/preview-softball-to-host-mountain-view-on-senior-night\/","content":"The Palo Alto High School softball team (14-11, 4-6) will take on Mountain View High School (18-7, 10-1) at 4 p.m. this afternoon at the Paly softball field for the Viking's last league game at home this season.\r\n\r\nThis is the second time the Vikings and the Spartans will go head-to-head. Last time they played, the Vikings fell to Mountain View, 3-4. Since then, Paly has been working hard to improve their technical skills, as well as their team chemistry, in order for it to be a memorable senior night, according to senior captain Julianna Heron.\r\n\r\n\"We have been working a lot on our hitting and also becoming united as a team to do well in this game,\" Heron said.\r\n\r\nThe team has been impacted by the loss of two of their pitchers late in the season, according to junior outfielder Maddy Atwater.\r\n\r\n\"Since we lost our two pitchers, things have been pretty rough,\" Atwater said. \"Going into this game, we are just looking to play hard and finish the game with our heads up.\"\r\n\r\nThe emotions of Senior Night will also be a factor in the team's success this afternoon, according to Heron.\r\n\r\n\"As a senior, I'm excited for the game,\" Heron said. \"It's bittersweet as the season is coming to an end so soon, and I'll be done with Paly softball.\"\r\n\r\nAtwater emphasized the importance of honoring the seniors and their coach as well.\r\n\r\n\"We want to go out there and play for the seniors,\" Atwater said, \"but also play for our coach Bill [Laskey] because of how supportive he's been since they [the two pitchers] quit.\"","excerpt":"The Palo Alto High School softball team (14-11, 4-6) will take on Mountain View High School (18-7, 10-1) at 4 p.m. this afternoon at the Paly softball field for the Viking's last league game at home this season.","date":"2015-05-08 15:35:15","author":"Molly Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030913_02341.jpg","categories":["Sports"],"tags":{"43765":"julianna heron","8861":"maddy atwater","29989":"mountain view","43764":"paly softball","18372":"softball"}}]