[{"id":108775,"title":"Warning! Banned books to make appearance in library","permalink":"http:\/\/palyvoice.com\/2015\/09\/29\/warning-banned-books-to-make-appearance-in-library\/","content":"[caption id=\"attachment_108786\" align=\"alignright\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2941.jpg\"><img class=\"size-full wp-image-108786\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2941.jpg\" alt=\"Librarian Sima Thomas holds up the warnings that are placed in front of banned books in the library. Some banned books to consider are &quot;The Great Gatsby&quot; and &quot;Madame Bovary,&quot; which were challenged in their time period. &quot;I think we’re sometimes desensitized to why these books might have been banned,&quot; Thomas said.\" width=\"600\" height=\"450\" \/><\/a> Librarian Sima Thomas holds up the warnings that are placed in front of banned books in the library. Some banned books to consider are \"The Great Gatsby\" and \"Madame Bovary,\" which were challenged in their time period. \"I think we’re sometimes desensitized to why these books might have been banned,\" Thomas said.[\/caption]\r\n\r\n“Harry Potter,” “Twilight\" and “The Great Gatsby” <span style=\"color: #1c2336;\">— <\/span>What do all of these books have in common? At one point, these popular books were challenged for being inappropriate during their time period. This week, the Palo Alto High School library is celebrating Banned Books Week by drawing students’ attention towards challenged books to generate discussion on the books’ subjects.\r\n\r\nAccording to librarian Sima Thomas, the library is placing warning signs in front of banned books that have been removed from their usual spot on the shelves, and instead placed around the library. Thomas hopes the warnings will draw students’ attention. She says that students who read the books will receive an award.\r\n\r\n“We think of Banned Books Week also as the Freedom to Read Week,” Thomas said. “What you’re doing when you’re reading a book of your choice, regardless of what people say, is that you’re asserting your freedom to read and to access info without any infringement by the government or other people, which is part of your First Amendment rights.”\r\n\r\nThe library is also planning to generate discussion about books on social media, according to Thomas, who will personally be launching the Twitter campaign on the account <a href=\"https:\/\/twitter.com\/palylibrary\">@palylibrary <\/a>by posting pictures pictures and facts of banned books.\r\n\r\nThe purpose of Banned Books Week is to introduce high school students to a variety of topics, such as LGBTQ themes, which will help them expand their boundaries.\r\n\r\n“We want students to be exposed to all kinds of ideas and lifestyles and feelings,” Thomas said. “One of the really common veins for books to be challenged is books with LGBTQ themes and topics. We don’t have LGBTQ themes just for students who are themselves questioning if they are gay, lesbian, bisexual or transexual. It’s for all students to read and have more empathy and understanding of what it could be like to be LGBTQ.”\r\n\r\nThomas said that another common reason that books are often banned is racism.\r\n\r\n“Especially from the point of view of someone who’s a person of color and struggling with racism, these books can often be graphic and violent and challenging,\" Thomas said. \"They sometimes challenge mindsets that are held and that are common.”\r\n\r\nPaly Book Club President Claire Dennis also says that Banned Books Week is a great way to celebrate the freedom to read.\r\n\r\n“Students have the right to read a lot of diverse books, especially books that cover controversial topics,\" Dennis said. \"I think that it’s really important that students take this week to remember and appreciate the fact that we have so much freedom in choosing what we get to read.”","excerpt":"This week, the Palo Alto High School library is celebrating Banned Books Week by drawing students’ attention towards challenged books in order to generate discussion on the books’ subjects.","date":"2015-09-29 11:10:25","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_2941.jpg","categories":["News"],"tags":[]},{"id":108137,"title":"English teachers to assist seniors with college essays during Tutorial","permalink":"http:\/\/palyvoice.com\/2015\/09\/28\/english-teachers-to-assist-seniors-with-college-essays-during-tutorial\/","content":"[caption id=\"attachment_108826\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1753.jpg\"><img class=\"size-full wp-image-108826\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1753.jpg\" alt=\"Pictured above is an English class at Palo Alto High School. This year, English teachers will now be assisting seniors with their college application essays during tutorial. Photo by Daniel Li.\" width=\"800\" height=\"600\" \/><\/a> English teachers will now be assisting seniors with their college application essays during Tutorial. Photo by Daniel Li.[\/caption]\r\n\r\nStarting this year, Palo Alto High School English teachers will utilize Tutorial periods to provide assistance to seniors on their college application essays, according to English Instructional Supervisor Shirley Tokheim.\r\n\r\nDuring these sessions, seniors will receive feedback, have time to work quietly and be exposed to a variety of ways to approach their essays.\r\n\r\n“The college application season is upon us, and many students face Nov. 1 deadlines or Nov. 30 deadlines for UCs [Universities of California],” Tokheim said. “I've worked privately with students on writing college essays for many years, so I thought it would be a good idea to use Tutorial to offer seniors some guidance and feedback.\"\r\n\r\nIn addition, all seniors in the fall semester will take time in their English classes to work on narratives that can be used for college admission essays, according to Tokheim. These narratives will aid students who have yet to begin crafting their essays.\r\n\r\nSenior Elias Fedel looks forward to these college application sessions.\r\n\r\n\"I think that this will be beneficial to many seniors, especially if they are having trouble starting their essays or don't have college counselors to write it with,\" Fedel said.","excerpt":"Starting this year, Palo Alto High School English teachers will utilize Tutorial periods to provide assistance to seniors on their college application essays.","date":"2015-09-28 19:57:49","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1753.jpg","categories":["News"],"tags":{"8604":"college","36406":"college application","54185":"college essay","32672":"eli fedel","29087":"essay","33412":"shirley tokheim","29086":"uc"}},{"id":108702,"title":"Slideshow: Volleyball vs. Mountain View","permalink":"http:\/\/palyvoice.com\/2015\/09\/28\/slideshow-volleyball-vs-mountain-view\/","content":"The Palo Alto High School volleyball team (12-3, 1-0) defeated Mountain View High School (9-1, 0-1) in a climactic 3-2 match 25-17, 25-18, 20-25, 18-25, 15-8 in its Santa Clara Valley - De Anza League opener on Tuesday at Gunn High School.\r\n\r\n&nbsp;\r\n<div id=\"cp_widget_32ff5329-6be1-4abb-b511-6359b7bb0f2a\">...<script>\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_32ff5329-6be1-4abb-b511-6359b7bb0f2a\"; cpo[\"_fid\"] = \"AcCA96MLkTxi\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting for Business<\/a> solution.<\/noscript>","excerpt":"The Palo Alto High School volleyball team (12-3, 1-0) defeated Mountain View High School (9-1, 0-1) in a climactic 3-2 match it its league opener on Tuesday at Gunn High School.","date":"2015-09-28 12:03:57","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0599.jpg","categories":["Multimedia","Slideshow","Sports","Volleyball"],"tags":{"52186":"Chelsea Fan","8751":"gunn","39013":"katie passarello","56275":"league opener","29989":"mountain view","56579":"mountain view high school","40735":"mountain view spartans","8939":"palo alto","8944":"palo alto high school","8953":"paly","9107":"slideshow","56578":"spartans","56580":"vball","9210":"vikings","9216":"volleyball"}},{"id":108776,"title":"Junior parent night is on Oct. 7","permalink":"http:\/\/palyvoice.com\/2015\/09\/28\/junior-parent-night-is-on-oct-7\/","content":"","excerpt":"","date":"2015-09-28 11:52:57","author":"Josh Yuen","categories":["Ticker"],"tags":{"56682":"junior parent night","56683":"oct 7"}},{"id":108771,"title":"Final senior portrait session is on Sept. 29 during tutorial","permalink":"http:\/\/palyvoice.com\/2015\/09\/28\/final-senior-portrait-session-is-on-sept-29-during-tutorial\/","content":"","excerpt":"","date":"2015-09-28 11:49:36","author":"Josh Yuen","categories":["Ticker"],"tags":{"56681":"senior portraits free","11060":"tutorial"}},{"id":108768,"title":"No school on Oct. 9 due to Professional Learning Day","permalink":"http:\/\/palyvoice.com\/2015\/09\/28\/no-school-on-oct-9-due-to-professional-learning-day\/","content":"","excerpt":"","date":"2015-09-28 11:47:03","author":"Josh Yuen","categories":["Ticker"],"tags":{"38411":"no school","56678":"professional learning day"}},{"id":108564,"title":"Students launch new sports app","permalink":"http:\/\/palyvoice.com\/2015\/09\/27\/students-launch-new-sports-app\/","content":"[caption id=\"attachment_108590\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Image1.jpg\"><img class=\"size-full wp-image-108590\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Image1.jpg\" alt=\"iPhone screenshots of &quot;The Vike&quot;. “The Vike is intended for Palo Alto High School students who want to go and see their friends play,” junior Brian Tracy said. Screenshots by Daniel Li.\" width=\"600\" height=\"600\" \/><\/a> Featured above are iPhone screenshots of \"The Vike\", a new sports app created by junior Brian Tracy and senior Matthew Seligson. Screenshot by Daniel Li.[\/caption]\r\n\r\nTwo Palo Alto High School students are actively publicizing a new iPhone app For Paly sports, \"The Vike,\" after launching the service earlier this month.\r\n\r\nJunior Brian Tracy and senior Matthew Seligson created “The Vike” to give students quick and easy access to Paly's varsity sports team's schedules.\r\n\r\nThe app was originally designed to track the availability of Paly sports facilities, but later turned into a scheduling app for all Paly sports, according to Tracy.\r\n\r\n“In the past, whenever Matthew and I wanted to go to Paly to practice lacrosse or soccer, we ran the risk of showing up and having a team playing on the same field we wanted to use,” Tracy said. “Originally, the only purpose of the app was to tell if a certain field was being used, saving people the effort of getting all the way to Paly only to realize they have to go home. From there, it spun off into a more comprehensive scheduling app not just for the fields, but for every sport.\"\r\n\r\nAccording to Tracy, \"The Vike\" started off as a project for their Advanced Placement Computer Science class last year.\r\n\r\n“We [Tracy and Seligson] decided to develop the app continuously through the rest of the year and into the summer,” Tracy said. “We finally finished it off early this school year.”\r\n\r\nTracy said that he and Seligson faced many challenges throughout the development process.\r\n\r\n“The programming itself is quite difficult, but that is another issue,” Tracy said. “A big challenge was finding a reliable resource that we could pull data from to deliver the kind of information you see in the app.”\r\n\r\nTracy encourages users to check out other features in the app.\r\n\r\n“My personal two favorite features of the app are the slideshow of all the sports and the 'Take Me Here' feature,” Tracy said. “The slideshow acts as an alternative to the boring list of sports to choose from. To actually see students play each sport is a nice way to display the necessary information. Secondly, the 'Take Me Here' feature is for people who want to go to any away games. 'The Vike' makes it really easy to get directions to all of our away games by integrating with Apple Maps.”\r\n\r\nCurrently, \"The Vike\" is only available on iOS devices.","excerpt":"Two Palo Alto High School students are actively publicizing a new iPhone app For Paly sports, \"The Vike,\" after launching the service earlier this month.","date":"2015-09-27 20:49:10","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1750.jpg","categories":["News"],"tags":{"11978":"app","32581":"brian tracy","11983":"Matthew Seligson","8944":"palo alto high school","8953":"paly","9120":"sports","56305":"sports app","56303":"the vike","56304":"vike"}},{"id":108638,"title":"ASB announces Homecoming details","permalink":"http:\/\/palyvoice.com\/2015\/09\/27\/asb-announces-homecoming-details-2\/","content":"<iframe src=\"https:\/\/www.google.com\/maps\/d\/embed?mid=z6di7IKPG2fc.kEhvuGiY5vvU\" width=\"640\" height=\"480\"><\/iframe>\r\n\r\n<span style=\"color: #444444;\">Palo Alto High School's Associated Student Body is implementing major changes to the location of its upcoming Homecoming dance, which will be held from 7 p.m. to 10 p.m. on Oct. 24, according to <\/span><a href=\"https:\/\/docs.google.com\/document\/d\/1qdp57yv5xtilt_OT4Fhy_sIUVkGxotcJQePbjMJaBZ0\/edit\">Paly ASB meeting minutes<\/a><span style=\"color: #444444;\">.<\/span>\r\n\r\nWith the demolition of the <a href=\"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/\">small and big gyms<\/a><span style=\"color: #444444;\">,<\/span> Paly no longer had a viable location to house the annual dance.\r\n\r\n“We were only allowed to look at locations inside of Palo Alto,” Junior Class Vice President Natalie Maloney said. “We tried looking at Lucie Stern, but that couldn’t hold enough people.”\r\n\r\nAs ASB tried to look for locations within Palo Alto, many were already in use or could not hold enough people, according to Maloney.\r\n\r\n“The majority of the issues that we came into with looking at different venues was that they were either booked the day we needed it ... or it wasn’t big enough for what we wanted, which had to hold 700 to 800 people,” Maloney said.\r\n\r\nThe inability to find a location in Palo Alto forced ASB to look <a href=\"https:\/\/www.youtube.com\/watch?v=vDpcgW3Gc1E\">outside of Palo Alto<\/a> to find a venue, according to Maloney.\r\n\r\n“After talking to the district about our budget, they gave us some money to use and let us look outside of the Palo Alto range, into Mountain View, Los Altos, neighboring cities, and then we found the Computer History Museum which worked out really well,” Maloney said.\r\n\r\nThe move to the Computer History Museum doesn’t come without its own problems, however. One of the main issues students will face is getting to the museum. ASB plans to have a limited number of buses for students who cannot get there by themselves, but also encourages students to carpool and drive themselves, legally that is, according to Maloney.\r\n\r\n“We are encouraging upperclassmen to drive and any sophomore who is able to legally drive,” Maloney said. \"Obviously we are going to try and get everyone there with the buses but the more people that don’t drive, the more expensive it’s going to be. We’d rather save that money to have better food and better decorations.”\r\n\r\nTickets are $15 without an ASB card and $10 with one. Food will be included and transportation can be provided if needed. Tickets will be sold at the door, online at Paly’s Web Store, on the Quad and at the Oct. 23 Homecoming football game.","excerpt":"Palo Alto High School's Associated Student Body is implementing major changes to the location of its upcoming Homecoming dance, which will be held from 7 p.m. to 10 p.m. on Oct. 24, according to Paly ASB meeting minutes.","date":"2015-09-27 20:04:02","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/rsz_homecoming.png","categories":["News","Spotlight"],"tags":{"19460":"2015","8496":"ASB","56575":"asking","56576":"compition","56573":"computer history","50272":"computer history museum","8626":"dance","56574":"first dance","9781":"homecoming","8953":"paly","9016":"prom"}},{"id":108736,"title":"Advisory this week is for all sophomores, all seniors and select freshmen (A-K)","permalink":"http:\/\/palyvoice.com\/2015\/09\/26\/advisory-this-week-is-for-all-sophomores-all-seniors-and-select-freshmen-a-k\/","content":"","excerpt":"","date":"2015-09-26 19:16:17","author":"Josh Yuen","categories":["Ticker"],"tags":{"8462":"Advisory","8721":"freshmen","9085":"senior","29301":"sophomore"}},{"id":107477,"title":"Voice of the Week: Ashlyn Callan","permalink":"http:\/\/palyvoice.com\/2015\/09\/25\/voice-of-the-week-ashlyn-callan\/","content":"[caption width=\"293\" id=\"attachment_107553\" align=\"aligncenter\"]<img class=\"wp-image-107553\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Ashlyn.jpg\" alt=\"Ashlyn\" width=\"293\" height=\"415\"> Freshman Ashylyn Callan speaks to The Paly Voice about her experiences on varsity volleyball. Callan chose volleyball as her sport after growing a passion to be the best. \"It's frustrating when you see all these girls who can hit really hard and they can jump really high and you keep making mistakes,\" Callan said. \"So I started working with a private coach and I took notes of the things he said, I have a whole notebook at home. I reviewed those before every time before I play.\"[\/caption]This week, The Paly Voice sat down with freshman volleyball player Ashlyn Callan to discuss how she made varsity, how the upperclassmen treat her and of course, volleyball.\n\nThe Paly Voice: You made varsity volleyball your freshman year, congratulations. How did you prepare for your tryouts mentally and physically?\n\nAshlyn Callan: This whole summer I have been doing a bunch of different camps. I do it every summer because it's fun. The week before tryouts, I took it a little bit easier so that I could be ready. I didn't want to go all out and be sore for the first day of tryouts, because that's never good. I also went to all the open gyms.\n\nTPV: “Did you expect to make varsity?”\n\nAC: Not at all. The head coach Jekara Wilson invited me to varsity tryouts and that's as far as I expected to go, because it is an accomplishment to even get invited because only six freshmen were. I was so happy because it's just amazing.\n\nTPV: You said you were excited to make varsity, could you elaborate on how you felt when you were told that you were going to be on varsity volleyball?\n\nAC: So my dad came downstairs and she [Wilson]&nbsp;&nbsp;sent out an email, he came downstairs and said “Bad news Ash” and I was like “Oh that’s okay, next year, I guess” and he said “No, look you made it” and I was like “What!”.\n\nTPV: How much more competitive is varsity volleyball compared to your club [Red Rock Volleyball Club]?\n\nAC: It’s similar but different at the same time. Red Rock is all about power and hard hits and digging everything and consistency, consistency. At Paly it's like they are all amazing players too, but it's more about strategy. It's different strategies. But the girls here are smarter, they are so good.\n\nTPV: Last year a current sophomore named Chelsea Fan made varsity as a freshman and the year before that Jessica Lee made varsity as a freshman, have you talked to them about tips and what it is like being a freshman. Do you feel like you have shoes to fill?\n\nAC: They are both amazing players. I haven’t talked to them specifically, but I have talked to Claire Dennis who&nbsp;made it her freshman year, she has been really, really nice and supportive and really helpful to me. She congratulated me when I made the team. She texted me when we got the roster saying “Congratulations, that's great. I was in your shoes a couple years ago and it was really tough but at the same time it was the best season I ever had and I hope you have the same experience I do,\" That was really nice that she would do that.\n\nTPV: What is the vibe on the team like?\n\nAC: It’s really good. Coach Wilson really emphasized in tryouts that you need good chemistry as a team or else it doesn’t go well, because you need communication. Volleyball is a team sport so all the girls have to be super supportive.&nbsp;Sometimes you need to yell at somebody for something they did wrong, but they do it nicely. It’s good. We play well together.\n\nTPV: A lot of times freshmen don't get a lot of playing time on varsity teams. How do you feel about that? Was there ever a thought about not playing varsity and instead playing junior varsity so you could get more playing time?\n\nAC: Well I did the same thing for club. I played Red Rock and didn't get much playing time at all but you have to work for your playing time, no matter how good you are. Just by practicing with the girls, I have developed so much, that it is worth it for me to stay even if I don’t play that much. It's worth it. I think we play five sets and some teams in our league aren't as good so hopefully I get to play.","excerpt":"This week, The Paly Voice sat down with Freshman volleyball player Ashlyn Callan, to discuss how she made varsity, upperclassmen, and her love for volleyball. ","date":"2015-09-25 14:44:52","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_20891.jpg","categories":["Sports","Voice of the Week"],"tags":{"52320":"Ashlyn Callan","9795":"freshman","9200":"varsity","9216":"volleyball"}}]