[{"id":102709,"title":"Review: &#8220;Unfriended&#8221; falls short of excellence","permalink":"http:\/\/palyvoice.com\/2015\/04\/26\/review-unfriended-falls-short-of-excellence\/","content":"Simultaneously innovative and unengaging, “Unfriended” delivers an adequate performance that serves more as a tacky teenage movie with a message than as a blood-curdling thriller. The film <span style=\"color: #222222;\">— r<\/span>eleased by Blumhouse Productions and the Bazelevs Co. last weekend <span style=\"color: #222222;\">— has its moments but fails to reach the ranks of the many horror films that came before it.<\/span>\r\n\r\n\"Unfriended,\" told entirely within the frame of a teenage girl’s laptop screen, follows a Skype group call between six friends on the anniversary of their friend’s suicide. After a humiliating drunk video of their friend was posted, they anonymously took part in cyberbullying her by posting malicious comments on the video, eventually resulting in her suicide. Their past comes back to haunt them a year later when they receive threatening messages from their friend's account. Unable to disconnect the unknown presence from their group chat, the friends are roped into a night of sadistic games and forced confrontations. If they log out, they die.\r\n\r\n[caption id=\"attachment_102711\" align=\"aligncenter\" width=\"611\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1.jpg\"><img class=\"wp-image-102711\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1.jpg\" alt=\"sdf\" width=\"611\" height=\"344\" \/><\/a> Blaire (Shelley Hennig) screams in fright as she witnesses her friend's murder over Skype. Photo courtesy of MTV.[\/caption]\r\n\r\nThe message the film is trying to convey is clear: Be careful of what you post on the Internet because your digital footprint lasts forever. In an era where social media dominates much of teenagers' lives, this message is essential. Screenwriter Nelson Greaves’s decision to set the entire film on the protagonist’s laptop creates a hauntingly real environment. No longer are the horror movie victims targeted by a possessed porcelain doll or trapped in a haunted house — the horror of “Unfriended” lies directly on the familiar pages of YouTube, Facebook and Instagram.\r\n\r\nViewers literally see the plot unfold through the eyes of the protagonist. Every Facebook or Skype notification she gets, every song she listens to on Spotify, every message she types out but deletes before sending is exposed to the audience. This new, unfamiliar sense of intimacy between the individuals on either sides of the screen is unlike any other.\r\n\r\nDespite its clever concept, the film fails to deliver a satisfying overall experience. The trailer, although brilliantly made, essentially spoils the entire movie. The plot becomes predictable, and as a result, it’s a bit boring at parts. Much like many other thrillers, the storyline isn't particularly complex. However, the frightening aspect of the other movies often counteracts their dull plots, making them enjoyable to watch.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/Q72LWqCx3pc\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<em>Featuring clips from viral YouTube videos, the \"Unfriended\" trailer presents a summary of the movie's plot.<\/em>\r\n\r\nIn this movie, the hinted scariness from the trailer is barely present in the film itself. With the age-old what’s-behind-the-closet-door question replaced with what’s-in-the-jpeg-image-I-just-received and the classic, chilling telephone ring replaced with the feeble ping of an unknown notification, the spook factor of “Unfriended” is minimal at best. There are several jump scares scattered throughout, but don’t count on this to be your new favorite horror movie.\r\n\r\nThat being said, the writing isn’t all bad. The considerably static plot is interlaced with jokes that are sure to make you laugh out loud. The humor is well-suited for high school students, and the dynamic of the on-screen teenagers is much like that of an average friend group. As a whole, the film offers decent entertainment and should not be missed by those who wish to have a good laugh.\r\n\r\nAlthough “Unfriended” may not be one of the best movies of the year, it most certainly deserves to be remembered as a timely snapshot of the 21st century.\r\n\r\n<strong>“Unfriended”<\/strong>\r\n\r\n<strong>1 hour, 23 minutes<\/strong>\r\n\r\n<strong>Rated R for violent content, pervasive language, some sexuality, and drug and alcohol use — all involving teens<\/strong>\r\n\r\n<strong>Directed by Levan Gabriadze<\/strong>\r\n\r\n<strong>Starring Shelley Henning, Moses Jacob Storm, Renee Olstead, Courtney Halverson<\/strong>","excerpt":"Simultaneously innovative and unengaging, “Unfriended” delivers an adequate performance that serves more as a tacky teenage movie with a message than as a blood-curdling thriller.","date":"2015-04-26 17:55:39","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Reviews","Spotlight"],"tags":{"8689":"Facebook","30939":"instagram","8900":"movie review","42389":"scary movie","42388":"skype","30938":"social media","42390":"spotify","42387":"unfriended","11976":"youtube"}},{"id":102771,"title":"Smarter Balanced scores to waive placement tests","permalink":"http:\/\/palyvoice.com\/2015\/04\/26\/smarter-balanced-scores-to-waive-placement-tests\/","content":"Juniors will take their first-ever official state-standardized Smarter Balanced test on Monday and Tuesday at Palo Alto High School. Starting in the 2015-16 school year, students enrolling in certain California colleges may use the Smarter Balanced test scores to determine placement in courses.\r\n\r\nThe Smarter Balanced test is a new state assessment based on the <a href=\"http:\/\/www.corestandards.org\/\">Common Core State Standards<\/a>. The test is administered electronically and it assesses skills in reading, language arts, math and science.\r\n\r\n[caption id=\"attachment_102788\" align=\"alignright\" width=\"352\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/smarter.jpg\"><img class=\"wp-image-102788 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/smarter.jpg\" alt=\"smarter balanced logo\" width=\"352\" height=\"196\" \/><\/a> Juniors will be taking the Smarter Balanced exam on Monday and Tuesday. Students can use their scores for placement in certain colleges after admission. Screenshot by Emily Hwang.[\/caption]\r\n\r\nAccording to the <a href=\"http:\/\/www.smarterbalanced.org\/news\/close-200-colleges-universities-use-smarter-balanced-scores-part-placement\/\">Smarter Balanced website<\/a>, 101 California schools will be accepting Smarter Balanced scores to waive placement test requirements. However, the scores will solely be used by colleges in the California State University (CSU) system and community college system, not the University of California (UC) system.\r\n\r\nAccording to college counselor Sandra Cernobori, the Smarter Balanced scores are not used for admission into colleges. Rather, they are exclusively utilized by state colleges and universities so that students do not have to take placement tests once they are accepted into a CSU or community college.\r\n\r\n“The Smarter Balanced has nothing to do with getting in [to college],” Cernobori said. “It’s having to do with whether or not they [students] need to take a placement test after they’ve been admitted, or if their scores on either the SAT or ACT or on the Smarter Balanced have waived that requirement.”\r\n\r\nAccording to Cernobori, there is a section on the test where students can indicate whether they want their Smarter Balanced scores to replace traditional placement test scores.\r\n\r\n“There’s a bubble that you fill in on the test sheet that says that you would like these [the test scores] to also be considered for this other purpose [placement in college courses],” Cernobori said.\r\n\r\nCernobori says that allowing colleges to look at Smarter Balanced scores for placement purposes will probably most likely not make much difference to most students. However, according to Cernobori, it would save them time if students end up attending a CSU or community college.\r\n\r\n“It might be an advantage after they’re admitted in terms of waiving the placement test,” Cernobori said. “There’s nothing to lose, there’s not a ton to gain, but there’s a little bit to gain, so might as well bubble it in.”\r\n\r\nThe test is being used so that students can have more variety with placement test scores at colleges.\r\n\r\n“It’s a different kind of test, so sometimes they do better on it [the Smarter Balanced exam],” Cernobori said.\r\n\r\nAccording to Cernobori, this option has existed before, except with a different exam (Standardized Testing and Reporting program, or STAR Test).\r\n\r\nJunior Neta Hart says she might indicate that she wants her scores on the Smarter Balanced to be used for placement. However, she is not concerned about her scores on the test.\r\n\r\n“I focus more on the ACT,” Hart said. “ I know that most colleges will look at the ACT, not the Smarter Balanced test. … I only knew about this test two days ago.”\r\n\r\n&nbsp;","excerpt":"Juniors will take their first-ever official state-standardized Smarter Balanced test on Monday and Tuesday at Palo Alto High School. Starting in the 2015-16 school year, students enrolling in certain California colleges may use the Smarter Balanced test scores to determine placement in courses.\r\n","date":"2015-04-26 17:31:45","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/smarter.jpg","categories":["News","Spotlight"],"tags":{"9680":"ACT","42408":"ap","42407":"assessment","8552":"California","8604":"college","34668":"community college","42409":"csu","42406":"exam","8944":"palo alto high school","29935":"sat","9068":"School","42405":"smarter balanced","9132":"students","12319":"test","29086":"uc"}},{"id":102734,"title":"Slideshow: Not In Our Schools Week","permalink":"http:\/\/palyvoice.com\/2015\/04\/26\/slideshow-not-in-our-schools-week\/","content":"Palo Alto High School Associated Student Body hosted Not In Our Schools Week to recognize and appreciate students of all abilities, races and beliefs. Daily awareness activities and presentations were available to students during brunch and lunch throughout the week.\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AsDA1dMxHrKC\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Palo Alto High School ASB hosted Not In Our Schools Week to recognize and appreciate students of all abilities, races, and beliefs. Daily awareness activities and presentations were available during brunch and lunch all throughout the week.","date":"2015-04-26 15:02:59","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_0099.jpg","categories":["News","Slideshow","Spotlight"],"tags":{"19460":"2015","14280":"nios","14279":"not in our schools week","8953":"paly","42398":"school spirit"}},{"id":102579,"title":"Liveblog: Boys&#8217; lacrosse takes on Los Gatos","permalink":"http:\/\/palyvoice.com\/2015\/04\/24\/liveblog-boys-lacrosse-takes-on-los-gatos\/","content":"<em>Check back here at 7 p.m. for live coverage of the Palo Alto High School boys’ lacrosse team (7<span style=\"color: #000000;\">-5-1, 4-2<\/span>) as they host the De Anza league-leading Los Gatos High School Wildcats (8-5, 8-0) at the El Camino field.<\/em>\r\n\r\n&nbsp;\r\n\r\n[liveblog]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Check back here at 7 p.m. for live coverage of the Palo Alto High School boys’ lacrosse team (7-5-1, 4-2) as they host the De Anza league-leading Los Gatos High School Wildcats (8-5, 8-0) at the El Camino field.","date":"2015-04-24 15:40:14","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2124.jpg","categories":["Sports"],"tags":{"12016":"lax","8855":"liveblog","9914":"los gatos"}},{"id":102523,"title":"ASB Appointed Officers Results 2015-16","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/asb-appointed-officers-results-2015-2016\/","content":"The 2014-2015 Associated Student Body announced its Appointed Officers for the 2015-16 school year. See the results below.\r\n<p style=\"color: #141823;\"><strong>Sports Commissione<\/strong>r: Ariya Momeny<\/p>\r\n\r\n<div class=\"text_exposed_show\" style=\"color: #141823;\">\r\n\r\n<strong>Spirit Commissioners<\/strong>: Cezanne Lane and Reid Walters\r\n\r\n<strong>Social Commissioners<\/strong>: Claire Billman and Maryland Valdez\r\n\r\n<strong>Social Justice &amp; School Culture Commissioner<\/strong>: Mariah Poitier\r\n\r\n<strong>PAUSD Board Representative<\/strong>: Emma Cole\r\n\r\n<strong>Publicity Commissioner &amp; Videographer<\/strong>: Griffin Carlson\r\n\r\n","excerpt":"The ASB Appointed Officers results for the 2015-2016 school year have been announced. ","date":"2015-04-23 19:12:43","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1969134_844366578915382_9183705722491742144_n.jpg","categories":["News"],"tags":{"42301":"appointed officers","8496":"ASB","8499":"Associated Student Body","8944":"palo alto high school","8953":"paly","30978":"results"}},{"id":102614,"title":"Opinion: Zero Period PE policy needs reform","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-pe-policy-needs-reform\/","content":"One main topic of discussion regarding Zero Period PE is the need for sleep. <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/03\/20\/guest-opinion-what-we-can-do-to-reduce-risk-for-our-teens\">Surveys<\/a> show that Palo Alto students sleep an average of six and a half hours — well below the needed eight to ten hours a night, according to the <a href=\"http:\/\/sleepfoundation.org\/sleep-topics\/teens-and-sleep\">Sleep Foundation<\/a>. While Zero Period PE is not responsible for a large percentage of these numbers, running the mile at 7:15 a.m. is sure to drain already sleep-deprived youth and can lead to even greater health risks. According to the <a href=\"http:\/\/www.apa.org\/monitor\/oct01\/sleepteen.aspx\">American Psychological Association<\/a>, research suggests that sleep deprivation puts adolescents at risk for cognitive and emotional difficulties, poor school performance, accidents and psychopathology.\r\n\r\nSleep deprivation can lead to other negative side effects. It can cause aggressive behavior and contribute to illnesses, according to the Sleep Foundation. According to the <a href=\"https:\/\/www.aap.org\/en-us\/about-the-aap\/aap-press-room\/aap-press-room-media-center\/Pages\/Sleepy-Teens.aspx\">American Academy of Pediatrics<\/a>, the risk of depression significantly increased among teens who sleep less than eight hours a night. While one may state that students enrolled in Zero Period PE try to sleep earlier in compensation, no surveys or studies regarding this exist and hordes of Paly students continue to lament their lack of sleep.\r\n\r\nWhile self-identified “morning people” may benefit from Zero Period PE, many sophomores take the class to enroll in as many as eight other academic classes during the school day. Although freshmen are <a href=\"http:\/\/paly.net\/sites\/default\/files\/2015-16_gr9_course_selection_form_front%26back.pdf\">prohibited<\/a> from joining more than seven classes, no limit exists for sophomores and upperclassmen.\r\n\r\n“It forces people who want to take many classes into taking Zero Period [PE] because it [taking many classes] is not an option otherwise,” sophomore Julia Lauer said.\r\n\r\nFurthermore, morning people can still wake up early to complete school assignments, and thus do not need to take an early class to be productive.\r\n\r\nAccording to sophomore Jessica Wu, who signed up for nine classes in first semester, Zero Period PE contributed to an already high stress load.\r\n\r\n“It was a super long day,” she said. “I’d arrive [at school] at seven and go home at five with no break. Then I would have extracurriculars, and that would give me no time to actually get work done until nine.”\r\n\r\nAlthough Zero Period PE may cause less stress than early academic classes, it continues to strain students’ stress and sleep levels. However, supporters maintain that because Zero Period PE is an optional class, it should always be available to those who wish to take it. In order to cooperate with students willing to wake in the early morning in exchange for an afternoon prep, an ideal solution is to limit Zero Period students to a total of seven classes or make students who wish to take more that seven classes sign a waiver. In addition, advisers and counselors should warn against utilizing Zero Period PE as a tool for taking extra classes.","excerpt":"Zero Period Physical Education classes need reform in order to limit student stress and decrease sleep deprivation.\r\n","date":"2015-04-23 14:42:41","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg","categories":["Opinion"],"tags":{"8638":"debate","8751":"gunn","32445":"max mcgee","8927":"opinion","8944":"palo alto high school","8953":"paly","8980":"pe","9106":"sleep","9128":"Stress","42273":"zero period","42382":"zero period pe"}},{"id":102617,"title":"Opinion: Zero Period offers flexibility without detrimental effects","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-offers-flexibility-without-detrimental-effects\/","content":"The most obvious defense of the controversial Zero Period — and what supporters of the policy have repeated time and time again — is that it’s a choice. If a student wants to take an early morning class and start his or her school day earlier, he or she should have the freedom to do so. The ability to make mature decisions about scheduling is one that will be very important in future years. Students should be trusted with the power to determine what works best for their academic life and how they want to manage their time.\r\n\r\nAlthough concern over sleep deprivation among teenagers is reasonable when taking Zero Period into consideration, it should not be something that ultimately drives the elimination of the classes. To my knowledge, there has been no research done at PAUSD specifically to prove the correlation of sleep deprivation and Zero Period. In fact, some people may argue that Zero Period actually helps students go to sleep earlier, as it motivates them to manage their time better. Providing an opportunity for students to learn at an earlier time than usual does not necessarily lead to a surge in sleep-deprived students. Besides, some sports teams already implement morning practices and a handful of students arrive at school well before the first bell rings. If the goal is to ensure that everyone gets enough sleep, should PAUSD prohibit students from being on campus before a given time too?\r\n\r\nAdditionally, some people argue that Zero Period is used inappropriately by high-achieving students to take an extra class. They claim that students want to get ahead and have an advantage over their peers. While I agree with the fact that those students, if such students exist, are using the class for the wrong reason, I believe it would be wrong to take away Zero Period from everyone in order to combat this issue. Many students opt to take the class so that they can have a prep period later on in the day, according to comments made at the <a href=\"http:\/\/palyvoice.com\/2015\/04\/22\/students-plead-with-school-board-to-re-examine-zero-period-elimination\/\">school board meeting<\/a> this week. And, those who sign up for a Zero Period with the intention of taking an additional class could genuinely be interested their courses and are looking to challenge themselves. Restricting a student from their full potential in hopes of reaching complete academic equality is very counterproductive.\r\n\r\nFor these reasons, Zero Period, Paly’s Zero Period PE in particular, should be offered in PAUSD.","excerpt":"Zero Period Physical Education is extremely beneficial to some and completely harmless to others, and it should be offered at PAUSD.","date":"2015-04-23 14:42:27","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg","categories":["Opinion"],"tags":{"42383":"pro","9106":"sleep","42384":"sleep deprivation","42385":"student freedom","42273":"zero period"}},{"id":102539,"title":"Opinion: The Zero Period debate","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-the-zero-period-debate-2\/","content":"[caption id=\"attachment_102618\" align=\"aligncenter\" width=\"625\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg\"><img class=\"wp-image-102618 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg\" alt=\"sdfsdf\" width=\"625\" height=\"338\" \/><\/a> Students from Palo Alto High School Physical Education teacher Stacey Kofman's Zero Period PE class jog around the Paly track. Photo by Jeanette Wong.[\/caption]\r\n\r\nEarlier this month, Palo Alto Unified School District Supt. Max McGee announced the elimination of Zero Period academic classes starting next school year. Non-academic Zero Period classes such as Physical Education, however, will continue to be implemented at both Palo Alto High School and Gunn High School. This decision resulted in mixed reaction from students: While some argued that abandoning Zero Period infringes on students’ rights, others pointed out the need for sleep and limiting stress.\r\n\r\nThe Paly Voice discusses the pros and cons of Zero Period PE at Paly. Read our perspectives in the links below:\r\n\r\n<strong>Pro Opinion: <\/strong><a href=\"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-offers-flexibility-without-detrimental-effects\/\">Zero Period PE offers flexibility without detrimental effects<\/a>\r\n\r\n<strong>Con Opinion: <\/strong><a href=\"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-pe-policy-needs-reform\/\">Zero Period PE policy needs reform<\/a>","excerpt":"The Paly Voice discusses the pros and cons of Zero Period Physical Education at Palo Alto High School.  \r\n","date":"2015-04-23 14:41:53","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_4245a.jpg","categories":["Opinion","Spotlight"],"tags":{"8751":"gunn","8927":"opinion","8939":"palo alto","8953":"paly","8977":"PAUSD","8980":"pe","9067":"scandal","9128":"Stress","9129":"student","42302":"superintendent mcgee","42273":"zero period"}},{"id":102455,"title":"Stanford organization to host computer science conference","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/stanford-organization-to-host-computer-science-conference\/","content":"The Stanford University Women in Computer Science organization is holding a conference at 10 a.m. on Saturday, May 2 for high school students interested in learning about working in the computer science industry.\r\n\r\n[caption id=\"attachment_102606\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2677.jpg\"><img class=\"wp-image-102606\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2677.jpg\" alt=\"Palo Alto High School seniors Ryan Huang and Elnathan Au work on their computer science projects in class. High schoolers, especially girls, are welcome to sign up for the Stanford Women in Computer Science-hosted CS conference on May 2. Photo by Lizzie Chun.\" width=\"300\" height=\"225\" \/><\/a> Palo Alto High School seniors Ryan Huang and Elnathan Au work on their computer science projects in class. High schoolers, especially girls, are welcome to sign up for the Stanford Women in Computer Science-hosted CS conference on May 2 at the Stanford Women's Community Center. Photo by Lizzie Chun.[\/caption]\r\n\r\nWomen in Computer Science is a student-run organization whose mission is \"to promote and support the growing community of women in CS and technology,\" according to <a href=\"http:\/\/web.stanford.edu\/group\/wics\/\" target=\"_blank\">its website<\/a>.\r\n\r\nWhile the free, four hour-long conference is particularly geared toward girls, the goal of the event is to provide high schoolers with a \"wide view into the possibilities and exciting aspects of computer science,\" according to <a href=\"https:\/\/docs.google.com\/forms\/d\/11kXpa-P6pOVmlLFZ7PQyIEa4kgJtx77p0CZNVQB2wZM\/viewform\" target=\"_blank\">the event's RSVP form<\/a>.\r\n\r\nAccording to event coordinator and Stanford freshman Catherina Xu, a number of speakers will present at the conference, including Stanford undergraduates, Ph.D. students and members of the computer science industry, each of whom will discuss their personal experiences as women in the field, along with the projects and research they are currently conducting. A Stanford tour guide will also lead the students on a tour of the school's engineering facilities, and lunch will be provided.\r\n\r\nXu and Luca Szegletes, a Stanford graduate student and fellow event coordinator, hope the event will help encourage high schoolers to look past the prejudices associated with coding.\r\n\r\n\"Computer science is useful in any field and, especially in 2015, really is a necessary skill,\" Xu said. \"I feel that many people view CS as a field for 'gamers' and 'introverts,' which discourages girls from learning it in school. The reason why Luca [Szegletes] and I are holding this event is to share Stanford's extremely welcoming and powerful CS department with high school girls, hoping to show them the amazing things that women in CS have done.\"\r\n\r\n<a href=\"https:\/\/docs.google.com\/forms\/d\/11kXpa-P6pOVmlLFZ7PQyIEa4kgJtx77p0CZNVQB2wZM\/viewform\" target=\"_blank\">Online sign-ups for the event<\/a> end on April 28, and the number of attendees will be capped at 40.","excerpt":"The Stanford University Women in Computer Science organization is holding a conference at 10 a.m. on Saturday, May 2 for high school students interested in learning about working in the computer science industry.","date":"2015-04-23 13:52:39","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2677.jpg","categories":["News"],"tags":{"42275":"catherina xu","42259":"coding","42264":"comp sci","42257":"compsci","42256":"computer science","42260":"conference","42258":"cs","10749":"high school","42276":"luca szegletes","9653":"stanford","38885":"stanford university","42255":"wics","42254":"women in computer science"}},{"id":102578,"title":"Baccalaureate ticket registration open at paly.io\/baccalaureate2015, ends at 3:25 p.m. on April 30","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/baccalaureate-ticket-registration-open-at-paly-iobaccalaureate2015-ends-at-325-p-m-on-april-30\/","content":"","excerpt":"","date":"2015-04-23 13:42:27","author":"Lizzie Chun","categories":["Ticker"],"tags":{"19372":"baccalaureate","11636":"registration","42304":"tickets"}}]