[{"id":100058,"title":"Opinion: Blended learning proposes better alternative to traditional learning experience","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/opinion-blended-learning-is-better\/","content":"While the learning environment at school is satisfactory for some, to others, it is too uniform. School has been taught the same for generations, and lacks many areas of passion and further projects to develop these. While the current American teaching system involves many lectures and tests that are not as conducive to finding and delving into one's passion as they could be, a learning environment in which students have complete freedom to do as much or as little work as they choose does not seem right either. So, the question is, how can we find a balance?\r\n\r\nPalo Alto High School journalism adviser Esther Wojcicki pushes for blended learning, a possibly solution.\r\n\r\nWojcicki’s new book \"Moonshots in Education\" and recent presentation at Paly’s <a href=\"http:\/\/palyvoice.com\/2015\/02\/08\/paly-hosts-second-annual-tedx\/\">TEDx<\/a> talk earlier this month discuss the concept of blended learning, or a way to “teach 21st century skills without lecturing to students,” as she described it in a recent <a href=\"http:\/\/palyvoice.com\/2015\/01\/29\/voice-qa-journalism-teacher-wojcicki-introduces-new-book\/\">interview<\/a> with The Paly Voice. Her book describes how to change the culture of the classroom and revolutionize the American school system.\r\n\r\nWe whole-heartedly agree with this style of teaching as it encourages students to take control of their own learning. The current rigid structure of some classes traps many high school students in an educational system they do not feel passionate learning in. Learning extends far beyond sitting behind a desk for 90 minutes while listening to a teacher lecture. For certain classes, like classes in STEM subjects, it is understandable that lectures are unavoidable – it would be pretty hard to figure out how to design and code your own website without any prior lessons. That being said, there can still be ways for learning to branch off into innovative territories.\r\n\r\nPhysics teacher Gul Eris is one of several Paly teachers who have implemented blended learning into their class curriculums. Having introduced the new format last fall, she strays away from the traditional teaching style of class lectures and homework and instead provides lecture videos for students to watch at home and practice problems or labs to do in class.\r\n\r\n“What I’ve noticed in the past is that some students struggle to keep up with writing stuff [during class lectures] or cannot pay full attention in class,” Eris said. “So, if they can do it [learn the material] on their own terms in their own time, where they can make it [the lecture video] as slow or as fast as they want it to be, they can pay better attention and take better notes and can reach a better understanding of the concepts.”\r\n\r\nThe numbers speak favorably in support of her theory.\r\n\r\n“The test scores are a little bit higher compared to last year,” Eris said. “It’s not a lot, but [they're] still higher.”\r\n\r\nIt’s a huge challenge to fit a square peg into a round hole — and even harder to fit each person's individual learning preferences into a strict, cookie-cutter model. That's why education should be personalized with blended learning. Students are currently unmotivated to learn in school, which detracts from the overall enjoyment of school. With blended learning, however, learning is more personalized, and students will be given the opportunity to pursue their true interests. The American high school system is too factory-like and not conducive to success because interests do not exactly lie in the domain. Ultimately, we push for teachers to experiment more with blended learning in classrooms because it allows students to take control of their learning experience.","excerpt":"While the learning environment at school is satisfactory for some, to others, it is too uniform. The Paly Voice analyzes if Esther Wojcicki's moonshot idea can solve this.","date":"2015-02-26 15:06:27","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo.jpg","categories":["Opinion"],"tags":{"39739":"blended learning","12704":"esther wojcicki","39740":"gul eris","8944":"palo alto high school"}},{"id":99872,"title":"Boys&#8217; wrestling to attend CCS this weekend","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/boys-wrestling-to-attend-ccs-this-weekend\/","content":"In its first season with a new coach, the Palo Alto High School boys’ wrestling team will send four wrestlers to the Central Coast Section finals this weekend.\r\n\r\n[caption id=\"attachment_100047\" align=\"alignright\" width=\"372\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0962.jpg\"><img class=\"wp-image-100047\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0962.jpg\" alt=\"\" width=\"372\" height=\"279\" \/><\/a> Boys' wrestling schedules and news hang in the Big Gym. The Vikings will go to CCS this weekend. Photo by Julia Asin.[\/caption]\r\n\r\nAlthough the Vikings struggled early in the season, head coach Braumon Creighton said the team improved its conditioning and positioning this month and expects to qualify three of the four CCS-qualified Paly wrestlers to the California Interscholastic Federation state championship.\r\n\r\n“We are training hard the rest of the week to prepare for CCS,” Creighton said. “[We will be] mainly drilling and working on tactical things for each individual – lots of stretching and paying attention to our nutrition.”\r\n\r\nThe four wrestlers going to CCS are senior captain James Giaccia, sophomore Seth Goyal, senior Chioke Bryant Anderson and freshman Noah Asing.\r\n\r\nGiaccia said the team is practicing every day to prepare for CCS.\r\n\r\n“We've been training all season for this,\" Giaccia said. \"[We] practice every single day, and for me, twice a day. ... Our expectations are to have three CCS champions. Team expectation [is to place] within the top 10.”\r\n\r\nThe boys will participate in the first day of CCS finals on Friday at Independence High School.","excerpt":"In its first season with a new coach, the Palo Alto High School boys’ wrestling team will send four wrestlers to the Central Coast Section finals this weekend.\r\n","date":"2015-02-26 13:06:09","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0962.jpg","categories":["Sports"],"tags":{"39599":"boys wrestling","8568":"CCS","9951":"chioke bryant-anderson","36388":"james giaccia","39601":"noah asing","8944":"palo alto high school","39600":"seth goyal","9241":"wrestling"}},{"id":99790,"title":"Science Bowl places third at regional competition","permalink":"http:\/\/palyvoice.com\/2015\/02\/26\/science-bowl-places-third-at-regional-competition\/","content":"[caption id=\"attachment_99850\" align=\"alignnone\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg\"><img class=\"wp-image-99850\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg\" alt=\"\" width=\"350\" height=\"263\" \/><\/a> Palo Alto High School Science Bowl team members Samarth Venkatasubramaniam, Andrew Lee, Jasen Liu, Matthew Li and Gary Chen (left to right) pose with the medals they earned at the regional Science Bowl last week. The team placed third out of 20 schools in the 11th Annual Department of Energy Bay Area Science Bowl competition at Stanford University. Photo courtesy of Gary Chen.[\/caption]\r\n\r\nPalo Alto High School’s Science Bowl team returned to school victorious in February after placing third out of 20 schools in the 11th Annual Department of Energy Bay Area Science Bowl competition at Stanford University. This strong finish marks the Paly team’s debut in the regional competition and season.\r\n\r\nThe Paly SciBowl team, which consists of sophomore Samarth Venkatasubramaniam, junior Andrew Lee and seniors Gary Chen, Matthew Li and Jasen Liu, competed against other strong schools, including Lynbrook High School and the Harker School, who placed first and second respectively. However, only the top two teams in each division advanced to the double elimination round, so the Paly team did not move to the next round.\r\n\r\n“It felt nice to place at regionals since we have been practicing a lot,\"  Lee said. “We were all definitely surprised once we found out that we placed third overall.”\r\n\r\nAccording to its <a href=\"https:\/\/www6.slac.stanford.edu\/news\/2015-02-09-slac-hosts-11th-annual-regional-doe-science-bowl.aspx\">website<\/a>, the Regional Science Bowl “encourages students to excel in STEM disciplines – science, technology, engineering and mathematics – and to pursue careers in these field.” Students are also expected to answer multiple choice and short answer questions covering biology, chemistry, Earth science, physics, energy and math in a fast-paced format that requires them to think quickly and spend months practicing.\r\n\r\nAccording to Lee, to work on speed, the team met every week for about two hours to go through previous competitions and practice buzzing.\r\n\r\nOverall, Venkatasubramaniam was content with the performance of the team.\r\n\r\n“Although only first place gets to advance to nationals, we are super happy with our third place because it is one of the hardest regionals, and it was a good show for the last SciBowl for the three seniors on the team,” Venkatasubramaniam said.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s Science Bowl team returned to school victorious in February after placing third out of 20 schools in the 11th Annual Department of Energy Bay Area Science Bowl competition at Stanford University. This strong finish marks the Paly team’s debut in the regional competition and season.","date":"2015-02-26 13:05:50","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/unnamed3.jpg","categories":["News"],"tags":{"39379":"andrew lee","12848":"competition","39382":"gary chen","39378":"jasen liu","39381":"matthew li","8944":"palo alto high school","39380":"samarth venkatasubramanian","39377":"scibowl","9072":"science","9073":"science bowl"}},{"id":99794,"title":"Net neutrality in five minutes or less","permalink":"http:\/\/palyvoice.com\/2015\/02\/25\/net-neutrality-in-five-minutes-or-less\/","content":"Chances are if you're reading this article, you're reading it on the Internet. And chances are, you most definitely did not log on to your computer or turn on your phone with the intention of reading this specific article. Perhaps you were browsing your social media feeds or watching that funny video your friend sent you before you somehow stumbled upon this article.\r\n\r\nIn your Internet-accessing excitement, did you for one second pause and think of the principle of net neutrality and how it affects the way you interact with your information? Probably not, but a vote to be taken Thursday on the issue of net neutrality by the Federal Communications Commission, the governing body for the Internet in the U.S., might fundamentally change the kind of information you access and make you think more critically about where you're getting your information.\r\n\r\nThe Paly Voice summarizes the issue at hand and presents them in five minutes or less.\r\n\r\n<b> What is net neutrality?<\/b>\r\n\r\nThe point of dispute behind the vote Thursday is whether the principle of <a href=\"http:\/\/www.fcc.gov\/openinternet\" target=\"_blank\">net neutrality<\/a> should be preserved. According to the FCC, net neutrality is simply the idea that all information on the Internet should be treated equally and that consumers are able to freely make choices on the type of content they access.\r\n\r\n<b>What are the issues at stake?<\/b>\r\n\r\nIn April of last year, FCC Chairman Tom Wheeler proposed a plan to allow Internet Service Providers (companies you pay to access the Internet like AT&amp;T and Comcast), or ISPs, to create high-speed fast lanes for those who pay a premium, <a href=\"http:\/\/www.savetheinternet.com\/net-neutrality-what-you-need-know-now\">according to Free Press<\/a>. However, this proposal violates the basis of net neutrality: to treat all data equally.\r\n\r\nIf such a proposal went through, companies willing to shell out the big bucks would have their data prioritized over everyone else's, and smaller websites belonging to small businesses, non-profits, schools, individuals – websites like yours truly – would be subject to regular-speed (read: slow) lanes. Even though websites not paying premiums to ISPs would still be accessible, the Free Press’s <a href=\"http:\/\/www.savetheinternet.com\/net-neutrality-what-you-need-know-now\" target=\"_blank\">website<\/a> on net neutrality warns that this is a precursor to possible censorship of information on behalf of the ISPs by slowing “regularly laned” information to such a pace that it can’t be accessed.\r\n\r\nAfter the proposal, the FCC opened up an online comment forum, which resulted in a record number of responses (thanks in part to a<a href=\"https:\/\/www.youtube.com\/watch?v=fpbOEoRrHyU\"> \"Last Week Tonight with John Oliver\" episode<\/a>). The proposal was narrowly denied by a 3 to 2 vote, and the idea of “fast lane” was fortuitously dropped. Now, the FCC will instead be taking a <a href=\"http:\/\/www.cnet.com\/news\/fcc-chairman-confirms-net-neutrality-vote-for-february\/\" target=\"_blank\">vote on Feb. 26<\/a> to reclassify ISPs as Title II carriers, a grouping that currently applies to telecommunication service companies. Under this new classification, there will be heavier government involvement in regulation with the supposed intent of minimizing the chances that more proposals like that introduced last April appear or somehow get passed.\r\n\r\n<b>Why are people divided on this issue?<\/b>\r\n\r\nLike most political issues, people are divided on the role that the government should play in people's lives. In theory, by putting the Internet under government control, it becomes harder for a few firms to monopolize the ISP market and easier for smaller firms and start ups to succeed. As a result, more competition exists, and if one company unfairly jacks up the prices (as people suspect they might), the consumer can simply switch providers.\r\n\r\nHowever, history has shown that the government is never necessarily the cure-all for any given problem. For example, look at the criticisms directed at the new ObamaCare initiative. On the last official day of ObamaCare enrollment, the website crashed, and recently, about <a href=\"http:\/\/www.washingtontimes.com\/news\/2015\/feb\/20\/obamacare-officials-give-penalty-payers-extra-time\/\">800,000 customers<\/a> received faulty tax information from the site. Furthermore, lobbyists' influence in politics (as exemplified by last April’s debacle) makes some weary about the future of government-controlled neutrality.\r\n\r\nWhile politicians have been debating this issue for quite some time now, senior members of the Republican Party announced yesterday that they will probably not act against the upcoming policy shift with a legislative response.\r\n\r\nAt the end of the day, most people agree that net neutrality is a basic right and should be universally existent. The central issue lies in how we arrive at that final destination; based on one’s political ideology, the government may or may not be involved.","excerpt":"A vote to be taken Thursday on the issue of net neutrality might fundamentally change the kind of information you access and make you think more critically about where you're getting your information. The Paly Voice summarizes the issue at hand and presents them in five minutes or less.","date":"2015-02-25 21:33:03","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/unnamed1.jpg","categories":["Features","Spotlight"],"tags":{"39375":"fcc","39376":"federal communications commission","39374":"internet service provider","39373":"isp","39372":"net neutrality","38868":"obama","8944":"palo alto high school"}},{"id":99796,"title":"Students to voice opinions at student forum","permalink":"http:\/\/palyvoice.com\/2015\/02\/25\/students-to-voice-opinions-at-student-forum\/","content":"[caption id=\"attachment_100015\" align=\"aligncenter\" width=\"619\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/11012292_10205630897719418_570304258_n.jpg\"><img class=\"wp-image-100015\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/11012292_10205630897719418_570304258_n.jpg\" alt=\"ASB President Claire Liu stands outside of the SAO. Liu and ASB have been advertising and publicizing the event for the past week. Photo by Chalres Yu\" width=\"619\" height=\"464\" \/><\/a> ASB President Claire Liu smiles in front of the SAO bulletin board which features flyers for Thursday's student forum. Liu and ASB have been advertising and publicizing the event for the past week. Photo by Charles Yu.[\/caption]\r\n\r\nThe Palo Alto High School administration and the Associative Student Body will host a Paly Student Forum at 7 p.m. Thursday in the Media Arts Center for students to voice their opinions regarding school climate issues directly to Superintendent Max McGee and Principal Kim Diorio.\r\n\r\nDiorio and ASB began speaking a couple of weeks ago, wanting to hold an event where students are able to talk directly to the administration.\r\n\r\n\"In that conversation with ASB, they were really appreciative to be able to talk to me and share with me what they see and some of their experiences,\" Diorio said. \"I think it would be great if more students had the opportunity to do this.\"\r\n\r\nGunn's Student Executive Council (SEC), equivilent to ASB at Paly, recently held a student forum with McGee and their principal, Dr. Denise Herrmann.\r\n\r\n\"Gunn did it and it was really successfull,\" Diorio said. \"They had an open forum... it was kind of like an open house. Students could pop in or leave or stay... and just talk directly to the principle and superintendent about things that they've noticed in their time in this district and things that adults should focusing their efforts on.\"\r\n\r\nASB President Claire Liu agrres with Diorio about the importance of being able to speak directly to the administration.\r\n\r\n\"It's important overall that students are voicing their concerns and making sure that people who actually have the power to change things are listening to them,\" Liu said. \"With what's been going on in our community, it's an especially crucial time for students to speak up... It's a time when students' voices can be most powerful, too.\"\r\n\r\nLiu adds that in order to make an impact in the Paly and Palo Alto community students must take the initiative by showing up to the event.\r\n\r\n\"There is nothing but positive outcomes for this event,\" Liu said. \"I think it's just a matter of students taking the initiative to come to the MAC on Thursday. ... It will be a great way for Mrs. Diorio and Mr. McGee to see students personally and hear their stories – that is the most impactful thing that students can do.\"\r\n\r\nThis is a chance for the administration and faculty to understand the issues that students are facing, according to McGee.\r\n\r\n\"'Seek first to understand, then be understood,'\" McGee told The Paly Voice, quoting Stephen Covey. \"From the position of the administration and faculty, we need to understand the issues that are really important to the students ... [and] not just assume what they [the issues] are because we are teachers and parents.\"\r\n\r\nDiorio also expressed wanting the students to be heard more so than the adults.\r\n\r\n\"A lot of times what happens is you have adults at the table,\" Diorio said. \"And although every adult is well-meaning and well-intending, we have to make sure we are including our students in the conversation and that they are really leading this conversation.\"\r\n\r\nMcGee said that moving forward, the community needs to become increasingly more collaborative when dealing with issues such as student stress and other school climate concerns.\r\n<p style=\"text-align: left;\">\"I think the inclusive piece is really important,\" said McGee. \"Edicts don't come from the top down. ... They're made in collaboration and shared meaningful dialogue. ... We are going to do more listening than speaking.\"<\/p>\r\nDiorio said that this forum is to be a positive experience for students and the community.\r\n\r\n\"We just want this to be a positive experience,\" Diorio said. \"We want it to be an opportunity for people to feel like they are being part of the solutions and that if they have an idea or they have something they want to talk about ... it would be a good opportunity for people to come forward.\"\r\n\r\nWhile ideas and opinions presented at this forum will be considered by the administration, Diorio noted that it will take time for the administration to respond.\r\n\r\n\"It might not happen overnight,\" Diorio said. \"It might not be a quick fix, but we are certainly going to take the input that we receive at this forum and bring it back to our community ... so that we can all work together in partnership to support kids.\"","excerpt":"Student forum to be held at 7 p.m. this Thursday in the MAC. Students will be given the opportunity to voice their opinions on student climate issues to Superintendent Max McGee and Principal Kim Diorio. ","date":"2015-02-25 18:30:26","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/11012292_10205630897719418_570304258_n.jpg","categories":["News","Spotlight"],"tags":{"8458":"administration","8496":"ASB","8644":"diorio","30042":"discussion","18366":"mac","25038":"McGee","11127":"media arts center","8944":"palo alto high school","39603":"paly student forum","10609":"school climate"}},{"id":99870,"title":"Liveblog: Boys&#8217; soccer CCS first round vs. Santa Teresa","permalink":"http:\/\/palyvoice.com\/2015\/02\/24\/liveblog-boys-soccer-ccs-first-round-vs-santa-teresa\/","content":"<em>Check back at 3 p.m. for live updates as the Palo Alto High School boys' soccer team (12-2-3, 8-2-1)<span style=\"font-weight: bold;\"> <\/span><span style=\"font-weight: bold;\"> <\/span>takes on Santa Teresa High School (10-5-7, 7-2-5)<span style=\"font-weight: bold;\"> <\/span>in the first round of the <span style=\"color: #000000;\">Central Coast Section playoffs at home. <\/span><\/em>\r\n\r\n[liveblog]","excerpt":"Check back at 3 p.m. for live updates as the Palo Alto High School boys' soccer team (12-2-3, 8-2-1)  takes on Santa Teresa High School (10-5-7, 7-2-5) in the first round of the Central Coast Section playoffs at home. ","date":"2015-02-24 23:40:24","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_55731.jpg","categories":["Sports"],"tags":{"8537":"Boys","8568":"CCS","9110":"Soccer"}},{"id":99857,"title":"Season preview: Boys&#8217; tennis looks to rebuild","permalink":"http:\/\/palyvoice.com\/2015\/02\/24\/season-preview-boys-tennis-looks-to-rebuild\/","content":"[caption id=\"attachment_68381\" align=\"alignnone\" width=\"595\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/tennispreview.jpg\"><img class=\"size-full wp-image-68381\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/tennispreview.jpg\" alt=\"Blake Smith, the number one seed last year will not be returning along with seven other seniors. Photo by Grant Shorin\" width=\"595\" height=\"396\" \/><\/a> Blake Smith, the number one seed last year will not be returning along with seven other seniors. Photo by Grant Shorin[\/caption]\r\n\r\nAfter losing in the second round of the Central Coast Section playoffs to top ranked Menlo School <a href=\"http:\/\/palyvoice.com\/2014\/05\/08\/boys-tennis-gears-up-for-ccs-after-successful-league-season\/\">last year<\/a>, the Palo Alto High boys' tennis team looks to rebuild this season starting tomorrow with a match against Sacred Heart.\r\n\r\nWith the loss of seven seniors, including the team's top three players, coach Andy Harader has shifted expectations from last season.\r\n\r\n\"We're not going to improve on 14-7 [last season] with seven starters graduating,\" Harader said. \"So this is a retooling season. It's a matter of reestablishing starter spots.\"\r\n\r\nHarader acknowledged that playing in the top league in Northern California is a double-edged sword.\r\n\r\n\"In a way, it's good because we play the best, but the downside to it is [since] we're in a down year right now, we'll be at the bottom of the league,\" Harader said.\r\n\r\nJunior captain Shiv Matta said that the team can still be successful despite the loss of key players.\r\n\r\n\"I'm expecting everyone to improve their game,\" Matta said. \"It's a young group, but I think we can do well if we play hard all season and compete day in and day out.\"\r\n\r\nThe boys' first match will be at 3:30 p.m. on Wednesday at Sacred Heart High School.","excerpt":"After losing in the second round of the Central Coast Section playoffs to top ranked Menlo School last year, the Palo Alto High boys' tennis team looks to rebuild this season.","date":"2015-02-24 20:59:26","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/02\/tennispreview.jpg","categories":["Sports"],"tags":{"11724":"boys tennis","11391":"new season","8944":"palo alto high school","12045":"season preview","10016":"tennis"}},{"id":97521,"title":"Representatives to speak about Middle College alternative learning","permalink":"http:\/\/palyvoice.com\/2015\/02\/24\/representatives-to-speak-about-middle-college-alternative-learning\/","content":"Representatives from Foothill's Middle College program will be in the College and Career Center at Palo Alto High School  tomorrow during lunch.\r\n\r\nMiddle College is an alternative program for high school upperclassmen, where students have the opportunity to take college-level courses at Foothill Community College. According to the<a href=\"http:\/\/www.foothill.edu\/programs\/middle.php\" target=\"_blank\"> Foothill Middle College Program website<\/a>, \"the <span style=\"color: #000000;\">coordinators of the Middle College Program understand that not all students fit the mold of the 'traditional high school student.' ... It is the goal of the Middle College to rekindle the desire to learn by offering an alternative academic program that better meets the needs of these students.\"<\/span>\r\n\r\nStudents of Middle College take History and English classes, as well as several college course electives to earn college-style credits. The program is open to students from the Palo Alto Unified School District, as well as students in the Mountain View-Los Altos district.\r\n\r\nSenior Shira Pederson was among several Paly students that opted to partake in this alternate learning environment in the past several years.\r\n\r\n\"It [the decision to participate in Middle College] started with getting too overwhelmed by all the classes I had to take at one time, and consequentially, my grades would start dropping by the end of the first month,\" Pederson said.\r\n\r\nPederson noted that differences between Middle College and the traditional high school experience include the school climate, homework policy and classroom experience.\r\n\r\n[caption id=\"attachment_99841\" align=\"alignleft\" width=\"336\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/1175021_621862484511337_1405863900_n.jpg\"><img class=\" wp-image-99841\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/1175021_621862484511337_1405863900_n.jpg\" alt=\"Students of Middle College participate in activities designed to strengthen teamwork on a group field trip to Yosemite. Photo courtesy of Shira Pederson.\" width=\"336\" height=\"223\" \/><\/a> Students of Middle College participate in activities designed to strengthen teamwork on a group field trip to Yosemite. Photo courtesy of Shira Pederson.[\/caption]\r\n\r\n\"It [Middle College] values honesty and risk taking,\" Pederson said. \"[Classroom life is] mostly projects [with] lots of teamwork involved [and] lots of little interesting day-to-day things that happen involving Foothill. Middle College tries to make it a fun place to be, so they have open mics, pizza and nice field trips.\"\r\n\r\nPederson recommends that Paly students struggling with social or academic issues attend the meeting to learn more about the program.\r\n\r\n\"If you don't like where you are currently – emotionally, mentally, physically – you should at least go to the meeting to get a better idea of what the faculty has to say,\" Pederson said.\r\n\r\nOverall, Middle College offers an alternative high school experience that encourages independence and responsibility.\r\n\r\n\"It gives you the freedom to control your life almost as much as a normal college student,\" Pederson said. \"It's a lot of responsibility, and you have to really know yourself and be kind of careful and controlled to make it through.\"","excerpt":"Representatives from Foothill's Middle College program will be in the College and Career Center to meet with interested sophomores tomorrow during lunch. \r\n","date":"2015-02-24 20:56:02","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/1175021_621862484511337_1405863900_n.jpg","categories":["News","Spotlight"],"tags":{"8604":"college","8606":"College and Career Center","34669":"Foothill","39370":"middle","39369":"middle college","39371":"shira pederson"}},{"id":99154,"title":"Opinion: Palo Alto not immune to misconceptions about disease","permalink":"http:\/\/palyvoice.com\/2015\/02\/24\/opinion-palo-alto-not-immune-to-misconceptions-about-disease\/","content":"[caption id=\"attachment_99881\" align=\"alignnone\" width=\"612\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_0001.jpg\"><img class=\" wp-image-99881\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_0001.jpg\" alt=\"The recent measles outbreak in the United States has raised some fears about public health safety, especially in schools, where unvaccinated children could potentially be exposed the the measles virus. Photo by Nika Woodfill.\" width=\"612\" height=\"408\" \/><\/a> The recent measles outbreak in the United States has raised some fears about public health safety, especially in schools, where unvaccinated children could potentially be exposed the the measles virus. Photo by Nika Woodfill.[\/caption]\r\n\r\nA <a href=\"http:\/\/www.cdc.gov\/measles\/cases-outbreaks.html\">recent measles outbreak<\/a> that has affected at least 141 people across 17 states, including <a href=\"http:\/\/www.cdph.ca.gov\/HealthInfo\/discond\/Pages\/MeaslesSurveillanceUpdates.aspx\">two in Santa Clara County<\/a>, has sparked a national conversation about the importance of vaccinations in maintaining public health.\r\n\r\nSomething of this magnitude, the reemergence of a potentially life-threatening disease, would usually generate much public discourse in Palo Alto. But alas, save for the occasional diatribe found on Palo Alto Online’s Town Square, our reaction to the outbreak has been pretty subdued. After all, we Palo Altans have been <em>entirely <\/em>responsible when it comes to getting our shots, and as <em>rational, highly scientific beings<\/em>, completely acknowledge the necessity of vaccinations in preserving public health. We all know that it’s really just the uneducated, impoverished, and\/or religious fundamentalist demographic groups that refuse to get their kids vaccinated and essentially allow infectious diseases to proliferate in the population.\r\n\r\nBut that’s not true.\r\n\r\nContrary to popular belief, the anti-vaccination movement is most prevalent in wealthy, educated and generally liberal enclaves. Take, for example, the cities of Santa Monica and Beverly Hills. In these affluent suburbs, droves of parents have filled out personal belief exemptions, or PBEs, meaning that their children can attend school despite not having the required shots because they have a moral objection to the vaccines. According to an an <a href=\"http:\/\/www.hollywoodreporter.com\/features\/los-angeles-vaccination-rates\/\">exposé written by The Hollywood Reporter in 2014<\/a>, close to 70 percent of parents have submitted personal belief exemptions in certain Southern California private schools, making the vaccination rates at those schools lower than those found in some developing countries.\r\n\r\nThankfully, the percentage of unvaccinated kids in Palo Alto is not even close to those frighteningly high numbers, and several schools in PAUSD  have a perfect or near-perfect vaccination record. That being said, data shows that there is a minuscule, surreptitious anti-vax movement within our city, and we need to pay attention.\r\n\r\nAccording to information from <a href=\"http:\/\/www.shotsforschool.org\/k-12\/how-doing\/\">ShotsForSchool.org<\/a>, an affiliate of the California Department of Public Health, approximately six percent of kindergarteners at Addison Elementary School in Palo Alto are inadequately vaccinated because their parents have submitted PBEs. This number seems laughably insignificant, but with a disease as infectious as measles, these few unvaccinated children could pose a serious threat to other students, especially those with compromised immune systems who, for medical reasons, cannot be vaccinated. Individuals with weak immune systems are highly susceptible to contracting illnesses, and have virtually no defense against disease. If I was a parent of a child who cannot receive the proper shots for medical reasons, I would, rightfully so, be very scared about this measles outbreak.\r\n\r\nWe believe ourselves to be an enlightened and progressive community; the importance and infallibility of science is stressed by a great many. Yet somehow, there are people who apparently spurn medical facts (<a href=\"http:\/\/www.cdc.gov\/vaccinesafety\/Concerns\/Autism\/antigens.html\">vaccines do NOT cause autism<\/a>) and potentially put people’s lives in jeopardy. Beyond being just plain wrong about the science behind vaccinations, anti-vaccination folks are morally negligent and show a wanton disregard for both their children's health and the general wellbeing of the public.\r\n\r\nThough its proponents aren’t vocal, nor is it widely accepted, the anti-vax movement has somehow seeped into Palo Alto. This goes to show that even a city heralded as an epicenter of technological progress isn’t immune to the dogma of this illogical campaign.\r\n\r\nThe vast majority of Palo Altans dutifully take their children to the doctor’s office for the proper shots and willingly comply with medical requirements, but in some ways, it seems almost as if we’ve forgotten what damage infectious disease can inflict upon us. After years of relative safety and no large-scale epidemics (other than the largely underground HIV\/AIDS epidemic) in the United States over the past few decades, infectious disease is no longer at the forefront of our minds. In fact, we seem to be amnesic when it comes to maladies: The 1918 Spanish influenza outbreak, the most devastating pandemic in the history of mankind, is but an obscure blurb in a dusty history textbook. Polio, smallpox, tuberculosis and other dastardly diseases that terrified and crippled the U.S. population less than a century ago are rarely mentioned, even by medical practitioners. Advances in medicine over the past 50 years or so have successfully assuaged our fears, and as a result, we’ve become almost ignorant of the horrors brought about by infectious disease.\r\n\r\nIn our never-ending race to innovate, and move society forward scientifically, we sometimes lose sight of the past. It’s imperative that we continue to progress but remain cognizant of our history. We can’t forget why we get shots and work actively to improve medicine: T0 protect ourselves, to the best of our abilities, from the indiscriminate onslaught of germs.\r\n\r\nThis current measles outbreak is a formidable reminder that a select few in one of the most highly educated and affluent communities -- our community -- are rejecting well-established medical claims in favor of rhetoric from anti-vax demagogues. But more importantly, the rise in measles cases across the United States demonstrates that we haven’t conquered disease; clearly, we have quite a bit of work to do as a nation if we want to avoid future public health disasters. Those of us who have been properly vaccinated have already solved part of the problem. The next step is to move away from our collective sense of complacency. I'm not saying that we need to go out and start what would essentially be a witch-hunt for all people who may be opposed to vaccinations. What we do need to do is acknowledge that infectious disease has not been eradicated, and be more aware of the fact that it poses a very real threat to our livelihood.","excerpt":"In light of a recent measles outbreak that has affected at least 141 people across 17 states, including two in Santa Clara County, staff writer Dhara Yu weighs in on public health issues which plague our community.","date":"2015-02-24 13:50:09","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_0001.jpg","categories":["Opinion","Spotlight"],"tags":{"39059":"anti-vaccination movement","39058":"anti-vax","39061":"disease","39056":"infectious disease","39055":"measles","8927":"opinion","39060":"outbreak","8939":"palo alto","8944":"palo alto high school","8977":"PAUSD","39057":"public health"}},{"id":98589,"title":"From a #SSS: Narrowing your college list","permalink":"http:\/\/palyvoice.com\/2015\/02\/24\/from-a-sss-narrowing-your-college-list\/","content":"As second semester seniors (a.k.a. #SSS), we have begun to reflect back on our high school experiences and look to pass along helpful advice and lessons we have learned.\r\n\r\nFor Palo Alto High School juniors looking toward next year, the college application process may seem like it's looming over your heads. Narrowing your college list is the first step in what can be a long, and arduous process. Finalizing which colleges and universities you wish to apply to can take months, so it’s best to start as soon as possible.\r\n\r\nHere are a few tips that we found helpful in narrowing down our own lists:\r\n<ul>\r\n\t<li><b>Check out or buy college books<\/b><\/li>\r\n<\/ul>\r\nThere are close to 4,000 colleges in the United States, which can be extremely overwhelming. Luckily, a good way to dip your toes into the ocean of colleges is to start flipping through a college guide book, such as the \"Fiske Guide to Colleges\" or The Princeton Review's \"The Best 379 Colleges.\" These books offer an overview of many schools, various stats and some insight into student life. You can get a sense for what schools are out there and what you want in a college by skimming through the books and picking out attributes that appeal to you. These books can be purchased in bookstores and online or rented out for free at the College and Career Center or at a local library.\r\n<ul>\r\n\t<li><b>List out attributes<\/b><\/li>\r\n<\/ul>\r\nAfter getting a sense for what's out there, it's a good time to focus in on what you specifically want. One of the strategies that worked well for us is to divide the attributes we were looking for into two categories: must-haves and like-to-haves. Those under the must-haves would be deal-breakers (such as the student body size or location of campus), whereas those under like-to-haves are things you could see yourself living without (such as having a good football team or the type of weather on campus). There are many Internet resources that will give you suggestions based on requirements you input like <a href=\"https:\/\/connection.naviance.com\/family-connection\/auth\/login\/?hsid=pahs\">Naviance<\/a> and <a href=\"https:\/\/bigfuture.collegeboard.org\/college-search\">The College Board<\/a>. There are also sites like <a href=\"https:\/\/colleges.niche.com\/\">College Prowler, <\/a>which host reviews from actual students at that school.\r\n<ul>\r\n\t<li><b>Seek out advice<\/b><\/li>\r\n<\/ul>\r\nIf you start getting lost in the sea of college info that’s out there, it may be time to talk to a professional. Luckily, that’s exactly what the College and Career Center counselors are there for. All college-bound Paly juniors are recommended by their advisers to schedule a meeting with their corresponding C&amp;CC counselor — something we recommend being on top of, since the meeting time slots fill up quickly. These meetings can help focus your college list with their realistic advice and give you a different perspective on your college process so far. Paly grads are also good resources regarding the college process and are usually happy to give their advice if you reach out to them. Some may also choose to hire a private college advisor if they want additional services.\r\n<ul>\r\n\t<li><b>Visit colleges to get a feel for different kinds of campuses<\/b><\/li>\r\n<\/ul>\r\nIt’s one thing to read about a college, but it's a whole other thing to actually experience a college. Knowing how you feel on a campus and getting placed in that environment can help you narrow down what you like in a college. You don’t even have to go out of the Bay Area <span style=\"color: #252525;\">— <\/span>there are a variety of colleges within driving distance, such as Santa Clara University (27 minutes from Paly); University of California, Berkeley (59 minutes); Stanford University (5 minutes); and San Jose State University (32 minutes). Even if you aren’t interested in that particular college, going to visit can help you understand how you’d feel on a campus of that size, with that size of student body and in that environment. Sitting in on a class can also be invaluable in getting a feel for the classroom dynamics <span style=\"color: #252525;\">—<\/span> there are a range of styles from large lecture halls to smaller, discussion-based classrooms. Since this is a place you may hope to attend for a couple of years you want to know what the education you will be getting will be like. We recommend choosing a weekend or break to visit a variety of colleges.\r\n<ul>\r\n\t<li><b>Choose a variety<\/b><\/li>\r\n<\/ul>\r\nWe have all heard of the Ivies and the top 25 colleges in the country, but there are so many great colleges out there to choose from <span style=\"color: #252525;\">—<\/span> many you probably have never even heard about before. We recommend that you choose colleges because they have attributes that appeal to you, like a unique major or great school atmosphere, and not solely because of the name. That being said, dream big, but you should definitely have reasonable back ups. Also, don’t overlook or underestimate safety or match schools. Naviance is a great tool to compare your academic statistics to former Paly students who applied to schools you're interested in. Remember, these statistics are only a part of the application, but they are a great starting point to see how realistic your list is. Keep in mind that any school on your list should be one where you see yourself succeeding and enjoying the next few years of your life.","excerpt":"As second semester seniors (a.k.a. #SSS), we have begun to reflect back on our high school experiences and look to pass along helpful advice and lessons we have learned. For Palo Alto High School juniors looking toward next year, the college application process may seem like it's looming over your heads. Check out our tips on narrowing down your college list.","date":"2015-02-24 13:30:39","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-11.jpg","categories":["Opinion","Spotlight"],"tags":{"33420":"advice","8604":"college","38978":"college list","38979":"from a #sss","38977":"narrowing your college list"}}]