[{"id":98084,"title":"Former Secretary of Energy to kick off MAC Speaker series","permalink":"http:\/\/palyvoice.com\/2015\/02\/21\/former-secretary-of-energy-to-kick-off-mac-speaker-series\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_98085\" align=\"aligncenter\" width=\"554\"]<img class=\"wp-image-98085\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/mac.jpg\" alt=\"This speaker event is first in the MAC’s Speaker Series.“There will be three more later this spring,” Wojcicki said. “We want to get students intellectually excited, bring the community together with great speakers at a low cost.”  \" width=\"554\" height=\"419\" \/> The school's Media Arts Center will host former United States Secretary of Energy, Steven Chu as part of the Media Arts Center’s Speaker Series.“There will be three more later this spring,” Event Organizer and Palo Alto High School Journalism teacher Esther Wojcicki said. “We want to get students intellectually excited, bring the community together with great speakers at a low cost.” Photo William Zhou.[\/caption]\r\n<p style=\"text-align: left;\">Former United States Secretary of Energy Steven Chu will speak about his experiences at  7 p.m. on Wednesday, Feb. 25 in the Palo Alto High School Media Arts Center.<\/p>\r\nChu will focus on energy and his experiences working with the press on climate change, according to Paly journalism teacher Esther Wojcicki.\r\n\r\n“He’ll be talking about the environment and climate change: What can be done, what he has tried and what has worked and failed,” Wojcicki said.\r\n\r\nThis talk, titled \"Energy, Climate Change and a Path Forward,\" is sponsored by the school's Media Arts Boosters, and is the first installment in the MAC Speaker Series.\r\n\r\n“There will be three more events later this spring,” Wojcicki said. “We want to get students intellectually excited, and bring the community together with great speakers at a low cost.”\r\n\r\nWojcicki said the the purpose of the series is to pique interest of the public on various topics.\r\n\r\n“The purpose of the event is to bring the community into the new MAC building so they can enjoy some intellectually stimulating talks,” Wojcicki said. “[The] target audience is student, parents and community members.”\r\n\r\nSenior Ankita Avadhani expressed interest in attending the new series.\r\n\r\n\"I think the speaker series is great in general, because it exposes students to a variety of topics they wouldn't really get to experience before,\" Avadhani said. \"Having professional speakers as well can really bring a new light onto the topics as well.\"\r\n\r\nAccording to the<a href=\"http:\/\/www.eventbrite.com\/e\/paly-media-arts-center-great-minds-at-campus-speaker-event-steven-chu-tickets-15578382361\"> event page<\/a>, student and adult tickets are available for purchase online at $5 and $10 respectively, and proceeds will benefit the Media Arts Center Boosters.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Former United States Secretary of Energy Steven Chu will speak about his experiences at  7 p.m. on Wednesday, Feb. 25 in the Palo Alto High School Media Arts Center.","date":"2015-02-21 16:42:36","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/mac.jpg","categories":["News","Spotlight"],"tags":{"8595":"climate change","38961":"energyg","8747":"guest speaker","18366":"mac","11127":"media arts center","38959":"speaker series","38960":"steven chu"}},{"id":99167,"title":"Liveblog: Sadie Hawkins formal dance 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/20\/liveblog-sadie-hawkins-formal-dance-2015\/","content":"<em>Palo Alto High School will host an <a href=\"http:\/\/palyvoice.com\/2015\/02\/19\/asb-to-host-all-inclusive-sadie-hawkins-dance\/\">\"all-inclusive\" Sadie Hawkins formal dance<\/a> tonight in the Small Gym. Check back at 7:30 p.m. for live updates and commentary of the dance.<\/em>\r\n\r\n[liveblog]","excerpt":"Palo Alto High School will host an \"all-inclusive\" Sadie Hawkins formal dance tonight at 7:30 in the Small Gym. Check back at 7:30 p.m. for live updates and commentary of the dance.","date":"2015-02-20 19:08:49","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/20141101_214325.jpg","categories":["Entertainment"],"tags":{"8626":"dance","10003":"formal","39011":"sadie hawkins","39012":"sadies"}},{"id":98887,"title":"ASB to host &#8220;all-inclusive&#8221; Sadie Hawkins dance","permalink":"http:\/\/palyvoice.com\/2015\/02\/19\/asb-to-host-all-inclusive-sadie-hawkins-dance\/","content":"[caption id=\"attachment_99140\" align=\"alignnone\" width=\"759\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-19-at-6.59.50-PM.png\"><img class=\"size-full wp-image-99140\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-19-at-6.59.50-PM.png\" alt=\"Olivia Scola asked Michael Pappas to the dance on the Quad. Her sign reads, &quot;I'd be on could 9 if you came with me to Sadies.&quot; Photo by\" width=\"759\" height=\"389\" \/><\/a> Senior Olivia Scola asks fellow senior Michael Pappas to join her at Paly's Sadie Hawkins formal dance. Sadies dances typically encourage girls to ask boys to the dance, breaking the stereotype of boys doing the asking. The formal will be held at 7:30 p.m. today in the Small Gym. Her sign reads, \"I'd be on cloud 9 if you came with me to Sadies.\" Photo by Reid Walters.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body is making efforts to break gender barriers and stereotypes with its upcoming Sadie Hawkins formal dance at 7:30 p.m. today in the Small Gym.\r\n\r\nUnlike typical Sadie Hawkins-themed dances, which usually promote females to ask males to the dance, ASB <a href=\"https:\/\/docs.google.com\/document\/d\/16O5tIPzYpCBBgcvhlTiasUH9j0rztsru3GpKkFONQQg\/edit\">released a statement<\/a> in order to address any gender-related issues or concerns that surround the theme.\r\n\r\n\"Historically, Sadie Hawkins has been a dance that has encouraged females to invite their male peers,\" the statement said. \"As a body, we [ASB] recognize the progress society has made since the origination of Sadies, as well as the growing conversation related to gender roles and gender identity. ASB would like to emphasize that this winter dance, like all of our events, is<i> all-inclusive<\/i>. Students of every gender identity and sexual orientation are empowered to ask (or not ask) any person they so desire to this event. We encourage and welcome all students to attend, whether they choose do so with a date, with friends or alone.\"\r\n\r\nThe theme was decided after joint input from an online poll sent out to the student body last month and extensive discussion within ASB. The poll granted students the ability to voice their opinion on the theme for the upcoming dance and garnered just under 300 responses, the vast majority of which indicated for a Sadie Hawkins theme, according to Senior Class President Claire Liu.\r\n\r\nLiu expands on how ASB has worked to address stereotypes of boy-ask-girl dances and Sadie's dances.\r\n\r\n<span style=\"color: #373e4d;\">\"ASB officers are well aware of some of the conversation points Sadie's as a concept brings up, and we felt this would also be an appropriate time to address some of the gender roles and traditional notions the dance may be associated with,\" Liu said. \"We really saw this as an opportunity to expand the meaning of Sadie's, and make efforts to redefine it and make it more inclusive, as shown in our publicity, event page, and press statement.\" <\/span>\r\n\r\nAs part of ASB, Senior Class Vice President Olivia Scola is involved in organizing the dance.\r\n\r\n\"I am anticipating that the winter dance will be successful,\" Scola said. \"I think that girls have the opportunity to ask anyone they want to any dance we have, but Sadie's encourages women to ask their friend or special someone even more.\"\r\n\r\nSophomore Katie Passarello asked a date to join her at the dance.\r\n\r\n<span style=\"color: #373e4d;\">\"A bunch of my friends and I decided to ask our guy friends in a group because it would be cute and fun,\" Passarello said. \"I'm a good dancer, so I can't wait to show off my moves.\" <\/span>\r\n\r\nThe dance will be three hours long, from 7:30 p.m. to 10:30 p.m. Additionally, ASB is offering free donuts to all attendees.\r\n\r\nTickets will be sold on the Quad during lunch, on the <a href=\"https:\/\/palywebstore.myschoolcentral.com\/asbworks\/(S(5qpc0a45pntd5r45otkkil3m))\/WebStore.aspx\">online web store<\/a> and at the door according to ASB. Tickets will cost $5 for students with ASB cards and $10 for those without.\r\n\r\n&nbsp;","excerpt":"Paly ASB is making efforts to break gender barriers and stereotypes with its upcoming Sadie Hawkins formal dance at 7:30 p.m. tomorrow in the Small Gym.","date":"2015-02-19 23:48:06","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-19-at-6.59.50-PM.png","categories":["News","Spotlight"],"tags":{"8496":"ASB","8499":"Associated Student Body","14290":"claire liu","8626":"dance","39013":"katie passarello","29813":"olivia scola","8944":"palo alto high school","39011":"sadie hawkins","39012":"sadies","11267":"winter dance"}},{"id":98908,"title":"Review: Dontcha want to try Gong Cha?","permalink":"http:\/\/palyvoice.com\/2015\/02\/19\/review-dontcha-want-to-try-gong-cha\/","content":"Fear not, Palo Altans! Gong Cha has come to downtown Palo Alto to give you a little more variety in your pearl milk tea endeavors. Panda Milk tea with crunchy white pearls and chewy tapioca pearls and QQ Passion Fruit green tea with vibrant fruity flavors that taste like summer are just a couple of creative flavors that Gong Cha offers.\r\n\r\nGong Cha, which opened last Saturday, is located at 439 Waverley St. and has other locations in the Bay Area, including Fremont and San Jose. It also has more than 300 stores in Asia and Australia, according to its <a href=\"http:\/\/gong-cha-usa.com\/about-us\/\">website<\/a>.\r\n\r\nThere are many ways for a customer to personalize a drink at Gong Cha. The sweetness and ice levels can be adjusted, and there are a variety of additions, such as the standard egg pudding, tapioca pearls, coconut jelly and herbal jelly. Gong Cha also features milk foam, basil seed, ai-yu jelly and the uncommon white pearls. The white pearls are made from seaweed extract and are slightly crunchier and healthier for you, according to shift lead Jacki Wasmann.\r\n\r\n[caption id=\"attachment_98965\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_5931.jpg\"><img class=\"size-full wp-image-98965\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_5931.jpg\" alt=\"An array of possible additions is on display at Gong Cha currently. There are also samples of puddings and jellies for the customers to experience the flavors without committing to a full drink. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> An array of possible additions is on display at Gong Cha currently. There are also samples of puddings and jellies for the customers to experience the flavors without committing to a full drink. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nGong Cha also specializes in frothy milk-topped teas, or \"Mustache Teas\" as its menu says. According to Wasmann, the green and black pearl milk teas are the best sellers.\r\n\r\nGong Cha is the second pearl milk tea place in Palo Alto after <a href=\"http:\/\/palyvoice.com\/2014\/10\/29\/pearl-milk-tea-comes-to-palo-alto-from-taiwans-t4\/\">T4<\/a> moved in last October. Wasmann said that the company is not worried about the competition with T4 since it has different specialties and everyone has different preferences.\r\n\r\nPalo Alto High School students are excited about the new PMT store since they are no longer limited to T4 in the local vicinity.\r\n\r\n<span style=\"color: #373e4d;\">\"<\/span>The tea itself was really fresh,\" junior Aiva Petriceks said. \"Unlike other stores where you can mostly taste the syrup, the tea actually came through. The passion fruit tea was amazing. I didn't like the boba [tapioca pearls] because it wasn't as soft as I would like it. It's really unfortunate that they [Gong Cha] don't have the best location, because it deserves the attention T4 gets.\"\r\n\r\n<em>What I ordered: <\/em>Green Pearl Milk Tea ($3.25)\r\n\r\n<em>Overall Rating: <\/em>6.5\/10\r\n\r\n<em>Student Opinion: <\/em>\"I liked the change of sweetness,\" senior Mary Champagne said. \"Not too sweet and very reminiscent of Loving Hut.\"\r\n\r\n[caption id=\"attachment_98966\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_5927.jpg\"><img class=\"size-full wp-image-98966\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_5927.jpg\" alt=\"The green Pearl Milk Tea was rich and not watered down. The pearls were not very generous, which was alright because they were not very chewy or flavorful. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> The green pearl milk tea was rich and not watered down. The pearls were not very generous, which was alright because they were not very chewy or flavorful. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\n<em>Features: <\/em>Walking into the store, you are met with a smiling face and an overwhelmingly large board depicting the available drinks. The store generally seems dim and not very lively. The interior is very dark with the color scheme focusing on brown. There was limited seating, but there were still places where you could sit down and chat.\r\n\r\nGong Cha has two sizes: medium and large. The drinks are very customizable with variations in ice and sugar. The sweetness is very important to change because the tea is generally very sweet.\r\n\r\nThe tapioca pearls definitely left something to be desired. The pearls were not squishy, felt very oblong and were very difficult to fit through the straw. The center felt almost undercooked.\r\n\r\nThe tea itself was very flavorful and rich. The texture was creamy and not at all chunky or powdery. There was no distinct feature for Gong Cha. It felt very standard, where nothing was bad but nothing was striking or extremely delicious.\r\n\r\nThe service was very slow. The workers talked with each other to make sure they were doing the right thing. I assume this is because the store is still very new and they have not worked out all the kinks yet. The staff was very friendly and willing to answer any questions about the menu. Gong Cha uses a stamping system where the 10th drink is free.\r\n\r\nGong Cha is currently open from 11:30 a.m. to 5 p.m.\r\n\r\n&nbsp;","excerpt":"Gong Cha, a new Pearl Milk Tea shop, opened up in Palo Alto on Saturday at 439 Waverley Street. Gong Cha is the second Pearl Milk Tea place to open in downtown Palo Alto within the past six months. ","date":"2015-02-19 21:21:09","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_5930.jpg","categories":["News","The ultimate PMT challenge"],"tags":{"29703":"boba","29707":"bubble tea","38965":"gong cha","27710":"grand opening","8912":"new","8939":"palo alto","29705":"pearl milk tea","29704":"pmt","9044":"restaurant","9045":"review","31269":"taiwan","38964":"waverley","38966":"white pearls"}},{"id":98551,"title":"Five tips for students to avoid burglary","permalink":"http:\/\/palyvoice.com\/2015\/02\/19\/five-tips-for-students-to-avoid-burglary\/","content":"Palo Alto is safer than 68.5 percent of the cities in the United States, according to <a href=\"http:\/\/www.areavibes.com\/palo+alto-ca\/livability\/\" target=\"_blank\">AreaVibes<\/a>, a website that uses national data to determine the livability of a city. The crime rate in Palo Alto is lower than that of 80 percent of the cities in California, which gives Palo Alto an “A+” rating in the AreaVibes system. However, AreaVibes rates cities in comparison to each other, and despite acing the AreaVibes test, Palo Alto still isn’t perfect according to more local statistics.\r\n\r\nAccording to the City of Palo Alto website, there were a total of 332 burglaries in Palo Alto in 2012 and 242 burglaries in 2013. The chance of being a victim of a property crime, or burglary, in Palo Alto is 1 in 46, and precautions should still be taken.\r\n\r\nThe Paly Voice interviewed Lt. Perron of the Palo Alto Police Department to compile five tips for students to protect themselves against burglary, whether they’re heading to practice or home alone for the weekend.\r\n\r\nListed below are five of Perron's tips to avoid a burglary:\r\n\r\n<b>1. Leave everything locked:<\/b>\r\n\r\nAlways lock your windows and doors. According to Perron, sometimes people leave doors unlocked because they assume Palo Alto is a safe community.\r\n\r\n“Never leave a door or window open or unlocked,” Perron wrote in an email interview. “No matter how hot it may be or how short of a time you may be gone.\" Perron said that the most common points of entry are often just “doors that people will leave unlocked or open, either intentionally, because they have a false sense of security living in a safe city like Palo Alto, or accidentally.\"\r\n\r\n<b>2. Pretend you are home:<\/b>\r\n\r\nPerron suggests turning on some music or the TV before leaving the house or leaving the lights on so that the potential burglar thinks someone is home.\r\n\r\n“They [the burglars] are looking for empty homes so they can break in, steal stuff real fast, and leave quickly with no chances of getting caught,” Perron said.\r\n\r\n<b>3. Use just one headphone:<\/b>\r\n\r\nWhen home alone, avoid studying while listening to music with headphones on, as you might not hear suspicious noises.\r\n\r\n<b>4. Beware the solicitor ruse:<\/b>\r\n\r\nThe most common trick burglars use when trying to find out if someone is home is pretending to be a solicitor, according to Perron. Even if you don’t want to answer the door, talk to them through the door so they know someone’s home.\r\n\r\n“Burglars don’t want confrontations, and they don’t want witnesses,” Perron said. Just knowing that someone is in the house is often enough of a deterrent for them.\r\n\r\n<b>5. Look out for your neighbors:<\/b>\r\n\r\nIf you see an unfamiliar car drive aimlessly down your street, or a stranger ring the doorbell of a neighbor’s house and then walk around to the back, call the police. Chances are these are experienced burglars who are working their way through a neighborhood and may target your house next.\r\n\r\nIf you would like to learn more or have any questions, the Palo Alto Police Department has a <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/pol\/social_media_connections.asp\">media presence<\/a> on Twitter, Facebook, Nextdoor, Nixle, YouTube, Flickr and will be launching an Instagram later this year. The PAPD also has a free mobile app for <a href=\"http:\/\/palyvoice.com\/wp-admin\/%20bit.ly\/PAPD-AppStore\">iOS<\/a> and for <a href=\"http:\/\/palyvoice.com\/wp-admin\/bit.ly\/PAPD-GooglePlay\">Android<\/a>.\r\n\r\n[caption id=\"attachment_98902\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-17-at-1.05.49-PM.png\"><img class=\"size-full wp-image-98902\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-17-at-1.05.49-PM.png\" alt=\"A camera in a Palo Alto home captures two burglars breaking in. The video of this burglary has been shared on Facebook by the Palo Alto Police Department in an effort to catch the burglars. Photo courtesy of the PAPD.\" width=\"800\" height=\"434\" \/><\/a> A camera in a Palo Alto home captures two burglars breaking in. <a href=\"https:\/\/www.youtube.com\/watch?v=0onDD6e0N5A&amp;feature=youtu.be\">The video of this burglary<\/a> has been shared on Facebook by the Palo Alto Police Department in an effort to catch the burglars.[\/caption]","excerpt":"The Paly Voice interviewed Lt. Zachary Perron to compile five tips for students to protect themselves against burglary, whether they’re heading to practice or home alone for the weekend.","date":"2015-02-19 13:38:25","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-17-at-1.05.49-PM.png","categories":["Features"],"tags":{"38652":"burglary","38654":"five","8770":"home","38653":"Lt. Zachary Perron","14866":"tips"}},{"id":80797,"title":"The fresh kids corner: Sophie Frick","permalink":"http:\/\/palyvoice.com\/2015\/02\/19\/the-fresh-kids-corner-sophie-frick\/","content":"<em>Participating in a varsity sport under the stress and spotlight of high-pressure games and tournaments can be daunting, especially to those with little experience playing at that level. In this second installment of a three-part series, The Paly Voice features the youngest and least-experienced members of the Palo Alto High School varsity basketball teams: the freshmen.<\/em>\r\n\r\nRecently, The Paly Voice sat down with one of the two freshmen on this year's girls' basketball team, forward Sophie Frick, to talk about life at Paly, inspirational teammates and what it will take for the girls' team to finish strong.\r\n\r\n[caption id=\"attachment_98904\" align=\"alignnone\" width=\"616\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_8696.jpg\"><img class=\" wp-image-98904\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_8696.jpg\" alt=\"Freshman forward Sophie Frick warms up behind the three-point line prior to a game vs. Gunn earlier this season. Frick is one of two freshman on the girls' team this season. Photo by George Lu. \" width=\"616\" height=\"413\" \/><\/a> Freshman forward Sophie Frick warms up behind the three-point line prior to a game vs. Gunn earlier this season. Frick is one of two freshman on the girls' team this season. Photo by George Lu.[\/caption]\r\n\r\nThe Paly Voice: It's a unique situation to play varsity basketball as a freshman. What's it like for you?\r\n\r\nSophie Frick: It's a really, really special experience, especially getting to play with the older players. You get to learn a ton from the upperclassmen, and even though there's not that many, the people that are older than me and Carly [Leong], we get to learn a lot from them.\r\n\r\nTPV: Speaking of the older players, out of all the other players on the team, who do you look up to most? Personality-wise and playing-wise?\r\n\r\nSF: I would pick Coco Lovely because she's a beast out there on the court, diving after every loose ball and looking for every drive and every rebound. Overall, she's such a happy person and always really positive – something I aspire to be like.\r\n\r\nTPV: What do you like about Coach Scott Peters as a mentor?\r\n\r\nSF: Coach Scott is very passionate about the game. You will not meet anybody who loves the game more than him and cares about all of us and the team more. He'll get us pizza after practice because we did well, and he teaches us stuff that I would not learn from any other coach.\r\n\r\nTPV: What do you like most about the high school experience thus far?\r\n\r\nSF: I honestly really like the different people and the overall environment and atmosphere at Paly. There's a lot of really positive people, teachers, staff and upperclassmen. New friends are great, as well.\r\n\r\nTPV: All right. What's the worst thing about the transition to high school?\r\n\r\nSF: I would probably say getting used to scheduling and time management. But I am learning and getting used to it.\r\n\r\nTPV: What's your individual goal for the rest of the season? What do you think about this team's potential? What does a team that has started so strong have to do to finish strong?\r\n\r\nSF: Our stretch goal is to win CCS [Central Coast Section], without a doubt. My personal goal would be to continue to improve as a team player and pass to teammates that are open. Small things like that. We all want to finish strong.\r\n\r\nTPV: Is there an athlete in professional sports who you look up to? Kind of like Lovely, but someone more well known?\r\n\r\nSF: I don't think there's a particular athlete. I think it's more like a team play, like the San Francisco 49ers, even though they didn't do very well this year. In past years, however, their defense really works together and makes plays as a team.\r\n\r\nTPV: What does it mean to you to have Carly [Leong] on the team with you, as a fellow freshman going through the same experience?\r\n\r\nSF: Carly's like my No. 1 on the team. Being freshman buddies means getting the freshman treatment on the team, whether that's gathering loose balls [or] stuff like that. But it's really nice to experience this great team and great season with her.\r\n\r\nTPV: What does Paly need to know about you for the future?\r\n\r\nSF: I'm ready for the next three years of basketball and other sports, as well. I hope to make a big difference in the athletics.\r\n\r\n<em>Frick and the girls' team is currently 22-2 overall, with an undefeated record of 12-0 in the De Anza League. <\/em>\r\n\r\n&nbsp;","excerpt":"In this second installment of a three-part series, staff writer Josh Yuen sits down with one of the two freshmen on this year's girls' team, forward Sophie Frick, to talk about life at Paly, inspirational teammates and what it will take for the girls' team to finish strong.","date":"2015-02-19 13:21:51","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_8696.jpg","categories":["Sports"],"tags":{"10098":"basketball","38661":"freshman basketball","8721":"freshmen","8735":"girls basketball","38660":"sophie frick","38967":"The fresh kids corner"}},{"id":97913,"title":"Mitchell Park Community Center to host teen trivia night","permalink":"http:\/\/palyvoice.com\/2015\/02\/19\/mitchell-park-community-center-to-host-teen-trivia-night\/","content":"[caption id=\"attachment_99057\" align=\"alignnone\" width=\"560\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/1658533_367717013390203_3692188933849498793_o.jpg\"><img class=\"wp-image-99057 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/1658533_367717013390203_3692188933849498793_o.jpg\" alt=\"1658533_367717013390203_3692188933849498793_o\" width=\"560\" height=\"420\" \/><\/a> Teen Advisory Board members gather at the first meeting of the year. The board will host a teen trivia night on Feb. 27th at the Mitchell Park Community Center. Photo courtesy of The Palo Alto Teen Advisory Board.[\/caption]\r\n\r\nThe Palo Alto Teen Advisory Board will host a free trivia night for high school students at the Mitchell Park Community Center from 6 - 8 p.m. on Friday, Feb. 27. The event will provide food, music and board games.\r\n\r\nAccording to Amal Aziz, The City of Palo Alto’s recreation coordinator for youth and teen services, the event will allow for high school students to relax with friends and compete in trivia games in a fun environment.\r\n\r\n“With teen schedules so busy, our <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/recreation\/teens\/leadership.asp\">Teen Advisory Board<\/a> wanted to create a positive and safe space for teens [to] relax and have fun,” she said.  “It's a great way to take a break from the hectic demands of high school life and hang out with old friends, meet new ones and simply enjoy yourself.”\r\n\r\nTeens will have the option of either competing casually with friends or competitively for the chance to win prizes, according to Aziz.\r\n\r\n\"The [trivia game] will be in a jeopardy\/trivia crack style,\" said senior Brigid Godfrey, co-president of the Teen Advisory Board. \"[It] will consist of teams of four competing in consecutive rounds [with] more and more difficult questions.\"\r\n\r\nAccording to Godfrey, the trivia night will be one of many upcoming Friday teen nights at the Mitchell Park Teen Center.\r\n\r\nTeens wishing to attend the event can RSVP on the Teen Advisory Board <a href=\"https:\/\/www.facebook.com\/events\/1566526860253432\/?ref_newsfeed_story_type=regular\">Facebook page<\/a>.","excerpt":"The Palo Alto Teen Advisory Board will be hosting a free trivia night for high school students at the Mitchell Park Community Center on Friday, Feb. 27 from 6 - 8 p.m.","date":"2015-02-19 13:19:41","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/1658533_367717013390203_3692188933849498793_o.jpg","categories":["News"],"tags":{"27709":"mitchell park","29312":"mitchell park library","36631":"mitchell park library community center","8939":"palo alto","27177":"teen","38444":"trivia night"}},{"id":99012,"title":"Paly fencers win gold at 2015 Junior Olympics","permalink":"http:\/\/palyvoice.com\/2015\/02\/18\/paly-fencers-win-gold-at-2015-junior-olympics\/","content":"[caption id=\"attachment_99033\" align=\"alignnone\" width=\"504\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/fencing.jpg\"><img class=\"wp-image-99033\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/fencing.jpg\" alt=\"fencing\" width=\"504\" height=\"378\" \/><\/a> Senior Royce Wang (middle) poses with his Cardinal Fencing teammates after winning gold at the Junior Olympics this past weekend. Wang will be fencing at Stanford University next year. Photo courtesy of Royce Wang.[\/caption]\r\n\r\nTwo Palo Alto High School students are gold medal champions after fencing at last weekend's Junior Olympics in Virginia.\r\n\r\nSenior Royce Wang was part of the Cardinal Fencing junior men’s sabre team that won gold in Richmond, Va. last Saturday, while junior Julian Knodt took home gold in the individual junior men’s foil division.\r\n\r\nWang said that the win, first and foremost, meant a lot to his team and his club.\r\n\r\n“It's the first title we won as a club in [the] men's team event,” Wang said. “It was a team event, so it didn’t offer any points [that go toward individual national ranking] – it was only about medals and club glory.”\r\n\r\nHowever, Wang added that the win still carried personal significance as well.\r\n\r\n“It's one of my last Junior Olympic events before I join the Taiwanese national team,” Wang said. “It was a good jump start for my individual event the next day. It took a lot of pressure off [of me].”\r\n\r\nKnodt, a member of the Massialas Fencing Foundation in San Francisco, attributed his win to multiple factors.\r\n\r\n“It's a combination of a lot of things,” Knodt said. “I guess the most noticeable things I could point to would be good coaches, lots of experience in past tournaments and practice. I try not to think about how things will end up. I just try to fence and worry about the end result after it's all over.”\r\n\r\nKnodt also emphasized that despite this achievement, he remains future-focused.\r\n\r\n“Before this tournament, I qualified for international Under 16 events,” Knodt said. “With this result, I hopefully can qualify for Under 19 international events. … I'm just going to keep practicing and try to improve my fencing.\"\r\n\r\n&nbsp;","excerpt":"Multiple Palo Alto High School students won gold medals for fencing at the Junior Olympics last weekend in Virginia.","date":"2015-02-18 22:43:12","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/fencing.jpg","categories":["Sports"],"tags":{"14171":"fencing","38970":"gold","38971":"gold medal","38968":"julian knodt","38969":"junior olympics","8944":"palo alto high school","9052":"royce wang"}},{"id":98999,"title":"Slideshow: Boys&#8217; soccer finish first in league on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/02\/18\/slideshow-boys-soccer-finish-first-in-league-on-senior-night\/","content":"Palo Alto High School boys' soccer (12-3-3, 8-2-1) celebrated its Senior Night and last game in league play by defeating Los Gatos High School (9-8-3, 3-5-3) 2-1 to finish in first place in the De Anza League.\r\n\r\nThe team's five seniors were honored in a ceremony before the game.\r\n\r\nJunior midfielder Cole Tierney scored both of Paly's goals, securing the team's win.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AMGAnWsDkkBB\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Palo Alto High School boys' soccer (12-3-3, 8-2-1) celebrated its Senior Night by defeating Los Gatos High School (9-8-3, 3-5-3) 2-1 to finish first place in the De Anza League.\r\n","date":"2015-02-18 21:09:43","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_1132.jpg","categories":["Uncategorized"],"tags":{"10311":"boys soccer","17499":"FIRST","9884":"league","9914":"los gatos","9087":"Senior Night","10981":"win"}},{"id":99025,"title":"Naviance demonstration for students during Tutorial Feb. 24 in LRC, parent demo at 7 p.m. March 4","permalink":"http:\/\/palyvoice.com\/2015\/02\/18\/naviance-demonstration-for-students-tutorial-feb-24-in-lrc-parent-demo-at-7-p-m-march-4\/","content":"","excerpt":"","date":"2015-02-18 18:04:06","author":"Lizzie Chun","categories":["Ticker"],"tags":{"38974":"demo","38973":"demonstration","38972":"naviance"}}]