[{"id":107559,"title":"Verbatim: Who will win this year&#8217;s Super Bowl?","permalink":"http:\/\/palyvoice.com\/2015\/09\/11\/verbatim-who-will-win-this-years-super-bowl\/","content":"With the National Football League's annual Super Bowl coming to Santa Clara this February, The Paly Voice asked students which teams they believed would play in the biggest football game of the year.\r\n\r\nHover over the white dots to see what they have to say.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/698693490963382274\/1024\/10\/scaletowidth#tl-698693490963382274;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"With the National Football League's annual Super Bowl coming to San Francisco this February, The Paly Voice asked students which teams they believed would play in the biggest football game of the year.","date":"2015-09-11 19:38:47","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Voice-SuperBowl1.png","categories":["Sports","Verbatims"],"tags":{"53301":"alec olmstead","53305":"ankita amberkar","37718":"eli friedlander","8714":"football","53303":"george welch","53302":"john liu","53299":"julia taylor","53308":"nfl","53306":"nura mstaghimi","10667":"santa clara","53298":"super bowl","53300":"taylor","53307":"timothy liu","53304":"will sallomi"}},{"id":107536,"title":"Liveblog: Football vs. San Benito","permalink":"http:\/\/palyvoice.com\/2015\/09\/11\/liveblog-football-vs-san-benito\/","content":"Check back here for live updates beginning at 7:15 p.m. as the Palo Alto High School football team (1-0, 0-0) hosts the San Benito Haybalers (1-0, 0-0) for its second game of the season. The Haybalers shut out the Vikings last year 33-0 at their home field in Hollister. \r\n\r\n[liveblog]","excerpt":"Check back here for live updates beginning at 7:15 p.m. as the Palo Alto High School football team (1-0, 0-0) hosts the San Benito Haybalers (1-0, 0-0) for its second game of the season. ","date":"2015-09-11 15:11:07","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSC_0280.jpg","categories":["Sports"],"tags":{"8714":"football","29082":"home game","8855":"liveblog","9059":"San Benito"}},{"id":107503,"title":"Meet the new teachers: Part 1","permalink":"http:\/\/palyvoice.com\/2015\/09\/10\/meet-the-new-teachers-part-1\/","content":"Palo Alto High School has welcomed a slew of new teachers for the 2015-16 school year. Hover over the dots to find out more about four of them.\r\n\r\n<script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script><img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/698407086148550658\/1024\/10\/scaletowidth#tl-698407086148550658;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\nPhotos by Dhara Yu and Cooper Lou.\r\n\r\n&nbsp;","excerpt":"Find out more about four of Palo Alto High School's new teachers for the 2015-16 school year.","date":"2015-09-10 18:50:44","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/Teacher-Collage-1.jpg","categories":["Features"],"tags":[]},{"id":107132,"title":"How to stay organized for the new school year","permalink":"http:\/\/palyvoice.com\/2015\/09\/10\/how-to-stay-organized-for-the-new-school-year\/","content":"Is your binder stuffed with loose papers? Do you constantly stress about school work and want to start the year off right? You're in luck.\r\n\r\nAs the new Palo Alto High School 2015-16 school year unfolds, here are tips from peers on how to efficiently complete work and stay organized.\r\n\r\nScroll over the dots to read on.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/697288871225851904\/1024\/10\/scaletowidth#tl-697288871225851904;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n <img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/697288871221657600\/1024\/10\/scaletowidth#tl-697288871221657600;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/697288871032913920\/1024\/10\/scaletowidth#tl-697288871032913920;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n <img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/697947120560242688\/1024\/10\/scaletowidth#tl-697947120560242688;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/698344744081686528\/1024\/10\/scaletowidth#tl-698344744081686528;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n <img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/698343964507373568\/1024\/10\/scaletowidth#tl-698343964507373568;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"As the new Palo Alto High School 2015-16 school year unfolds, here are tips from peers on how to efficiently complete work and stay organized.\r\n","date":"2015-09-10 14:23:57","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/DSC_0014.jpg","categories":["Multimedia","Spotlight"],"tags":{"52178":"binder reminder","9795":"freshman","8816":"junior","52177":"Organization","8953":"paly","9068":"School","9128":"Stress","9210":"vikings"}},{"id":107021,"title":"Candy banned from Club Day","permalink":"http:\/\/palyvoice.com\/2015\/09\/10\/candy-banned-from-club-day\/","content":"[caption id=\"\" align=\"aligncenter\" width=\"455\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/candy.jpg\"><img class=\"wp-image-107039\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/candy.jpg\" alt=\"candy\" width=\"455\" height=\"291\" \/><\/a> This year, clubs will be unable to distribute candy during Club Day due to a district-wide effort to promote healthy foods. Photo by William Zhou.[\/caption]\r\n\r\nIn an effort to promote healthier eating on campus, nutritional services will no longer allow the Club Day tradition of distributing candy for the upcoming Club Day on Sept. 21.\r\n\r\n\"As a school district that takes part in both the National School Lunch and the School Breakfast programs, we are required to follow certain regulations,\" said Alva Spence, Nutrition Services director for the Palo Alto Unified School District. \"Each year both USDA and California Department of Education strengthen the regulations.\"\r\n\r\nAccording the Spence, the most recent changes concern the snacks offered on campuses.\r\n\r\nThe new \"smart snack\" policy states: \"Youth will achieve their full potential only if they are well nourished and healthy. The district will maintain high nutritional quality of all foods made available to students while they are in school, both through food school food service and sales by other groups.\"\r\n\r\nThough the restrictions only specify the sale of food, the district is committed to promoting healthy choices, according to Spence.\r\n\r\n\"I recognize that student clubs are not selling but, rather giving away the candy,\" Spence said. \"PAUSD District [is] committed to promoting healthier and nutritious items available to students during the school day and candy does not meet the standards of either the district policy or USDA\/CDE guidelines.\"\r\n\r\nWhile the restriction has good intentions, some club leaders believe that it may be trivial.\r\n\r\n\"<span style=\"color: #373e4d;\">Yes, kids need to be healthier, \" junior and YCS Co-President, Ibby Day said.  \"But all teenagers love candy, and it's just a small treat to motivate joining a club which could change your life and your thinking. A couple pieces of candy is nothing compared to Halloween.\" <\/span>\r\n\r\nSome club leaders, however, believe the ban may lead to sign-ups based more on interest rather than candy incentives.\r\n\r\n<span style=\"color: #373e4d;\">\"I feel like having the candy takes away from the point of Club Day,\" said Karina Chan, senior and president of Works of Art Club, \"even if you're a [legitimate] club, you still feel like you need it because everyone else uses it to entice people to their booths but it shouldn't be about that.\"<\/span>","excerpt":"In an effort to promote healthier eating on campus, nutritional services will no longer allow the Club Day tradition of distributing candy for the upcoming Club Day on Sept. 21.","date":"2015-09-10 14:16:17","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/candy.jpg","categories":["News","Spotlight"],"tags":{"50766":"banned","50765":"candy","11711":"club day","8713":"Food","8977":"PAUSD","50767":"snack"}},{"id":107470,"title":"&#8216;Save the 2,008&#8242; pushes for new school policies","permalink":"http:\/\/palyvoice.com\/2015\/09\/10\/save-the-2008-pushes-for-new-school-policies\/","content":"Opinions are divided on the feasibility and efficacy of the plan put forward by the campaign \"Save the 2,008\" at the Palo Alto Unified School District Board of Education meeting last night.\r\n\r\nWhile parents and students alike commended \"Save the 2008’s\" motives at the meeting, reactions were mixed regarding the campaign’s six points.\r\n\r\n[caption id=\"attachment_107475\" align=\"alignright\" width=\"424\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/SCHOOLFRICKNBOARD.jpg\"><img class=\"wp-image-107475 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/SCHOOLFRICKNBOARD.jpg\" alt=\"SCHOOLFRICKNBOARD\" width=\"424\" height=\"311\" \/><\/a> The PAUSD School Board convenes on Sept. 8 with the goal of discussing \"Save the 2008's\" six principles further. Supt. McGee converses with high school representatives, Emma Cole and Grace Park. According to Cole, “Save the 2,008’s” sx points are “slightly unrealistic.” Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\n“[The campaign's] intentions are coming from a really good place,” Palo Alto High School Student Representative Emma Cole said. “I agree with those intentions and his ultimate goal, but I think that the six points are slightly unrealistic.”\r\n\r\nGunn Student Representative Grace Park offered additional insight on Vincenti’s goals.\r\n\r\n“I think the real goal from this meeting is going to be how to take the intentions and some of the new ideas in these proposals and coordinate them with what the student body really wants,” Park said.\r\n\r\nParents, however, were much more supportive of the campaign’s six key points. Parent Gloria Simon praised the efforts of the campaign, stressing the importance of urgent action.\r\n\r\n“I want a better environment for all our children right now,” Simon said. “Save the 2,008\" recognizes the obvious connection between the school environment and our children’s well being.”\r\n\r\nAccording to \"Save the 2,008\" co-founder and former Gunn High School teacher Marc Vincenti, his goal for the meeting was to further inform the public of the campaign's mission and answer any questions the school board might have had.\r\n\r\nVincenti launched the “Save the 2,008” campaign last winter in response to Palo Alto’s hyper-competitive academic culture, student mental health and the deaths of PAUSD high school students.\r\n\r\n“Save the 2008’s\" six goals include reducing classroom sizes, reducing work at home and in Advanced Placement courses, banning cell phones at school, eliminating constant grade reporting and ending rampant cheating.\r\n\r\nSupt. Max McGee praised Vincenti’s campaign efforts, but reminded the community of the school board’s<a href=\"http:\/\/palyvoice.com\/2015\/05\/27\/school-board-approves-gunns-creative-bell-schedule-examines-solutions-for-minority-achievement\/\"> recent efforts<\/a> to improve the overall experience of Palo Alto schools in relation to student well-being.\r\n\r\n“In addition to 'Save the 2,008' we do have all these additional efforts,” McGee said. “This is not just a school issue, in fact it's a community matter and we, as we have said many times before, are all in this together.”\r\n\r\nWhile the school board did not take action at yesterday’s meeting, Vincenti says he hopes they will eventually implement Save the 2,008’s six points.","excerpt":"Opinions are divided on the feasibility and efficacy of the plan put forward by the campaign \"Save the 2,008\" at the Palo Alto Unified School District Board of Education meeting last night.","date":"2015-09-10 11:32:04","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/SCHOOLFRICKNBOARD.jpg","categories":["News"],"tags":{"8751":"gunn","52317":"henry m gunn","10749":"high school","52319":"marc vincenti","34885":"Martha","32445":"max mcgee","52318":"pal","8939":"palo alto","8944":"palo alto high school","8950":"Palo Alto Unified School District","8953":"paly","8977":"PAUSD","34893":"Save the 2008","9128":"Stress","9132":"students"}},{"id":107403,"title":"School seeks to pilot new technology policy","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/school-seeks-to-pilot-new-technology-policy\/","content":"[caption id=\"attachment_107416\" align=\"aligncenter\" width=\"590\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1715.jpg\"><img class=\"wp-image-107416\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1715.jpg\" alt=\"Senior Allison Zhang  returns her assigned chromebook to its charging station in her AP Psychology class. Photo by Nika Woodfill.\" width=\"590\" height=\"393\" \/><\/a> Senior Allison Zhang returns her computer to its charging station in her Advanced Placement Psychology class. Each student enrolled in the class is assigned a specific Chromebook to use during class time. Photo by Nika Woodfill.[\/caption]\r\n\r\nThe Palo Alto High School administration is seeking to implement a bring-your-own-device (BYOD) policy for the 2016-17 school year to ensure every student has access to an electronic device, according to principal Kim Diorio.\r\n\r\nThough the school owns 1,800 assorted electronic devices, including iPads, desktops and laptops, teachers often have difficulty securing access to them for their classes, according to Diorio. Consequently, the school will encourage students to bring their own personal devices.\r\n\r\n“I’m hoping to have students come to school next year with their own laptops, Chromebooks, tablets, or whatever it is that they want to use,\" Diorio said.  \"When they’re in class they can just pull it out, work on it right there and put it back in their bag.”\r\n\r\nAccording to Diorio, the administration will not require students to bring any particular kind of device.\r\n\r\n“Some schools have gone one-to-one with iPads or with Chromebooks, but we want students and their families to make the choice that works best for them,” Diorio said.\r\n\r\nFor students who are unable to afford a personal device, Diorio said the school will cover the cost, although the students will still have to pay for an affordable insurance policy.\r\n\r\n“We would be using some outside funding to work on providing devices for anyone who needs it,” Diorio said. “What most schools do is have students buy an insurance policy, so that they do not have to pay for the entire cost of the device if they lose or break their device.”\r\n\r\nSophomore Reetu Joshi believes that more widespread technology use will only be effective if teachers regulate it.\r\n\r\n“If the teachers don’t have any rules about it [using electronics], kids will be on their laptops all the time,” Joshi said. “But if they say, ‘You can’t take your laptops out unless I tell you,’ it’ll be better.”\r\n\r\nAdvanced Placement Psychology classes have already piloted a technology program similar to the proposed BYOD policy, in which all students are given a designated Chromebook to use throughout the school year. AP Psychology teacher Chris Farina believes that the new approach may prevent device shortages and reduce the pressure on the school to provide equipment for students.\r\n\r\n“It can help alleviate the strain on some of the resources we have in the various departments,” Farina said. “Maybe you don’t need a laptop set of 32 ... you just need 16.”\r\n\r\nFarina echoed Joshi's statement, expressing his concern that technology could become a distraction rather than an educational asset.\r\n\r\n“From a classroom management perspective, the big concern for the teachers is how they’re going to balance providing kids with access to the Internet,” Farina said. “How do we keep them focused on doing class work in class and not on Facebook, or Instagram or Reddit or wherever else they would like to go?”","excerpt":"The Palo Alto High School administration is seeking to implement a bring-your-own-device policy for the 2016-17 school year to ensure every student has access to an electronic device.","date":"2015-09-08 23:06:08","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_1715.jpg","categories":["News"],"tags":{"52313":"BYOD","52316":"chris farina","52314":"chromebooks","52315":"device","8644":"diorio","17796":"psych","11642":"psychology"}},{"id":107365,"title":"Friday&#8217;s Safe and Welcoming Day in numbers","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/fridays-safe-and-welcoming-day-in-numbers\/","content":"Over 34 percent of Palo Alto High School students were absent on Friday for Safe and Welcoming Day, a minimum day dedicated to preparing students for emergency situations and reminding students of school protocol, according to Attendance Secretary Karla Larson.\r\n\r\nStudents who attended school on Friday are now equipped with knowledge for dealing with future potential problems, after participating in Code Red and earthquake drills and discussing the Paly handbook, the academic integrity policy and bullying on Friday.\r\n\r\n[caption id=\"attachment_107366\" align=\"alignright\" width=\"295\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo.jpg\"><img class=\" wp-image-107366\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo.jpg\" alt=\"Some classrooms were almost empty, as large number of students were absent during on Drill Day. Of the 34 students in a BC Calculus class, only 12 showed up. Photo by William Zhou.\" width=\"295\" height=\"222\" \/><\/a> Some classrooms were nearly empty on Friday, as a large number of students were absent. Of the 34 students in an Advanced Placement BC Calculus class, only 12 were present. Photo by William Zhou.[\/caption]\r\n\r\nWhile the day may be review for many students, administrators believe there can never be too much preparation.\r\n\r\n\"It's important to go [to these drill days] because they [the teachers] go over a lot of important stuff,\" Larson said. \"So if anything does happen, you're prepared. It's kind of like studying for a test.\"\r\n\r\nAccording to Larson, the numbers of this year's Safe and Welcoming Day attendance are similar to those of last year's. The surge in absences may have been caused by the prospect of a four-day weekend.\r\n\r\n\"We tend to have more absences before long weekends,\" Larson said. \"So with it [Safe and Welcoming Day] being right before Labor Day, that may have had an impact.\"\r\n\r\nDespite the low attendance, some of those who showed up saw Safe and Welcoming Day as a valuable use of time.\r\n\r\n\"Today [Friday] was a reminder of what we should all know,\" senior Hegene Lee said. \"I thought it was worth coming to school for.\"\r\n\r\nThe Paly Voice received the following attendance data from Larson.\r\n\r\n<iframe style=\"-ms-overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/7674208-minimum-day-attendance\" width=\"620\" height=\"1233\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Over 34 percent of Palo Alto High School students were absent last Friday on \"Drill Day,\" a minimum day dedicated to prepare and remind students of school protocol, according to Attendance Secretary Karla Larson.","date":"2015-09-08 22:38:19","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/photo.jpg","categories":["Multimedia","News","Spotlight"],"tags":{"52286":"absent","52307":"attendance office","37643":"cut","52308":"ditch","52285":"drill day","52288":"empty","52306":"karla larson","52305":"low attendance","52309":"minimum day"}},{"id":107399,"title":"Gym Construction moving along","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/gym-construction-moving-along\/","content":"[caption id=\"attachment_107438\" align=\"alignleft\" width=\"365\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11992134_911247968968030_1176431149_n.jpg\"><img class=\" wp-image-107438\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11992134_911247968968030_1176431149_n.jpg\" alt=\"Photo by Amy Leung\" width=\"365\" height=\"276\" \/><\/a> The newly demolished big gym sits in shambles. Photo by Amy Leung[\/caption]\r\n\r\nConstruction continues to take over Palo Alto High School as the small gym is scheduled to be demolished later this week, a few days after the big gym's demolition.\r\n\r\nAfter construction on the Paly gym was delayed by over a year, the <a href=\"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/\" target=\"_blank\">demolition of the big gym <\/a> marked the start of a optimistically uninterrupted stretch for Paly, after which the new gym complex will be finished in 18 months, according to Assistant Principal Jerry Berkson.\r\n\r\n“Other than being a year behind, from this point forward we’ll be a smooth sail besides the El Niño storm expected this year,” Berkson said. “We’ll just put a tarp over it.”\r\n\r\nAlso, the Churchill parking lot will be further decreased during the upcoming weeks until the demolition of both gyms are fully complete and building begins, according to Berkson.\r\n\r\n“The [gym] construction affected some staff parking which means staff have to move out into the student parking, which means students lose parking,” Berkson said.","excerpt":"Construction continues to take over Palo Alto High School as the small gym is scheduled to be demolished later this week, a few days after the big gym's demolition.","date":"2015-09-08 21:58:55","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/11992134_911247968968030_1176431149_n.jpg","categories":["News"],"tags":{"11286":"big gym","8616":"construction","8753":"gym","8939":"palo alto","8953":"paly","8975":"parking","52310":"parking permit","52311":"parking spot","29306":"small gym","52312":"staff parking"}},{"id":106530,"title":"Tuesday Tunes: Sylvia Targ","permalink":"http:\/\/palyvoice.com\/2015\/09\/08\/tuesday-tunes-sylvia-targ\/","content":"[caption id=\"attachment_107337\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0922.jpg\"><img class=\"wp-image-107337\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0922.jpg\" alt=\"Science Olympiad President Sylvia Targ has a large variety of different genres of music taken from her childhood experiences as well as songs that she has performed. \" width=\"620\" height=\"465\" \/><\/a> Senior Sylvia Targ poses for a picture with a Science Olympiad flyer in hand. In addition to being an avid fan of music, Targ also is the president on the Science Olympiad team. Photo by Claire Krugler.[\/caption]\r\n\r\nThis week, The Paly Voice sat down with senior Sylvia Targ and asked her to compile a list of a few of her favorite songs.\r\n\r\nTarg, Science Olympiad President and former Paly Rocks member, is an avid performer in the local area. Her playlist consists of a variety of different musical genres ranging from the classical composer Frédéric Chopin to the electronic rock music of the duo Phantogram.\r\n\r\n\"Most of the classical music is from my childhood because my parents always played classical music in the house,\" Targ said. \"My two older sisters play violin and piano and I sing. We grew up playing and singing a lot of classical music so that's how that got into my playlist ... it reminds me of when I was little and of being safe and having fun.\"\r\n\r\nTarg also notes that the reason some songs are in her playlist is due to her experiences with having to performing them.\r\n\r\n\"Some of the other songs I've found because I've been asked to play them at a performance, \" Targ said. \"Then I actually listen to it and really like it. Once you learn something well enough to sing it on stage without lyrics, you have to like that song or else you wouldn't do it in the first place.\"\r\n\r\nAlthough Paly Rocks band is no longer in existence, Targ still performs with some of her friends.\r\n\r\n\"I sometimes get together with some of my friends and we go play a gig,\" Targ said. \"Like last week, on Sunday, me and my friend Russell Star-Lack did something where he played guitar and I sang and it was really fun.\"\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify:user:clairekrugler:playlist:6rntKbUkV0a8KQzai7fMl9&amp;theme=white&amp;view=coverart\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"This week, The Paly Voice sat down with senior Sylvia Targ and asked her to compile a list of a few of her favorite songs.","date":"2015-09-08 21:14:39","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/09\/IMG_0922.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Tuesday Tunes"],"tags":{"8906":"music","52283":"playlist","33475":"sylvia targ","42416":"Tuesday Tunes"}}]