[{"id":102523,"title":"ASB Appointed Officers Results 2015-16","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/asb-appointed-officers-results-2015-2016\/","content":"The 2014-2015 Associated Student Body announced its Appointed Officers for the 2015-16 school year. See the results below.\r\n<p style=\"color: #141823;\"><strong>Sports Commissione<\/strong>r: Ariya Momeny<\/p>\r\n\r\n<div class=\"text_exposed_show\" style=\"color: #141823;\">\r\n\r\n<strong>Spirit Commissioners<\/strong>: Cezanne Lane and Reid Walters\r\n\r\n<strong>Social Commissioners<\/strong>: Claire Billman and Maryland Valdez\r\n\r\n<strong>Social Justice &amp; School Culture Commissioner<\/strong>: Mariah Poitier\r\n\r\n<strong>PAUSD Board Representative<\/strong>: Emma Cole\r\n\r\n<strong>Publicity Commissioner &amp; Videographer<\/strong>: Griffin Carlson\r\n\r\n","excerpt":"The ASB Appointed Officers results for the 2015-2016 school year have been announced. ","date":"2015-04-23 19:12:43","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/1969134_844366578915382_9183705722491742144_n.jpg","categories":["News"],"tags":{"42301":"appointed officers","8496":"ASB","8499":"Associated Student Body","8944":"palo alto high school","8953":"paly","30978":"results"}},{"id":102614,"title":"Opinion: Zero Period PE policy needs reform","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-pe-policy-needs-reform\/","content":"One main topic of discussion regarding Zero Period PE is the need for sleep. <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/03\/20\/guest-opinion-what-we-can-do-to-reduce-risk-for-our-teens\">Surveys<\/a> show that Palo Alto students sleep an average of six and a half hours — well below the needed eight to ten hours a night, according to the <a href=\"http:\/\/sleepfoundation.org\/sleep-topics\/teens-and-sleep\">Sleep Foundation<\/a>. While Zero Period PE is not responsible for a large percentage of these numbers, running the mile at 7:15 a.m. is sure to drain already sleep-deprived youth and can lead to even greater health risks. According to the <a href=\"http:\/\/www.apa.org\/monitor\/oct01\/sleepteen.aspx\">American Psychological Association<\/a>, research suggests that sleep deprivation puts adolescents at risk for cognitive and emotional difficulties, poor school performance, accidents and psychopathology.\r\n\r\nSleep deprivation can lead to other negative side effects. It can cause aggressive behavior and contribute to illnesses, according to the Sleep Foundation. According to the <a href=\"https:\/\/www.aap.org\/en-us\/about-the-aap\/aap-press-room\/aap-press-room-media-center\/Pages\/Sleepy-Teens.aspx\">American Academy of Pediatrics<\/a>, the risk of depression significantly increased among teens who sleep less than eight hours a night. While one may state that students enrolled in Zero Period PE try to sleep earlier in compensation, no surveys or studies regarding this exist and hordes of Paly students continue to lament their lack of sleep.\r\n\r\nWhile self-identified “morning people” may benefit from Zero Period PE, many sophomores take the class to enroll in as many as eight other academic classes during the school day. Although freshmen are <a href=\"http:\/\/paly.net\/sites\/default\/files\/2015-16_gr9_course_selection_form_front%26back.pdf\">prohibited<\/a> from joining more than seven classes, no limit exists for sophomores and upperclassmen.\r\n\r\n“It forces people who want to take many classes into taking Zero Period [PE] because it [taking many classes] is not an option otherwise,” sophomore Julia Lauer said.\r\n\r\nFurthermore, morning people can still wake up early to complete school assignments, and thus do not need to take an early class to be productive.\r\n\r\nAccording to sophomore Jessica Wu, who signed up for nine classes in first semester, Zero Period PE contributed to an already high stress load.\r\n\r\n“It was a super long day,” she said. “I’d arrive [at school] at seven and go home at five with no break. Then I would have extracurriculars, and that would give me no time to actually get work done until nine.”\r\n\r\nAlthough Zero Period PE may cause less stress than early academic classes, it continues to strain students’ stress and sleep levels. However, supporters maintain that because Zero Period PE is an optional class, it should always be available to those who wish to take it. In order to cooperate with students willing to wake in the early morning in exchange for an afternoon prep, an ideal solution is to limit Zero Period students to a total of seven classes or make students who wish to take more that seven classes sign a waiver. In addition, advisers and counselors should warn against utilizing Zero Period PE as a tool for taking extra classes.","excerpt":"Zero Period Physical Education classes need reform in order to limit student stress and decrease sleep deprivation.\r\n","date":"2015-04-23 14:42:41","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg","categories":["Opinion"],"tags":{"8638":"debate","8751":"gunn","32445":"max mcgee","8927":"opinion","8944":"palo alto high school","8953":"paly","8980":"pe","9106":"sleep","9128":"Stress","42273":"zero period","42382":"zero period pe"}},{"id":102617,"title":"Opinion: Zero Period offers flexibility without detrimental effects","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-offers-flexibility-without-detrimental-effects\/","content":"The most obvious defense of the controversial Zero Period — and what supporters of the policy have repeated time and time again — is that it’s a choice. If a student wants to take an early morning class and start his or her school day earlier, he or she should have the freedom to do so. The ability to make mature decisions about scheduling is one that will be very important in future years. Students should be trusted with the power to determine what works best for their academic life and how they want to manage their time.\r\n\r\nAlthough concern over sleep deprivation among teenagers is reasonable when taking Zero Period into consideration, it should not be something that ultimately drives the elimination of the classes. To my knowledge, there has been no research done at PAUSD specifically to prove the correlation of sleep deprivation and Zero Period. In fact, some people may argue that Zero Period actually helps students go to sleep earlier, as it motivates them to manage their time better. Providing an opportunity for students to learn at an earlier time than usual does not necessarily lead to a surge in sleep-deprived students. Besides, some sports teams already implement morning practices and a handful of students arrive at school well before the first bell rings. If the goal is to ensure that everyone gets enough sleep, should PAUSD prohibit students from being on campus before a given time too?\r\n\r\nAdditionally, some people argue that Zero Period is used inappropriately by high-achieving students to take an extra class. They claim that students want to get ahead and have an advantage over their peers. While I agree with the fact that those students, if such students exist, are using the class for the wrong reason, I believe it would be wrong to take away Zero Period from everyone in order to combat this issue. Many students opt to take the class so that they can have a prep period later on in the day, according to comments made at the <a href=\"http:\/\/palyvoice.com\/2015\/04\/22\/students-plead-with-school-board-to-re-examine-zero-period-elimination\/\">school board meeting<\/a> this week. And, those who sign up for a Zero Period with the intention of taking an additional class could genuinely be interested their courses and are looking to challenge themselves. Restricting a student from their full potential in hopes of reaching complete academic equality is very counterproductive.\r\n\r\nFor these reasons, Zero Period, Paly’s Zero Period PE in particular, should be offered in PAUSD.","excerpt":"Zero Period Physical Education is extremely beneficial to some and completely harmless to others, and it should be offered at PAUSD.","date":"2015-04-23 14:42:27","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg","categories":["Opinion"],"tags":{"42383":"pro","9106":"sleep","42384":"sleep deprivation","42385":"student freedom","42273":"zero period"}},{"id":102539,"title":"Opinion: The Zero Period debate","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-the-zero-period-debate-2\/","content":"[caption id=\"attachment_102618\" align=\"aligncenter\" width=\"625\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg\"><img class=\"wp-image-102618 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ZEROPERIOD.jpg\" alt=\"sdfsdf\" width=\"625\" height=\"338\" \/><\/a> Students from Palo Alto High School Physical Education teacher Stacey Kofman's Zero Period PE class jog around the Paly track. Photo by Jeanette Wong.[\/caption]\r\n\r\nEarlier this month, Palo Alto Unified School District Supt. Max McGee announced the elimination of Zero Period academic classes starting next school year. Non-academic Zero Period classes such as Physical Education, however, will continue to be implemented at both Palo Alto High School and Gunn High School. This decision resulted in mixed reaction from students: While some argued that abandoning Zero Period infringes on students’ rights, others pointed out the need for sleep and limiting stress.\r\n\r\nThe Paly Voice discusses the pros and cons of Zero Period PE at Paly. Read our perspectives in the links below:\r\n\r\n<strong>Pro Opinion: <\/strong><a href=\"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-offers-flexibility-without-detrimental-effects\/\">Zero Period PE offers flexibility without detrimental effects<\/a>\r\n\r\n<strong>Con Opinion: <\/strong><a href=\"http:\/\/palyvoice.com\/2015\/04\/23\/opinion-zero-period-pe-policy-needs-reform\/\">Zero Period PE policy needs reform<\/a>","excerpt":"The Paly Voice discusses the pros and cons of Zero Period Physical Education at Palo Alto High School.  \r\n","date":"2015-04-23 14:41:53","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/DSC_4245a.jpg","categories":["Opinion","Spotlight"],"tags":{"8751":"gunn","8927":"opinion","8939":"palo alto","8953":"paly","8977":"PAUSD","8980":"pe","9067":"scandal","9128":"Stress","9129":"student","42302":"superintendent mcgee","42273":"zero period"}},{"id":102455,"title":"Stanford organization to host computer science conference","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/stanford-organization-to-host-computer-science-conference\/","content":"The Stanford University Women in Computer Science organization is holding a conference at 10 a.m. on Saturday, May 2 for high school students interested in learning about working in the computer science industry.\r\n\r\n[caption id=\"attachment_102606\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2677.jpg\"><img class=\"wp-image-102606\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2677.jpg\" alt=\"Palo Alto High School seniors Ryan Huang and Elnathan Au work on their computer science projects in class. High schoolers, especially girls, are welcome to sign up for the Stanford Women in Computer Science-hosted CS conference on May 2. Photo by Lizzie Chun.\" width=\"300\" height=\"225\" \/><\/a> Palo Alto High School seniors Ryan Huang and Elnathan Au work on their computer science projects in class. High schoolers, especially girls, are welcome to sign up for the Stanford Women in Computer Science-hosted CS conference on May 2 at the Stanford Women's Community Center. Photo by Lizzie Chun.[\/caption]\r\n\r\nWomen in Computer Science is a student-run organization whose mission is \"to promote and support the growing community of women in CS and technology,\" according to <a href=\"http:\/\/web.stanford.edu\/group\/wics\/\" target=\"_blank\">its website<\/a>.\r\n\r\nWhile the free, four hour-long conference is particularly geared toward girls, the goal of the event is to provide high schoolers with a \"wide view into the possibilities and exciting aspects of computer science,\" according to <a href=\"https:\/\/docs.google.com\/forms\/d\/11kXpa-P6pOVmlLFZ7PQyIEa4kgJtx77p0CZNVQB2wZM\/viewform\" target=\"_blank\">the event's RSVP form<\/a>.\r\n\r\nAccording to event coordinator and Stanford freshman Catherina Xu, a number of speakers will present at the conference, including Stanford undergraduates, Ph.D. students and members of the computer science industry, each of whom will discuss their personal experiences as women in the field, along with the projects and research they are currently conducting. A Stanford tour guide will also lead the students on a tour of the school's engineering facilities, and lunch will be provided.\r\n\r\nXu and Luca Szegletes, a Stanford graduate student and fellow event coordinator, hope the event will help encourage high schoolers to look past the prejudices associated with coding.\r\n\r\n\"Computer science is useful in any field and, especially in 2015, really is a necessary skill,\" Xu said. \"I feel that many people view CS as a field for 'gamers' and 'introverts,' which discourages girls from learning it in school. The reason why Luca [Szegletes] and I are holding this event is to share Stanford's extremely welcoming and powerful CS department with high school girls, hoping to show them the amazing things that women in CS have done.\"\r\n\r\n<a href=\"https:\/\/docs.google.com\/forms\/d\/11kXpa-P6pOVmlLFZ7PQyIEa4kgJtx77p0CZNVQB2wZM\/viewform\" target=\"_blank\">Online sign-ups for the event<\/a> end on April 28, and the number of attendees will be capped at 40.","excerpt":"The Stanford University Women in Computer Science organization is holding a conference at 10 a.m. on Saturday, May 2 for high school students interested in learning about working in the computer science industry.","date":"2015-04-23 13:52:39","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2677.jpg","categories":["News"],"tags":{"42275":"catherina xu","42259":"coding","42264":"comp sci","42257":"compsci","42256":"computer science","42260":"conference","42258":"cs","10749":"high school","42276":"luca szegletes","9653":"stanford","38885":"stanford university","42255":"wics","42254":"women in computer science"}},{"id":102578,"title":"Baccalaureate ticket registration open at paly.io\/baccalaureate2015, ends at 3:25 p.m. on April 30","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/baccalaureate-ticket-registration-open-at-paly-iobaccalaureate2015-ends-at-325-p-m-on-april-30\/","content":"","excerpt":"","date":"2015-04-23 13:42:27","author":"Lizzie Chun","categories":["Ticker"],"tags":{"19372":"baccalaureate","11636":"registration","42304":"tickets"}},{"id":102568,"title":"Science Olympiad places second at states, falls short of nationals","permalink":"http:\/\/palyvoice.com\/2015\/04\/23\/science-olympiad-places-second-at-states-falls-short-of-nationals\/","content":"<dl id=\"attachment_102572\" class=\"wp-caption   aligncenter\" style=\"width: 486px;\"><dt class=\"wp-caption-dt\">\r\n\r\n[caption id=\"attachment_102572\" align=\"aligncenter\" width=\"476\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11108859_1428375030811535_1915186195489368124_n.jpg\"><img class=\"wp-image-102572\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11108859_1428375030811535_1915186195489368124_n.jpg\" alt=\"11108859_1428375030811535_1915186195489368124_n\" width=\"476\" height=\"317\" \/><\/a> Senior Alex Lu, one of Science Olympiad's presidents, celebrates with his teammates after they placed second at the Northern California State Tournament. Photo Courtesy of William Meng.[\/caption]\r\n\r\n<\/dt><\/dl>The Palo Alto High School Science Olympiad team placed second at the Northern California State Finals on Saturday after winning regionals and earning its spot at states in March.\r\n\r\nAlthough placing second means that it will not compete at Nationals, the team still celebrated after displaying strong individual performances.\r\n\r\n“We placed second overall with a bunch of really high individual placements: every single person [for the Paly team] got within top five in multiple events, and most people got first place in something,” one of the club's presidents, senior Alex Lu said. “Unfortunately, California has two sections, north and south, so only one team from each goes.\"\r\n\r\n<dl id=\"attachment_102573\" class=\"wp-caption  alignleft\"><dt class=\"wp-caption-dt\">\r\n\r\n[caption id=\"attachment_102573\" align=\"alignleft\" width=\"268\"]<img class=\"wp-image-102573\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/10702154_1428376397478065_5988010919667282907_n.jpg\" alt=\"10702154_1428376397478065_5988010919667282907_n\" width=\"268\" height=\"179\" \/> After the competition, team members drove to prom in San Francisco. Photo courtesy of William Meng.[\/caption]\r\n\r\n<\/dt><\/dl>Lu is proud of his team for doing so well, given the team’s conditions compared to that of other teams.\r\n\r\n“[Other school’s] have heavily involved coaches, and their science olympiad programs [are] elective class,” Lu said. “This is compared to Paly, in which the majority of our team members don't join until their sophomore year and Paly's teacher advisors, who are very supportive, are [more focused on] students running our own club. I really couldn't be more happy with or proud of this team.\"\r\n\r\nTo wrap up the year, the club is finalizing leadership roles and plans for its camp.\r\n\r\n“We're going to start prepping elections for next year's presidents and other officers, as well as making sure that the summer camp we run functions smoothly,” Lu said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Science Olympiad team placed second at the Northern California State Finals, last Saturday, after winning regionals and earning their spot at states in March. \r\n","date":"2015-04-23 13:33:14","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/11108859_1428375030811535_1915186195489368124_n.jpg","categories":["News","Uncategorized"],"tags":{"40834":"nationals","10045":"scioly","33011":"states"}},{"id":102188,"title":"“The Juggling Kid”","permalink":"http:\/\/palyvoice.com\/2015\/04\/22\/the-juggling-kid\/","content":"[caption id=\"attachment_102189\" align=\"alignright\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Juggle.png\"><img class=\"wp-image-102189\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Juggle.png\" alt=\"Juggle\" width=\"587\" height=\"329\" \/><\/a> Sophomore Zach Strassberg-Phillips demonstrates his juggling abilities after school in the Palo Alto High School Media Arts Center. In addition to juggling, Strassberg-Phillips has mastered the art of riding a unicycle and throwing Chinese yo-yos. Photos by George Lu.[\/caption]\r\n\r\nThe tennis balls are a blur. The hands behind them are swift, expertly directing the orbs in its designed path. Gravity pulls each ball down to earth, only to be defied once again when the balls are thrown upwards. The rhythmic pattern sets a steady beat, captivating nearby students who pause to watch. Sophomore Zach Strassberg-Phillips, \"The Juggling Kid,” is at ease.\r\n\r\nStrassberg-Phillips’s nickname, “The Juggling Kid,” stems from the curiosity of passersby. He doesn't know where the name came from or who started it, but somehow the name came to be, and it stuck.\r\n\r\n“I would randomly meet someone, and they would greet me with, ‘Hey, aren't you the juggling kid?’\" Strassberg-Phillips said.\r\n\r\nDespite its unusualness, Strassberg-Phillips doesn't mind the nickname.\r\n\r\n“I am not just a kid, not even just a juggling kid,” Strassberg-Phillips said. “I am The Juggling Kid and I take pride in this uniqueness. If so many people take the effort to refer to you with eight more letters than everyone else at school, it must mean you're more than an ordinary kid.”\r\n\r\n[caption id=\"attachment_102407\" align=\"aligncenter\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ezgif.com-crop.gif\"><img class=\"wp-image-102407\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/ezgif.com-crop.gif\" alt=\"ZACH\" width=\"615\" height=\"346\" \/><\/a> Strassberg-Phillips juggles four tennis balls. According to Hall, when juggling an odd number of balls, crossing between hands occurs while with an even number, each half of the balls rotate through one hand. GIF by Jeanette Wong.[\/caption]\r\n\r\nStrassberg-Phillips enjoys juggling because of the movement involved and the hidden mathematical and musical components.\r\n\r\n“I’m a pretty kinetic person, so that’s why I like motion,” Strassberg-Phillips said. “Juggling is basically a combination of math and music. In the regular three ball pattern, each throw you do is given a number. One throw, two, three, four, and then five. They get exponentially bigger.”\r\n\r\nStrassberg-Phillips’s experience with juggling has made the activity part of himself.\r\n\r\n“People talk about five basic senses, but there’s also a sixth one [that lets you] feel things,” Strassberg-Phillips said. “Sometimes I feel like tennis balls are an extension of my body, a sixth sense. So, the tennis ball can just bounce off the wall and I know where it is without even looking.”\r\n\r\nWith the help of his freshman advisory teacher Matthew Hall, an internationally renowned juggler, Strassberg-Phillips ventured into the world of juggling at age 14.\r\n\r\n“I’ve only been juggling since the beginning of high school,” Strassberg-Phillips said. “Mr. Hall kind of got me into it. In middle school, when I was going to class, I’d just have one tennis ball and just bounce it off the wall and stuff. So it grew from that.”\r\n\r\n[caption id=\"attachment_102296\" align=\"alignleft\" width=\"243\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/MG_4025.jpg\"><img class=\" wp-image-102296\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/MG_4025.jpg\" alt=\"Strassberg-Phillips plays \" width=\"243\" height=\"365\" \/><\/a> Strassberg-Phillips plays with his Chinese yo-yo, one of the several juggling equipments he owns. Over the years, he accumulated a collection of tennis balls, rubber balls, clubs, devil sticks. Photo by George Lu.[\/caption]\r\n\r\nAs president of the Paly Juggling Club, Strassberg-Phillips spreads his passion to others.\r\n\r\n“I’m in charge of teaching the new people; there’s actually a whole juggling app that I sometimes get inspiration from,” Strassberg-Phillips said.\r\n\r\nThe juggling club often practices on the Quad at lunch and recently performed at the International Lunch.\r\n\r\n“Generally we just practice and have a good time, throwing things around,” Strassberg-Phillips said.\r\n\r\nAs his talent gradually grew over time, so did the equipment he owned.\r\n\r\n“Over the past two years, I’ve gotten a lot of stuff for juggling,” Strassberg-Phillips said. “Mr. Hall gave me his prized tennis balls from his world championship — priceless. I was using those for a while but then I gave them back because I didn’t want to mess them up. Now, I use tennis balls, clubs [similar to bowling pins] and devil sticks [batons used for juggling].”\r\n\r\nStrassberg-Phillips has recently taken his juggling to the next level by learning how to juggle while riding a unicycle.\r\n\r\n“Instead of using your hands you use your hips — but you can’t pedal or anything,”  Strassberg-Phillips said.\r\n\r\nDespite his huge passion for juggling, he still finds time for other activities he enjoys. According to Strassberg-Phillips, most of his juggling is at school between classes, and when he gets home, he prefers to focus on academics and extracurriculars. After school, he likes to play the drums in a band, volunteer and spend time with his family.\r\n\r\nStrassberg-Phillips is glad he discovered the world of juggling.\r\n\r\n“If you don’t give yourself the opportunity to experience something new, then you never know if you’d really like it or not,” Strassberg-Phillips said. “I am proud of who I am, so I am proud of my title, The Juggling Kid.”","excerpt":"With just over a year and a half of experience under his belt, sophomore Zach Strassberg-Phillips has earned himself a nickname of \"The Juggling Kid” due to his consistent display of his hobby. Read on to discover his story.","date":"2015-04-22 23:56:52","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Juggle.png","categories":["Features","Spotlight"],"tags":{"42303":"chinese yo-yo","42126":"juggling","8873":"Matt Hall","42125":"zach strassberg-phillips"}},{"id":102525,"title":"Season update: Track to face-off against Los Gatos","permalink":"http:\/\/palyvoice.com\/2015\/04\/22\/season-update-track-to-face-off-against-los-gatos\/","content":"[caption id=\"attachment_102533\" align=\"alignright\" width=\"392\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2803.jpg\"><img class=\"wp-image-102533\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2803.jpg\" alt=\"Junior Dami Bolarinwa sprints to the finish line in the 400-meter run agaInst Gunn High School on March 12. The Paly boys' team defeated Gunn 82-45. Photo by Nika Woodfill\" width=\"392\" height=\"261\" \/><\/a> Junior Dami Bolarinwa sprints to the finish line in the 400-meter run against Gunn High School on March 12. The Palo Alto High School boys' team defeated Gunn 82-45. Photo by Nika Woodfill.[\/caption]\r\n\r\nAfter an impressive opening to their seasons, the Palo Alto High School boys’ (4-0) and girls’ (2-2) track and field teams look to maintain their strong performances as they prepare for their next meet at 3:15 p.m. tomorrow at home, against the Los Gatos High School Wildcats (4-0).\r\n\r\nThe Wildcats are currently ranked first for both boys and girls in the De Anza League.\r\n\r\nThe Paly boys’ team is currently still undefeated and will advance to first place if they beat Los Gatos. According to junior sprinter Dami Bolarinwa, the team has been occupied preparing for this momentous face-off.\r\n\r\n“The team is working hard,” Bolarinwa said. “We are getting the handoffs down and doing the workouts [to make] sure we are ready for Thursday.”\r\n\r\nAccording to junior middle distance runner Portia Barrientos, the girls’ team is also training hard thanks to strong leadership from veteran runners.\r\n\r\n“I think we have some great leaders in Julia [Asin], Anna [Dukovic] and Katie [Foug],” Barrientos said. “We should continue to improve as we approach the league meet.”\r\n\r\nBarrientos also emphasized that there is still room for development as the team prepares for the second half of the season.\r\n\r\n“We have a lot of talent,\" Barrientos said. \"But so many people have been away college touring or otherwise busy that we haven't actually had everyone compete at once. Going into the second half of the season, we have a lot of potential.”","excerpt":"After an impressive opening to their seasons, the Palo Alto High School boys’ (4-0) and girls’ (2-2) track and field teams look to maintain their strong performances as they prepare for their next meet at 3:15 p.m. tomorrow at home, against the Los Gatos High School Wildcats (4-0).","date":"2015-04-22 22:44:31","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/IMG_2803.jpg","categories":["Sports","Spotlight","Track and Field"],"tags":{"34106":"dami bolarinwa","8634":"de anza league","9914":"los gatos","9004":"portia barrientos","9182":"Track &amp; Field"}},{"id":102432,"title":"Students to give back on Service Day","permalink":"http:\/\/palyvoice.com\/2015\/04\/22\/students-to-give-back-on-service-day\/","content":"For the fourth day of Palo Alto High School's <a href=\"http:\/\/palyvoice.com\/2015\/04\/19\/preview-not-in-our-schools-week\/\">Not In Our Schools Week<\/a>, students are invited to give back to the community both on- and off-campus tomorrow by participating in the sixth annual Service Day.\r\n\r\nWith over 300 students signed up for volunteer projects at local organizations and a host of booths and activities available on the Paly Quad at lunch, this year's Service Day is set to be bigger than ever, according to sophomore and Service Day planner Candace Wang. Each year, the event attracts more and more participants, and there are more volunteer organizations present than ever before.\r\n\r\nStudents who have not already signed up to volunteer at off-campus organizations are instead encouraged to participate in the available on-campus activities during lunch. Clubs and organizations will be on campus raising awareness for their respective causes and providing volunteer opportunities to students. No sign-ups are required, and free pizza will be served to those who participate in two or more activities.\r\n\r\n\"It is our hope that the students who participate in Service Day are able to find new ways to express their passions, find new ways to be involved and engaged in their communities, and find places where they can try new things,\" Wang said. \"Volunteering is a great way to get a feel for different career paths without heavy commitment for sacrifices.\"\r\n\r\n<iframe style=\"overflow-y:hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/5660368-paly-service-day-2015\" width=\"620\" height=\"1183\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\nOrganizing this event took a large number of people, and Wang is grateful for the support and efforts of everyone involved.\r\n\r\n\"This year, it was an incredible team effort,\" Wang said. \"More people have chipped in than ever before. YCS did an incredible job of organizing all 23 of the off-campus sites, and Key Club is putting all the effort humanly possible to create the best on-campus selection of clubs and organizations. We also have to thank the parents and, of course, [community service and career adviser] Ms. [Christina] Owen for making everything else possible.\"\r\n\r\nAfter months of hard work, the Service Day planning committee looks forward to the event.\r\n\r\n\"This is a huge milestone for all of us,\" Wang said. \"I can't wait to see how the day turns out.\"","excerpt":"For the fourth day of Palo Alto High School's Not In Our Schools Week, students are invited to give back to the community both on- and off-campus tomorrow by participating in the sixth annual Service Day.\r\n","date":"2015-04-22 17:15:58","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/04\/Paly-Service-Day-2012-breakfast.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","8499":"Associated Student Body","28798":"candace wang","14280":"nios","14279":"not in our schools week","8953":"paly","9094":"Service","14277":"service day","32455":"volunteer","42197":"volunteering","42196":"YCS"}}]