[{"id":111589,"title":"Advisory this week is for freshmen and sophomores","permalink":"http:\/\/palyvoice.com\/2015\/11\/08\/advisory-this-week-is-for-freshmen-and-sophomores\/","content":"","excerpt":"","date":"2015-11-08 23:59:17","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":111531,"title":"Review: Greek mythology comes to life with “The Odyssey”","permalink":"http:\/\/palyvoice.com\/2015\/11\/07\/review-greek-mythology-comes-to-life-with-the-odyssey\/","content":"[caption id=\"attachment_111535\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_3048.jpg\"><img class=\"size-full wp-image-111535\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_3048.jpg\" alt=\"In &quot;The Odyssey,&quot; Odysseus (senior Ophir Sneh) must journey through many perils across the ocean before making it home. Sirens, such as the one played by senior Clara Baker above, entice the sailors with their singing and dancing. Photo by Ana Caklovic\" width=\"600\" height=\"428\" \/><\/a> In \"The Odyssey,\" Odysseus (senior Ophir Sneh) must journey through many perils across the ocean before making it home. Sirens, such as the one played by senior Clara Baker above, entice the sailors with their singing and dancing. Photo by Ana Caklovic.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">When the words “ancient Greek mythology” are mentioned, what does your mind jump to? Is it the powerful rule of the Greek gods or the tales of the humans that worship them? Do you remember grand stories of heroism about slaying horrendous monsters? In “The Odyssey,” the Palo Alto High School Theater Department aims to bring the world of ancient Greece back to life and showcases the long journey of Odysseus on his return home from the Trojan War. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Most of the play, written by playwright Mary Zimmerman, chronicles the enormous amount of obstacles Odysseus (senior Ophir Sneh) faces during his journey, including an angry cyclops, enchanting sirens, vindictive gods and rowdy lords. However, the difficulties endure after his return, as Odysseus must fight to restore the life he had before the war. Along the way, the goddess Athena (senior Sophie Swezey), Odysseus' son, Telemachus (junior Jackson Kienitz) and other characters help Odysseus. His grieving wife Penelope (senior Molly Kraus) fights off suitors who wish to marry her since her husband Odysseus is presumed dead. Though it is usually clear what is going on, the short modern-day element at the beginning of the play is slightly confusing and seems irrelevant to the rest of the plot.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The cast members do a great job of capturing the essence of their characters. The dialogue is understandable, and the story is portrayed nicely whether it is a lighthearted, fun moment or a serious scene. Odysseus, with his sincerity and determination, is convincing in his image of a hero, and is nicely balanced by the loud and foolish actions of rowdy nobles (senior Matthew O’Reilly, junior Jason Pollak and senior Daniel Cottrell). A silent muse shows the audience, through body movements, the transferring of ideas from gods to mortals in a fluid, creative manner. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The show features one main set with a backdrop of waves, clouds and rocks. Throughout the play, the location and time period is projected onto the stage to help clarify the plot. Greek columns are cleverly lifted on and off stage depending on the scene, and a platform in the back showcases the presence of the Olympic gods. The huge puppet used to create the character of the cyclops is a particularly impressive prop, and adds a dramatic feel to an action-packed scene. The presence of a boat is smartly substituted by artfully arranged chairs, convincing pole movements to represent rowing and characters that sway to the drift of the faux ocean. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The characters’ costumes showcased great attention to detail, with a modern twist on some of the garments and accessories such as necklaces and headpieces. Although the torn tunics, leggings and pants of some of the characters were simple, they seemed authentic to their station. The goddesses had interesting, flowing dress variations and the make-up on the nymph Calypso (junior Nadia Leinhos) is particularly beautiful. In instances when characters were “disguised,” clever costume switches that do not disguise the actual identity of the character are utilized.<\/span>\r\n\r\n[caption id=\"attachment_111537\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/unnamed.jpg\"><img class=\"size-full wp-image-111537\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/unnamed.jpg\" alt=\"Calypso (junior Nadia Leinhos) holds Odysseus captive on her island, rendering him unable to return home to Ithaca. As Calypose, Leinhos does a wonderful job of portraying a lonely and desperate goddess with antics that drew a few laughs from the audience. Photo courtesy of Yi Ge. \" width=\"600\" height=\"400\" \/><\/a> Calypso (junior Nadia Leinhos) holds Odysseus captive on her island, rendering him unable to return home to Ithaca. As Calypso, Leinhos does a wonderful job of portraying a lonely and desperate goddess with antics that drew a few laughs from the audience. Photo courtesy of Yi Ge.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">One of the standout features of the production is the musical element. Recorded music, <\/span><a href=\"http:\/\/palyvoice.com\/2015\/10\/06\/alumnus-composes-music-for-fall-production\/\"><span style=\"font-weight: 400;\">composed by alumnus Jonathan Shue<\/span><\/a><span style=\"font-weight: 400;\">, as well as live music provided by student musicians junior Edward Park and junior Laura Sieh, accompanies the actors during almost every scene with an assortment of instruments such as bajo sexto, drums and wind chimes. The calm and melodic music makes watching it much more entertaining and helps to fully immerse the audience into ancient Greece. Interesting and artistic use of scarves and chairs as props during dance sequences made scene changes flow smoothly and helped set the tone for the next scene. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">An epic saga that includes elements of adventure, romance and tragedy, “The Odyssey” is a production that does justice to Homer’s classic poem. It will please the eyes and ears of theater-goers of almost any age, though small children might get restless with the two hours and 30 minutes running length. Although the first act seems to move a little slowly, the second act picks up momentum and carries it to the end, providing for a satisfying conclusion.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Odyssey” has four more showings on Nov. 7, Nov. 8, Nov. 12 and Nov. 13. All shows begin at 7:30 p.m. in the Haymarket Theater, except for the Sunday show on Nov. 8, which begins at 2 p.m. <\/span><a href=\"http:\/\/palytheatre.seatyourself.biz\"><span style=\"font-weight: 400;\">Tickets<\/span><\/a><span style=\"font-weight: 400;\"> are $7 for students and seniors and $10 for adults.<\/span>","excerpt":"In “The Odyssey,” the Palo Alto High School Theater Department aims to bring the world of ancient Greece back to life and showcases the long journey of Odysseus on his return home from the Trojan War.","date":"2015-11-07 13:51:24","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/unnamed.jpg","categories":["Entertainment","Reviews","Spotlight"],"tags":["acting","athena","calypso","clara baker","daniel cottrell","greek","jackson kienitz","jason pollak","journey","matthew o'reilly","molly kraus","mythology","odysseus","Ophir Sneh","palo alto high school theater department","paly","play","production","review","show","sophie swezey","the odyssey","theater"]},{"id":107551,"title":"Opinion: Meditation should be implemented into classes","permalink":"http:\/\/palyvoice.com\/2015\/11\/07\/opinion-meditation-should-be-implemented-into-classes\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_110467\" align=\"aligncenter\" width=\"560\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/abcd1.jpg\"><img class=\"wp-image-110467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/abcd1.jpg\" alt=\"Seniors Nicole Cox and Elizabeth Hall meditating during astrophysics, which is taught by science teacher Josh Bloom.\" width=\"560\" height=\"420\" \/><\/a> Seniors Elizabeth Hall, left, and Nicole Cox meditate during Spirit Week in their Astrophysics class, which is taught by science teacher Josh Bloom. Bloom is one of the few teachers at Palo Alto High School who introduces meditation to his students each year. Photo by Amy Leung.[\/caption]\r\n\r\n\"Welcome to this five minute pause in your day. Allow your eyes to close.\" This is how Christopher Farina's Advanced Placement psychology students begin their class each day.\r\n\r\nThe students perform mindful meditation, a popular form of relaxation in which participants focus on their thoughts, feelings, sounds or breath by sitting in silence with their eyes closed. This method does not require any spiritual belief, but rather, it gives individuals an opportunity to shut out unnecessary thoughts to facilitate a deeper connection with themselves. Meditational practice, which stems from an ancient Buddhist relaxation practice, has become increasingly popular in Western culture in recent years, according to <a href=\"https:\/\/www.psychologytoday.com\/blog\/meditation-modern-life\/201307\/overview-meditation-its-origins-and-traditions\" target=\"_blank\">Psychology Today<\/a>. <a href=\"http:\/\/life.gaiam.com\/article\/meditation-101-techniques-benefits-beginner-s-how\" target=\"_blank\">Studies<\/a> show that a few minutes of this mindful meditation each day can lead to emotional benefits that mirror the benefits of physical activity.\r\n\r\nPalo Alto High School should systematically implement meditation into the beginning of certain class periods per week to reduce stress, foster a healthy class environment and encourage high levels of focus.\r\n\r\nOn a typical school day, most teachers are unable to give their students time to exercise or participate in stress-relieving activities. With that, students are expected to sit for six hours each day, with an occasional break, while simultaneously maintaining a healthy well being. <span style=\"font-weight: 400;\">This causes stress that often weighs down students, and it is essential to find an effective method to alleviate it. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To their credit, Paly administrators have focused on finding ways to reduce Paly's high-stress culture in the past years. One of their solutions included <a href=\"http:\/\/palyvoice.com\/2015\/04\/29\/paly-teachers-incorporate-meditation-into-the-classroom\/\" target=\"_blank\">introducing meditation<\/a> into classrooms. By the end of the year, however, most teachers did not continue the practice, aside from a select few.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Josh Bloom, astronomy teacher and Teacher on Special Assignment for social and emotional learning, is one of the few faculty members who introduces students to meditational practices each year. According to Bloom, he began the <\/span><span style=\"font-weight: 400;\">mindful practice five years ago to sort out the stress in his own life. After Bloom found the results to be beneficial, he decided to share the practice with his students.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There’s a lot of pressure on kids in this community around this idea of success, what success means, and what's required for success,” Bloom said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Introducing just five minutes of meditation at the beginning of each class at Paly could be the beginning of a solution to this problem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Meditation has been shown to reduce feelings of anxiety, increase calmness and enable people to enjoy their lives to a fuller and happier extent. <\/span><span style=\"font-weight: 400;\">For students, meditation is a chance to control one's own mind and live in the present moment, providing an opportunity to pause during a hectic day, according to the website, <a href=\"http:\/\/www.tipsonlifeandlove.com\/self-help\/meditating-your-way-to-greater-happiness-and-health-in-20-minutes-a-day\" target=\"_blank\">Love &amp; Life<\/a>.<\/span>\r\n\r\n“The mindfulness of this experience is creating space for you to focus on what's going on inside of you,” Bloom says. “To allow yourself to step back and become aware of your thoughts, and how you're thinking.”\r\n\r\nMeditation is also a way to focus attention and eliminate the stream of thoughts crowding your mind. Students who meditate during class time will find themselves retaining information better after refueling. They will be able to work harder with more energy, and therefore succeed more in their classes.\r\n\r\n<span style=\"font-weight: 400;\">The practice of meditation also benefits students physically. <\/span><span style=\"font-weight: 400;\">Meditation enables an inner quiet and peace in people, which has been scientifically proven to slow the heart rate, lower blood pressure and decrease the production of stress hormones. Just five minutes a day of this practice grows the areas of the brain associated with memory, empathy and sense of self, according to <a href=\"http:\/\/www.medicaldaily.com\/mental-health-benefits-meditation-itll-alter-your-brains-grey-matter-and-improve-319298\" target=\"_blank\">Medical Daily<\/a>, a website dedicated to sharing studies on mental health.<\/span>\r\n\r\nStudents could begin to earn these physical and emotional benefits if teachers of one required course introduce meditation into their classes. Therefore, students would be given a chance to experience the practice two or three times per week, which is enough time to receive healthy benefits through just a brief five minutes a day.\r\n\r\nThis would require commitment from the department, and a<span style=\"font-weight: 400;\">lthough some might argue that these practices would waste valuable class time, one should keep in mind that it takes less than five minutes at the beginning of a class period, providing benefits that outweigh the small amount of time used for meditation. <\/span><span style=\"font-weight: 400;\">English teacher George Vuong, who has introduced meditation to students after learning about the method at the end of last year, advocates for other teachers to introduce it as well.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“This is a good beginning of a class period to kind of help things get settled down and make a more calm environment,” Vuong said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Meditation creates many more focused, relaxed and de-stressed students, allowing students to put in more effort, interest and their attention into the period's classwork.<\/span>\r\n\r\n\"[Through meditation] y<span style=\"font-weight: 400;\">ou begin to discover the aspects of ourselves that are common to all human beings,\" said Bloom. \"The more you come to know and understand that part of our human being, the more we begin to understand that part being in all of us.\"<\/span>\r\n\r\nWho knew that a simple five minute task every few days could so significantly impact our lives?","excerpt":"Staff writer Morgan Keller shares her opinion on implementing meditational practices into the beginning of class periods.","date":"2015-11-07 09:53:30","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/abcd1.jpg","categories":["Opinion","Spotlight"],"tags":["meditation","opinion","paly"]},{"id":111557,"title":"Second quarter progress reports are released on Friday, Nov. 13","permalink":"http:\/\/palyvoice.com\/2015\/11\/06\/second-quarter-progress-reports-are-released-on-friday-nov-13\/","content":"","excerpt":"","date":"2015-11-06 23:13:07","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":111555,"title":"Seniors: CSU\/UC Application help on Tuesday, Nov. 10 during tutorial","permalink":"http:\/\/palyvoice.com\/2015\/11\/06\/seniors-csuuc-application-help-on-tuesday-nov-10-during-tutorial\/","content":"","excerpt":"","date":"2015-11-06 23:08:55","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":111318,"title":"APPetite: Spindle, the selfish app","permalink":"http:\/\/palyvoice.com\/2015\/11\/05\/appetite-spindle-the-selfish-app\/","content":"[caption id=\"attachment_111511\" align=\"aligncenter\" width=\"532\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Spindle.jpg\"><img class=\"wp-image-111511\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Spindle.jpg\" alt=\"\" width=\"532\" height=\"341\" \/><\/a> Last week, Stanford alumni and founders of social app Spindle, Amanda Lin and Alex Walker, visited The Paly Voice to talk about Spindle and its goal of being a “selfish app.” Photo by Cooper Lou.[\/caption]\r\n\r\nDo you want to journal your life? Are you tired of traditional social media sites? If so, Stanford alumni and founders of the social app Spindle, Alex Walker and Amanda Lin, may have a solution for you. The two visited The Paly Voice last week to talk about <a href=\"https:\/\/itunes.apple.com\/us\/app\/spindle-tell-it-like-it-is\/id970237649?mt=8\">Spindle<\/a> and its goal of being a “selfish app.\"\r\n\r\n<span style=\"font-weight: 400;\">Although at first glance, Spindle may seem to resemble other social apps like Instagram and Twitter, its overarching goals are different.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A lot of current social media revolve around people creating an image of themselves,” Lin said. “We wanted people to have a space to allow them to be <\/span>themselves and document their lives. [Spindle’s like a personal] journal, that also allows people to share certain entries.”\r\n\r\nThrough their application, Walker and Lin seek to emulate real life conversations and discussions.\r\n\r\n“In life, people have different friend groups,\" Lin said. “Something you share with one group might not be what you want to share with another. With Spindle, you get to choose what to share with each group. There’s no friending on Spindle and the recipient of every entry, [if you choose to share it,] is dependent on you.”\r\n\r\n<span style=\"font-weight: 400;\">Walker and Lin founded Spindle after meeting at Stanford University. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We went to Stanford together and graduated in 2013,” Walker said. “We became really good friends in freshmen year and started Spindle when we graduated. Stanford taught us that it was okay to go for something since the people around you are constantly taking these risks. You’re taught that anything is possible. Together, we’ve been working on this for a little over nine months.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Lin, she and Walker used their experience with product design, computer science, symbolic systems and design to build their app from scratch.<\/span>\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_110995\" align=\"aligncenter\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/screen-shot-2015-09-03-at-11-30-27-pm.png\"><img class=\"wp-image-110995\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/screen-shot-2015-09-03-at-11-30-27-pm.png\" alt=\"screen-shot-2015-09-03-at-11-30-27-pm\" width=\"603\" height=\"390\" \/><\/a> Spindle co-founder Amanda Lin's joy at climbing to the top of Half Dome turned into fear when she thought she would fall off when jumping for a photo. According to Walker, this photo captures the essence of Spindle. \"We want to give people a way to save the best stuff and time travel back to it later,\" Lin said. Photo courtesy of Amanda Lin.[\/caption]\r\n\r\n&nbsp;\r\n\r\nA typical Spindle can be short, but users can group them together to create a story. The application acts as a journal for important life moments.\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">“My proudest Spindle is [my story] of when I ran a half marathon,” Lin said. “I’m not a runner and I hate running, but I challenged myself. I tracked my practice runs, the events leading up to the weekend and the race itself.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Walker, Spindle also allows you to see the days during which you saved the most highlights.<\/span>\r\n\r\n\"Spindle only saves the [what you deem as] highlights,\" Lin said. \"With texts [or social media], there’s a whole lot of other stuff. Spindle saves the best of the best, happiest and saddest stories.”\r\n\r\n<span style=\"font-weight: 400;\">The inspiration for Spindle came from Walker and Lin’s desire to remember the little moments in life. <\/span>\r\n\r\n“We are both storytellers,” Walker said. “Often times, the stories you want to share aren't big events. We want to give people a way to save the best stuff and time travel back to it later.”\r\n\r\n<span style=\"font-weight: 400;\">The idea of storytelling is woven into Spindle's name. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [Spindle] sounds really fun, but also ties a bunch of threads together,” Walker said.<\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\nWalker and Lin have high hopes for the future of Spindle.\r\n\r\n<span style=\"font-weight: 400;\">“We want to be a brand synonymous with how people document their lives,” Walker said.<\/span>\r\n\r\n[caption id=\"attachment_111319\" align=\"aligncenter\" width=\"199\"]<img class=\"wp-image-111319\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/12179926_751188174986733_1693898061_n.jpg\" alt=\"12179926_751188174986733_1693898061_n\" width=\"199\" height=\"354\" \/> Screenshot from the app by Adele Bloch.[\/caption]\r\n\r\n&nbsp;","excerpt":"Do you want to journal your life? Are you tired of traditional social media sites? If so, Stanford alumni and founders of the social app Spindle, Alex Walker and Amanda Lin, may have a solution for you. ","date":"2015-11-05 17:34:53","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/screen-shot-2015-09-03-at-11-30-27-pm.png","categories":["APPetite","Blog","Spotlight"],"tags":["app","Snapchat","social media","spindle"]},{"id":111376,"title":"News in Review: October 2015","permalink":"http:\/\/palyvoice.com\/2015\/11\/05\/news-in-review-october-2015\/","content":"<iframe src=\"\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1mwTJyEM4L2U5R9dXp_IhIG4FtHVv3bcmd-RiFO2V02E&amp;font=Default&amp;lang=en&amp;initial_zoom=3&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"A timeline of the most important news stories and events from the month of October.","date":"2015-11-05 11:17:02","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/real.png","categories":["Editor's Pick","Multimedia"],"tags":["news","news in review","news in review october","october","palo alto high school"]},{"id":111343,"title":"Football field vandalism disrupts school activities","permalink":"http:\/\/palyvoice.com\/2015\/11\/04\/football-field-vandalism-disrupts-school-activities\/","content":"[caption id=\"attachment_111348\" align=\"alignleft\" width=\"575\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_3507.jpg\"><img class=\"wp-image-111348\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_3507.jpg\" alt=\"A portion of the Palo Alto High School football where it has been burnt is mostly undisturbed during school hours. If the act requires a certain amount of funds to repair, the situation could become increasingly serious, according to assistant principal Jerry Berkson. Photo by Emma van der Veen.\" width=\"575\" height=\"432\" \/><\/a> Portions of the Viking Stadium remain melted after acts of vandalism were reported to administration. The administration is currently investigating the case. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School administration is looking to repair damages done to the football field resulting in extensive damage to the turf.\r\n\r\nAfter receiving information regarding vandalism early Monday, administrators are further investigating the case of a phallic image burnt into the field, according to Assistant Principal Jerry Berkson.\r\n\r\n[caption id=\"attachment_111355\" align=\"alignleft\" width=\"574\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_6241.jpg\"><img class=\"wp-image-111355\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_6241.jpg\" alt=\"The Viking Stadium football field was subject to an act of vandalism. This included burning part of the field's turf, melting the rubber pellets together. Photo by Ethan Kao.\" width=\"574\" height=\"431\" \/><\/a> The Viking Stadium stands strong after an unidentified individual burned parts of the turf. According to Berkson, the cost of the repairs determines the severity of the punishment for the perpetrator. Photo by Ethan Kao.[\/caption]\r\n\r\n“It depends on how much damage [is done],” Berkson said. “Between the actual supplies and labor needed, if it’s a thousand bucks or more, it becomes a felony.”\r\n\r\nAccording to Berkson, required measures will be taken immediately.\r\n\r\n“I am required to file a police report and I have to call maintenance to get it fixed,” Berkson said.\r\n\r\nGoing forward, administration will be taking action to fix the situation for sports teams and others as efficiently as possible, according to Berkson.\r\n\r\n“Football wise, we have a bye this week, but for soccer [tryouts], I don’t know what we’re going to do,” Berkson said. “They could probably paint over it as a first move, maybe we’ll do that.”\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School administration is looking to repair damages done to the football field reported on Nov. 3 as an effect of an act of vandalism.","date":"2015-11-04 12:14:48","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_6241.jpg","categories":["News","Spotlight"],"tags":["burning","football field","paly","sports","vandalism"]},{"id":109360,"title":"Contests provide students opportunity to voice political opinions","permalink":"http:\/\/palyvoice.com\/2015\/11\/03\/contests-provide-students-opportunity-to-voice-political-opinions\/","content":"[caption id=\"attachment_111315\" align=\"alignnone\" width=\"557\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/voting.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/voting.jpg\" alt=\"The cartoon contest will give students a chance to express their political beliefs. Illustration by Portia Barrientos.\" width=\"557\" height=\"557\" class=\"size-full wp-image-111315\" \/><\/a> \r\nThe cartoon contest will give students a chance to express their political beliefs. Illustration by Portia Barrientos.[\/caption]\r\n\r\nIn an effort to get more high schoolers to participate in politics, a civic education project is offering an essay and a cartoon contest from which students can win prizes. \r\n\r\nLegischool, a civic education project that is working with California State University, Sacramento on this project, will award a round trip to Sacramento to meet and talk with state legislators to the winner of the essay contest and prize money to the winner of the cartoon contest.  According to LegiSchool Project Director Terre Thorne, the contests' goal is to get more teens involved with government policies.\r\n\r\n\"LegiSchool’s mission is to engage high school students in matters of public policy and state government,\" Thorne said. \"One of the ways we hope to achieve that goal is through our contests, which we created to get students thinking critically about important issues. Our hope is that participation in our contests will make government relevant to young people and inspire an interest in civic life.\"\r\n\r\nAccording to the LegiSchool Project website, the <a href=\"http:\/\/www.csus.edu\/calst\/LegiSchool_contests\/2015EssayFlyer.pdf\" target=\"_blank\">essay contest<\/a> requires students to write about their opinions on issues regarding low voter turnout among youth. The competition is available to all juniors and seniors in California.\r\n\r\nThe top 10 students will win a trip to Sacramento and get the chance to meet state legislators and share their ideas with them. \r\n\r\nAccording to Thorne, participants in the <a href=\"http:\/\/www.csus.edu\/calst\/LegiSchool_contests\/2015_Art_Contest.pdf\" target=\"_blank\">cartoon contest<\/a> must write an original political cartoon about a current political issue. All high schoolers can participate and students can only write one cartoon. The student who draws the most creative cartoon will win $150 and the next four runner-ups will win $100 each. The top five cartoons will also be showcased on <a href=\"http:\/\/www.kqed.org\/\" target=\"_blank\">KQED.org<\/a>.\r\n\r\nThe deadline for the essay competition is Nov. 18 and the deadline for the cartoon contest is Dec. 4.\r\n\r\n&nbsp;\r\n\r\n\r\n&nbsp;","excerpt":"In an effort to get more high schoolers to participate in politics,  a civic education project is offering an essay and a cartoon contest from which students can win prizes. ","date":"2015-11-03 19:34:25","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/voting.jpg","categories":["News"],"tags":["Barrientos","cartoon","contest","essay","Legischool","Politics","youth"]},{"id":111304,"title":"Liveblog: Girls’ volleyball plays Los Gatos on Senior Night","permalink":"http:\/\/palyvoice.com\/2015\/11\/03\/liveblog-girls-volleyball-plays-los-gatos-on-senior-night\/","content":"Check back at 6:45 p.m. for live coverage as Palo Alto High School girls’ volleyball team takes on Los Gatos High School on its Senior Night.\r\n\r\n[liveblog]","excerpt":"Check back at 6:45 p.m. for live coverage as Palo Alto High School girls’ volleyball team takes on Los Gatos High School on its Senior Night.","date":"2015-11-03 10:56:03","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Volleyball.png","categories":["Sports","Spotlight","Volleyball"],"tags":["girls volleyball","los gatos","paly","sports","VIKES"]}]