[{"id":98858,"title":"Girls&#8217; basketball to play No. 1 St. Ignatius Friday","permalink":"http:\/\/palyvoice.com\/2015\/02\/23\/girls-basketball-to-play-no-1-st-ignatius-friday\/","content":"<em>An undefeated league season is rewarded with a primetime matchup this Friday.<\/em>\r\n<p style=\"text-align: left;\">The Palo Alto High School girls' basketball team (22-2, 12-0) exceeded its initial goal of the season, not only finishing atop the De Anza League, but also capping off an undefeated record of 12-0 in league with a 64-62 victory on Feb. 18 against the Los Gatos Wildcats (16-7, 7-4). With a perfect league season in the books and a 22-2 overall record, the team will play its first Central Coast Section postseason game as the No. 8 seed this Friday, Feb. 27 against San Francisco's St. Ignatius High School (20-4, 10-2), the No. 1 team in Northern California and the No. 5 team in the United States, according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/st-ignatius-wildcats-(san-francisco,ca)\/girls-basketball\/home.htm\">MaxPreps<\/a>.<\/p>\r\nThe game will be played at 6 p.m. at Oak Grove High School in San Jose.\r\n\r\n[caption id=\"attachment_99086\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_14505b35d.jpg\"><img class=\"wp-image-99086\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_14505b35d.jpg\" alt=\"Sophomores Lauren Koyama, Skylar Burris and Julie Chandler join juniors Maddy Atwater and Courtney Lovely to form a team huddle during a game against cross-town rival Gunn High School. The girls' team finished its season with an undefeated league record of 12-0 and will face off against St. Igantius High School (20-4, 10-2) in its first postseason game. Photo by Dhara Yu.\" width=\"300\" height=\"201\" \/><\/a> Sophomores Lauren Koyama, Skylar Burris and Julie Chandler join juniors Maddy Atwater and Courtney Lovely to form a team huddle during a game against cross-town rival Gunn High School. The girls' team finished its season with an undefeated league record of 12-0 and will face off against St. Igantius High School (20-4, 10-2) in its first postseason game. Photo by Dhara Yu.[\/caption]\r\n\r\nPrior to the start of league play, sophomore guard Julie Chandler said winning league was <a href=\"http:\/\/palyvoice.com\/2014\/12\/04\/season-preview-girls-basketball-set-for-big-year\/\">one of the team's primary goals<\/a>, which the team ultimately accomplished with relative ease.\r\n\r\nThe Vikings are currently ranked 35th in California, also according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-basketball\/home.htm\">MaxPreps<\/a>.\r\n\r\nJunior guard Courtney Lovely said that winning the boards battle and playing consistent defense will be crucial if the Vikings are to pull off the upset.\r\n\r\n\"We are going to need really good defense and [get] rebounds [to win],\" Lovely said. \"They [St. Ignatius] are really strong on the boards.\"\r\n\r\nIf the Vikings defeat St. Ignatius, they will play the winner of the Scotts Valley (23-3, 12-0) and Sacred Heart Cathedral (14-10, 9-3) game on Tuesday, March 3, also at a neutral location.\r\n\r\nRegardless of how the team does in the CCS tournament, it is guaranteed a spot in the NorCal tournament which begins shortly after the conclusion of CCS.","excerpt":"The Palo Alto High School girls' basketball team (22-2, 12-0) exceeded its initial goal of the season, not only finishing atop the De Anza League, but also capping off an undefeated record of 12-0 in league with a 64-62 victory on Feb. 18 against the Los Gatos Wildcats (16-7, 7-4). The team will play St. Ignatius High School this Friday, the No. 5 team in the United States. ","date":"2015-02-23 17:57:15","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_14505b35d.jpg","categories":["Sports","Spotlight"],"tags":{"10098":"basketball","8568":"CCS","11270":"courtney lovely","8634":"de anza league","8735":"girls basketball","30050":"julie chandler","11722":"st. ignatius","38315":"undefeated"}},{"id":99034,"title":"Mayor Holman delivers State of Palo Alto address","permalink":"http:\/\/palyvoice.com\/2015\/02\/23\/mayor-holman-delivers-state-of-palo-alto-address\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_99038\" align=\"alignright\" width=\"326\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-2-7.jpg\"><img class=\"wp-image-99038 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-2-7.jpg\" alt=\"photo 2 (7)\" width=\"326\" height=\"244\" \/><\/a> Mayor Holman delivers the State of Palo Alto address to the community. “[13] is the number of years that I have been in either appointed or elected positions to serve this committee and its been my pleasure” Holman said. Photo by Will Zhou.[\/caption]City of Palo Alto Mayor Karen Holman emphasized the balance between retail and technology, youth goals and the connection between the city and its citizens during the State of Palo Alto Address on Wednesday at the Mitchell Park Community Center.\r\n\r\nIn her presentation, Holman stressed the need for both retail and technology business space in the city in order to make it a more balanced place.\r\n\r\n“When people think of Palo Alto, they see us as the technology center of the world or even the universe,” Holman said. “We are the heart of Silicon Valley, but when I think of Palo Alto, I think of a mix [of the technology and retail stores]. ”\r\n\r\nThe city, however, has lost over 70,000 square feet of retail space since 2008, according to Holman.\r\n\r\nHolman attributes the decline to rising rent prices that have driven stores away and empty spaces that have been replaced by housing.\r\n\r\n“[One of City Council’s goals is to increase] the walkability of the city and to reduce vehicle emissions and it’s essential to have a mix [of retail and technology] in order to accomplish that,” Holman said. “Council is looking at ways to protect retail, especially on California Avenue.”\r\n\r\nHolman also had a message to youth, urging them to find a passion and take action.\r\n\r\n“Find something that inspires you [the youth] to action and then act,” Holman said. “Identify some issue that you believe is to be addressed and then speak to it. You do have a place and we can make this a better world whether standing up for someone being bullied or leading a march, it all matters. Sometimes in ways that we will never know because we never know who or how many people are watching us. Act as if the world is watching, because it is.”\r\n\r\nAdditionally, Holman wants to create a communication channel between youth and the city.\r\n\r\n“There have been a bunch of meetings that have been organized to give youth a voice in the community and I encourage [youth] to seek them out,” Holman said.\r\n\r\n[caption id=\"attachment_99069\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-1.jpg\"><img class=\"wp-image-99069\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-1.jpg\" alt=\"Former Palo Alto mayors and city council members listen to the address and with currently serving council members. Photo by Will Zhou.\" width=\"300\" height=\"225\" \/><\/a> Former Palo Alto mayors and city council members listen to the address and with currently serving council members. Photo by Will Zhou.[\/caption]\r\n\r\nHolman is also working to enhance communication between stewards and citizens.\r\n\r\n“[We] seek to focus on communication between neighborhoods including holding annual town-hall style meetings with council members and staff and focus on different regions of Palo Alto,\" Holman said. \"You can expect this to be coming to the council in March.”\r\n\r\nPalo Alto resident Dave Dockter was able to relate to Holman’s messages.\r\n\r\n“I enjoyed [the address] because I could identify with the numbers: the population and the number of trees,” Dockter said. “They spoke to me. It was not just politics. I like [Holman’s stance on] stewardship, that’s the way I see the city staff, this will be a better community, we don’t want to be just a veneer.”\r\n\r\nThroughout the address, Holman stated several data points to give a summary of the city's condition:\r\n<ul>\r\n\t<li>$1.8 million is the median home value in the city<\/li>\r\n\t<li>54.8 percent of the homes in the city are occupied by the homeowners<\/li>\r\n\t<li>45.2 percent of homes in the city are occupied by renters<\/li>\r\n\t<li>148,209 is the population in Palo Alto, including residents at Stanford<\/li>\r\n\t<li>8271 square feet of parks, preserves, and open space in the city.<\/li>\r\n\t<li>836 bikers at Gunn High School, 805 at Palo Alto High School<\/li>\r\n<\/ul>\r\nHolman continued by outlining what she thought Palo Alto should be.\r\n\r\n“[I want] Palo Alto to be the kind of town you want to live in, the kind of town that reflects your values, that makes you proud, that preserves your right to be heard, our open spaces and address traffic and housing issues, that supports diversity of business and residents that cares about and for those that are not as well of,” Holman said.\r\n\r\nThe mayor concluded by sharing her vision for the year.\r\n\r\n“We have an inheritance that has been endowed upon us and it is up to us to care for it right now,\" Holman said. \"Your [the resident's] voice still matters, use it this year so we can reconnect with each other. It’s [Palo Alto] a place I’m proud to call home.”\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"City of Palo Alto Mayor Karen Holman emphasized the balance between retail and technology, youth goals and the connection between the city and its citizens during the State of Palo Alto Address last Wednesday at the Mitchell Park Community Center.","date":"2015-02-23 14:31:54","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-2-7.jpg","categories":["News"],"tags":{"38976":"holman","30529":"mayor","8939":"palo alto","9045":"review","38975":"state of palo alto"}},{"id":99491,"title":"Summer opportunities fair at 7 p.m. on Feb. 25 at the Gunn High School library","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/summer-opportunities-fair-at-7-p-m-on-feb-25-at-the-gunn-high-school-library\/","content":"","excerpt":"","date":"2015-02-22 17:41:59","author":"Lizzie Chun","categories":["Ticker"],"tags":{"15095":"fair","8751":"gunn","39364":"summer opportunities"}},{"id":99183,"title":"Review: &#8220;American Sniper&#8221; – a personal look into war","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-american-sniper-a-personal-look-into-war\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_99219\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/American-Sniper-2014.jpg\"><img class=\"size-full wp-image-99219\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/American-Sniper-2014.jpg\" alt=\"Clint Eastwood directs the true story of Chris Kyle, an American SEAL who does [[[completes?]]] four tours in Iraq after the devastating events of 9\/11. Photo by Warner Bros.\" width=\"600\" height=\"374\" \/><\/a> Clint Eastwood directs the true story of Chris Kyle, an American SEAL who does four tours in Iraq after the devastating events of 9\/11. Photo courtesy of Warner Bros.[\/caption]The title of the movie says it all: war, patriotism and of course, snipers. This war movie not only includes numerous fighting scenes, but also flashes of the life a soldier experiences and how far some soldiers are willing to go for a country they love. \"American Sniper\" tells the story through a unique perspective by taking a deep look into one soldier's experiences. However, while the movie reaches the expectations for a great action movie and realistic war movie, it does not quite reach the goal of being the perfectly thought-out biography.\r\n\r\n“American Sniper” is a true story based on Chris Kyle’s autobiography as a Navy SEAL in Iraq after the United States declared war on terrorism. Kyle (Bradley Cooper) is a Texan cowboy who grew up with a father who taught him to classify people as wolves, sheep and sheepdogs that protect the innocent. The childhood lesson resurfaces in Kyle’s life when he joins the SEALs, after he decides it’s time he did something more with his life. Kyle meets his future wife Taya (Sienna Miller) in a surprisingly lighthearted scene, and after some playful bantering and courtship, they marry before Kyle leaves for Iraq. The movie then proceeds to follows him through his four tours, over a hundred kills, his struggle to stay in touch with his wife and through his assimilation into society after losing friends along the way.\r\n\r\nDirector Clint Eastwood attempts to portray the reasoning behind the violence war requires by emphasizing the themes of vengeance against terrorism and the price good men pay in the fight against evil through Kyle’s story. However, while there is a strong focus on Kyle’s beliefs on the war and his duty, the lens Eastwood uses primarily provides justification for the war instead of focusing more on troubling consequences and opposing views.\r\n\r\n[caption id=\"attachment_99197\" align=\"alignnone\" width=\"643\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/americansniper26.jpg\"><img class=\"size-full wp-image-99197\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/americansniper26.jpg\" alt=\"As a sniper, Chris Kyle (Bradley Cooper) protects the American soldiers moving through the Iraqi streets. He eventually becomes the most efficient sniper in U.S. history. Photo by Warner Bros. \" width=\"643\" height=\"359\" \/><\/a> As a sniper, Chris Kyle (Bradley Cooper) protects the American soldiers moving through the Iraqi streets. He eventually becomes the most efficient sniper in U.S. history. Photo courtesy of Warner Bros.[\/caption]\r\n\r\nThe action scenes are beautifully done with interesting camera angles and none of the overly loud and unnecessary music that can be distracting in a serious war movie. There are also scenes flashing between Kyle’s perspective and his wife’s perspective during phone conversations that add strength and realism to their relationship, which could have otherwise been easily overlooked. Bradley Cooper’s transformation into a bulky, Texan soldier is not only amazing physically, but it also remained unwaveringly realistic throughout the movie in a showcase of dedicated acting. As Taya, Sienna Miller's emotions seem authentic, and her performance as the worried wife helps the audience connect to the couple's struggles.\r\n\r\n“American Sniper” provides a direct look into the lives of soldiers and a moving snapshot of their dedication to protect their country. The movie is not afraid to illustrate not only the struggles of the soldiers, but also the terrifying experiences of affected Iraqi citizens. As an action movie, it meets all standards. As a drama, it paints a gritty but also touching look into one man’s life. Still, while it is a good and sometimes even thematically deep war movie, “American Sniper” does not explore enough of the varying aspects of war issues to be considered one of the best war movies of all time.\r\n\r\n<strong>\"American Sniper\"<\/strong>\r\n\r\n<strong>2 hours, 14 minutes<\/strong>\r\n\r\n<strong>Rated R for for strong and disturbing war violence, and language throughout, including some sexual references<\/strong>\r\n\r\n<strong>Directed by Clint Eastwood<\/strong>\r\n\r\n<strong>With Bradley Cooper, Sienna Miller, Kyle Gallner<\/strong>\r\n\r\n<strong>Oscar Nominations: Best Picture, Actor in a Leading Role (Bradley Cooper), Adapted Screenplay, Film Editing, Sound Editing and Sound Mixing<\/strong>","excerpt":"The title of the movie says it all: war, patriotism and of course, snipers. This war movie not only includes numerous fighting scenes, but also flashes of the life a soldier experiences and how far a person is willing to go for a country they love. ","date":"2015-02-22 17:40:45","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/americansniper26.jpg","categories":["Entertainment","Reviews"],"tags":{"14287":"action","39021":"american sniper","39023":"bradley cooper","39022":"clint eastwood","8654":"drama","8900":"movie review","8930":"oscars","10815":"war"}},{"id":99484,"title":"Liveblog: Oscars 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/liveblog-oscars-2015\/","content":"[caption id=\"attachment_99494\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars1.jpg\"><img class=\" wp-image-99494\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars1.jpg\" alt=\"The 87th Annual Academy Awards begin at 5:30 p.m. Photo courtesy of Forbes. \" width=\"600\" height=\"331\" \/><\/a> The 87th Annual Academy Awards begin at 5:30 p.m. Photo courtesy of Forbes.[\/caption]\r\n\r\n<em>The Paly Voice presents live coverage of the 87th Academy Awards. Be sure to check out The Voice's <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/liveblog-oscars-red-carpet-2015\/\">coverage of the Red Carpet <\/a>and <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-oscars-2015-best-picture-nominees\/\">reviews of the Best Picture nominees<\/a>.<\/em>\r\n\r\n<em>Editor's Note: The opinions expressed in this article are those of the authors alone and not necessarily of the staff of The Paly Voice as a whole.<\/em>\r\n\r\n[liveblog]","excerpt":"The Paly Voice presents live coverage of the 87th Academy Awards. Tune in at 5:30 p.m. for live updates and commentary.","date":"2015-02-22 17:33:36","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars1.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Spotlight"],"tags":{"19460":"2015","8450":"academy","11967":"academy awards","39366":"awards","39365":"oscar","8930":"oscars"}},{"id":99269,"title":"Review: &#8220;The Imitation Game&#8221; is a hidden gem","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-imitation-game-is-a-hidden-gem\/","content":"[caption id=\"attachment_99277\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/ig2_0.jpg\"><img class=\"size-full wp-image-99277\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/ig2_0.jpg\" alt=\"The Enigma team works feverishly to figure out if &quot;Christopher&quot; the &quot;universal machine&quot; can solve the difficult coding system. Photo by StudioCanal.\" width=\"400\" height=\"266\" \/><\/a> The Enigma team works feverishly to figure out if \"Christopher,\" the \"universal machine,\" can solve the difficult coding system. Photo courtesy of StudioCanal.[\/caption]\r\n\r\nIf you walk down the street and ask someone \"Who is Alan Turing?\" they probably would give you a blank stare or a puzzled expression. After watching \"The Imitation Game,\" viewers everywhere will know about Alan Turing and his life-changing position in helping to end World War II. \"The Imitation Game\" is an intense film set in the 1940s that depicts the turmoil of the time and within Turing's life while still having all the necessary parts of a film, including humor, romance and high stakes.\r\n\r\nAlan Turing (Benedict Cumberbatch) is part of an elite group searching for the key to Enigma, the coding system the Germans utilized during World War II. Turing is a genius but is socially awkward as he cannot comprehend jokes or sarcasm, which often causes difficulties between him and the other workers.\r\n\r\nThe humor in \"The Imitation Game\" is often very subtle and can be found in Turing's actions or in snarky comments from his team that completely pass over his head.\r\n\r\n\"The Imitation Game\" has three distinct plot lines, which give a more complete idea of Turing's life. The main plot line is Turing working on Enigma and creating \"Christopher,\" a machine that should solve Enigma and become a \"universal machine.\" The name \"Christopher\" has meaning to the audience because of the second plot line that focuses on his intimate friendship with his only friend Christopher Morcom (Jack Bannon) during high school. Everything gets tied together in the final plot line in which Turing is exposed, not as a Soviet spy, but as a gay man, which was a crime in the United Kingdom until 1967.\r\n\r\nA British film would not be complete without Keira Knightley. Knightley plays Joan Clarke, who outdoes many of the men on the Enigma team and is Turing's closest confidant. Knightley is practically the only female character, but she is strong and refreshing. In order to keep Clarke on the Enigma team, Turing often goes above and beyond by lying to her parents about her \"secretarial job\" and even proposing to her, so she still fits stereotypical women's roles during the time period.\r\n\r\n[caption id=\"attachment_99279\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/cdn.indiewire.jpg\"><img class=\"size-full wp-image-99279\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/cdn.indiewire.jpg\" alt=\"Keira Knightley and Benedict Cumberpatch star in &quot;The Imitation Game.&quot; Knightley is the only star female character and outshines many of the other Enigma team members. \" width=\"400\" height=\"281\" \/><\/a> Keira Knightley and Benedict Cumberbatch star in \"The Imitation Game.\" Knightley is the only star female character and outshines many of the other Enigma team members. Photo courtesy of StudioCanal[\/caption]\r\n\r\nNot only is the film set in an incredibly tenuous time period, but Turing's sexual orientation also causes himself to be a target. Throughout the movie, the idea of his feelings toward Morcom build, and his homosexuality becomes a greater topic as the storyline escalates. The film itself is not about homophobia, but this definitely adds a more contemporary importance to the film.\r\n\r\nThe costumes seem very well done and enhance the setting of the time period. Cumberbatch's performance was amazing, as the audience both loved him for his ideas but felt removed from him with his awkwardness. Even though the film is about a dark time in history, it has plenty of happy and adorable moments. After Cumberbatch understands a clue of how to crack Enigma, the urge to stand up and cheer is undeniable.\r\n\r\n\"The Imitation Game\" is up for eight Oscar nominations. Best Picture, Actor in Leading Role and Actress in Supporting Role are just a few of the possible awards that we can expect from this film.\r\n\r\n<strong>\"The Imitation Game\"<\/strong>\r\n\r\n<strong>1 hour, 54 minutes<\/strong>\r\n\r\n<strong>Rated PG-13 for sexual references and mature thematic material<\/strong>\r\n\r\n<strong>Directed by Morten Tyldum <\/strong>\r\n\r\n<strong>With Benedict Cumberbatch, Keira Knightley and Matthew Goode<\/strong>","excerpt":"Oscar nominee \"The Imitation Game\" features Benedict Cumberbatch as Alan Turing in a biopic about solving Enigma during World War II and preventing further violence.","date":"2015-02-22 17:27:30","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/ig2_0.jpg","categories":["Entertainment","Reviews"],"tags":{"39034":"benedict cumberbatch","39031":"best film","39033":"keira knightley","8900":"movie review","8930":"oscars","39032":"the imitation game"}},{"id":99270,"title":"Review: &#8220;Boyhood&#8221; captures audience and time","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-boyhood-captures-audience-and-time\/","content":"[caption id=\"attachment_99358\" align=\"alignnone\" width=\"612\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/image.jpg\"><img class=\"wp-image-99358 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/image.jpg\" alt=\"boyhood image \" width=\"612\" height=\"380\" \/><\/a> Ellar Coltrane portrays the protagonist, Mason, in \"Boyhood.\" Coltrane started shooting for the film at age 7 and finished acting in the final scene 12 years later. Photo courtesy of IFC Films.[\/caption]\r\n\r\nRichard Linklater's \"Boyhood\" is the coming of age story of a young man named Mason (Ellar Coltrane) from ages 5 to 18. The film was shot over 12 years of filming beginning in 2002. It is through this groundbreaking technique we experience Mason's transcendence into adulthood, as he matures and leaves for college, and simultaneously experience the cast and actor Coltrane maturing and growing with him.\r\n\r\nThe feat this film has accomplished is extraordinary and its message universal. It's extraordinary in the sense that the plot is very limited and consists of a series of snapshots of a life, a life that could be anyone's, and yet it is for this reason of simplicity that the audience is drawn in. We empathize with Mason and we see his life reflected in our own. The film's focus is on the passing of time, and as the story progresses we come to see how each character is affected by time, and how they overcome, or fail to overcome its unstoppable progression. Time has been spotlighted in other Richard Linklater's films, such as \"Before Sunrise\", \"Before Sunset\" and \"Before Midnight\". The three films follow a couple as they meet throughout the years and then are forced in each film to say goodbye, time never seeming to stand still for either of them.\r\n\r\nBoyhood does this on a larger scale. The film centers around Mason's family, mainly his father (Ethan Hawke) who left the family when Mason was young, his mother (Patricia Arquette) who left school to support her kids, his sister Samantha (Lorelei Linklater-the directors daughter) a bratty hyperactive elementary schooler and finally Mason, a thoughtful young boy who quietly observes the world around him. The film takes you through Mason's childhood, his parents divorce and then through his mother's failing relationships which force the family to start anew time and time again. From one home to the next, we watch how each new experience affects and changes the family members, and how time helps them recover and grow. Both Hawke and Arquette are remarkable in this film; their performance is raw and truthful. Likewise, Coltrane is able portray Mason with such dreamlike and wistful vulnerability that at the end of the film we are left praying and aching for Mason, hoping that everything will turn out okay for him. You grow to understand and love the characters wholly, and you leave the movie a little different than when you came in, with maybe a slight hint at an understanding of this unstoppable whirlwind called life.\r\n\r\n\"Boyhood\" is nominated for the following six academy awards: Best Picture, Best Supporting Actor, Best Supporting Actress, Best Director, Best Original Screenplay and Best Film Editing. I believe \"Boyhood\" deserves to win best Supporting Actress, Best Picture and Best Director.\r\n\r\n<strong>\"Boyhood\"<\/strong>\r\n\r\n<strong>2 hours, 45 minutes<\/strong>\r\n\r\n<strong>Rated R for language including sexual references, and for teen drug and alcohol use<\/strong>\r\n\r\n<strong>Directed by Richard Linklater<\/strong>\r\n\r\n<strong>Staring Ellar Coltrane, Patricia Arquette, Ethan Hawke and Lorelei Linklater<\/strong>","excerpt":"Richard Linklater's \"Boyhood\" is the coming of age story of a young man named Mason (Ellar Coltrane) from ages 5 to 18. The film was shot over 12 years of filming beginning in 2002.","date":"2015-02-22 17:26:32","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/image.jpg","categories":["Entertainment","Reviews"],"tags":{"11967":"academy awards","39045":"Best Director","39018":"best picture","39039":"Boyhood","39040":"Ellar Coltrane","39042":"Ethan Hawke","39043":"Lorelei Linklater","8930":"oscars","39041":"Patricia Arquette","39044":"Richard Linklater"}},{"id":99376,"title":"Review: “Whiplash” provides drama and entertainment","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-whiplash-provides-drama-and-entertainment\/","content":"[caption id=\"attachment_99384\" align=\"alignnone\" width=\"519\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/WHIPLASH.png\"><img class=\"wp-image-99384\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/WHIPLASH.png\" alt=\"WHIPLASH\" width=\"519\" height=\"365\" \/><\/a> \"Whiplash\" stars Miles Teller as Andrew Neiman, a jazz drummer determined to win the approval of his abusive band teacher. It is nominated for five Academy Awards including Best Picture. Photo by Sony Pictures.[\/caption]\r\n\r\nDamien Chazelle’s film “Whiplash” captivates audiences with its talented cast, superb script and intriguing mood, garnering five Academy Award nominations. Despite this deserved success, the film falls slightly flat in terms of character development and realistic plotline.\r\n\r\n“Whiplash” stars  Andrew Neiman (Miles Teller), an ambitious jazz drummer enrolled in a prestigious New York music school. Neiman, initially accepted into the school band as an alternate drummer, is eventually promoted to the jazz band’s core drummer. Conductor Terence Fletcher (J.K. Simmons), however, is abusive to his students, regularly ridiculing and mocking them during rehearsals. Teller’s hopes of gaining Fletcher’s approval soon turn into an obsession which rapidly spirals out of control.\r\n\r\nThe film serves as great entertainment and is captivating throughout. The cast of “Whiplash,” namely J.K. Simmons, effortlessly slide into character and evoke various emotions in the audience. Viewers easily connect with the protagonist and are engrossed by Teller’s arduous journey as he struggles against Fletcher’s harsh classroom rule. Teller’s character traits continuously evolve in the film, allowing for a dynamic and sophisticated plot.\r\n\r\n\"Whiplash\" succeeds in other aspects as well. The movie’s moderate length will not bore most audiences, and the entire film is well-edited as each scene flows on to the next. The script is well written and provides intricate plot twists which will no doubt surprise most viewers. Furthermore, a vague yet constant suspenseful tone combined with as a fast-paced soundtrack created an interesting mood throughout with a positive result.\r\n\r\nAlthough “Whiplash” has a large number of charming qualities, the film still faces a few problems as well. Character development is generally lacking in Simmons’ character and viewers may be disappointed to find how little he has evolved at the end of the film. The plot can also be at times irritatingly unrealistic, forcing the audience to question Teller’s motives throughout.\r\n\r\nDespite the negative aspects of the film, “Whiplash” proved to be an exciting and dramatic film with a colorful cast, alluring plot and intriguing tone which will do little to displease any audience.\r\n\r\n\"Whiplash\" is nominated for the Academy Awards for Best Picture, Best Supporting Actor, Best Adapted Screenplay, Best Film Editing and Best Sound Mixing. Although \"Whiplash\" is unlikely to win Best Picture, it has a chance to take home the awards for Best Supporting Actor, Best Adapted Screenplay and Best Sound Mixing.\r\n\r\n<b>\"Whiplash\"<\/b>\r\n\r\n<b>1 hour, 46 minutes<\/b>\r\n\r\n<b>Rated R for <\/b><b>for strong language including some sexual references<\/b>\r\n\r\n<b>Directed by Damien Chazelle<\/b>\r\n\r\n<b>Starring Miles Teller, J.K. Simmons, Paul Reiser, Melissa Benoist<\/b>\r\n\r\n&nbsp;","excerpt":"Damien Chazelle’s film “Whiplash” captivates audiences with its talented cast, superb script and intriguing mood.","date":"2015-02-22 16:38:37","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/WHIPLASH.png","categories":["Entertainment","Reviews"],"tags":{"39053":"academy award","39018":"best picture","39052":"oscars 2015","39051":"whiplash film"}},{"id":99420,"title":"Review: The Oscars 2015 Best Picture Nominees","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-oscars-2015-best-picture-nominees\/","content":"<em>The Academy of Motion Picture Arts and Sciences will host its 87th Academy Awards ceremony at 5:30 p.m. tonight. The Paly Voice reviewed the nominations for Best Picture. Read up on each film before the event.<\/em>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-american-sniper-a-personal-look-into-war\/\">American Sniper<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-birdman-provides-entertainment-and-food-for-thought\/\" target=\"_blank\">Birdman or (The Unexpected Virtue of Ignorance)<\/a>\r\n\r\n<a title=\"Review: &quot;Boyhood&quot; captures audience and time\" href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-boyhood-captures-audience-and-time\/\" target=\"_blank\">Boyhood<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/the-grand-budapest-hotel-is-a-complex-hit\/\" target=\"_blank\">The Grand Budapest Hotel<\/a>\r\n\r\n<a title=\"Review: &quot;The Imitation Game&quot; is a hidden gem\" href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-the-imitation-game-is-a-hidden-gem\/\" target=\"_blank\">The Imitation Game<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-selma-bridges-past-and-present-with-promise-of-mlks-legacy\/\" target=\"_blank\">Selma<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/the-theory-of-everything-is-beautifully-bittersweet\/\" target=\"_blank\">The Theory of Everything<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/review-whiplash-provides-drama-and-entertainment\/\" target=\"_blank\">Whiplash<\/a>\r\n\r\n&nbsp;","excerpt":"The Academy of Motion Picture Arts and Sciences will host its 87th Academy Awards ceremony at 5:30 p.m. tonight. The Paly Voice reviewed the nominations for Best Picture. Read up on each film before the event tonight.","date":"2015-02-22 16:30:23","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/oscars.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Reviews","Spotlight"],"tags":{"11967":"academy awards","39367":"movie reviews","39052":"oscars 2015","37729":"reviews"}},{"id":99426,"title":"Liveblog: Oscars Red Carpet 2015","permalink":"http:\/\/palyvoice.com\/2015\/02\/22\/liveblog-oscars-red-carpet-2015\/","content":"[caption id=\"attachment_99448\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/GTY_emma_watson_jef_140303_mn_16x9_9921.jpg\"><img class=\"size-full wp-image-99448\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/GTY_emma_watson_jef_140303_mn_16x9_9921.jpg\" alt=\"Emma Watson poses on the red carpet at the 86th annual Oscars ceremony on March 2, 2014. Photo courtesy of ABC News.\" width=\"600\" height=\"338\" \/><\/a> Emma Watson poses on the red carpet at the 86th annual Oscars ceremony on March 2, 2014. Photo courtesy of ABC News.[\/caption]\r\n\r\n<em>Coming to you from (our sofas) the Red Carpet, The Paly Voice gives live coverage of the Oscars Red Carpet as actors arrive elegantly dressed.\r\n<\/em>\r\n\r\n<em>Editor's Note: The opinions expressed in this article are solely those of the authors alone and are not necessarily those of the The Paly Voice staff. <\/em>\r\n\r\n[liveblog]","excerpt":"Coming to you from (our sofas) the red carpet, The Paly Voice gives live coverage of the Oscars Red Carpet as actors arrive elegantly dressed.","date":"2015-02-22 16:01:49","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/GTY_emma_watson_jef_140303_mn_16x9_9921.jpg","categories":["A&amp;E Section Spotlight","Uncategorized"],"tags":{"9699":"actors","39084":"actresses","39083":"celebrities","8901":"movies","39052":"oscars 2015","9034":"red carpet"}}]