[{"id":97481,"title":"What the heck-a is DECA?","permalink":"http:\/\/palyvoice.com\/2015\/02\/09\/what-the-heck-a-is-deca\/","content":"[caption id=\"attachment_97851\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965188_839116899457646_1870902858_o.jpg\"><img class=\"wp-image-97851\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965188_839116899457646_1870902858_o.jpg\" alt=\"Paly DECA members pose for a picture at the Silicon Valley DECA regional competition. Photo by Alice Zhao \" width=\"620\" height=\"412\" \/><\/a> Paly DECA members pose for a picture at the Silicon Valley DECA regional competition. Photo by Alice Zhao.[\/caption]\r\n\r\nThis year, a new club has risen to prominence at Palo Alto High School: DECA.\r\n\r\nIn just a few short months of its existence, the Paly chapter has grown to include over 50 people and has had members place in a prestigious competition. But despite the club’s success as well as its prominent social media presence, quite a few Paly students are unaware of what the club is actually about. Paly DECA co-presidents junior Stephanie Cong and junior Karina Chan help explain the organization’s objectives.\r\n\r\n“DECA is just a club that enhances learning of any business-related topics through competitive conferences,” Cong said.\r\n\r\nDECA, which formerly stood for Distributive Education Clubs of America but is no longer used as an acronym for anything, is a club intended to increase high school students' knowledge of the professional world. Chapters participate in contests at the regional, state and international levels in which students compete in various business-related events. Most of the events involve students showcasing their knowledge of a specific field of business, usually by making a sales pitch to a series of judges.\r\n\r\n“Each person has a different event,\" Chan said. \"There are over 50 events offered, so there’s a lot of detail that goes into it, which is why it’s so hard to explain to people.\"\r\n\r\nSo far, Paly DECA has attended the Leadership and Competitive Excellence Conference, an introductory event that offers workshops for DECA members to learn about the events offered and to improve their skills, and the Silicon Valley district conference.\r\n\r\n“We were pretty successful [in the Silicon Valley conference],\" Chan said \"A third of all members who attended placed in their contests.\"\r\n\r\nLast year’s DECA was practically nonexistent, and Chan said she was inspired to revitalize the club at Paly after seeing the success of DECA programs at other local high schools.\r\n\r\n“Other schools [Gunn, Lynbrook, Monta Vista and Mission San Jose] have big DECA clubs – all 200 to 400 people – and definitely there’s no club like that at Paly,” Chan said. “I wanted to start DECA to help give people that kind of experience.”\r\n\r\nBoth presidents attribute DECA’s popularity at Paly to the idea that the club gives people the opportunity to learn valuable skills and gain real-world business experience.\r\n\r\n“A lot of people can see themselves going into the field [hospitality, finance, entrepreneurship, management, marketing] that they are currently studying for DECA,” Cong said. “As well as that, it [DECA] gives people an opportunity to network with other high school students.”\r\n\r\nTo promote their club, members have taken to social media; on two separate occasions, members have changed their profile pictures on Facebook to DECA-themed images. Cong and Chan both say DECA’s social media approach is an effective way to advertise the club and attract potential members.\r\n\r\n“We know that if people don’t even know what DECA is when we talk to them, we have to have the same conversation over and over,\" Cong said. \"Having a large social media presence gets our name out there initially.”\r\n\r\nChan asserts that having a dynamic social media presence isn’t the main focus of Paly DECA.\r\n\r\n“The value of our club is not our social media presence – it’s what skills we can offer to students,” Chan said. “It’s not about the profile pictures.\"","excerpt":"This year, a new club has risen to prominence at Palo Alto High School: DECA. Despite the club’s success, quite a few Paly students are unaware of what the club is actually about. The Paly Voice gets the scoop.","date":"2015-02-09 19:20:35","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965188_839116899457646_1870902858_o.jpg","categories":["Features","Spotlight"],"tags":{"38437":"business","28772":"club","11337":"clubs","38427":"DECA","38436":"karina chan","8944":"palo alto high school","38438":"stephanie cong"}},{"id":95407,"title":"The fresh kids corner: Max Dorward","permalink":"http:\/\/palyvoice.com\/2015\/02\/08\/the-fresh-kids-corner-max-dorward\/","content":"<em>Participating in a varsity sport, under the stress and spotlight of high-pressure games and tournaments, can be daunting, especially to those with little experience playing at the level. In this first installment of a three-part series, The Paly Voice features the youngest and least-experienced members of the Palo Alto High School varsity basketball teams: the freshmen.<\/em>\r\n\r\nThis year, the girls' team features two freshmen, while the boys' team has just one – the first freshman to make the boys' varsity team since alumnus E.J Floreal, who currently <a title=\"EJ Floreal UK Profile\" href=\"http:\/\/www.ukathletics.com\/sports\/m-baskbl\/mtt\/ej_floreal_862043.html\" target=\"_blank\">plays for the University of Kentucky<\/a>, during the 2009-10 season. All three players possess critical roles for their respective teams, just a handful of months into their high school careers.\r\n\r\nRecently, The Paly Voice sat down with the lone freshman on the boys' team, 6' 2\" forward Max Dorward, to discuss his brother's guiding influence, his current role on the team and his bright future in the sport he loves.\r\n\r\n[caption id=\"attachment_97467\" align=\"alignnone\" width=\"624\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg\"><img class=\" wp-image-97467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg\" alt=\"Freshman forward Max Dorward boxes out his Wilcox opponents during his team's 71-56 win on Jan. 30. Dorward is the lone senior on this year's boys' team. Photo by Josh Yuen. \" width=\"624\" height=\"416\" \/><\/a> Freshman forward Max Dorward boxes out his Wilcox opponents during his team's 71-56 win on Jan. 30. Dorward is the lone freshman on this year's boys' team. Photo by Josh Yuen.[\/caption]\r\n\r\nThe Paly Voice: Freshman year. Varsity basketball. Tell us what that means to you.\r\n\r\nMax Dorward: It's a huge accomplishment for me. I've been playing basketball my entire life, and I worked really hard to get to this point. I'm thankful that I made it onto varsity, but I still would have been very proud of myself if I had made it onto JV. Varsity is a huge, huge accomplishment.\r\n\r\nTPV: There are a lot of experienced players on the varsity team: Kevin [Mullin] and Johnny [Rojahn] in particular, Alex [Dees] as well. Who do you look up to most playing-wise and leadership-wise?\r\n\r\nMD: I think all of our seniors are really good. They're undoubtedly the leaders on our team. Kevin has his traits of leadership while Johnny has the other traits and Alex has some of his traits as well. A combination of all three is really great. Juniors are also a big part – Oliver [Svirsky], Justin [Hull], Mikey [Grandy], they all possess aspects of leadership. Rather than look at individuals, I really like to look at our entire team and really take a little bit of something from everyone.\r\n\r\nTPV: What is your take on Coach Sax developing you into not just a basketball player at Paly, but also as a student in high school? What has he done to help you transition from the middle school to the high school level?\r\n\r\nMD: Knowing that we are all just in high school, he relates to me and everyone else by bringing in these quotes that really help us just play our games. In practice he also brings in quotes from Macbeth and other novels that he really likes. He can really relate to us well that way.\r\n\r\nTPV: In terms of your current role on the team, you realize that being a freshman means you probably won't get as many opportunities as you will as later as an upperclassmen. This year, though, what do you want your role to be the rest of the season? You're playing a healthy amount for a freshman.\r\n\r\nMD: I was coming into this year expecting to not play at all, similar to how Kevin didn't really play his sophomore year. That year was more of a developing year for the coming seasons. That's what I was expecting. I was really taken back when I began getting a lot of playing time as a freshman. This year, I'm still taking it as a stride for future years to really develop myself and get better as a player.\r\n\r\nTPV: Think about the professional level, just for a moment. Out of all of the NBA players that you could choose from, which one do you look up to most? Not just playing-wise, but also think about who you want to become as a person.\r\n\r\nMD: There's a lot of great players to choose from. People may right away think about Kobe [Bryant], LeBron [James], Kevin Durant. For me, Stephen Curry is my guy. I really like him a lot because he's a leader as well as a great player. He also kind of started out with nobody knowing who he was, and he's worked really hard to get to where he is. I look up to him more than the other great players.\r\n\r\nTPV: You started playing basketball at an early age. Your brother [Lukas Dorward] currently plays over at Gunn. How early did playing varsity basketball become a real possibility in your mind? When did that hit you?\r\n\r\nMD: Over this past summer, I played for Coach Sax over summer league. I thought I had a small shot making varsity then. I later found out that I was being asked to try out, and really try and be on the team. That's when it really hit me that I had a really good shot at making varsity.\r\n\r\nTPV: Take the fact that Kevin, who's averaging more than 20 points per game this season, started playing varsity as a sophomore and didn't play very much at all for a moment, and combine it with the fact that you're a freshman already integrated into Coach Sax's rotation. What does that right there say about what you can become?\r\n\r\nMD: I have really high hopes, honestly. Looking up to Kevin, who's a great scorer and a great team player, I really hope to one day exceed Kevin's playing ability. Right now, though, I'm just really focusing on developing and improving my skills.\r\n\r\nTPV: Outside of the school and the team itself, who has helped you the most get to this point?\r\n\r\nMD: Definitely my brother. I look up to him so much. He's been a great mentor to me, having played basketball his entire life, too. This in addition to other sports that he's played, as well. I really look up to him, and he's given me a lot of good advice.\r\n\r\nTPV: Best thing about high school so far?\r\n\r\nMD: Definitely the freedom. No question.\r\n\r\nTPV: Okay, then. What's the worst thing about it?\r\n\r\nMD: I would have to say Mondays. I just don't like the seven period schedule.\r\n\r\nTPV: What is one thing that Paly should know about you as the school gets to witness your growth and potential over the next few years?\r\n\r\nMD: I'm just a young player trying to develop and trying to be the next big guy during my senior year.\r\n\r\n<em>Dorward and the boys' varsity team is currently in first place in the De Anza League, with a league record of 7-2. Their next game is at 7:45 p.m. Feb. 13 at Homestead High School.<\/em>\r\n\r\n&nbsp;","excerpt":"For the first segment of a three-part series featuring freshmen varsity basketball players, staff writer Josh Yuen sat down with freshman Max Dorward to discuss his brother's guiding influence, his current role on the team and his bright future. ","date":"2015-02-08 20:48:15","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg","categories":["Editor's Pick","Sports"],"tags":{"10098":"basketball","8538":"boys basketball","38475":"fresh kids corner","9795":"freshman","37657":"max dorward","37656":"three-part series"}},{"id":97027,"title":"Paly hosts second annual TEDx","permalink":"http:\/\/palyvoice.com\/2015\/02\/08\/paly-hosts-second-annual-tedx\/","content":"Palo Alto High School's TEDx Club will host a series of student, teacher and professional TEDx speakers during various class periods tomorrow in the Media Arts Center. Each speaker will deliver a short talk on a topic of his or her choice, from medicine and physics to music and writing.\r\n\r\nTED is a nonprofit organization, which aims to spread ideas to the whole world, according to <a href=\"https:\/\/www.ted.com\">its website<\/a>. TED started as a conference where \"technology, entertainment and design converged, and today covers almost all topics — from science to business to global issues — in more than 100 languages.\" These ideas are shared in the form of talks, 18 minutes or fewer. The \"x\" in \"TEDx\" signifies an independently organized event, where communities can create and host their own TED events.\r\n\r\nBelow are previews of the talks that will be offered.\r\n\r\n[caption id=\"attachment_98360\" align=\"alignleft\" width=\"158\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/pic-physician-tayeri.jpg\"><img class=\"wp-image-98360 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/pic-physician-tayeri.jpg\" alt=\"Thomas Tayeri is an ophthalmologist. He is the founder and CEO of Palo Alto Eye Group. \" width=\"158\" height=\"219\" \/><\/a> Tayeri practices as an ophthalmologist. He is the founder and CEO of <a href=\"http:\/\/www.paloaltoeye.com\/index.html\">Palo Alto Eye Group<\/a>. Photo Courtesy of Thomas Tayeri.[\/caption]\r\n\r\n<strong>Thomas Tayeri, Period 1<\/strong>\r\n\r\nTayeri is an ophthalmologist and the founder and CEO of Palo Alto Eye Group. He will talk about the problem of blindness around the world.\r\n\r\n\"Specifically, I will give examples of what a local nonprofit is doing to eradicate needless blindness in developing countries,\" Tayeri said via email.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_98375\" align=\"alignleft\" width=\"225\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/me.png\"><img class=\"wp-image-98375\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/me.png\" alt=\"Wu is a senior at Paly. Photo by Michelle Tang \" width=\"225\" height=\"230\" \/><\/a> Wu is a senior at Paly. Photo by Michelle Tang.[\/caption]\r\n\r\n<strong>Rolina Wu, Period 1<\/strong>\r\n\r\nWu, a senior at Paly, will raise awareness on the importance of scientific journalism.\r\n\r\n\"I believe that as consumers of journalism and creators of social journalism, it is important to understand that scientific news articles do not necessarily represent facts,\" Wu said. \"It is important to always check the credibility of cited sources and the validity of conclusions before sharing articles as facts to our friends.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_98373\" align=\"alignleft\" width=\"156\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10951608_10205319106250563_862994415_n.jpg\"><img class=\"wp-image-98373\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10951608_10205319106250563_862994415_n.jpg\" alt=\"Beth smiles for a selfie. He attends Foothill Middle College. Photo by Adi Beth\" width=\"156\" height=\"208\" \/><\/a> Beth smiles for a selfie. He is a senior who attends Foothill Middle College. Photo by Adi Beth.[\/caption]\r\n\r\n<strong>Adi Beth, Period 2<\/strong>\r\n\r\nBeth will be discussing the importance of music in our lives.\r\n\r\n\"Music has been the force guiding mankind on our quest to discover who it is we are through the cultural evolution that brings us to where we are at today,\" Beth said. \"We're at a super important point in history today because I believe that with the proper awareness, we as a generation can finally transcend the cultural barriers that have always held us back. And I'm going to explain how were going to do that.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_98372\" align=\"alignleft\" width=\"212\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965345_931769923519914_1141385085_n.jpg\"><img class=\"wp-image-98372\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/10965345_931769923519914_1141385085_n.jpg\" alt=\"Lu is a junior at Paly. Photo by Karina Chan \" width=\"212\" height=\"141\" \/><\/a> Lu is s co-national president and founder of Works of Art, a student-run club that uses art to address important issues. Photo by Karina Chan.[\/caption]\r\n\r\n<strong>Anna Lu, Period 2<\/strong>\r\n\r\nLu, a junior at Paly, will talk about the definition and importance of introversion.\r\n\r\n\"Because our society seems to place a bias on supposedly-extroverted traits, I think that it’s extremely important for all of us to accept who we are and what makes us special,\" Lu said. \"Not to mention that introverts are on average more intelligent than extroverts.\"\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_98370\" align=\"alignleft\" width=\"186\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/997087_877795612232438_5236870188922060048_n.jpg\"><img class=\" wp-image-98370\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/997087_877795612232438_5236870188922060048_n.jpg\" alt=\"Chan is co-president and founder of Works of Art, a student-run club that uses art to address important issues. Photo by Tiffany Tsay\" width=\"186\" height=\"124\" \/><\/a> Chan is co-national president and founder of Works of Art Club. Photo by Tiffany Tsay.[\/caption]\r\n\r\n<strong>Karina Chan, Period 4<\/strong>\r\n\r\nChan, a junior at Paly, will be discussing the role of judgment in Palo Alto.\r\n\r\n\"Judgment is inevitable but so powerful that it shapes peoples' lives,\" Chan said. \"With so much influence, judgments are something that we need to be more thoughtful about before acting upon them.\"\r\n\r\n&nbsp;\r\n\r\n<strong>Samantha Edgington, Period 4<\/strong>\r\n\r\nEdgington, a system architect at Lockhead Martin, will be talking about the Geostationary Lightning Mapper.\r\n\r\n\"[The Geostationary Lightning Mapper] detects lightning in order to provide an early indication of stormy weather,\" event coordinator junior Adele Bloch said. \"She will discuss the benefits of measuring lightning, as well as how the GLM functions and its main objectives.\"\r\n\r\n[caption id=\"attachment_98070\" align=\"alignleft\" width=\"210\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_0261.jpg\"><img class=\" wp-image-98070\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/DSC_0261.jpg\" alt=\"garret lees\" width=\"210\" height=\"140\" \/><\/a> Lees is a junior at Paly. Photo by Saba Moussavian.[\/caption]\r\n\r\n<strong>Garret Lees, Period 5<\/strong>\r\n\r\nLees, a junior at Paly, will speak about autism and his personal experiences with it.\r\n\r\n\"My talk will be about autism, the large spectrum of it and how it should not be regarded as a 'dis' ability but an 'A' bility,\" Lees said. \"I will be going into details of some of my personal experiences with the disorder and how it has shaped me into the person I am today, as well as some resources my parents provided for me like the organization of ASC [Autism Social Connection] in order to help me learn how to behave better socially. My speech will be about the cause I am most passionate about, which is helping the world see that having any type of autism is not something to be ashamed of, and with a little effort, anyone with autism can fit in and even be helpful to others in unimaginable ways.\"\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_98074\" align=\"alignleft\" width=\"161\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Az-image_Jan-20151.jpg\"><img class=\" wp-image-98074\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Az-image_Jan-20151.jpg\" alt=\"Zusman is an author, executive director of  Story for All and founder of Uniquely Perfect.  Photo courtesy of Angela Zusman\" width=\"161\" height=\"197\" \/><\/a> Zusman is an author, executive director of  <a href=\"http:\/\/www.storyforall.org\">Story for All<\/a> and founder of <a href=\"http:\/\/www.uniquelyperfect.com\">Uniquely Perfect<\/a>.  Photo courtesy of Angela Zusman.[\/caption]\r\n\r\n<strong>Angela Zusman, Period 5<\/strong>\r\n\r\nBusman is an author, executive director of Story for All and founder of Uniquely Perfect. She will talk about the power of story and how stories can be used both as weapons and as instruments of healing and peace.\r\n\r\n\"Negative narratives have become instrumental in the continued enslavement of African-American men in this country, and stories – particularly stories of our youth – can be used to set them free,\" Zusman said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_98064\" align=\"alignleft\" width=\"160\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-03-at-7.43.17-AM.png\"><img class=\" wp-image-98064\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-03-at-7.43.17-AM.png\" alt=\"woj\" width=\"160\" height=\"148\" \/><\/a> Wojcicki teaches journalism at Paly. Photo courtesy of Esther Wojcicki.[\/caption]\r\n\r\n<strong>Esther Wojcicki, Period 6<\/strong>\r\n\r\nWojcicki, a teacher at Paly and esteemed journalist, will talk about Moonshots in Education, based on her new book \"Moonshots in Education: Launching Blended Learning in the Classroom.\"\r\n\r\n\"A Moonshot is something that is hard to achieve but worth the effort, just like the first moonshot under President Kennedy,\" Wojcicki said. \"In the classroom, it means changing the culture of the classroom so that lecture is not the primary method of instruction and that teachers give students more control of their learning. The instruction is supported by technology and real world projects that students choose. It is a <i style=\"color: #222222;\">moonshot<\/i> because changing the culture is just as hard if not harder than going to the moon.\"\r\n\r\n[caption id=\"attachment_98066\" align=\"alignleft\" width=\"216\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/THP-authors-photo.jpg\"><img class=\" wp-image-98066\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/THP-authors-photo.jpg\" alt=\"John Evans\" width=\"216\" height=\"144\" \/><\/a> Evans is an author as well as a <a href=\"http:\/\/creativewriting.stanford.edu\/people\/john-evans\">lecturer of poetry and creative writing<\/a> at Stanford University. Photo Courtesy of John Evans.[\/caption]\r\n\r\n<strong>John Evans, Period 6<\/strong>\r\n\r\nEvans is an author as well as lecturer of poetry and creative writing at Stanford University. Evans' talk is called \"The Things We Don’t Mean To Prepare For.\"\r\n\r\n\"Basically, I’m going to talk about the ways in which we prepare for things without meaning to, and also how we become wise against our wills,\" Evans said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nBelow is the official schedule of the talks:\r\n<b>Period 1 [<span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1404767657\"><span class=\"aQJ\">8:15 - 9:05<\/span><\/span>]<\/b> - Thomas Tayeri, Rolina Wu, Official TED video [Medicine + The Media]\r\n<b>Period 2 [<span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1404767658\"><span class=\"aQJ\">9:10 - 10:00<\/span><\/span>]<\/b> - Adi Beth, Anna Lu, and Official Ted Video [Palo Alto Judgement, Introversion]\r\n<b>Period 4 [<span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1404767659\"><span class=\"aQJ\">11:10 - 12:05<\/span><\/span>]<\/b> - Karina Chan, Samantha Edgington, Official TED Video [Music, Physics]\r\n<b>Period 5 [<span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1404767660\"><span class=\"aQJ\">12:45 - 1:35<\/span><\/span>]<\/b> - Garrett Lees, Angela Zusman, Official TED Video [Autism, the community]\r\n<b>Period 6 [<span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1404767661\"><span class=\"aQJ\">1:40 - 2:30<\/span><\/span>]<\/b> - Esther Wojcicki, John Evans &amp; Official TED Video [Journalism and Writing]\r\n\r\n&nbsp;","excerpt":"Palo Alto High School will host a series of student and teacher TEDx speakers during various class periods tomorrow in the Media Arts Center.","date":"2015-02-08 20:32:53","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/TEDx.png","categories":["Features"],"tags":{"38462":"adi beth","38465":"angela zusman","28577":"anna lu","12704":"esther wojcicki","38464":"garret lees","38466":"john evans","38436":"karina chan","8944":"palo alto high school","38461":"rolina wu","38463":"samantha edgington","38480":"ted talks","11635":"TEDx","38460":"thomas tayeri"}},{"id":98108,"title":"Liveblog: 57th annual Grammy Music Awards","permalink":"http:\/\/palyvoice.com\/2015\/02\/08\/liveblog-57th-annual-grammy-music-awards\/","content":"<em>Editor’s Note: The opinions presented in this article are those of the author alone and do not necessarily reflect the opinions of the staff of The Paly Voice as a whole.<\/em>\r\n\r\nTune in starting at 8 p.m. for live coverage of the 57th annual Grammy Music Awards.\r\n\r\n[caption id=\"attachment_98109\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/grammy-beyonce_2476690b.jpg\"><img class=\"wp-image-98109 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/grammy-beyonce_2476690b.jpg\" alt=\"Beyonce has won 17 Grammy Awards and is nominated for six this year. She is also scheduled to perform at the awards ceremony this year. Photo courtesy  of Reuters. \" width=\"600\" height=\"375\" \/><\/a> Beyonce has won 17 Grammy Awards and is nominated for six this year. She is also scheduled to perform at the awards ceremony this year. Photo courtesy of Reuters.[\/caption]\r\n\r\n[liveblog]","excerpt":"Tune in at 8 p.m. for live coverage of the 57th annual Grammy Awards. ","date":"2015-02-08 11:29:32","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/grammy-beyonce_2476690b.jpg","categories":["Entertainment"],"tags":{"38472":"a&amp;e","38473":"grammy awards","38471":"grammys","38474":"grammys 2015","8906":"music"}},{"id":97524,"title":"&#8220;Own Your Health Info&#8221; initiative launched in memory of Paly alumna","permalink":"http:\/\/palyvoice.com\/2015\/02\/07\/own-your-health-info-initiative-launched-in-memory-of-paly-alumna\/","content":"A Palo Alto family recently launched the <a href=\"http:\/\/www.ownyourhealthinfo.com\/Users\">Own Your Health Info<\/a> project, a campaign promoting the individual ownership of health and immunization records.\r\n\r\nThe family members of Emily Benatar, a Palo Alto High School Class of 2011 graduate who passed away in 2012 from bacterial meningitis, started the project in her honor. Own Your Health Info is a continuation of the annual Emily's Way project, a program that the Benatar family initiated last year. Last year's project involved creating cards for military personnel. Emily's mother and creator of Own Your Health Info, Lisa Benatar, noted that the aim of the project is to encourage individuals to advocate for their own health awareness. The goal is to get 1,100 people, including Paly students, to have their medical records available on their phones by Feb. 11, to honor Emily's birthday. \"We want to help people help themselves and be their own best advocate,\" Lisa Benatar said.\r\n\r\n[caption id=\"attachment_97806\" align=\"alignright\" width=\"229\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/24c4a9_9d0b04fe6cc110af7277a042655855d4.jpg_srz_p_402_603_75_22_0.50_1.20_0.jpg\"><img class=\" wp-image-97806\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/24c4a9_9d0b04fe6cc110af7277a042655855d4.jpg_srz_p_402_603_75_22_0.50_1.20_0.jpg\" alt=\"Paly graduate Emily Benatar passed away on May 9, 2012 from bacterial meningitis. To honor her memory and spread awareness about the meningococcal disease, her family members launched the &quot;Own Your Health Info&quot; campaign to promote individual ownership of health records. Photo courtesy of emilybenetar.com.\" width=\"229\" height=\"345\" \/><\/a> Paly graduate Emily Benatar passed away on May 9, 2012 from bacterial meningitis. To honor her memory and spread awareness about the meningococcal disease, her family members launched the \"Own Your Health Info\" campaign to promote individual ownership of health records. Photo courtesy of emilybenetar.com.[\/caption]\r\n\r\nThe process by which students and adults can achieve mobile access to health records varies, according to Lisa Benatar. Individuals with physicians affiliated with <a href=\"myhealth.stanfordhealthcare.org\" target=\"_blank\">Stanford Hospital<\/a>, <a href=\"myhealthonline.sutterhealth.org \" target=\"_blank\">Palo Alto Medical Foundation<\/a> or <a href=\"KaiserPermanente.org\" target=\"_blank\">Kaiser Permanente<\/a> can go online to learn about digital health records and how set up an account. Teens can also set up an account during an appointment with a physician.\r\n\r\n\"The quickest and easiest way to set up an online account is while you are actually at the doctor’s office — they will help you set up the account right on the spot,\" Lisa Benatar said. \"The problem is, many teens only go to the doctor every couple of years.\"\r\n\r\nIn order to streamline this process and make it more accessible to teenagers, Lisa Benatar created a simple \"FastTrak\" solution that she hopes will encourage teenagers to gain a greater understanding of their own health.\r\n\r\n\"All we want students to do is this: Ask your parents to text you a picture of your immunization records,\" Lisa Benatar said. \"That’s it.\"\r\n\r\nOnce students have access to their health records on their phone, whether it's through an online account or an image sent by their parents, Benatar encourages them to contact the Own Your Health Info organization <a href=\"ownyourhealthinfo@gmail.com\" target=\"_blank\">via email<\/a> and add their name to help reach the 1,100 goal. Students can also <a href=\"http:\/\/www.ownyourhealthinfo.com\/users\/register\" target=\"_blank\">join the campaign by registering online<\/a>.\r\n\r\nThe idea for the Own Your Health project, according to Lisa Benatar, stemmed from her desire to spread awarness about the meningococcal disease.\r\n\r\n\"I wanted to raise awareness about the disease, but I couldn’t even tell people to get vaccinated because at the time when I first started thinking about this project, there was no [meningococcal B] vaccine available in the U.S,\" Lisa Benatar said.\r\n\r\nAccording to Lisa Benatar, Emily was vaccinated but contracted a strain of the meningococcal disease that was not covered by the vaccination.\r\n\r\n\"[Emily] contracted serogroup B, which is not covered by the vaccine that was the only one available at the time when she was vaccinated,\" Lisa Benatar said. \"Just within the last three months, the FDA has approved two MenB vaccines.\"\r\n\r\n[caption id=\"attachment_97827\" align=\"alignleft\" width=\"229\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/24c4a9_223f86a0b83c4338998bb35d601a5a6b1.jpg_srz_p_460_431_75_22_0.50_1.20_01.jpg\"><img class=\"wp-image-97827\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/24c4a9_223f86a0b83c4338998bb35d601a5a6b1.jpg_srz_p_460_431_75_22_0.50_1.20_01.jpg\" alt=\"The Own Your Health Info project continues the Benatar family's tradition of honoring Emily around the time of her birthday. Last year's Emily's Way project included sending cards to members of the military.\" width=\"229\" height=\"244\" \/><\/a> The Own Your Health Info project continues the Benatar family's tradition of honoring Emily around the time of her birthday. Last year's Emily's Way project included sending cards to members of the military. Photo courtesy of emilybenatar.com.[\/caption]\r\n\r\nAfter learning more about the disease and vaccinations, Lisa Benatar hoped that the \"Own Your Health\" campaign would help lead to a wider-scale understanding of immunizations and medical history.\r\n\r\n\"At least I could help people with the first step in understanding vaccinations, which is to at least know which ones you’ve had and when,\" Lisa Benatar said. \"That’s how the idea of 'owning your health information' came about.\"\r\n\r\nEmily's sister junior Maya Benatar is one of over 800 people who have added their names to the Own Your Health Info Campaign.\r\n\r\n\"I think this is super important because the transition from high school to college is a tough one and a lot of the time teenagers still rely on their parents for a lot of stuff,\" Maya Benatar said. \"When teenagers go to the doctor in college and are sick they usually don't know certain information about their health in the past that the doctor might need to diagnose them or prescribe them medication.\"\r\n\r\nWith the project, Lisa Benatar hopes to encourage college students to take their health matters into their own hands. The project is designed to help people, young adults in particular, understand their own medical history and have access to their records at all times.\r\n\r\n\"When kids turn 18, it makes sense for them to take on the responsibility of keeping track of their health records because at that point, their parents no longer even have legal access to the records,\" Lisa Benatar said. \"If you’re away from home and have some kind of medical emergency, like a sports injury or any kind of accident or illness, you might need to know things quickly, like what medicines you’re allergic to.\"\r\n\r\nLisa Benatar also hopes that the project will encourage parents to play a greater role in helping their children to understand health care.\r\n\r\n\"Parents can help by showing their kids what's involved in healthcare, like finding a doctor ... and getting access to records,\" Lisa Benatar said. \"As one friend of mine put it, when kids go off to college we spend more time picking out bedding than we we do helping them take care of health information.\"","excerpt":"A Palo Alto family recently launched the Own Your Health Info project, a campaign promoting the individual ownership of health and immunization records.","date":"2015-02-07 18:11:32","author":"Hannah Nguyen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/Screen-Shot-2015-02-07-at-9.45.12-PM1.png","categories":["News","Spotlight"],"tags":{"38419":"emily benatar","38421":"emily's way","38420":"lisa benatar","38423":"medical records","38422":"own your health info"}},{"id":97864,"title":"Liveblog: Basketball vs. Gunn","permalink":"http:\/\/palyvoice.com\/2015\/02\/07\/liveblog-basketball-vs-gunn\/","content":"<p><em>Check back in this Saturday beginning at 6 p.m. as Palo Alto High School's girls' and boys' basketball teams host the cross-town rival Gunn High School Titans in a double-header. Shortly following the girls' game, the boys' team will have its annual Senior Night festivities, celebrating the accomplishments of seniors Alex Dees, Corey Bicknell, Johnny Rojahn and Kevin Mullin. <\/em><\/p>\r\n<p>[liveblog]<\/p>\r\n","excerpt":"Check back in this evening beginning at 6 p.m. as Palo Alto High School's girls' and boys' basketball teams host the cross-town rival Gunn High School Titans in a double-header. The boys' team will honor its four seniors prior to tip-off. ","date":"2015-02-07 13:54:53","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/01\/IMG_0298.jpg","categories":["Sports"],"tags":{"8538":"boys basketball","8735":"girls basketball","38467":"gunn vs. paly","9087":"Senior Night"}},{"id":97466,"title":"ASB &#8220;Suggestion Box&#8221; gives students opportunity to express ideas","permalink":"http:\/\/palyvoice.com\/2015\/02\/07\/asb-suggestion-box-gives-students-opportunity-to-express-ideas\/","content":"[caption id=\"attachment_97974\" align=\"alignnone\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-1271.jpg\"><img class=\"wp-image-97974\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-1271.jpg\" alt=\"photo-127\" width=\"581\" height=\"436\" \/><\/a> As of this week, students can more effectively reach out to the Associated Student Body with the new \"Suggestion Boxes\" that are placed in front of the library and the Student Activities Office. Each box was created to make it easier for students to express their opinions and ideas on what ASB is doing or should do, according to ASB President Claire Liu. \"Prioritizing student opinion and voice has been a goal of ASB's since day one,\" Liu said. Photo by Adele Bloch.[\/caption]\r\n\r\nThe Associated Student Body is extending its outreach by creating physical and online \"Suggestion Boxes\" that provide Palo Alto High School students outlets to voice their concerns and feedback to ASB this year.\r\n\r\nIn previous years, the sole Suggestion Box was placed in front of the library and received little attention from students, according to senior and ASB President Claire Liu. However, this year ASB hopes to incorporate the Suggestion Box into students' daily lives by creating an <a href=\"https:\/\/docs.google.com\/forms\/d\/1nCDga8Em38vidtBWHuvc9E1rGC3UfgYwpF71KuV17LU\/viewform\">online Suggestion Box<\/a>, which is being advertised through InFocus and social media.\r\n\r\n\"ASB is excited and totally on board [to reintroduce the box] and we're waiting to see what we get in our boxes and how we can work more effectively with the student body,\" Liu said.\r\n\r\nSenior Fabian Garduño is looking forward to the potential improvements that the Suggestion Box will bring.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692\">\r\n<div class=\"_5wd9\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #373e4d;\" data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0.0.0\">\r\n<div data-reactid=\".9w.$mid=11423004300823=22d659f187b901a3692.2:0.0.0.0\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805\">\r\n<div class=\"_5wd9\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" data-reactid=\".9w.$mid=11423004318486=21d2932e5f4f30f3805.2:0.0.0\">\r\n\r\n\"If they [ASB members] actually pay attention to it and put it into consideration ... I think it will be beneficial to the school,\" Garduño said.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Associated Student Body's extends its outreach by creating physical and online \"Suggestion Boxes\" that provide Palo Alto High School students with a new outlet to voice their concerns and feedback to ASB this year.","date":"2015-02-07 12:14:08","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/photo-127.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","8499":"Associated Student Body","8944":"palo alto high school","38452":"suggestion box","30842":"suggestions"}},{"id":97999,"title":"Debaters to attend state qualifications tournament","permalink":"http:\/\/palyvoice.com\/2015\/02\/06\/debaters-to-attend-state-qualifications-tournament\/","content":"[caption id=\"attachment_98058\" align=\"alignnone\" width=\"348\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/CANDAAACE1.jpg\"><img class=\"wp-image-98058\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/CANDAAACE1.jpg\" alt=\"CANDAAACE\" width=\"348\" height=\"464\" \/><\/a> Sophomore Candace Wang shows off her medal won at the Coast Forensic League debate tournament. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nTwo Palo Alto High School debaters went undefeated in a debate tournament at Monta Vista High School last Saturday, guaranteeing them the opportunity to compete in California's State Qualifications tournament.\r\n\r\nSenior Noah Hashmi and sophomore Candace Wang stood victorious after winning all four rounds of debate at California's Coast Forensic League, one of two speech and debate leagues in the Bay Area.\r\n\r\nAccording to Hashmi, intensive preparation was necessary for the event.\r\n\r\n“Preparation for the tournament was intense because some of the best debate powerhouses in the Bay Area, like Bellarmine and Leland, were also at the tournament,” Hashmi said. “However, the topic was actually the same as many of the tournaments first semester … making the preparation for this specific tournament somewhat easier because I already had a good grasp on the topic.\"\r\n\r\nAccording to Paly debate coach Jennie Savage, receiving a wildcard is no easy feat.\r\n\r\n“It's exceptionally difficult to qualify to the State Championship tournament,” Savage said. “We get very few slots to even debate at the tournament to qualify — only the very best debaters are selected to attend and go head-to-head against the other best debaters.”\r\n\r\nWang is looking forward to joining junior Jenny Xin, who <a href=\"http:\/\/palyvoice.com\/2014\/11\/14\/juniors-triumph-at-debate-tournament\/\">received a wildcard<\/a> in late 2014, at State Qualifications.\r\n\r\n“I'm so excited that I get a chance to go [to State Qualifications],” Wang said. “Being able to go to State Quals is a testament to your ability, but advancing is an even greater achievement.”\r\n\r\nThe State Qualifications debate tournament will be held on March 6 and 7 at Westmont High School in Campbell.","excerpt":"Two Palo Alto High School debaters were awarded wildcards after going undefeated in a tournament at Monta Vista High School last Saturday, guaranteeing them the opportunity to compete in California's State Qualifications tournament.","date":"2015-02-06 19:12:06","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/CANDAAACE2.jpg","categories":["News","Spotlight"],"tags":{"28798":"candace wang","8638":"debate","8918":"noah hashmi","8944":"palo alto high school","8953":"paly","19261":"speech and debate","9175":"tournament","38459":"wildcard"}},{"id":97942,"title":"District calls for community effort to improve student wellness","permalink":"http:\/\/palyvoice.com\/2015\/02\/06\/district-calls-for-community-effort-to-improve-student-wellness\/","content":"Palo Alto Unified School District Superintendent Max McGee and Palo Alto High School Principal Kim Diorio sent emails to parents and students, respectively, addressing ways that the community and school plan to improve student wellness.\r\n\r\nA few hours after McGee posted his <a href=\"http:\/\/pausd.org\/community\/Superintendent\/Newsletter\/Feb2015MainMessage.shtml\" target=\"_blank\">fourth edition of his \"Max Mail\"<\/a> newsletter, Diorio emailed the student body a <a href=\"http:\/\/paly.net\/sites\/default\/files\/kd_letter_students_2015-02-05.pdf\" target=\"_blank\">revised version<\/a> of a letter from <a href=\"http:\/\/palyvoice.com\/2015\/01\/30\/administration-making-structural-changes-for-better-student-environment\/\" target=\"_blank\">last week<\/a>, which she removed from the <a href=\"paly.net\" target=\"_blank\">Paly website<\/a> after McGee suggested sending a district-wide letter instead. While worded differently to better match McGee's phrasing, Diorio's revised letter shares the same sentiments as the original, encouraging the school to implement a homework-free February break and suggesting long-term changes to Paly's homework and test policies.\r\n\r\n[caption id=\"attachment_98040\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg\"><img class=\"wp-image-98040\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg\" alt=\"The Palo Alto Unified School district and Palo Alto High School administrations are working on ways to increase support for students and their well-beings. Photo by Alex Merkle-Raymond.\" width=\"300\" height=\"225\" \/><\/a> The Palo Alto Unified School district and Palo Alto High School administrations are working on ways to increase support for students and their well-beings. Some of those methods are outlined in letters sent out yesterday to parents and students. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nWhile Diorio plans to notify parents of the new letter soon, she wants the first recipients of her email to be students in order to involve them more directly in the discussion about stress and mental health.\r\n\r\n\"Having listened to students all last week, there was a concern about feeling like, 'who's talking to the kids?'\" Diorio said. \"The adults are in this position where we're having a lot of adult conversations about suicide and stress, but who's talking to the kids, and how come they're not being included in these conversations?\"\r\n\r\nDiorio said she will discuss possible solutions to help empower students and improve the school climate with the Associated Student Body this week. Additionally, Diorio invites students to share their thoughts and suggestions using a <a href=\"https:\/\/docs.google.com\/forms\/d\/1Iwmc-hxmRcGjpHY02mszlFVPmFkyQL5ddR7Xk84r77E\/viewform\" target=\"_blank\">Google form<\/a> included in the letter.\r\n\r\nIn McGee's newsletter, the superintendent showed gratitude for students, district staff, the police, city officials and other public agents in light of a Gunn High School student's death by suicide last month. McGee also advocated for a community-wide effort to support students in all aspects of their well-being, stressing that mental health issues are not just a \"school problem.\"\r\n\r\n\"These past two weeks, people have been anxious to understand why [the suicide happened], sometimes quick to blame and generally eager to share their solutions to what they believe the students’ problems are,\" McGee said in his newsletter. \"While the reactions are understandable, it is time to come together as a collective community.\"\r\n\r\nWhile McGee acknowledges that academic stress is not the sole cause of suicide, he emphasizes that change can begin within the school system and urges parents and students to reduce competitiveness at school, underscoring the importance of learning for the sake of learning, not for grades.\r\n\r\n\"It is imperative we remember student health and connectedness do not have to come at the cost of high academic standards,\" McGee said. \"This [students'] sense of curiosity and desire to deepen and apply knowledge is consistent with our [the district's] vision and evidence that we are a community of learners who will be well-prepared for a fulfilling future. However, when students feel they should prize their grades over deeper learning, when the number of AP [Advanced Placement] and honors classes they take matters more than what they experience in these classes or when they are over-competitive with one another or obsessed with checking grades, unhealthy actions can follow. \"\r\n\r\nMcGee has also authorized a number of projects to help support students at both high schools, such as conducting a course alignment review, requiring regular meetings with school counselors and advisers and beginning \"mindfulness training,\" in addition to the changes that Diorio hopes to make at Paly.\r\n\r\nMcGee said he hopes to increase the discussion as a community about student wellness. A \"Let's Talk: A Community Conversation about Healthy Kids and Healthy Schools\" event, sponsored by the City of Palo Alto and <a href=\"http:\/\/www.psnpaloalto.com\" target=\"_blank\">Project Safety Net<\/a>, will be held at 7 p.m. on Wednesday, Feb. 25 at the Cubberley Community Center Theatre to help spark a discourse.","excerpt":"Palo Alto Unified School District Superintendent Max McGee and Palo Alto High School Principal Kim Diorio sent emails to parents and students, respectively, addressing ways that the community and school plan to improve student wellness.","date":"2015-02-06 10:15:42","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["News","Spotlight"],"tags":{"38449":"academic stress","8611":"Community","8644":"diorio","8647":"district","8834":"Kim Diorio","37742":"letter","32445":"max mcgee","37655":"mental health","8944":"palo alto high school","8977":"PAUSD","9128":"Stress","11606":"superintendent"}},{"id":97856,"title":"Girls&#8217; soccer looks to win it all","permalink":"http:\/\/palyvoice.com\/2015\/02\/05\/girls-soccer-looks-to-win-it-all\/","content":"[caption id=\"attachment_97861\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg\"><img class=\"wp-image-97861 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg\" alt=\"Senior midfielder Katie Foug carries the ball forward into the Los Gatos half. Paly beat Los Gatos 2-0. Photo by George Lu\" width=\"600\" height=\"399\" \/><\/a> Senior midfielder Katie Foug carries the ball forward into the Los Gatos half. Paly beat Los Gatos 2-0 on Jan. 24. Photo by George Lu.[\/caption]\r\n\r\nAfter defeating Santa Clara High School (8-4-4, 5-3-2), the only team to serve it a loss this season, today by a score of 9-2, the Palo Alto High School girls’ soccer team (14-1-0, 8-1-0) is tied for first in the De Anza League, leading the league in most goals scored and fewest goals allowed , according to <a href=\"http:\/\/www.maxpreps.com\/league\/gJhb-VuN5kesTljiplLOEQ\/standings-scval---de-anza.htm\" target=\"_blank\">Maxpreps<\/a>.\r\n\r\nThe team is doing historically well. On Jan. 20, Paly beat Mountain View High School (12-3-0,7-1-0) for the first time since 2007 to move back into a tie for first place in the DAL.\r\n\r\nAssistant Coach Eric Seedman said he feels the team is having a great season so far.\r\n\r\n“If we can keep it up, it could be very special indeed,” Seedman said.\r\n\r\nSeedman said he was impressed with the way the team handled its first setback of the loss to Santa Clara.\r\n\r\n“The team got right back to work and cleaned up some of the details that led up to that setback,” Seedman said. “The players are very resilient. They didn't let it get them down.”\r\n\r\nJunior forward and defender Alison Lu also noted the team’s successful season but said there are a few things the team can do to reach its ultimate goal of winning the DAL and later the Central Coast Section finals.\r\n\r\n“We've had many chances in front of the goal but haven't been able to capitalize on those opportunities,” Lu said. “We're just going to keep practicing and work on starting games off strong. We sometimes start off a bit lackadaisical and have a few moments in the beginning where we don't have full control of the ball.”\r\n\r\nPaly players currently lead the DAL in multiple categories, according to <a href=\"http:\/\/www.maxpreps.com\/league\/gJhb-VuN5kesTljiplLOEQ\/standings-scval---de-anza.htm#standings\" target=\"_blank\">Maxpreps<\/a>. Junior midfielder Jacey Pederson leads the DAL in goals with 20, while sophomore goalie Dhara Yu leads the league in fewest goals allowed per game, with an average of 0.4. The team as a whole has scored 55 goals, while only allowing seven.\r\n\r\nSeedman noted the excellence of Pederson's performance but also attributed the team’s success to a wide range of players, including Lu, senior Katie Foug and freshman Emily Tomz.\r\n\r\n“One of our best attributes is our depth,” Seedman said. “We can put any player out on the field at any juncture and have confidence that they will more than hold their own. Most coaches don't have that flexibility.”\r\n\r\nWith <a href=\"http:\/\/www.maxpreps.com\/rankings\/girls-soccer-winter\/1\/section\/ca\/central+coast+section.htm\" target=\"_blank\">Maxpreps<\/a>' standings placing the Vikings third in CCS, a playoff berth seems inevitable.\r\n\r\n“Can we do it?\" Seedman said. \"Yes. Will we do it? Time will tell. We will need to stay healthy, and keep working hard.\"\r\n\r\nThe Vikings' next game is against Mountain View at 3:30 p.m. on Feb. 10 at Mountain View.\r\n\r\n&nbsp;","excerpt":"After defeating Santa Clara High School (8-4-4, 5-3-2), the only team to serve it a loss this season, by a score of 9-2, the Palo Alto High School girls’ soccer team (14-1-0, 8-1-0) is tied for first in the De Anza League, leading the league in most goals scored and fewest goals allowed.","date":"2015-02-05 20:33:35","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0282.jpg","categories":["Sports","Spotlight"],"tags":{"38451":"allison lu","8568":"CCS","10199":"eric seedman","10198":"girls soccer","25078":"jacey pederson","37715":"midseason","8944":"palo alto high school","8953":"paly","9012":"preview","10667":"santa clara","9110":"Soccer","38450":"update"}}]